#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABplushSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ABplushSpawner.ABplushSpawner_C
// 0x0020 (0x0268 - 0x0248)
class AABplushSpawner_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ABplushSpawner_C;                   // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Rad;                                               // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_ABplushSpawner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABplushSpawner_C">();
	}
	static class AABplushSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AABplushSpawner_C>();
	}
};
static_assert(alignof(AABplushSpawner_C) == 0x000008, "Wrong alignment on AABplushSpawner_C");
static_assert(sizeof(AABplushSpawner_C) == 0x000268, "Wrong size on AABplushSpawner_C");
static_assert(offsetof(AABplushSpawner_C, UberGraphFrame_ABplushSpawner_C) == 0x000248, "Member 'AABplushSpawner_C::UberGraphFrame_ABplushSpawner_C' has a wrong offset!");
static_assert(offsetof(AABplushSpawner_C, StaticMesh) == 0x000250, "Member 'AABplushSpawner_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AABplushSpawner_C, Sphere) == 0x000258, "Member 'AABplushSpawner_C::Sphere' has a wrong offset!");
static_assert(offsetof(AABplushSpawner_C, Rad) == 0x000260, "Member 'AABplushSpawner_C::Rad' has a wrong offset!");

}

