#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorChipPile_erie

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function actorChipPile_erie.actorChipPile_erie_C.ExecuteUbergraph_actorChipPile_erie
// 0x0100 (0x0100 - 0x0000)
struct ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_dingus5erie_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie) == 0x000010, "Wrong alignment on ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie");
static_assert(sizeof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie) == 0x000100, "Wrong size on ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, EntryPoint) == 0x000000, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_VLerp_ReturnValue) == 0x00000C, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_BreakTransform_Location) == 0x000050, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000074, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D0, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000DC, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_GetActorScale3D_ReturnValue) == 0x0000E8, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie, CallFunc_VLerp_ReturnValue_1) == 0x0000F4, "Member 'ActorChipPile_erie_C_ExecuteUbergraph_actorChipPile_erie::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");

}

