#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorChipPile

#include "Basic.hpp"

#include "Struct_food1_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_mInt_structs.hpp"


namespace SDK::Params
{

// Function actorChipPile.actorChipPile_C.ExecuteUbergraph_actorChipPile
// 0x0900 (0x0900 - 0x0000)
struct ActorChipPile_C_ExecuteUbergraph_actorChipPile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3534[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3535[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x00F8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3536[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0128(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3537[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3538[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0288(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3539[0x3];                                     // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x0314(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353A[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0330(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_353B[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353C[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0440(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0450(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_353D[0x1];                                     // 0x04DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353E[0x4];                                     // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353F[0x4];                                     // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_Chip_Pile;         // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3540[0x3];                                     // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0584(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0590(0x0030)(IsPlainOldData, NoDestructor)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x05C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3541[0x3];                                     // 0x0655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3542[0x2];                                     // 0x0662(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x066C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0684(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3543[0x4];                                     // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x06D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x06E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3544[0x4];                                     // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrunge_C*                              CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_key;                                  // 0x0778(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0794(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x081C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0829(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x082A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x082B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_activate;                             // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3545[0x3];                                     // 0x082D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0854(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3546[0x4];                                     // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x08E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3547[0x3];                                     // 0x08F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_C_ExecuteUbergraph_actorChipPile) == 0x000010, "Wrong alignment on ActorChipPile_C_ExecuteUbergraph_actorChipPile");
static_assert(sizeof(ActorChipPile_C_ExecuteUbergraph_actorChipPile) == 0x000900, "Wrong size on ActorChipPile_C_ExecuteUbergraph_actorChipPile");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, EntryPoint) == 0x000000, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_14) == 0x000008, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_7) == 0x000010, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_4) == 0x000098, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_fuel) == 0x00009C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_13) == 0x0000A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_12) == 0x0000A8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_3) == 0x0000B0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_location_1) == 0x0000B4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_11) == 0x0000C0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_10) == 0x0000C8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_9) == 0x0000D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_wheelDelta) == 0x0000D8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_8) == 0x0000E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_mouse) == 0x0000E8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_7) == 0x0000F0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_key_1) == 0x0000F8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_pressed) == 0x000110, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_temperature_1) == 0x000114, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_temperature) == 0x000118, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_speed) == 0x00011C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_6) == 0x000120, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_6) == 0x000128, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_name_1) == 0x0001B0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_volume) == 0x0001C0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_5) == 0x0001C8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_location) == 0x0001D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_2) == 0x0001DC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_clean) == 0x0001E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_4) == 0x0001E8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_5) == 0x0001F0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hook) == 0x000278, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_3) == 0x000280, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_4) == 0x000288, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_kick) == 0x000310, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_name) == 0x000314, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_2) == 0x000320, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_1) == 0x000328, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_3) == 0x000330, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003B8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue) == 0x0003C4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeTransform_ReturnValue) == 0x0003D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000400, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000408, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_FinishSpawningActor_ReturnValue) == 0x000410, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000418, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000424, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000430, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_obj_static_obj) == 0x000440, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000450, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0004D8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bBlockingHit) == 0x0004D9, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004DA, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Time) == 0x0004DC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Distance) == 0x0004E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Location) == 0x0004E4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactPoint) == 0x0004F0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Normal) == 0x0004FC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactNormal) == 0x000508, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_PhysMat) == 0x000518, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitActor) == 0x000520, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitComponent) == 0x000528, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitBoneName) == 0x000530, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitItem) == 0x000538, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ElementIndex) == 0x00053C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_FaceIndex) == 0x000540, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceStart) == 0x000544, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceEnd) == 0x000550, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Array_Add_ReturnValue) == 0x00055C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_GetObjectClass_ReturnValue) == 0x000560, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000568, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_ClassDynamicCast_AsActor_Chip_Pile) == 0x000578, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_ClassDynamicCast_AsActor_Chip_Pile' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_ClassDynamicCast_bSuccess) == 0x000580, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000584, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeTransform_ReturnValue_1) == 0x000590, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player) == 0x0005C0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_2) == 0x0005C8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_index) == 0x000650, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_action) == 0x000654, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000658, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000660, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000661, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Time_1) == 0x000664, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Distance_1) == 0x000668, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Location_1) == 0x00066C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000678, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Normal_1) == 0x000684, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000690, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_PhysMat_1) == 0x0006A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitActor_1) == 0x0006A8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitComponent_1) == 0x0006B0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitBoneName_1) == 0x0006B8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitItem_1) == 0x0006C0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ElementIndex_1) == 0x0006C4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_FaceIndex_1) == 0x0006C8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceStart_1) == 0x0006CC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceEnd_1) == 0x0006D8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeHitResult_ReturnValue) == 0x0006E4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000770, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_key) == 0x000778, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_actor_1) == 0x000788, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_1) == 0x000790, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_1) == 0x000794, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_impact_1) == 0x00081C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_skipSetting) == 0x000828, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_static) == 0x000829, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_frozen) == 0x00082A, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_active) == 0x00082B, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_activate) == 0x00082C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water_3) == 0x000830, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water_2) == 0x000838, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water_1) == 0x000840, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water) == 0x000848, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage) == 0x000850, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit) == 0x000854, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_actor) == 0x0008E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_impact) == 0x0008E8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_ignore) == 0x0008F4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Array_Add_ReturnValue_1) == 0x0008F8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.setIgnoreSave
// 0x0001 (0x0001 - 0x0000)
struct ActorChipPile_C_SetIgnoreSave final
{
public:
	bool                                          Param_Ignore;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActorChipPile_C_SetIgnoreSave) == 0x000001, "Wrong alignment on ActorChipPile_C_SetIgnoreSave");
static_assert(sizeof(ActorChipPile_C_SetIgnoreSave) == 0x000001, "Wrong size on ActorChipPile_C_SetIgnoreSave");
static_assert(offsetof(ActorChipPile_C_SetIgnoreSave, Param_Ignore) == 0x000000, "Member 'ActorChipPile_C_SetIgnoreSave::Param_Ignore' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct ActorChipPile_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3548[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_C_ImpactDamage) == 0x000008, "Wrong alignment on ActorChipPile_C_ImpactDamage");
static_assert(sizeof(ActorChipPile_C_ImpactDamage) == 0x0000A8, "Wrong size on ActorChipPile_C_ImpactDamage");
static_assert(offsetof(ActorChipPile_C_ImpactDamage, Damage) == 0x000000, "Member 'ActorChipPile_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ImpactDamage, Hit) == 0x000004, "Member 'ActorChipPile_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ImpactDamage, Actor) == 0x000090, "Member 'ActorChipPile_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ImpactDamage, Impact) == 0x000098, "Member 'ActorChipPile_C_ImpactDamage::Impact' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct ActorChipPile_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on ActorChipPile_C_EnterWaterOrigin");
static_assert(sizeof(ActorChipPile_C_EnterWaterOrigin) == 0x000008, "Wrong size on ActorChipPile_C_EnterWaterOrigin");
static_assert(offsetof(ActorChipPile_C_EnterWaterOrigin, Water) == 0x000000, "Member 'ActorChipPile_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct ActorChipPile_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on ActorChipPile_C_LeaveWaterOrigin");
static_assert(sizeof(ActorChipPile_C_LeaveWaterOrigin) == 0x000008, "Wrong size on ActorChipPile_C_LeaveWaterOrigin");
static_assert(offsetof(ActorChipPile_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'ActorChipPile_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct ActorChipPile_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_C_EnterWater) == 0x000008, "Wrong alignment on ActorChipPile_C_EnterWater");
static_assert(sizeof(ActorChipPile_C_EnterWater) == 0x000008, "Wrong size on ActorChipPile_C_EnterWater");
static_assert(offsetof(ActorChipPile_C_EnterWater, Water) == 0x000000, "Member 'ActorChipPile_C_EnterWater::Water' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct ActorChipPile_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorChipPile_C_LeaveWater) == 0x000008, "Wrong alignment on ActorChipPile_C_LeaveWater");
static_assert(sizeof(ActorChipPile_C_LeaveWater) == 0x000008, "Wrong size on ActorChipPile_C_LeaveWater");
static_assert(offsetof(ActorChipPile_C_LeaveWater, Water) == 0x000000, "Member 'ActorChipPile_C_LeaveWater::Water' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.virus
// 0x0001 (0x0001 - 0x0000)
struct ActorChipPile_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActorChipPile_C_Virus) == 0x000001, "Wrong alignment on ActorChipPile_C_Virus");
static_assert(sizeof(ActorChipPile_C_Virus) == 0x000001, "Wrong size on ActorChipPile_C_Virus");
static_assert(offsetof(ActorChipPile_C_Virus, Activate) == 0x000000, "Member 'ActorChipPile_C_Virus::Activate' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct ActorChipPile_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActorChipPile_C_SetPropProps) == 0x000001, "Wrong alignment on ActorChipPile_C_SetPropProps");
static_assert(sizeof(ActorChipPile_C_SetPropProps) == 0x000003, "Wrong size on ActorChipPile_C_SetPropProps");
static_assert(offsetof(ActorChipPile_C_SetPropProps, Static) == 0x000000, "Member 'ActorChipPile_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_SetPropProps, Frozen) == 0x000001, "Member 'ActorChipPile_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_SetPropProps, Active) == 0x000002, "Member 'ActorChipPile_C_SetPropProps::Active' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct ActorChipPile_C_AddDamage final
{
public:
