#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Actor_save

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function actor_save.actor_save_C.ExecuteUbergraph_actor_save
// 0x04A0 (0x04A0 - 0x0000)
struct Actor_save_C_ExecuteUbergraph_actor_save final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C15[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage_4;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1C16[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C17[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C18[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C19[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0230(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1A[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1B[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0318(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1C[0x3];                                     // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0348(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1D[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1E[0x7];                                     // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0410(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_ExecuteUbergraph_actor_save) == 0x000008, "Wrong alignment on Actor_save_C_ExecuteUbergraph_actor_save");
static_assert(sizeof(Actor_save_C_ExecuteUbergraph_actor_save) == 0x0004A0, "Wrong size on Actor_save_C_ExecuteUbergraph_actor_save");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, EntryPoint) == 0x000000, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::EntryPoint' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_ignore) == 0x000004, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_damage_4) == 0x000008, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hit_5) == 0x00000C, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_actor_1) == 0x000098, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_impact_1) == 0x0000A0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_water_3) == 0x0000B0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_water_2) == 0x0000B8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_water_1) == 0x0000C0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_water) == 0x0000C8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_activate) == 0x0000D0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_static) == 0x0000D1, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_frozen) == 0x0000D2, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_active) == 0x0000D3, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_actor) == 0x0000D8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_damage_3) == 0x0000E0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hit_4) == 0x0000E4, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_impact) == 0x00016C, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_skipSetting) == 0x000178, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_key_1) == 0x000180, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_11) == 0x000190, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hit_3) == 0x000198, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_damage_2) == 0x000220, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_fuel) == 0x000224, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_10) == 0x000228, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hit_2) == 0x000230, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_index) == 0x0002B8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_action) == 0x0002BC, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_9) == 0x0002C0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_8) == 0x0002C8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_damage_1) == 0x0002D0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_location_1) == 0x0002D4, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_7) == 0x0002E0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_6) == 0x0002E8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_5) == 0x0002F0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_wheelDelta) == 0x0002F8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_4) == 0x000300, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_mouse) == 0x000308, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_3) == 0x000310, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_key) == 0x000318, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_pressed) == 0x000330, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_temperature_1) == 0x000334, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_temperature) == 0x000338, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_speed) == 0x00033C, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_2) == 0x000340, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hit_1) == 0x000348, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_name) == 0x0003D0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_volume) == 0x0003E0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player_1) == 0x0003E8, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_location) == 0x0003F0, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_damage) == 0x0003FC, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_clean) == 0x000400, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_player) == 0x000408, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hit) == 0x000410, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ExecuteUbergraph_actor_save, K2Node_Event_hook) == 0x000498, "Member 'Actor_save_C_ExecuteUbergraph_actor_save::K2Node_Event_hook' has a wrong offset!");

// Function actor_save.actor_save_C.setIgnoreSave
// 0x0001 (0x0001 - 0x0000)
struct Actor_save_C_SetIgnoreSave final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_SetIgnoreSave) == 0x000001, "Wrong alignment on Actor_save_C_SetIgnoreSave");
static_assert(sizeof(Actor_save_C_SetIgnoreSave) == 0x000001, "Wrong size on Actor_save_C_SetIgnoreSave");
static_assert(offsetof(Actor_save_C_SetIgnoreSave, Ignore) == 0x000000, "Member 'Actor_save_C_SetIgnoreSave::Ignore' has a wrong offset!");

// Function actor_save.actor_save_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_Hooked) == 0x000008, "Wrong alignment on Actor_save_C_Hooked");
static_assert(sizeof(Actor_save_C_Hooked) == 0x000008, "Wrong size on Actor_save_C_Hooked");
static_assert(offsetof(Actor_save_C_Hooked, Hook) == 0x000000, "Member 'Actor_save_C_Hooked::Hook' has a wrong offset!");

// Function actor_save.actor_save_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Actor_save_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Actor_save_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Actor_save_C_PlayerUsedOn");
static_assert(sizeof(Actor_save_C_PlayerUsedOn) == 0x000090, "Wrong size on Actor_save_C_PlayerUsedOn");
static_assert(offsetof(Actor_save_C_PlayerUsedOn, Player) == 0x000000, "Member 'Actor_save_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Actor_save_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function actor_save.actor_save_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Actor_save_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_Slice) == 0x000001, "Wrong alignment on Actor_save_C_Slice");
static_assert(sizeof(Actor_save_C_Slice) == 0x000001, "Wrong size on Actor_save_C_Slice");
static_assert(offsetof(Actor_save_C_Slice, Clean) == 0x000000, "Member 'Actor_save_C_Slice::Clean' has a wrong offset!");

// Function actor_save.actor_save_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Actor_save_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Actor_save_C_ReachedByExplosion");
static_assert(sizeof(Actor_save_C_ReachedByExplosion) == 0x000010, "Wrong size on Actor_save_C_ReachedByExplosion");
static_assert(offsetof(Actor_save_C_ReachedByExplosion, Location) == 0x000000, "Member 'Actor_save_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Actor_save_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function actor_save.actor_save_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerLookAway) == 0x000008, "Wrong alignment on Actor_save_C_PlayerLookAway");
static_assert(sizeof(Actor_save_C_PlayerLookAway) == 0x000008, "Wrong size on Actor_save_C_PlayerLookAway");
static_assert(offsetof(Actor_save_C_PlayerLookAway, Player) == 0x000000, "Member 'Actor_save_C_PlayerLookAway::Player' has a wrong offset!");

// Function actor_save.actor_save_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Actor_save_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_Stepped) == 0x000004, "Wrong alignment on Actor_save_C_Stepped");
static_assert(sizeof(Actor_save_C_Stepped) == 0x000004, "Wrong size on Actor_save_C_Stepped");
static_assert(offsetof(Actor_save_C_Stepped, Volume) == 0x000000, "Member 'Actor_save_C_Stepped::Volume' has a wrong offset!");

// Function actor_save.actor_save_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Actor_save_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_ActionName) == 0x000008, "Wrong alignment on Actor_save_C_ActionName");
static_assert(sizeof(Actor_save_C_ActionName) == 0x0000A0, "Wrong size on Actor_save_C_ActionName");
static_assert(offsetof(Actor_save_C_ActionName, Player) == 0x000000, "Member 'Actor_save_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ActionName, Hit) == 0x000008, "Member 'Actor_save_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ActionName, Param_Name) == 0x000090, "Member 'Actor_save_C_ActionName::Param_Name' has a wrong offset!");

// Function actor_save.actor_save_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Actor_save_C_AccumulateTemperature");
static_assert(sizeof(Actor_save_C_AccumulateTemperature) == 0x000008, "Wrong size on Actor_save_C_AccumulateTemperature");
static_assert(offsetof(Actor_save_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Actor_save_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Actor_save_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Actor_save_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function actor_save.actor_save_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Actor_save_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_AddTemperature) == 0x000004, "Wrong alignment on Actor_save_C_AddTemperature");
static_assert(sizeof(Actor_save_C_AddTemperature) == 0x000004, "Wrong size on Actor_save_C_AddTemperature");
static_assert(offsetof(Actor_save_C_AddTemperature, Temperature) == 0x000000, "Member 'Actor_save_C_AddTemperature::Temperature' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Actor_save_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Param_Key;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandAnyKey");
static_assert(sizeof(Actor_save_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Actor_save_C_PlayerHandAnyKey");
static_assert(offsetof(Actor_save_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_PlayerHandAnyKey, Param_Key) == 0x000008, "Member 'Actor_save_C_PlayerHandAnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(Actor_save_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Actor_save_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Actor_save_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandMouse");
static_assert(sizeof(Actor_save_C_PlayerHandMouse) == 0x000010, "Wrong size on Actor_save_C_PlayerHandMouse");
static_assert(offsetof(Actor_save_C_PlayerHandMouse, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Actor_save_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Actor_save_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandMouseWheel");
static_assert(sizeof(Actor_save_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Actor_save_C_PlayerHandMouseWheel");
static_assert(offsetof(Actor_save_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Actor_save_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandRelease_LMB");
static_assert(sizeof(Actor_save_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Actor_save_C_PlayerHandRelease_LMB");
static_assert(offsetof(Actor_save_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandRelease_RMB");
static_assert(sizeof(Actor_save_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Actor_save_C_PlayerHandRelease_RMB");
static_assert(offsetof(Actor_save_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function actor_save.actor_save_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Actor_save_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_Exploded) == 0x000004, "Wrong alignment on Actor_save_C_Exploded");
static_assert(sizeof(Actor_save_C_Exploded) == 0x000010, "Wrong size on Actor_save_C_Exploded");
static_assert(offsetof(Actor_save_C_Exploded, Damage) == 0x000000, "Member 'Actor_save_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Actor_save_C_Exploded, Location) == 0x000004, "Member 'Actor_save_C_Exploded::Location' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandUse_LMB");
static_assert(sizeof(Actor_save_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Actor_save_C_PlayerHandUse_LMB");
static_assert(offsetof(Actor_save_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function actor_save.actor_save_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Actor_save_C_PlayerHandUse_RMB");
static_assert(sizeof(Actor_save_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Actor_save_C_PlayerHandUse_RMB");
static_assert(offsetof(Actor_save_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Actor_save_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function actor_save.actor_save_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Actor_save_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Actor_save_C_ActionOptionIndex");
static_assert(sizeof(Actor_save_C_ActionOptionIndex) == 0x000098, "Wrong size on Actor_save_C_ActionOptionIndex");
static_assert(offsetof(Actor_save_C_ActionOptionIndex, Player) == 0x000000, "Member 'Actor_save_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Actor_save_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Actor_save_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ActionOptionIndex, Action) == 0x000094, "Member 'Actor_save_C_ActionOptionIndex::Action' has a wrong offset!");

// Function actor_save.actor_save_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Actor_save_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_Ignite) == 0x000004, "Wrong alignment on Actor_save_C_Ignite");
static_assert(sizeof(Actor_save_C_Ignite) == 0x000004, "Wrong size on Actor_save_C_Ignite");
static_assert(offsetof(Actor_save_C_Ignite, Fuel) == 0x000000, "Member 'Actor_save_C_Ignite::Fuel' has a wrong offset!");

// Function actor_save.actor_save_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Actor_save_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_FireDamage) == 0x000004, "Wrong alignment on Actor_save_C_FireDamage");
static_assert(sizeof(Actor_save_C_FireDamage) == 0x000004, "Wrong size on Actor_save_C_FireDamage");
static_assert(offsetof(Actor_save_C_FireDamage, Damage) == 0x000000, "Member 'Actor_save_C_FireDamage::Damage' has a wrong offset!");

// Function actor_save.actor_save_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Actor_save_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Actor_save_C_SteppedOn) == 0x000008, "Wrong alignment on Actor_save_C_SteppedOn");
static_assert(sizeof(Actor_save_C_SteppedOn) == 0x000090, "Wrong size on Actor_save_C_SteppedOn");
static_assert(offsetof(Actor_save_C_SteppedOn, Player) == 0x000000, "Member 'Actor_save_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Actor_save_C_SteppedOn, Hit) == 0x000008, "Member 'Actor_save_C_SteppedOn::Hit' has a wrong offset!");

// Function actor_save.actor_save_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Actor_save_C_SetKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_SetKey) == 0x000008, "Wrong alignment on Actor_save_C_SetKey");
static_assert(sizeof(Actor_save_C_SetKey) == 0x000010, "Wrong size on Actor_save_C_SetKey");
static_assert(offsetof(Actor_save_C_SetKey, Param_Key) == 0x000000, "Member 'Actor_save_C_SetKey::Param_Key' has a wrong offset!");

// Function actor_save.actor_save_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Actor_save_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_AddDamage) == 0x000008, "Wrong alignment on Actor_save_C_AddDamage");
static_assert(sizeof(Actor_save_C_AddDamage) == 0x0000A8, "Wrong size on Actor_save_C_AddDamage");
static_assert(offsetof(Actor_save_C_AddDamage, Actor) == 0x000000, "Member 'Actor_save_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Actor_save_C_AddDamage, Damage) == 0x000008, "Member 'Actor_save_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Actor_save_C_AddDamage, Hit) == 0x00000C, "Member 'Actor_save_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Actor_save_C_AddDamage, Impact) == 0x000094, "Member 'Actor_save_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Actor_save_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Actor_save_C_AddDamage::SkipSetting' has a wrong offset!");

// Function actor_save.actor_save_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Actor_save_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_SetPropProps) == 0x000001, "Wrong alignment on Actor_save_C_SetPropProps");
static_assert(sizeof(Actor_save_C_SetPropProps) == 0x000003, "Wrong size on Actor_save_C_SetPropProps");
static_assert(offsetof(Actor_save_C_SetPropProps, Static) == 0x000000, "Member 'Actor_save_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Actor_save_C_SetPropProps, Frozen) == 0x000001, "Member 'Actor_save_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Actor_save_C_SetPropProps, Active) == 0x000002, "Member 'Actor_save_C_SetPropProps::Active' has a wrong offset!");

// Function actor_save.actor_save_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Actor_save_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_Virus) == 0x000001, "Wrong alignment on Actor_save_C_Virus");
static_assert(sizeof(Actor_save_C_Virus) == 0x000001, "Wrong size on Actor_save_C_Virus");
static_assert(offsetof(Actor_save_C_Virus, Activate) == 0x000000, "Member 'Actor_save_C_Virus::Activate' has a wrong offset!");

// Function actor_save.actor_save_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Actor_save_C_LeaveWaterOrigin");
static_assert(sizeof(Actor_save_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Actor_save_C_LeaveWaterOrigin");
static_assert(offsetof(Actor_save_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Actor_save_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function actor_save.actor_save_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Actor_save_C_EnterWaterOrigin");
static_assert(sizeof(Actor_save_C_EnterWaterOrigin) == 0x000008, "Wrong size on Actor_save_C_EnterWaterOrigin");
static_assert(offsetof(Actor_save_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Actor_save_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function actor_save.actor_save_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_LeaveWater) == 0x000008, "Wrong alignment on Actor_save_C_LeaveWater");
static_assert(sizeof(Actor_save_C_LeaveWater) == 0x000008, "Wrong size on Actor_save_C_LeaveWater");
static_assert(offsetof(Actor_save_C_LeaveWater, Water) == 0x000000, "Member 'Actor_save_C_LeaveWater::Water' has a wrong offset!");

// Function actor_save.actor_save_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Actor_save_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_EnterWater) == 0x000008, "Wrong alignment on Actor_save_C_EnterWater");
static_assert(sizeof(Actor_save_C_EnterWater) == 0x000008, "Wrong size on Actor_save_C_EnterWater");
static_assert(offsetof(Actor_save_C_EnterWater, Water) == 0x000000, "Member 'Actor_save_C_EnterWater::Water' has a wrong offset!");

// Function actor_save.actor_save_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Actor_save_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1C1F[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_ImpactDamage) == 0x000008, "Wrong alignment on Actor_save_C_ImpactDamage");
static_assert(sizeof(Actor_save_C_ImpactDamage) == 0x0000A8, "Wrong size on Actor_save_C_ImpactDamage");
static_assert(offsetof(Actor_save_C_ImpactDamage, Damage) == 0x000000, "Member 'Actor_save_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ImpactDamage, Hit) == 0x000004, "Member 'Actor_save_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ImpactDamage, Actor) == 0x000090, "Member 'Actor_save_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Actor_save_C_ImpactDamage, Impact) == 0x000098, "Member 'Actor_save_C_ImpactDamage::Impact' has a wrong offset!");

// Function actor_save.actor_save_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Actor_save_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_getKey_key;                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_UserConstructionScript) == 0x000008, "Wrong alignment on Actor_save_C_UserConstructionScript");
static_assert(sizeof(Actor_save_C_UserConstructionScript) == 0x000010, "Wrong size on Actor_save_C_UserConstructionScript");
static_assert(offsetof(Actor_save_C_UserConstructionScript, CallFunc_getKey_key) == 0x000000, "Member 'Actor_save_C_UserConstructionScript::CallFunc_getKey_key' has a wrong offset!");

// Function actor_save.actor_save_C.ignoreSave
// 0x0001 (0x0001 - 0x0000)
struct Actor_save_C_IgnoreSave final
{
public:
	bool                                          Param_IgnoreSave;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_IgnoreSave) == 0x000001, "Wrong alignment on Actor_save_C_IgnoreSave");
static_assert(sizeof(Actor_save_C_IgnoreSave) == 0x000001, "Wrong size on Actor_save_C_IgnoreSave");
static_assert(offsetof(Actor_save_C_IgnoreSave, Param_IgnoreSave) == 0x000000, "Member 'Actor_save_C_IgnoreSave::Param_IgnoreSave' has a wrong offset!");

// Function actor_save.actor_save_C.loadData
// 0x0150 (0x0150 - 0x0000)
struct Actor_save_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C20[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_LoadData) == 0x000010, "Wrong alignment on Actor_save_C_LoadData");
static_assert(sizeof(Actor_save_C_LoadData) == 0x000150, "Wrong size on Actor_save_C_LoadData");
static_assert(offsetof(Actor_save_C_LoadData, Data) == 0x000000, "Member 'Actor_save_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Actor_save_C_LoadData, Return) == 0x0000C0, "Member 'Actor_save_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Actor_save_C_LoadData, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000C4, "Member 'Actor_save_C_LoadData::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Actor_save_C_LoadData, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00014C, "Member 'Actor_save_C_LoadData::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function actor_save.actor_save_C.getData
// 0x01C0 (0x01C0 - 0x0000)
struct Actor_save_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C21[0x8];                                     // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           K2Node_MakeStruct_struct_save;                     // 0x0100(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Actor_save_C_GetData) == 0x000010, "Wrong alignment on Actor_save_C_GetData");
static_assert(sizeof(Actor_save_C_GetData) == 0x0001C0, "Wrong size on Actor_save_C_GetData");
static_assert(offsetof(Actor_save_C_GetData, Data) == 0x000000, "Member 'Actor_save_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Actor_save_C_GetData, CallFunc_GetTransform_ReturnValue) == 0x0000C0, "Member 'Actor_save_C_GetData::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Actor_save_C_GetData, CallFunc_GetObjectClass_ReturnValue) == 0x0000F0, "Member 'Actor_save_C_GetData::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Actor_save_C_GetData, K2Node_MakeStruct_struct_save) == 0x000100, "Member 'Actor_save_C_GetData::K2Node_MakeStruct_struct_save' has a wrong offset!");

// Function actor_save.actor_save_C.skipPreDelete
// 0x0001 (0x0001 - 0x0000)
struct Actor_save_C_SkipPreDelete final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_SkipPreDelete) == 0x000001, "Wrong alignment on Actor_save_C_SkipPreDelete");
static_assert(sizeof(Actor_save_C_SkipPreDelete) == 0x000001, "Wrong size on Actor_save_C_SkipPreDelete");
static_assert(offsetof(Actor_save_C_SkipPreDelete, Skip) == 0x000000, "Member 'Actor_save_C_SkipPreDelete::Skip' has a wrong offset!");

// Function actor_save.actor_save_C.setPath
// 0x0018 (0x0018 - 0x0000)
struct Actor_save_C_SetPath final
{
public:
	TArray<struct FVector>                        Path;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Actor_save_C_SetPath) == 0x000008, "Wrong alignment on Actor_save_C_SetPath");
static_assert(sizeof(Actor_save_C_SetPath) == 0x000018, "Wrong size on Actor_save_C_SetPath");
static_assert(offsetof(Actor_save_C_SetPath, Path) == 0x000000, "Member 'Actor_save_C_SetPath::Path' has a wrong offset!");
