#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorChipPile

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_food1_structs.hpp"


namespace SDK::Params
{

// Function actorChipPile.actorChipPile_C.ExecuteUbergraph_actorChipPile
// 0x0A40 (0x0A40 - 0x0000)
struct ActorChipPile_C_ExecuteUbergraph_actorChipPile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_6;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x00A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x0188(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x01B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0280(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0330(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x03BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x03D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x04F8(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0508(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_593[0x1];                                      // 0x0593(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x059C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0608(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_Chip_Pile;         // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x063C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0650(0x0030)(IsPlainOldData, NoDestructor)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0688(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_722[0x2];                                      // 0x0722(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0750(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0770(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x078C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0798(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrunge_C*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_key;                                  // 0x07B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x07C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_activate;                             // 0x07C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C4[0x4];                                      // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x07EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_874[0x4];                                      // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0880(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x088C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88D[0x3];                                      // 0x088D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_894[0x4];                                      // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x08A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x092C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_939[0x3];                                      // 0x0939(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x093C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0948(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_954[0xC];                                      // 0x0954(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0960(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x09B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ActorChipPile_C_ExecuteUbergraph_actorChipPile) == 0x000010, "Wrong alignment on ActorChipPile_C_ExecuteUbergraph_actorChipPile");
static_assert(sizeof(ActorChipPile_C_ExecuteUbergraph_actorChipPile) == 0x000A40, "Wrong size on ActorChipPile_C_ExecuteUbergraph_actorChipPile");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, EntryPoint) == 0x000000, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_18) == 0x000008, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_7) == 0x000010, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_6) == 0x000098, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_fuel) == 0x00009C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_5) == 0x0000A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hot) == 0x0000A4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_17) == 0x000130, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_16) == 0x000138, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_4) == 0x000140, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_location_1) == 0x000144, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_15) == 0x000150, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_14) == 0x000158, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_13) == 0x000160, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_wheelDelta) == 0x000168, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_12) == 0x000170, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_mouse) == 0x000178, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_11) == 0x000180, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_key_1) == 0x000188, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_pressed) == 0x0001A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_temperature_1) == 0x0001A4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_temperature) == 0x0001A8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_speed) == 0x0001AC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_10) == 0x0001B0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_6) == 0x0001B8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_name_1) == 0x000240, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_volume) == 0x000250, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_9) == 0x000258, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_location) == 0x000260, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_3) == 0x00026C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_clean_1) == 0x000270, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_8) == 0x000278, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_5) == 0x000280, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hook_1) == 0x000308, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_clean) == 0x000310, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_7) == 0x000318, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hook) == 0x000320, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_6) == 0x000328, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_4) == 0x000330, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_kick) == 0x0003B8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_name) == 0x0003BC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_5) == 0x0003C8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_4) == 0x0003D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_3) == 0x0003D8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_2) == 0x000460, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_3) == 0x000468, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_2) == 0x000470, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player_1) == 0x000478, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000480, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue) == 0x00048C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeTransform_ReturnValue) == 0x0004A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0004D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0004D4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0004E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0004EC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_obj_static_obj) == 0x0004F8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000508, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000590, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bBlockingHit) == 0x000591, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bInitialOverlap) == 0x000592, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Time) == 0x000594, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Distance) == 0x000598, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Location) == 0x00059C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactPoint) == 0x0005A8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Normal) == 0x0005B4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactNormal) == 0x0005C0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_PhysMat) == 0x0005D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitActor) == 0x0005D8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitComponent) == 0x0005E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitBoneName) == 0x0005E8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitItem) == 0x0005F0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ElementIndex) == 0x0005F4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_FaceIndex) == 0x0005F8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceStart) == 0x0005FC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceEnd) == 0x000608, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Array_Add_ReturnValue) == 0x000614, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_GetObjectClass_ReturnValue) == 0x000618, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000620, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_ClassDynamicCast_AsActor_Chip_Pile) == 0x000630, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_ClassDynamicCast_AsActor_Chip_Pile' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_ClassDynamicCast_bSuccess) == 0x000638, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00063C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeTransform_ReturnValue_1) == 0x000650, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_player) == 0x000680, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_2) == 0x000688, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_action) == 0x000710, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000718, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000720, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000721, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Time_1) == 0x000724, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Distance_1) == 0x000728, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Location_1) == 0x00072C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000738, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_Normal_1) == 0x000744, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000750, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_PhysMat_1) == 0x000760, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitActor_1) == 0x000768, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitComponent_1) == 0x000770, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitBoneName_1) == 0x000778, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_HitItem_1) == 0x000780, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_ElementIndex_1) == 0x000784, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_FaceIndex_1) == 0x000788, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceStart_1) == 0x00078C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BreakHitResult_TraceEnd_1) == 0x000798, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_FinishSpawningActor_ReturnValue) == 0x0007A8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_key) == 0x0007B0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_static) == 0x0007C0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_frozen) == 0x0007C1, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_active) == 0x0007C2, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_activate) == 0x0007C3, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water_3) == 0x0007C8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water_2) == 0x0007D0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water_1) == 0x0007D8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_water) == 0x0007E0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage_1) == 0x0007E8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit_1) == 0x0007EC, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_actor_1) == 0x000878, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_impact_1) == 0x000880, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_ignore) == 0x00088C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Array_Add_ReturnValue_1) == 0x000890, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_actor) == 0x000898, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_damage) == 0x0008A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_hit) == 0x0008A4, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_impact) == 0x00092C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, K2Node_Event_skipSetting) == 0x000938, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00093C, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000948, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeTransform_ReturnValue_2) == 0x000960, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000990, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000998, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0009A0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0009A8, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActorChipPile_C_ExecuteUbergraph_actorChipPile, CallFunc_MakeHitResult_ReturnValue) == 0x0009B0, "Member 'ActorChipPile_C_ExecuteUbergraph_actorChipPile::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function actorChipPile.actorChipPile_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct ActorChipPile_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActorChipPile_C_AddDamage) == 0x000008, "Wrong alignment on ActorChipPile_C_AddDamage");
static_assert(sizeof(ActorChipPile_C_AddDamage) == 0x0000A8, "Wrong size on ActorChipPile_C_AddDamage");
