#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AirRuneBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass airRuneBox.airRuneBox_C
// 0x0018 (0x0238 - 0x0220)
class AAirRuneBox_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__airRuneBox_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_airRuneBox(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"airRuneBox_C">();
	}
	static class AAirRuneBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAirRuneBox_C>();
	}
};
static_assert(alignof(AAirRuneBox_C) == 0x000008, "Wrong alignment on AAirRuneBox_C");
static_assert(sizeof(AAirRuneBox_C) == 0x000238, "Wrong size on AAirRuneBox_C");
static_assert(offsetof(AAirRuneBox_C, UberGraphFrame) == 0x000220, "Member 'AAirRuneBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAirRuneBox_C, Box) == 0x000228, "Member 'AAirRuneBox_C::Box' has a wrong offset!");
static_assert(offsetof(AAirRuneBox_C, DefaultSceneRoot) == 0x000230, "Member 'AAirRuneBox_C::DefaultSceneRoot' has a wrong offset!");

}

