#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AltarPortal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass altarPortal.altarPortal_C
// 0x0028 (0x0248 - 0x0220)
class AAltarPortal_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Eff_altarPortal;                                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AAltar_C*                               Altar;                                             // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__altarPortal_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_altarPortal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"altarPortal_C">();
	}
	static class AAltarPortal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAltarPortal_C>();
	}
};
static_assert(alignof(AAltarPortal_C) == 0x000008, "Wrong alignment on AAltarPortal_C");
static_assert(sizeof(AAltarPortal_C) == 0x000248, "Wrong size on AAltarPortal_C");
static_assert(offsetof(AAltarPortal_C, UberGraphFrame) == 0x000220, "Member 'AAltarPortal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAltarPortal_C, Eff_altarPortal) == 0x000228, "Member 'AAltarPortal_C::Eff_altarPortal' has a wrong offset!");
static_assert(offsetof(AAltarPortal_C, Capsule) == 0x000230, "Member 'AAltarPortal_C::Capsule' has a wrong offset!");
static_assert(offsetof(AAltarPortal_C, DefaultSceneRoot) == 0x000238, "Member 'AAltarPortal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAltarPortal_C, Altar) == 0x000240, "Member 'AAltarPortal_C::Altar' has a wrong offset!");

}

