#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbienceMastter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ambienceMastter.ambienceMastter_C
// 0x0060 (0x0280 - 0x0220)
class AAmbienceMastter_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ATrigger_ambientSound_C*>        Ambience_triggers;                                 // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FIntVector>                     bounded;                                           // 0x0240(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Priorities;                                        // 0x0250(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 A;                                                 // 0x0260(0x0010)(Edit, BlueprintVisible)
	TArray<class ATrigger_ambientSound_C*>        Ambiences;                                         // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void ExecuteUbergraph_ambienceMastter(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ambienceMastter_C">();
	}
	static class AAmbienceMastter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmbienceMastter_C>();
	}
};
static_assert(alignof(AAmbienceMastter_C) == 0x000008, "Wrong alignment on AAmbienceMastter_C");
static_assert(sizeof(AAmbienceMastter_C) == 0x000280, "Wrong size on AAmbienceMastter_C");
static_assert(offsetof(AAmbienceMastter_C, UberGraphFrame) == 0x000220, "Member 'AAmbienceMastter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAmbienceMastter_C, Billboard) == 0x000228, "Member 'AAmbienceMastter_C::Billboard' has a wrong offset!");
static_assert(offsetof(AAmbienceMastter_C, Ambience_triggers) == 0x000230, "Member 'AAmbienceMastter_C::Ambience_triggers' has a wrong offset!");
static_assert(offsetof(AAmbienceMastter_C, bounded) == 0x000240, "Member 'AAmbienceMastter_C::bounded' has a wrong offset!");
static_assert(offsetof(AAmbienceMastter_C, Priorities) == 0x000250, "Member 'AAmbienceMastter_C::Priorities' has a wrong offset!");
static_assert(offsetof(AAmbienceMastter_C, A) == 0x000260, "Member 'AAmbienceMastter_C::A' has a wrong offset!");
static_assert(offsetof(AAmbienceMastter_C, Ambiences) == 0x000270, "Member 'AAmbienceMastter_C::Ambiences' has a wrong offset!");

}

