#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Antibreather

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_physSound_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function antibreather.antibreather_C.ExecuteUbergraph_antibreather
// 0x09A0 (0x09A0 - 0x0000)
struct Antibreather_C_ExecuteUbergraph_antibreather final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24CF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D0[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D1[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D2[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D3[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D4[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D5[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D6[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_CustomEvent_NewSound;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D7[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0110(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D8[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D9[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24DA[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DB[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACar1_C*                                K2Node_DynamicCast_AsCar_1;                        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24DC[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_LowEntry_LocalVariable_Value__Object;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_5;               // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DD[0x5];                                     // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24DE[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24DF[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_Constant_ReturnValue;           // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E0[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAntibreather_LOW_test_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsAntibreather_LOW_Test_Skeleton_Anim_Blueprint; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E1[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E2[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02AC(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E3[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x02C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E4[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_2;            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E5[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E6[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0344(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E7[0x3];                                     // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x03F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0480(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0508(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_11;       // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24E8[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x05A0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x05B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E9[0x3];                                     // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x05C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24EA[0x3];                                     // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24EB[0x2];                                     // 0x065A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0664(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0670(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24EC[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24ED[0x4];                                     // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24EE[0x3];                                     // 0x06E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x06EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x06F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0784(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_2;                              // 0x0785(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0786(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24EF[0x1];                                     // 0x0787(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0794(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x07A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x07D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24F0[0x4];                                     // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACar1_C*                                K2Node_DynamicCast_AsCar_1_1;                      // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F1[0x3];                                     // 0x07F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x07F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x087C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F2[0x3];                                     // 0x087D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player_1;                // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F3[0x3];                                     // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_12;       // 0x088C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsProp_ABfriend;           // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F4[0x7];                                     // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_13;       // 0x08B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x08C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F5[0x3];                                     // 0x08D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x08DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x08E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_4;               // 0x08EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x08ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F6[0x2];                                     // 0x08EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x08FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x08FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F7[0x2];                                     // 0x08FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_14;       // 0x0900(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_15;       // 0x090C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x091C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_16;       // 0x0928(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0938(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x093C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0940(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x094C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0958(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0964(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F8[0x3];                                     // 0x0965(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0968(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F9[0x4];                                     // 0x0974(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_2;    // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24FA[0x2];                                     // 0x0982(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0984(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0994(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0999(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x099A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x099B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x099C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x099D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x099E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Antibreather_C_ExecuteUbergraph_antibreather) == 0x000010, "Wrong alignment on Antibreather_C_ExecuteUbergraph_antibreather");
static_assert(sizeof(Antibreather_C_ExecuteUbergraph_antibreather) == 0x0009A0, "Wrong size on Antibreather_C_ExecuteUbergraph_antibreather");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, EntryPoint) == 0x000000, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::EntryPoint' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, Temp_object_Variable) == 0x000008, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_MakeRotator_ReturnValue_1) == 0x000024, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, Temp_object_Variable_1) == 0x000030, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CustomEvent_MovementResult_1) == 0x000040, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CustomEvent_MovementResult) == 0x000054, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, Temp_byte_Variable) == 0x000068, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000070, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000084, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, Temp_byte_Variable_1) == 0x0000A8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Normal_ReturnValue) == 0x0000AC, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_VLerp_ReturnValue) == 0x0000B8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C4, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Vector_Distance_ReturnValue) == 0x0000DC, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E4, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0000E8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CustomEvent_NewSound) == 0x0000F0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CustomEvent_NewSound' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000F8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000104, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000108, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_obj_static_obj) == 0x000110, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_MakeVector_ReturnValue) == 0x000120, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_RotateAngleAxis_ReturnValue) == 0x00012C, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Add_VectorVector_ReturnValue) == 0x000138, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000144, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000150, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00015C, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000160, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000164, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetActorForwardVector_ReturnValue) == 0x000170, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000180, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000188, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_IsValid_ReturnValue) == 0x000194, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000198, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_DynamicCast_AsCar_1) == 0x0001A8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_DynamicCast_AsCar_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001B4, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0001C0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_DynamicCast_AsMain_Player) == 0x0001C8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_IsValid_ReturnValue_1) == 0x0001D1, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CustomEvent_MovementResult_5) == 0x0001D2, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CustomEvent_MovementResult_5' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_CreateMoveToProxyObject_ReturnValue_1) == 0x0001D8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_CreateMoveToProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_IsValid_ReturnValue_2) == 0x0001E0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0001E4, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CustomEvent_MovementResult_2) == 0x0001F0, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0001F4, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000200, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Normal_ReturnValue_1) == 0x00020C, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetPlayerPawn_ReturnValue) == 0x000218, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000220, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x00022C, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Cross_VectorVector_ReturnValue) == 0x000238, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Dot_VectorVector_ReturnValue) == 0x000244, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_VInterpTo_Constant_ReturnValue) == 0x000248, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_VInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Lerp_ReturnValue) == 0x000254, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_MakeRotator_ReturnValue_2) == 0x000258, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetAnimInstance_ReturnValue) == 0x000268, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_DynamicCast_AsAntibreather_LOW_Test_Skeleton_Anim_Blueprint) == 0x000270, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_DynamicCast_AsAntibreather_LOW_Test_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_DynamicCast_bSuccess_2) == 0x000278, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetVelocity_ReturnValue) == 0x00027C, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_VSize_ReturnValue) == 0x000288, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x00028C, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000290, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_FInterpTo_ReturnValue) == 0x000294, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000298, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Vector_Distance_ReturnValue_1) == 0x0002A4, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002A8, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_C_ExecuteUbergraph_antibreather, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002AC, "Member 'Antibreather_C_ExecuteUbergraph_antibreather::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
