#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Antibreather_LOW_test_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function antibreather_LOW_test_Skeleton_AnimBlueprint.antibreather_LOW_test_Skeleton_AnimBlueprint_C.ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint
// 0x0040 (0x0040 - 0x0000)
struct Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_218D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_218E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAntibreather_C*                        K2Node_DynamicCast_AsAntibreather;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_218F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint");
static_assert(sizeof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint) == 0x000040, "Wrong size on Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsAntibreather) == 0x000018, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsAntibreather' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000028, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000034, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue_1) == 0x00003C, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_ExecuteUbergraph_antibreather_LOW_test_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

// Function antibreather_LOW_test_Skeleton_AnimBlueprint.antibreather_LOW_test_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function antibreather_LOW_test_Skeleton_AnimBlueprint.antibreather_LOW_test_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Antibreather_LOW_test_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

