#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Arg_whspawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass arg_whspawn.arg_whspawn_C
// 0x00C0 (0x0308 - 0x0248)
class AArg_whspawn_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Arg_whspawn_C;                      // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Eff_B;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_G;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_Y;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_M;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_C;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_R;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Ligh_Y;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Ligh_M;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Ligh_C;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Ligh_B;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Ligh_G;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Ligh_R;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Args;                                              // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<float>                                 Angs;                                              // 0x02C0(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 Dists;                                             // 0x02D0(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 AngsDiffs;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible)
	bool                                          Active;                                            // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         S;                                                 // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Middle;                                            // 0x02F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CalcMiddle();
	void InCenter(bool* Return);
	void Sound1();
	void Check(bool* Return);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_arg_whspawn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"arg_whspawn_C">();
	}
	static class AArg_whspawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArg_whspawn_C>();
	}
};
static_assert(alignof(AArg_whspawn_C) == 0x000008, "Wrong alignment on AArg_whspawn_C");
static_assert(sizeof(AArg_whspawn_C) == 0x000308, "Wrong size on AArg_whspawn_C");
static_assert(offsetof(AArg_whspawn_C, UberGraphFrame_Arg_whspawn_C) == 0x000248, "Member 'AArg_whspawn_C::UberGraphFrame_Arg_whspawn_C' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Eff_B) == 0x000250, "Member 'AArg_whspawn_C::Eff_B' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Eff_G) == 0x000258, "Member 'AArg_whspawn_C::Eff_G' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Eff_Y) == 0x000260, "Member 'AArg_whspawn_C::Eff_Y' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Eff_M) == 0x000268, "Member 'AArg_whspawn_C::Eff_M' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Eff_C) == 0x000270, "Member 'AArg_whspawn_C::Eff_C' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Eff_R) == 0x000278, "Member 'AArg_whspawn_C::Eff_R' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Ligh_Y) == 0x000280, "Member 'AArg_whspawn_C::Ligh_Y' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Ligh_M) == 0x000288, "Member 'AArg_whspawn_C::Ligh_M' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Ligh_C) == 0x000290, "Member 'AArg_whspawn_C::Ligh_C' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Ligh_B) == 0x000298, "Member 'AArg_whspawn_C::Ligh_B' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Ligh_G) == 0x0002A0, "Member 'AArg_whspawn_C::Ligh_G' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Ligh_R) == 0x0002A8, "Member 'AArg_whspawn_C::Ligh_R' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Args) == 0x0002B0, "Member 'AArg_whspawn_C::Args' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Angs) == 0x0002C0, "Member 'AArg_whspawn_C::Angs' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Dists) == 0x0002D0, "Member 'AArg_whspawn_C::Dists' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, AngsDiffs) == 0x0002E0, "Member 'AArg_whspawn_C::AngsDiffs' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Active) == 0x0002F0, "Member 'AArg_whspawn_C::Active' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, S) == 0x0002F4, "Member 'AArg_whspawn_C::S' has a wrong offset!");
static_assert(offsetof(AArg_whspawn_C, Middle) == 0x0002F8, "Member 'AArg_whspawn_C::Middle' has a wrong offset!");

}

