#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AriralRepEventHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ariralRepEventHandler.ariralRepEventHandler_C.ExecuteUbergraph_ariralRepEventHandler
// 0x0218 (0x0218 - 0x0000)
struct AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_calcRep_ReturnValue;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2037[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0100(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2038[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_globalChange_C>   K2Node_DynamicCast_AsInt_Global_Change;            // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2039[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0040)(HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0188(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler) == 0x000008, "Wrong alignment on AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler");
static_assert(sizeof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler) == 0x000218, "Wrong size on AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, EntryPoint) == 0x000000, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::EntryPoint' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_int_Variable) == 0x000004, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_string_Variable) == 0x000008, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_string_Variable_1) == 0x000018, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_string_Variable_2) == 0x000028, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_string_Variable_3) == 0x000038, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_string_Variable_4) == 0x000048, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, Temp_int_Variable_1) == 0x000058, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_getSaveSlot_saveSlot) == 0x000060, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_calcRep_ReturnValue) == 0x00006C, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_calcRep_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B4, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000100, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Array_Get_Item) == 0x000110, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_DynamicCast_AsInt_Global_Change) == 0x000120, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_DynamicCast_AsInt_Global_Change' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Less_IntInt_ReturnValue) == 0x000131, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_Select_Default) == 0x000178, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Conv_StringToText_ReturnValue) == 0x000188, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001A0, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, K2Node_MakeArray_Array) == 0x0001E0, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Format_ReturnValue) == 0x0001F0, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler, CallFunc_Conv_TextToString_ReturnValue) == 0x000208, "Member 'AriralRepEventHandler_C_ExecuteUbergraph_ariralRepEventHandler::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function ariralRepEventHandler.ariralRepEventHandler_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AriralRepEventHandler_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AriralRepEventHandler_C_ReceiveTick) == 0x000004, "Wrong alignment on AriralRepEventHandler_C_ReceiveTick");
static_assert(sizeof(AriralRepEventHandler_C_ReceiveTick) == 0x000004, "Wrong size on AriralRepEventHandler_C_ReceiveTick");
static_assert(offsetof(AriralRepEventHandler_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AriralRepEventHandler_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ariralRepEventHandler.ariralRepEventHandler_C.calcRep
// 0x0018 (0x0018 - 0x0000)
struct AriralRepEventHandler_C_CalcRep final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AriralRepEventHandler_C_CalcRep) == 0x000008, "Wrong alignment on AriralRepEventHandler_C_CalcRep");
static_assert(sizeof(AriralRepEventHandler_C_CalcRep) == 0x000018, "Wrong size on AriralRepEventHandler_C_CalcRep");
static_assert(offsetof(AriralRepEventHandler_C_CalcRep, ReturnValue) == 0x000000, "Member 'AriralRepEventHandler_C_CalcRep::ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_CalcRep, CallFunc_getSaveSlot_saveSlot) == 0x000008, "Member 'AriralRepEventHandler_C_CalcRep::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_CalcRep, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'AriralRepEventHandler_C_CalcRep::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_CalcRep, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000011, "Member 'AriralRepEventHandler_C_CalcRep::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_CalcRep, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000012, "Member 'AriralRepEventHandler_C_CalcRep::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralRepEventHandler_C_CalcRep, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000013, "Member 'AriralRepEventHandler_C_CalcRep::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

}

