#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirShipAppear

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function arirShipAppear.arirShipAppear_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct ArirShipAppear_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShipAppear_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on ArirShipAppear_C_IgnoreSave_trigger");
static_assert(sizeof(ArirShipAppear_C_IgnoreSave_trigger) == 0x000001, "Wrong size on ArirShipAppear_C_IgnoreSave_trigger");
static_assert(offsetof(ArirShipAppear_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'ArirShipAppear_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function arirShipAppear.arirShipAppear_C.make
// 0x00D8 (0x00D8 - 0x0000)
struct ArirShipAppear_C_Make final
{
public:
	class FText                                   OutputPin;                                         // 0x0000(0x0018)(Parm, OutParm)
	class FString                                 bX;                                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         L;                                                 // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         buff;                                              // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         B;                                                 // 0x0040(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShipAppear_C_Make) == 0x000008, "Wrong alignment on ArirShipAppear_C_Make");
static_assert(sizeof(ArirShipAppear_C_Make) == 0x0000D8, "Wrong size on ArirShipAppear_C_Make");
static_assert(offsetof(ArirShipAppear_C_Make, OutputPin) == 0x000000, "Member 'ArirShipAppear_C_Make::OutputPin' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, bX) == 0x000018, "Member 'ArirShipAppear_C_Make::bX' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, L) == 0x000028, "Member 'ArirShipAppear_C_Make::L' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, buff) == 0x000030, "Member 'ArirShipAppear_C_Make::buff' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, B) == 0x000040, "Member 'ArirShipAppear_C_Make::B' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, Temp_int_Variable) == 0x000050, "Member 'ArirShipAppear_C_Make::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'ArirShipAppear_C_Make::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'ArirShipAppear_C_Make::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'ArirShipAppear_C_Make::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, K2Node_MakeArray_Array) == 0x000060, "Member 'ArirShipAppear_C_Make::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000070, "Member 'ArirShipAppear_C_Make::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'ArirShipAppear_C_Make::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000084, "Member 'ArirShipAppear_C_Make::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'ArirShipAppear_C_Make::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x00008C, "Member 'ArirShipAppear_C_Make::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_JoinStringArray_ReturnValue) == 0x000090, "Member 'ArirShipAppear_C_Make::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'ArirShipAppear_C_Make::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'ArirShipAppear_C_Make::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'ArirShipAppear_C_Make::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_Make, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'ArirShipAppear_C_Make::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function arirShipAppear.arirShipAppear_C.appear
// 0x0001 (0x0001 - 0x0000)
struct ArirShipAppear_C_Appear final
{
public:
	bool                                          Dir;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShipAppear_C_Appear) == 0x000001, "Wrong alignment on ArirShipAppear_C_Appear");
static_assert(sizeof(ArirShipAppear_C_Appear) == 0x000001, "Wrong size on ArirShipAppear_C_Appear");
static_assert(offsetof(ArirShipAppear_C_Appear, Dir) == 0x000000, "Member 'ArirShipAppear_C_Appear::Dir' has a wrong offset!");

// Function arirShipAppear.arirShipAppear_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct ArirShipAppear_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirShipAppear_C_RunTrigger) == 0x000008, "Wrong alignment on ArirShipAppear_C_RunTrigger");
static_assert(sizeof(ArirShipAppear_C_RunTrigger) == 0x000010, "Wrong size on ArirShipAppear_C_RunTrigger");
static_assert(offsetof(ArirShipAppear_C_RunTrigger, Param_Owner) == 0x000000, "Member 'ArirShipAppear_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_RunTrigger, Param_Index) == 0x000008, "Member 'ArirShipAppear_C_RunTrigger::Param_Index' has a wrong offset!");

// Function arirShipAppear.arirShipAppear_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ArirShipAppear_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirShipAppear_C_ReceiveTick) == 0x000004, "Wrong alignment on ArirShipAppear_C_ReceiveTick");
static_assert(sizeof(ArirShipAppear_C_ReceiveTick) == 0x000004, "Wrong size on ArirShipAppear_C_ReceiveTick");
static_assert(offsetof(ArirShipAppear_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ArirShipAppear_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function arirShipAppear.arirShipAppear_C.ExecuteUbergraph_arirShipAppear
// 0x01F8 (0x01F8 - 0x0000)
struct ArirShipAppear_C_ExecuteUbergraph_arirShipAppear final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_dir;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_make_OutputPin;                           // 0x00C8(0x0018)()
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x00E0(0x0010)(ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x00F0(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShipAppear_C_ExecuteUbergraph_arirShipAppear) == 0x000008, "Wrong alignment on ArirShipAppear_C_ExecuteUbergraph_arirShipAppear");
static_assert(sizeof(ArirShipAppear_C_ExecuteUbergraph_arirShipAppear) == 0x0001F8, "Wrong size on ArirShipAppear_C_ExecuteUbergraph_arirShipAppear");
static_assert(offsetof(ArirShipAppear_C_ExecuteUbergraph_arirShipAppear, EntryPoint) == 0x000000, "Member 'ArirShipAppear_C_ExecuteUbergraph_arirShipAppear::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArirShipAppear_C_ExecuteUbergraph_arirShipAppear, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ArirShipAppear_C_ExecuteUbergraph_arirShipAppear::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
