#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirTrasher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass arirTrasher.arirTrasher_C
// 0x0020 (0x0268 - 0x0248)
class AArirTrasher_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ArirTrasher_C;                      // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_arirTrasher(int32 EntryPoint);
	void Trash();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"arirTrasher_C">();
	}
	static class AArirTrasher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArirTrasher_C>();
	}
};
static_assert(alignof(AArirTrasher_C) == 0x000008, "Wrong alignment on AArirTrasher_C");
static_assert(sizeof(AArirTrasher_C) == 0x000268, "Wrong size on AArirTrasher_C");
static_assert(offsetof(AArirTrasher_C, UberGraphFrame_ArirTrasher_C) == 0x000248, "Member 'AArirTrasher_C::UberGraphFrame_ArirTrasher_C' has a wrong offset!");
static_assert(offsetof(AArirTrasher_C, Sphere) == 0x000250, "Member 'AArirTrasher_C::Sphere' has a wrong offset!");
static_assert(offsetof(AArirTrasher_C, Box) == 0x000258, "Member 'AArirTrasher_C::Box' has a wrong offset!");
static_assert(offsetof(AArirTrasher_C, Count) == 0x000260, "Member 'AArirTrasher_C::Count' has a wrong offset!");

}

