#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AriralRepEventHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ariralRepEventHandler.ariralRepEventHandler_C
// 0x0018 (0x0238 - 0x0220)
class AAriralRepEventHandler_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevRep;                                           // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ariralRepEventHandler(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void LaunchEvent();
	int32 CalcRep();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ariralRepEventHandler_C">();
	}
	static class AAriralRepEventHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAriralRepEventHandler_C>();
	}
};
static_assert(alignof(AAriralRepEventHandler_C) == 0x000008, "Wrong alignment on AAriralRepEventHandler_C");
static_assert(sizeof(AAriralRepEventHandler_C) == 0x000238, "Wrong size on AAriralRepEventHandler_C");
static_assert(offsetof(AAriralRepEventHandler_C, UberGraphFrame) == 0x000220, "Member 'AAriralRepEventHandler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAriralRepEventHandler_C, DefaultSceneRoot) == 0x000228, "Member 'AAriralRepEventHandler_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAriralRepEventHandler_C, PrevRep) == 0x000230, "Member 'AAriralRepEventHandler_C::PrevRep' has a wrong offset!");

}

