#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AriralThrowStuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ariralThrowStuff.ariralThrowStuff_C
// 0x00D0 (0x02F0 - 0x0220)
class AAriralThrowStuff_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, float>                    PoisonFoods;                                       // 0x0248(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, float>                    GoodFoods;                                         // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsGood;                                            // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ariralThrowStuff(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Throw();
	void ThrowFoods();
	void ThrowType(int32 Param_Type);
	void ThrowFoods_good();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ariralThrowStuff_C">();
	}
	static class AAriralThrowStuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAriralThrowStuff_C>();
	}
};
static_assert(alignof(AAriralThrowStuff_C) == 0x000008, "Wrong alignment on AAriralThrowStuff_C");
static_assert(sizeof(AAriralThrowStuff_C) == 0x0002F0, "Wrong size on AAriralThrowStuff_C");
static_assert(offsetof(AAriralThrowStuff_C, UberGraphFrame) == 0x000220, "Member 'AAriralThrowStuff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, Sphere) == 0x000228, "Member 'AAriralThrowStuff_C::Sphere' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, Arrow) == 0x000230, "Member 'AAriralThrowStuff_C::Arrow' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, DefaultSceneRoot) == 0x000238, "Member 'AAriralThrowStuff_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, Type) == 0x000240, "Member 'AAriralThrowStuff_C::Type' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, PoisonFoods) == 0x000248, "Member 'AAriralThrowStuff_C::PoisonFoods' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, GoodFoods) == 0x000298, "Member 'AAriralThrowStuff_C::GoodFoods' has a wrong offset!");
static_assert(offsetof(AAriralThrowStuff_C, IsGood) == 0x0002E8, "Member 'AAriralThrowStuff_C::IsGood' has a wrong offset!");

}

