#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirShip_tower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass arirShip_tower.arirShip_tower_C
// 0x0070 (0x02F8 - 0x0288)
class AArirShip_tower_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ArirShip_tower_C;                   // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Gravigun_object_attr_loop;                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  Pressure;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_radarPoint_C*                     RadarPoint;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Air;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Press_p_B42E0EE04B03F2191C6B35860C766EF3;          // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Press__Direction_B42E0EE04B03F2191C6B35860C766EF3; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Press;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_E2BAAD1D4B7AD90E35FEA79FCDCF3416;              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_E2BAAD1D4B7AD90E35FEA79FCDCF3416;     // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Used;                                              // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void IgnoreSave_trigger(bool* Ignore);
	void UserConstructionScript();
	void A__FinishedFunc();
	void A__UpdateFunc();
	void A__air_diss__EventFunc();
	void A__air_app__EventFunc();
	void Press__FinishedFunc();
	void Press__UpdateFunc();
	void ReceiveBeginPlay();
	void Appear(bool Dir);
	void ExecuteUbergraph_arirShip_tower(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"arirShip_tower_C">();
	}
	static class AArirShip_tower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArirShip_tower_C>();
	}
};
static_assert(alignof(AArirShip_tower_C) == 0x000008, "Wrong alignment on AArirShip_tower_C");
static_assert(sizeof(AArirShip_tower_C) == 0x0002F8, "Wrong size on AArirShip_tower_C");
static_assert(offsetof(AArirShip_tower_C, UberGraphFrame_ArirShip_tower_C) == 0x000288, "Member 'AArirShip_tower_C::UberGraphFrame_ArirShip_tower_C' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Box) == 0x000290, "Member 'AArirShip_tower_C::Box' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Gravigun_object_attr_loop) == 0x000298, "Member 'AArirShip_tower_C::Gravigun_object_attr_loop' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Pressure) == 0x0002A0, "Member 'AArirShip_tower_C::Pressure' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, PointLight) == 0x0002A8, "Member 'AArirShip_tower_C::PointLight' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, StaticMesh) == 0x0002B0, "Member 'AArirShip_tower_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, RadarPoint) == 0x0002B8, "Member 'AArirShip_tower_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Sphere) == 0x0002C0, "Member 'AArirShip_tower_C::Sphere' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Air) == 0x0002C8, "Member 'AArirShip_tower_C::Air' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Press_p_B42E0EE04B03F2191C6B35860C766EF3) == 0x0002D0, "Member 'AArirShip_tower_C::Press_p_B42E0EE04B03F2191C6B35860C766EF3' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Press__Direction_B42E0EE04B03F2191C6B35860C766EF3) == 0x0002D4, "Member 'AArirShip_tower_C::Press__Direction_B42E0EE04B03F2191C6B35860C766EF3' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Press) == 0x0002D8, "Member 'AArirShip_tower_C::Press' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, A_a_E2BAAD1D4B7AD90E35FEA79FCDCF3416) == 0x0002E0, "Member 'AArirShip_tower_C::A_a_E2BAAD1D4B7AD90E35FEA79FCDCF3416' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, A__Direction_E2BAAD1D4B7AD90E35FEA79FCDCF3416) == 0x0002E4, "Member 'AArirShip_tower_C::A__Direction_E2BAAD1D4B7AD90E35FEA79FCDCF3416' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, A) == 0x0002E8, "Member 'AArirShip_tower_C::A' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Visible) == 0x0002F0, "Member 'AArirShip_tower_C::Visible' has a wrong offset!");
static_assert(offsetof(AArirShip_tower_C, Used) == 0x0002F1, "Member 'AArirShip_tower_C::Used' has a wrong offset!");

}

