#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirSlapper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function arirSlapper.arirSlapper_C.ExecuteUbergraph_arirSlapper
// 0x00B8 (0x00B8 - 0x0000)
struct ArirSlapper_C_ExecuteUbergraph_arirSlapper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USlapperSummoner_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirSlapper_C_ExecuteUbergraph_arirSlapper) == 0x000008, "Wrong alignment on ArirSlapper_C_ExecuteUbergraph_arirSlapper");
static_assert(sizeof(ArirSlapper_C_ExecuteUbergraph_arirSlapper) == 0x0000B8, "Wrong size on ArirSlapper_C_ExecuteUbergraph_arirSlapper");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, EntryPoint) == 0x000000, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, K2Node_DynamicCast_AsProp) == 0x000008, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000020, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000A8, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ExecuteUbergraph_arirSlapper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000AC, "Member 'ArirSlapper_C_ExecuteUbergraph_arirSlapper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function arirSlapper.arirSlapper_C.getTriggerData
// 0x02E0 (0x02E0 - 0x0000)
struct ArirSlapper_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_triggerSave                    CallFunc_getTriggerData_data;                      // 0x00F0(0x00F0)(HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	struct FStruct_triggerSave                    K2Node_SetFieldsInStruct_StructOut;                // 0x01F0(0x00F0)(HasGetValueTypeHash)
};
static_assert(alignof(ArirSlapper_C_GetTriggerData) == 0x000010, "Wrong alignment on ArirSlapper_C_GetTriggerData");
static_assert(sizeof(ArirSlapper_C_GetTriggerData) == 0x0002E0, "Wrong size on ArirSlapper_C_GetTriggerData");
static_assert(offsetof(ArirSlapper_C_GetTriggerData, Data) == 0x000000, "Member 'ArirSlapper_C_GetTriggerData::Data' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_GetTriggerData, CallFunc_getTriggerData_data) == 0x0000F0, "Member 'ArirSlapper_C_GetTriggerData::CallFunc_getTriggerData_data' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_GetTriggerData, K2Node_MakeArray_Array) == 0x0001E0, "Member 'ArirSlapper_C_GetTriggerData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_GetTriggerData, K2Node_SetFieldsInStruct_StructOut) == 0x0001F0, "Member 'ArirSlapper_C_GetTriggerData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function arirSlapper.arirSlapper_C.loadTriggerData
// 0x0110 (0x0110 - 0x0000)
struct ArirSlapper_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadTriggerData_return;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirSlapper_C_LoadTriggerData) == 0x000010, "Wrong alignment on ArirSlapper_C_LoadTriggerData");
static_assert(sizeof(ArirSlapper_C_LoadTriggerData) == 0x000110, "Wrong size on ArirSlapper_C_LoadTriggerData");
static_assert(offsetof(ArirSlapper_C_LoadTriggerData, Data) == 0x000000, "Member 'ArirSlapper_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_LoadTriggerData, Return) == 0x0000F0, "Member 'ArirSlapper_C_LoadTriggerData::Return' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_LoadTriggerData, CallFunc_loadTriggerData_return) == 0x0000F1, "Member 'ArirSlapper_C_LoadTriggerData::CallFunc_loadTriggerData_return' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_LoadTriggerData, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'ArirSlapper_C_LoadTriggerData::CallFunc_Array_Get_Item' has a wrong offset!");

// Function arirSlapper.arirSlapper_C.processKeys
// 0x0018 (0x0018 - 0x0000)
struct ArirSlapper_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirSlapper_C_ProcessKeys) == 0x000008, "Wrong alignment on ArirSlapper_C_ProcessKeys");
static_assert(sizeof(ArirSlapper_C_ProcessKeys) == 0x000018, "Wrong size on ArirSlapper_C_ProcessKeys");
static_assert(offsetof(ArirSlapper_C_ProcessKeys, Return) == 0x000000, "Member 'ArirSlapper_C_ProcessKeys::Return' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ProcessKeys, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'ArirSlapper_C_ProcessKeys::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(ArirSlapper_C_ProcessKeys, CallFunc_getObjectFromKey_Output) == 0x000010, "Member 'ArirSlapper_C_ProcessKeys::CallFunc_getObjectFromKey_Output' has a wrong offset!");

}

