#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirGun_shoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass arirGun_shoot.arirGun_shoot_C
// 0x0098 (0x02B8 - 0x0220)
class AArirGun_shoot_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraShakeSourceComponent*            bSh;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ArirGunFire2;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeSourceComponent*            ESh;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        L;                                                 // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Len;                                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_arirGunBeam;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ArirGunFire1;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialForce;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_1BD1BFC341E2AAD26FB45385B4AD3810;              // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_1BD1BFC341E2AAD26FB45385B4AD3810;     // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dist;                                              // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Gun;                                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_arirGun_shoot(int32 EntryPoint);
	void D(class AActor* DestroyedActor);
	void BndEvt__arirGunFire1_K2Node_ComponentBoundEvent_0_OnAudioFinished__DelegateSignature();
	void ReceiveBeginPlay();
	void A__UpdateFunc();
	void A__FinishedFunc();
	struct FVector F(struct FVector* ReturnValue2);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"arirGun_shoot_C">();
	}
	static class AArirGun_shoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArirGun_shoot_C>();
	}
};
static_assert(alignof(AArirGun_shoot_C) == 0x000008, "Wrong alignment on AArirGun_shoot_C");
static_assert(sizeof(AArirGun_shoot_C) == 0x0002B8, "Wrong size on AArirGun_shoot_C");
static_assert(offsetof(AArirGun_shoot_C, UberGraphFrame) == 0x000220, "Member 'AArirGun_shoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, bSh) == 0x000228, "Member 'AArirGun_shoot_C::bSh' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, ArirGunFire2) == 0x000230, "Member 'AArirGun_shoot_C::ArirGunFire2' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, ESh) == 0x000238, "Member 'AArirGun_shoot_C::ESh' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, L) == 0x000240, "Member 'AArirGun_shoot_C::L' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, Len) == 0x000248, "Member 'AArirGun_shoot_C::Len' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, Eff_arirGunBeam) == 0x000250, "Member 'AArirGun_shoot_C::Eff_arirGunBeam' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, ArirGunFire1) == 0x000258, "Member 'AArirGun_shoot_C::ArirGunFire1' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, PointLight1) == 0x000260, "Member 'AArirGun_shoot_C::PointLight1' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, PointLight) == 0x000268, "Member 'AArirGun_shoot_C::PointLight' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, RadialForce) == 0x000270, "Member 'AArirGun_shoot_C::RadialForce' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, Arrow) == 0x000278, "Member 'AArirGun_shoot_C::Arrow' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, DefaultSceneRoot) == 0x000280, "Member 'AArirGun_shoot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, A_a_1BD1BFC341E2AAD26FB45385B4AD3810) == 0x000288, "Member 'AArirGun_shoot_C::A_a_1BD1BFC341E2AAD26FB45385B4AD3810' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, A__Direction_1BD1BFC341E2AAD26FB45385B4AD3810) == 0x00028C, "Member 'AArirGun_shoot_C::A__Direction_1BD1BFC341E2AAD26FB45385B4AD3810' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, A) == 0x000290, "Member 'AArirGun_shoot_C::A' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, Dist) == 0x000298, "Member 'AArirGun_shoot_C::Dist' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, Gun) == 0x0002A0, "Member 'AArirGun_shoot_C::Gun' has a wrong offset!");
static_assert(offsetof(AArirGun_shoot_C, Objs) == 0x0002A8, "Member 'AArirGun_shoot_C::Objs' has a wrong offset!");

}

