#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AriralNoTaker

#include "Basic.hpp"

#include "Struct_triggerSave_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ariralNoTaker.ariralNoTaker_C.getTriggerData
// 0x02E0 (0x02E0 - 0x0000)
struct AriralNoTaker_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_triggerSave                    CallFunc_getTriggerData_data;                      // 0x00F0(0x00F0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	struct FStruct_triggerSave                    K2Node_SetFieldsInStruct_StructOut;                // 0x01F0(0x00F0)(HasGetValueTypeHash)
};
static_assert(alignof(AriralNoTaker_C_GetTriggerData) == 0x000010, "Wrong alignment on AriralNoTaker_C_GetTriggerData");
static_assert(sizeof(AriralNoTaker_C_GetTriggerData) == 0x0002E0, "Wrong size on AriralNoTaker_C_GetTriggerData");
static_assert(offsetof(AriralNoTaker_C_GetTriggerData, Data) == 0x000000, "Member 'AriralNoTaker_C_GetTriggerData::Data' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_GetTriggerData, CallFunc_getTriggerData_data) == 0x0000F0, "Member 'AriralNoTaker_C_GetTriggerData::CallFunc_getTriggerData_data' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_GetTriggerData, K2Node_MakeArray_Array) == 0x0001E0, "Member 'AriralNoTaker_C_GetTriggerData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_GetTriggerData, K2Node_SetFieldsInStruct_StructOut) == 0x0001F0, "Member 'AriralNoTaker_C_GetTriggerData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function ariralNoTaker.ariralNoTaker_C.loadTriggerData
// 0x0100 (0x0100 - 0x0000)
struct AriralNoTaker_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadTriggerData_return;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item;                           // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AriralNoTaker_C_LoadTriggerData) == 0x000010, "Wrong alignment on AriralNoTaker_C_LoadTriggerData");
static_assert(sizeof(AriralNoTaker_C_LoadTriggerData) == 0x000100, "Wrong size on AriralNoTaker_C_LoadTriggerData");
static_assert(offsetof(AriralNoTaker_C_LoadTriggerData, Data) == 0x000000, "Member 'AriralNoTaker_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_LoadTriggerData, Return) == 0x0000F0, "Member 'AriralNoTaker_C_LoadTriggerData::Return' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_LoadTriggerData, CallFunc_loadTriggerData_return) == 0x0000F1, "Member 'AriralNoTaker_C_LoadTriggerData::CallFunc_loadTriggerData_return' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_LoadTriggerData, CallFunc_Array_Get_Item) == 0x0000F2, "Member 'AriralNoTaker_C_LoadTriggerData::CallFunc_Array_Get_Item' has a wrong offset!");

// Function ariralNoTaker.ariralNoTaker_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct AriralNoTaker_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AriralNoTaker_C_RunTrigger) == 0x000008, "Wrong alignment on AriralNoTaker_C_RunTrigger");
static_assert(sizeof(AriralNoTaker_C_RunTrigger) == 0x000010, "Wrong size on AriralNoTaker_C_RunTrigger");
static_assert(offsetof(AriralNoTaker_C_RunTrigger, Param_Owner) == 0x000000, "Member 'AriralNoTaker_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_RunTrigger, Param_Index) == 0x000008, "Member 'AriralNoTaker_C_RunTrigger::Param_Index' has a wrong offset!");

// Function ariralNoTaker.ariralNoTaker_C.BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function ariralNoTaker.ariralNoTaker_C.BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AriralNoTaker_C_BndEvt__ariralNoTaker_dragAway_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function ariralNoTaker.ariralNoTaker_C.ExecuteUbergraph_ariralNoTaker
// 0x0110 (0x0110 - 0x0000)
struct AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0018(0x0010)(ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AProp_food_C*                           K2Node_DynamicCast_AsProp_Food;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_C*                           K2Node_DynamicCast_AsProp_Food_1;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker) == 0x000008, "Wrong alignment on AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker");
static_assert(sizeof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker) == 0x000110, "Wrong size on AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, EntryPoint) == 0x000000, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_Event_owner) == 0x000008, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_Event_index) == 0x000010, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000018, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000028, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000030, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000038, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000040, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_DynamicCast_AsProp_Food) == 0x0000D0, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_DynamicCast_AsProp_Food' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, CallFunc_Array_Contains_ReturnValue) == 0x0000D9, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000E0, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OtherActor) == 0x0000E8, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OtherComp) == 0x0000F0, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000F8, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_DynamicCast_AsProp_Food_1) == 0x000100, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_DynamicCast_AsProp_Food_1' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker, CallFunc_Array_Contains_ReturnValue_1) == 0x000109, "Member 'AriralNoTaker_C_ExecuteUbergraph_ariralNoTaker::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");

}

