#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirTrasher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function arirTrasher.arirTrasher_C.ExecuteUbergraph_arirTrasher
// 0x0180 (0x0180 - 0x0000)
struct ArirTrasher_C_ExecuteUbergraph_arirTrasher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0038(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Random_OutItem;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_2;           // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArirTrasher_C_ExecuteUbergraph_arirTrasher) == 0x000010, "Wrong alignment on ArirTrasher_C_ExecuteUbergraph_arirTrasher");
static_assert(sizeof(ArirTrasher_C_ExecuteUbergraph_arirTrasher) == 0x000180, "Wrong size on ArirTrasher_C_ExecuteUbergraph_arirTrasher");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, EntryPoint) == 0x000000, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomUnitVector_ReturnValue) == 0x000004, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, Temp_int_Variable) == 0x000010, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, Temp_int_Variable_1) == 0x000024, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000028, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000038, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000048, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004C, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RotateAngleAxis_ReturnValue) == 0x00005C, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Array_Random_OutItem) == 0x000068, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Array_Random_OutIndex) == 0x000070, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomUnitVector_ReturnValue_1) == 0x000074, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000080, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000088, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, K2Node_DynamicCast_AsPrimitive_Component) == 0x000090, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00009C, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B4, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0000C0, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C4, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Subtract_IntInt_ReturnValue) == 0x000110, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, K2Node_CreateDelegate_OutputDelegate) == 0x000114, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_GetPlayerPawn_ReturnValue) == 0x000130, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000144, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Vector_Distance_ReturnValue) == 0x000150, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000154, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Less_FloatFloat_ReturnValue) == 0x000158, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_RandomUnitVector_ReturnValue_2) == 0x00015C, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_RandomUnitVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArirTrasher_C_ExecuteUbergraph_arirTrasher, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000168, "Member 'ArirTrasher_C_ExecuteUbergraph_arirTrasher::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");

}

