#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AriralThrowStuff

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_signalDataDynamic_structs.hpp"


namespace SDK::Params
{

// Function ariralThrowStuff.ariralThrowStuff_C.ExecuteUbergraph_ariralThrowStuff
// 0x0410 (0x0410 - 0x0000)
struct AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x00B8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BytesToBase64Url_ReturnValue;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_2;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FStruct_signalDataDynamic              K2Node_MakeStruct_struct_signalDataDynamic;        // 0x0158(0x0070)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_signalDataDynamic              K2Node_MakeStruct_struct_signalDataDynamic_1;      // 0x0210(0x0070)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	struct FStruct_signalDataDynamic              K2Node_Select_Default_1;                           // 0x02B0(0x0070)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_drive_explosive_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_2;           // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_3;           // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x03A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_drive_C*                          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_1;        // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff) == 0x000010, "Wrong alignment on AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff");
static_assert(sizeof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff) == 0x000410, "Wrong size on AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, EntryPoint) == 0x000000, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::EntryPoint' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_GetActorForwardVector_ReturnValue) == 0x000004, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_int_Variable) == 0x00001C, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_string_Variable) == 0x000020, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_string_Variable_1) == 0x000030, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_string_Variable_2) == 0x000040, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_string_Variable_3) == 0x000050, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_bool_Variable) == 0x000060, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_int_Variable_1) == 0x000064, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_SwitchInteger_CmpSuccess) == 0x000070, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomUnitVector_ReturnValue) == 0x000078, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000084, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000090, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00009C, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000A8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_GenerateRandomBytes_ByteArray) == 0x0000B8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_BytesToBase64Url_ReturnValue) == 0x0000C8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_BytesToBase64Url_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomInteger_ReturnValue) == 0x0000D8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomInteger_ReturnValue_1) == 0x0000DC, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Conv_IntToString_ReturnValue) == 0x0000E0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomInteger_ReturnValue_2) == 0x0000F0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomInteger_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0000F4, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_Select_Default) == 0x0000F8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000108, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000120, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000130, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000140, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, Temp_int_Variable_2) == 0x000144, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_SelectString_ReturnValue) == 0x000148, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_MakeStruct_struct_signalDataDynamic) == 0x000158, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_MakeStruct_struct_signalDataDynamic' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001C8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0001CC, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001D0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001D4, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomUnitVector_ReturnValue_1) == 0x0001E0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001EC, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomBoolWithWeight_ReturnValue_1) == 0x0001F0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomBoolWithWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0001F4, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000200, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_MakeStruct_struct_signalDataDynamic_1) == 0x000210, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_MakeStruct_struct_signalDataDynamic_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_MakeTransform_ReturnValue) == 0x000280, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_Select_Default_1) == 0x0002B0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000320, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_FinishSpawningActor_ReturnValue) == 0x000328, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000330, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000340, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomUnitVector_ReturnValue_2) == 0x000348, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomUnitVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_DynamicCast_AsPrimitive_Component) == 0x000358, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000364, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000368, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_RandomUnitVector_ReturnValue_3) == 0x000374, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_RandomUnitVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000380, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x00038C, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_MakeTransform_ReturnValue_1) == 0x0003A0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0003D0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003E0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0003E8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0003F0, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_DynamicCast_AsPrimitive_Component_1) == 0x0003F8, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_DynamicCast_AsPrimitive_Component_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff, K2Node_DynamicCast_bSuccess_1) == 0x000400, "Member 'AriralThrowStuff_C_ExecuteUbergraph_ariralThrowStuff::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function ariralThrowStuff.ariralThrowStuff_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AriralThrowStuff_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AriralThrowStuff_C_ReceiveTick) == 0x000004, "Wrong alignment on AriralThrowStuff_C_ReceiveTick");
static_assert(sizeof(AriralThrowStuff_C_ReceiveTick) == 0x000004, "Wrong size on AriralThrowStuff_C_ReceiveTick");
static_assert(offsetof(AriralThrowStuff_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AriralThrowStuff_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ariralThrowStuff.ariralThrowStuff_C.throwFoods
// 0x0130 (0x0130 - 0x0000)
struct AriralThrowStuff_C_ThrowFoods final
{
public:
	TArray<class UClass*>                         Cs;                                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 Ws;                                                // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_weightedRandomV2_index;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x00F8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AriralThrowStuff_C_ThrowFoods) == 0x000010, "Wrong alignment on AriralThrowStuff_C_ThrowFoods");
static_assert(sizeof(AriralThrowStuff_C_ThrowFoods) == 0x000130, "Wrong size on AriralThrowStuff_C_ThrowFoods");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, Cs) == 0x000000, "Member 'AriralThrowStuff_C_ThrowFoods::Cs' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, Ws) == 0x000010, "Member 'AriralThrowStuff_C_ThrowFoods::Ws' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, Temp_int_Variable) == 0x000020, "Member 'AriralThrowStuff_C_ThrowFoods::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000028, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_RandomUnitVector_ReturnValue) == 0x000034, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000058, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_RandomUnitVector_ReturnValue_1) == 0x000064, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00007C, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000094, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_weightedRandomV2_index) == 0x0000D0, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_weightedRandomV2_index' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Map_Keys_Keys) == 0x0000D8, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_Map_Values_Values) == 0x0000F8, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000110, "Member 'AriralThrowStuff_C_ThrowFoods::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, K2Node_DynamicCast_AsPrimitive_Component) == 0x000118, "Member 'AriralThrowStuff_C_ThrowFoods::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'AriralThrowStuff_C_ThrowFoods::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ariralThrowStuff.ariralThrowStuff_C.throwType
// 0x0004 (0x0004 - 0x0000)
struct AriralThrowStuff_C_ThrowType final
{
public:
	int32                                         Param_Type;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AriralThrowStuff_C_ThrowType) == 0x000004, "Wrong alignment on AriralThrowStuff_C_ThrowType");
static_assert(sizeof(AriralThrowStuff_C_ThrowType) == 0x000004, "Wrong size on AriralThrowStuff_C_ThrowType");
static_assert(offsetof(AriralThrowStuff_C_ThrowType, Param_Type) == 0x000000, "Member 'AriralThrowStuff_C_ThrowType::Param_Type' has a wrong offset!");

// Function ariralThrowStuff.ariralThrowStuff_C.throwFoods_good
// 0x0130 (0x0130 - 0x0000)
struct AriralThrowStuff_C_ThrowFoods_good final
{
public:
	TArray<class UClass*>                         Cs;                                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 Ws;                                                // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_weightedRandomV2_index;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x00F8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AriralThrowStuff_C_ThrowFoods_good) == 0x000010, "Wrong alignment on AriralThrowStuff_C_ThrowFoods_good");
static_assert(sizeof(AriralThrowStuff_C_ThrowFoods_good) == 0x000130, "Wrong size on AriralThrowStuff_C_ThrowFoods_good");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods_good, Cs) == 0x000000, "Member 'AriralThrowStuff_C_ThrowFoods_good::Cs' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods_good, Ws) == 0x000010, "Member 'AriralThrowStuff_C_ThrowFoods_good::Ws' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods_good, Temp_int_Variable) == 0x000020, "Member 'AriralThrowStuff_C_ThrowFoods_good::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AriralThrowStuff_C_ThrowFoods_good, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'AriralThrowStuff_C_ThrowFoods_good::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
