#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirShip_tower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function arirShip_tower.arirShip_tower_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct ArirShip_tower_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShip_tower_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on ArirShip_tower_C_IgnoreSave_trigger");
static_assert(sizeof(ArirShip_tower_C_IgnoreSave_trigger) == 0x000001, "Wrong size on ArirShip_tower_C_IgnoreSave_trigger");
static_assert(offsetof(ArirShip_tower_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'ArirShip_tower_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function arirShip_tower.arirShip_tower_C.appear
// 0x0001 (0x0001 - 0x0000)
struct ArirShip_tower_C_Appear final
{
public:
	bool                                          Dir;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShip_tower_C_Appear) == 0x000001, "Wrong alignment on ArirShip_tower_C_Appear");
static_assert(sizeof(ArirShip_tower_C_Appear) == 0x000001, "Wrong size on ArirShip_tower_C_Appear");
static_assert(offsetof(ArirShip_tower_C_Appear, Dir) == 0x000000, "Member 'ArirShip_tower_C_Appear::Dir' has a wrong offset!");

// Function arirShip_tower.arirShip_tower_C.ExecuteUbergraph_arirShip_tower
// 0x00A0 (0x00A0 - 0x0000)
struct ArirShip_tower_C_ExecuteUbergraph_arirShip_tower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C5[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C6[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C7[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AUfoDreamer_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C8[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_dir;                            // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C9[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower) == 0x000010, "Wrong alignment on ArirShip_tower_C_ExecuteUbergraph_arirShip_tower");
static_assert(sizeof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower) == 0x0000A0, "Wrong size on ArirShip_tower_C_ExecuteUbergraph_arirShip_tower");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, EntryPoint) == 0x000000, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000040, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_Lerp_ReturnValue_1) == 0x000050, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000060, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000070, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_GetPlayerPawn_ReturnValue) == 0x000078, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000080, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, K2Node_CustomEvent_dir) == 0x000082, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::K2Node_CustomEvent_dir' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000088, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000090, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_IsOverlappingActor_ReturnValue) == 0x000091, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_IsOverlappingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000092, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_BooleanAND_ReturnValue) == 0x000093, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000094, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_BooleanAND_ReturnValue_1) == 0x000095, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000096, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_BooleanOR_ReturnValue) == 0x000097, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_BooleanAND_ReturnValue_2) == 0x000098, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArirShip_tower_C_ExecuteUbergraph_arirShip_tower, CallFunc_BooleanAND_ReturnValue_3) == 0x000099, "Member 'ArirShip_tower_C_ExecuteUbergraph_arirShip_tower::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

}

