#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArirBusterSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass arirBusterSpawner.arirBusterSpawner_C
// 0x0048 (0x0268 - 0x0220)
class AArirBusterSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor6;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor5;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor4;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor3;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor2;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor1;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_arirBusterSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"arirBusterSpawner_C">();
	}
	static class AArirBusterSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArirBusterSpawner_C>();
	}
};
static_assert(alignof(AArirBusterSpawner_C) == 0x000008, "Wrong alignment on AArirBusterSpawner_C");
static_assert(sizeof(AArirBusterSpawner_C) == 0x000268, "Wrong size on AArirBusterSpawner_C");
static_assert(offsetof(AArirBusterSpawner_C, UberGraphFrame) == 0x000220, "Member 'AArirBusterSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor6) == 0x000228, "Member 'AArirBusterSpawner_C::ChildActor6' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor5) == 0x000230, "Member 'AArirBusterSpawner_C::ChildActor5' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor4) == 0x000238, "Member 'AArirBusterSpawner_C::ChildActor4' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor3) == 0x000240, "Member 'AArirBusterSpawner_C::ChildActor3' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor2) == 0x000248, "Member 'AArirBusterSpawner_C::ChildActor2' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor1) == 0x000250, "Member 'AArirBusterSpawner_C::ChildActor1' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, ChildActor) == 0x000258, "Member 'AArirBusterSpawner_C::ChildActor' has a wrong offset!");
static_assert(offsetof(AArirBusterSpawner_C, DefaultSceneRoot) == 0x000260, "Member 'AArirBusterSpawner_C::DefaultSceneRoot' has a wrong offset!");

}

