#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: badSun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function badSun.badSun_C.ExecuteUbergraph_badSun
// 0x0098 (0x0098 - 0x0000)
struct badSun_C_ExecuteUbergraph_badSun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_badSun_C*                          CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeVirtualTextureVolume*           CallFunc_GetActorOfClass_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       K2Node_MakeStruct_BoxSphereBounds;                 // 0x0074(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(badSun_C_ExecuteUbergraph_badSun) == 0x000008, "Wrong alignment on badSun_C_ExecuteUbergraph_badSun");
static_assert(sizeof(badSun_C_ExecuteUbergraph_badSun) == 0x000098, "Wrong size on badSun_C_ExecuteUbergraph_badSun");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, EntryPoint) == 0x000000, "Member 'badSun_C_ExecuteUbergraph_badSun::EntryPoint' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_Create_ReturnValue) == 0x000010, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'badSun_C_ExecuteUbergraph_badSun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000038, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000041, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000048, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000050, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_GetActorOfClass_ReturnValue) == 0x000058, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000060, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, K2Node_MakeStruct_BoxSphereBounds) == 0x000074, "Member 'badSun_C_ExecuteUbergraph_badSun::K2Node_MakeStruct_BoxSphereBounds' has a wrong offset!");
static_assert(offsetof(badSun_C_ExecuteUbergraph_badSun, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'badSun_C_ExecuteUbergraph_badSun::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

