#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: badSun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass badSun.badSun_C
// 0x0038 (0x0280 - 0x0248)
class AbadSun_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_badSun_C;                           // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_ADF069CE4A49B896D1064B954824CC67;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_ADF069CE4A49B896D1064B954824CC67;     // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EDF[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_badSun_C*                          Widget;                                            // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EndSiren;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EE0[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Destroy;                                           // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Super;                                             // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_badSun(int32 EntryPoint);
	void Siren();
	void Remove();
	void ReceiveBeginPlay();
	void A__UpdateFunc();
	void A__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"badSun_C">();
	}
	static class AbadSun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AbadSun_C>();
	}
};
static_assert(alignof(AbadSun_C) == 0x000008, "Wrong alignment on AbadSun_C");
static_assert(sizeof(AbadSun_C) == 0x000280, "Wrong size on AbadSun_C");
static_assert(offsetof(AbadSun_C, UberGraphFrame_badSun_C) == 0x000248, "Member 'AbadSun_C::UberGraphFrame_badSun_C' has a wrong offset!");
static_assert(offsetof(AbadSun_C, Audio) == 0x000250, "Member 'AbadSun_C::Audio' has a wrong offset!");
static_assert(offsetof(AbadSun_C, A_a_ADF069CE4A49B896D1064B954824CC67) == 0x000258, "Member 'AbadSun_C::A_a_ADF069CE4A49B896D1064B954824CC67' has a wrong offset!");
static_assert(offsetof(AbadSun_C, A__Direction_ADF069CE4A49B896D1064B954824CC67) == 0x00025C, "Member 'AbadSun_C::A__Direction_ADF069CE4A49B896D1064B954824CC67' has a wrong offset!");
static_assert(offsetof(AbadSun_C, A) == 0x000260, "Member 'AbadSun_C::A' has a wrong offset!");
static_assert(offsetof(AbadSun_C, Widget) == 0x000268, "Member 'AbadSun_C::Widget' has a wrong offset!");
static_assert(offsetof(AbadSun_C, EndSiren) == 0x000270, "Member 'AbadSun_C::EndSiren' has a wrong offset!");
static_assert(offsetof(AbadSun_C, Destroy) == 0x000274, "Member 'AbadSun_C::Destroy' has a wrong offset!");
static_assert(offsetof(AbadSun_C, Super) == 0x000278, "Member 'AbadSun_C::Super' has a wrong offset!");

}

