#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: baocoin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function baocoin.baocoin_C.ExecuteUbergraph_baocoin
// 0x0868 (0x0868 - 0x0000)
struct baocoin_C_ExecuteUbergraph_baocoin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x022C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0310(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0340(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0408(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x04B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x3];                                      // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x0544(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0560(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0610(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x06A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x06E0(0x0010)(ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0700(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0708(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0714(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x07A0(0x0018)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x07B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BA[0x2];                                      // 0x07BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x07C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x07D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x07DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x07E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0808(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0824(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0830(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x083C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x084C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0858(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_ExecuteUbergraph_baocoin) == 0x000008, "Wrong alignment on baocoin_C_ExecuteUbergraph_baocoin");
static_assert(sizeof(baocoin_C_ExecuteUbergraph_baocoin) == 0x000868, "Wrong size on baocoin_C_ExecuteUbergraph_baocoin");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, EntryPoint) == 0x000000, "Member 'baocoin_C_ExecuteUbergraph_baocoin::EntryPoint' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_VSize_ReturnValue) == 0x000004, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage_6) == 0x000008, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_7) == 0x00000C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_actor_1) == 0x000098, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_impact_1) == 0x0000A0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000AC, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_water_3) == 0x0000B0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_water_2) == 0x0000B8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_water_1) == 0x0000C0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_water) == 0x0000C8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_activate) == 0x0000D0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_static) == 0x0000D1, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_frozen) == 0x0000D2, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_active) == 0x0000D3, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_actor) == 0x0000D8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage_5) == 0x0000E0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_6) == 0x0000E4, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_impact) == 0x00016C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_skipSetting) == 0x000178, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_key_1) == 0x000180, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_18) == 0x000190, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_5) == 0x000198, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage_4) == 0x000220, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_fuel) == 0x000224, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage_3) == 0x000228, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hot) == 0x00022C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_17) == 0x0002B8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_16) == 0x0002C0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage_2) == 0x0002C8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_location_1) == 0x0002CC, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_15) == 0x0002D8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_14) == 0x0002E0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_13) == 0x0002E8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_wheelDelta) == 0x0002F0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_12) == 0x0002F8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_mouse) == 0x000300, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_11) == 0x000308, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_key) == 0x000310, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_pressed) == 0x000328, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_temperature_1) == 0x00032C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_temperature) == 0x000330, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_speed) == 0x000334, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_10) == 0x000338, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_4) == 0x000340, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_name_1) == 0x0003C8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_volume) == 0x0003D8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_9) == 0x0003E0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_location) == 0x0003E8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage_1) == 0x0003F4, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_clean_1) == 0x0003F8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_8) == 0x000400, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_3) == 0x000408, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hook_1) == 0x000490, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_clean) == 0x000498, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_7) == 0x0004A0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hook) == 0x0004A8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_6) == 0x0004B0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_2) == 0x0004B8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_kick) == 0x000540, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_name) == 0x000544, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_5) == 0x000550, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_4) == 0x000558, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit_1) == 0x000560, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_damage) == 0x0005E8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_3) == 0x0005F0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_2) == 0x0005F8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player_1) == 0x000600, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_player) == 0x000608, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_hit) == 0x000610, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_action) == 0x000698, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_MakeStruct_FormatArgumentData) == 0x0006A0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_MakeArray_Array) == 0x0006E0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_ComponentBoundEvent_HitComponent) == 0x0006F0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_ComponentBoundEvent_OtherActor) == 0x0006F8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_ComponentBoundEvent_OtherComp) == 0x000700, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000708, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_ComponentBoundEvent_Hit) == 0x000714, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_Format_ReturnValue) == 0x0007A0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_bBlockingHit) == 0x0007B8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_bInitialOverlap) == 0x0007B9, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_Time) == 0x0007BC, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_Distance) == 0x0007C0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_Location) == 0x0007C4, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_ImpactPoint) == 0x0007D0, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_Normal) == 0x0007DC, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_ImpactNormal) == 0x0007E8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_PhysMat) == 0x0007F8, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_HitActor) == 0x000800, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_HitComponent) == 0x000808, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_HitBoneName) == 0x000810, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_HitItem) == 0x000818, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_ElementIndex) == 0x00081C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_FaceIndex) == 0x000820, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_TraceStart) == 0x000824, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_BreakHitResult_TraceEnd) == 0x000830, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_GetVelocity_ReturnValue) == 0x00083C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, K2Node_Event_DeltaSeconds) == 0x000848, "Member 'baocoin_C_ExecuteUbergraph_baocoin::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x00084C, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(baocoin_C_ExecuteUbergraph_baocoin, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000858, "Member 'baocoin_C_ExecuteUbergraph_baocoin::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");

// Function baocoin.baocoin_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct baocoin_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_ReceiveTick) == 0x000004, "Wrong alignment on baocoin_C_ReceiveTick");
static_assert(sizeof(baocoin_C_ReceiveTick) == 0x000004, "Wrong size on baocoin_C_ReceiveTick");
static_assert(offsetof(baocoin_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'baocoin_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function baocoin.baocoin_C.BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'baocoin_C_BndEvt__baocoin_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function baocoin.baocoin_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct baocoin_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_ActionOptionIndex) == 0x000008, "Wrong alignment on baocoin_C_ActionOptionIndex");
static_assert(sizeof(baocoin_C_ActionOptionIndex) == 0x000098, "Wrong size on baocoin_C_ActionOptionIndex");
static_assert(offsetof(baocoin_C_ActionOptionIndex, Player) == 0x000000, "Member 'baocoin_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(baocoin_C_ActionOptionIndex, Hit) == 0x000008, "Member 'baocoin_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(baocoin_C_ActionOptionIndex, Action) == 0x000090, "Member 'baocoin_C_ActionOptionIndex::Action' has a wrong offset!");

// Function baocoin.baocoin_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_PlayerR) == 0x000008, "Wrong alignment on baocoin_C_PlayerR");
static_assert(sizeof(baocoin_C_PlayerR) == 0x000008, "Wrong size on baocoin_C_PlayerR");
static_assert(offsetof(baocoin_C_PlayerR, Player) == 0x000000, "Member 'baocoin_C_PlayerR::Player' has a wrong offset!");

// Function baocoin.baocoin_C.playerHold
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_PlayerHold final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_PlayerHold) == 0x000008, "Wrong alignment on baocoin_C_PlayerHold");
static_assert(sizeof(baocoin_C_PlayerHold) == 0x000008, "Wrong size on baocoin_C_PlayerHold");
static_assert(offsetof(baocoin_C_PlayerHold, Player) == 0x000000, "Member 'baocoin_C_PlayerHold::Player' has a wrong offset!");

// Function baocoin.baocoin_C.playerUnequip
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_PlayerUnequip final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_PlayerUnequip) == 0x000008, "Wrong alignment on baocoin_C_PlayerUnequip");
static_assert(sizeof(baocoin_C_PlayerUnequip) == 0x000008, "Wrong size on baocoin_C_PlayerUnequip");
static_assert(offsetof(baocoin_C_PlayerUnequip, Player) == 0x000000, "Member 'baocoin_C_PlayerUnequip::Player' has a wrong offset!");

// Function baocoin.baocoin_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct baocoin_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_DamageByPlayer) == 0x000008, "Wrong alignment on baocoin_C_DamageByPlayer");
static_assert(sizeof(baocoin_C_DamageByPlayer) == 0x000098, "Wrong size on baocoin_C_DamageByPlayer");
static_assert(offsetof(baocoin_C_DamageByPlayer, Player) == 0x000000, "Member 'baocoin_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(baocoin_C_DamageByPlayer, Hit) == 0x000008, "Member 'baocoin_C_DamageByPlayer::Hit' has a wrong offset!");
static_assert(offsetof(baocoin_C_DamageByPlayer, Damage) == 0x000090, "Member 'baocoin_C_DamageByPlayer::Damage' has a wrong offset!");

// Function baocoin.baocoin_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_Thrown) == 0x000008, "Wrong alignment on baocoin_C_Thrown");
static_assert(sizeof(baocoin_C_Thrown) == 0x000008, "Wrong size on baocoin_C_Thrown");
static_assert(offsetof(baocoin_C_Thrown, Player) == 0x000000, "Member 'baocoin_C_Thrown::Player' has a wrong offset!");

// Function baocoin.baocoin_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_SendName) == 0x000004, "Wrong alignment on baocoin_C_SendName");
static_assert(sizeof(baocoin_C_SendName) == 0x000008, "Wrong size on baocoin_C_SendName");
static_assert(offsetof(baocoin_C_SendName, Param_Name) == 0x000000, "Member 'baocoin_C_SendName::Param_Name' has a wrong offset!");

// Function baocoin.baocoin_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct baocoin_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(baocoin_C_Kicked) == 0x000001, "Wrong alignment on baocoin_C_Kicked");
static_assert(sizeof(baocoin_C_Kicked) == 0x000001, "Wrong size on baocoin_C_Kicked");
static_assert(offsetof(baocoin_C_Kicked, Kick) == 0x000000, "Member 'baocoin_C_Kicked::Kick' has a wrong offset!");

// Function baocoin.baocoin_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct baocoin_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(baocoin_C_Player_use) == 0x000008, "Wrong alignment on baocoin_C_Player_use");
static_assert(sizeof(baocoin_C_Player_use) == 0x000090, "Wrong size on baocoin_C_Player_use");
static_assert(offsetof(baocoin_C_Player_use, Player) == 0x000000, "Member 'baocoin_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(baocoin_C_Player_use, Hit) == 0x000008, "Member 'baocoin_C_Player_use::Hit' has a wrong offset!");

// Function baocoin.baocoin_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_HookTension) == 0x000008, "Wrong alignment on baocoin_C_HookTension");
static_assert(sizeof(baocoin_C_HookTension) == 0x000008, "Wrong size on baocoin_C_HookTension");
static_assert(offsetof(baocoin_C_HookTension, Hook) == 0x000000, "Member 'baocoin_C_HookTension::Hook' has a wrong offset!");

// Function baocoin.baocoin_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct baocoin_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_CleanSponge) == 0x000008, "Wrong alignment on baocoin_C_CleanSponge");
static_assert(sizeof(baocoin_C_CleanSponge) == 0x000010, "Wrong size on baocoin_C_CleanSponge");
static_assert(offsetof(baocoin_C_CleanSponge, Clean) == 0x000000, "Member 'baocoin_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(baocoin_C_CleanSponge, Player) == 0x000008, "Member 'baocoin_C_CleanSponge::Player' has a wrong offset!");

// Function baocoin.baocoin_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_Hooked) == 0x000008, "Wrong alignment on baocoin_C_Hooked");
static_assert(sizeof(baocoin_C_Hooked) == 0x000008, "Wrong size on baocoin_C_Hooked");
static_assert(offsetof(baocoin_C_Hooked, Hook) == 0x000000, "Member 'baocoin_C_Hooked::Hook' has a wrong offset!");

// Function baocoin.baocoin_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct baocoin_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(baocoin_C_PlayerUsedOn) == 0x000008, "Wrong alignment on baocoin_C_PlayerUsedOn");
static_assert(sizeof(baocoin_C_PlayerUsedOn) == 0x000090, "Wrong size on baocoin_C_PlayerUsedOn");
static_assert(offsetof(baocoin_C_PlayerUsedOn, Player) == 0x000000, "Member 'baocoin_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(baocoin_C_PlayerUsedOn, Hit) == 0x000008, "Member 'baocoin_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function baocoin.baocoin_C.slice
// 0x0001 (0x0001 - 0x0000)
struct baocoin_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(baocoin_C_Slice) == 0x000001, "Wrong alignment on baocoin_C_Slice");
static_assert(sizeof(baocoin_C_Slice) == 0x000001, "Wrong size on baocoin_C_Slice");
static_assert(offsetof(baocoin_C_Slice, Clean) == 0x000000, "Member 'baocoin_C_Slice::Clean' has a wrong offset!");

// Function baocoin.baocoin_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct baocoin_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_ReachedByExplosion) == 0x000004, "Wrong alignment on baocoin_C_ReachedByExplosion");
static_assert(sizeof(baocoin_C_ReachedByExplosion) == 0x000010, "Wrong size on baocoin_C_ReachedByExplosion");
static_assert(offsetof(baocoin_C_ReachedByExplosion, Location) == 0x000000, "Member 'baocoin_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(baocoin_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'baocoin_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function baocoin.baocoin_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct baocoin_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_PlayerLookAway) == 0x000008, "Wrong alignment on baocoin_C_PlayerLookAway");
static_assert(sizeof(baocoin_C_PlayerLookAway) == 0x000008, "Wrong size on baocoin_C_PlayerLookAway");
static_assert(offsetof(baocoin_C_PlayerLookAway, Player) == 0x000000, "Member 'baocoin_C_PlayerLookAway::Player' has a wrong offset!");

// Function baocoin.baocoin_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct baocoin_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_Stepped) == 0x000004, "Wrong alignment on baocoin_C_Stepped");
static_assert(sizeof(baocoin_C_Stepped) == 0x000004, "Wrong size on baocoin_C_Stepped");
static_assert(offsetof(baocoin_C_Stepped, Volume) == 0x000000, "Member 'baocoin_C_Stepped::Volume' has a wrong offset!");

// Function baocoin.baocoin_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct baocoin_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(baocoin_C_ActionName) == 0x000008, "Wrong alignment on baocoin_C_ActionName");
