#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: basementDrain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass basementDrain.basementDrain_C
// 0x0030 (0x0278 - 0x0248)
class AbasementDrain_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_basementDrain_C;                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_basementFlooder_C*         WaterVolume;                                       // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AburstWaterPipe_C*>              Pipes;                                             // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class APowerControl_C*                        Powerblock;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetData(struct FStruct_save* Data);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GatherDataFromKey(bool* Gather);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void CheckWater();
	void TryBurstPipe();
	void CheckBreaker();
	void ExecuteUbergraph_basementDrain(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"basementDrain_C">();
	}
	static class AbasementDrain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AbasementDrain_C>();
	}
};
static_assert(alignof(AbasementDrain_C) == 0x000008, "Wrong alignment on AbasementDrain_C");
static_assert(sizeof(AbasementDrain_C) == 0x000278, "Wrong size on AbasementDrain_C");
static_assert(offsetof(AbasementDrain_C, UberGraphFrame_basementDrain_C) == 0x000248, "Member 'AbasementDrain_C::UberGraphFrame_basementDrain_C' has a wrong offset!");
static_assert(offsetof(AbasementDrain_C, Plane) == 0x000250, "Member 'AbasementDrain_C::Plane' has a wrong offset!");
static_assert(offsetof(AbasementDrain_C, WaterVolume) == 0x000258, "Member 'AbasementDrain_C::WaterVolume' has a wrong offset!");
static_assert(offsetof(AbasementDrain_C, Pipes) == 0x000260, "Member 'AbasementDrain_C::Pipes' has a wrong offset!");
static_assert(offsetof(AbasementDrain_C, Powerblock) == 0x000270, "Member 'AbasementDrain_C::Powerblock' has a wrong offset!");

}

