#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: baseCleaner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function baseCleaner.baseCleaner_C.ExecuteUbergraph_baseCleaner
// 0x0078 (0x0078 - 0x0000)
struct baseCleaner_C_ExecuteUbergraph_baseCleaner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2075[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2076[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2077[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(baseCleaner_C_ExecuteUbergraph_baseCleaner) == 0x000008, "Wrong alignment on baseCleaner_C_ExecuteUbergraph_baseCleaner");
static_assert(sizeof(baseCleaner_C_ExecuteUbergraph_baseCleaner) == 0x000078, "Wrong size on baseCleaner_C_ExecuteUbergraph_baseCleaner");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, EntryPoint) == 0x000000, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::EntryPoint' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, K2Node_MakeArray_Array) == 0x000008, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, Temp_int_Array_Index_Variable) == 0x000018, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, Temp_object_Variable) == 0x000030, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_BoxOverlapActors_OutActors) == 0x000040, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_BoxOverlapActors_ReturnValue) == 0x000050, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_Array_Get_Item) == 0x000058, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_GetObjectClass_ReturnValue) == 0x000068, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000070, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000071, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000072, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_BooleanOR_ReturnValue) == 0x000073, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseCleaner_C_ExecuteUbergraph_baseCleaner, CallFunc_BooleanOR_ReturnValue_1) == 0x000074, "Member 'baseCleaner_C_ExecuteUbergraph_baseCleaner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

}

