#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: baseLol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function baseLol.baseLol_C.BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'baseLol_C_BndEvt__baseLol_Sphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function baseLol.baseLol_C.ExecuteUbergraph_baseLol
// 0x0270 (0x0270 - 0x0000)
struct baseLol_C_ExecuteUbergraph_baseLol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0028(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0xB];                                      // 0x0225(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(baseLol_C_ExecuteUbergraph_baseLol) == 0x000010, "Wrong alignment on baseLol_C_ExecuteUbergraph_baseLol");
static_assert(sizeof(baseLol_C_ExecuteUbergraph_baseLol) == 0x000270, "Wrong size on baseLol_C_ExecuteUbergraph_baseLol");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, EntryPoint) == 0x000000, "Member 'baseLol_C_ExecuteUbergraph_baseLol::EntryPoint' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, Temp_object_Variable) == 0x000010, "Member 'baseLol_C_ExecuteUbergraph_baseLol::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_obj_static_obj) == 0x000028, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000060, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0000E8, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000F0, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F8, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F9, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_Time) == 0x0000FC, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_Distance) == 0x000100, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_Location) == 0x000104, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_ImpactPoint) == 0x000110, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_Normal) == 0x00011C, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_ImpactNormal) == 0x000128, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_PhysMat) == 0x000138, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_HitActor) == 0x000140, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_HitComponent) == 0x000148, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_HitBoneName) == 0x000150, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_HitItem) == 0x000158, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_ElementIndex) == 0x00015C, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_FaceIndex) == 0x000160, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_TraceStart) == 0x000164, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakHitResult_TraceEnd) == 0x000170, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000180, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000188, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000198, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A0, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001AC, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakTransform_Location) == 0x0001B0, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakTransform_Rotation) == 0x0001BC, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BreakTransform_Scale) == 0x0001C8, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001D8, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_ComponentBoundEvent_OtherActor) == 0x0001E0, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_ComponentBoundEvent_OtherComp) == 0x0001E8, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001F0, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0001F4, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_DynamicCast_AsMain_Player) == 0x000200, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, K2Node_DynamicCast_bSuccess_1) == 0x000208, "Member 'baseLol_C_ExecuteUbergraph_baseLol::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00020C, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_Add_VectorVector_ReturnValue) == 0x000218, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000224, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_MakeTransform_ReturnValue) == 0x000230, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000260, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000268, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BooleanOR_ReturnValue) == 0x000269, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BooleanOR_ReturnValue_1) == 0x00026A, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BooleanOR_ReturnValue_2) == 0x00026B, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BooleanOR_ReturnValue_3) == 0x00026C, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(baseLol_C_ExecuteUbergraph_baseLol, CallFunc_BooleanOR_ReturnValue_4) == 0x00026D, "Member 'baseLol_C_ExecuteUbergraph_baseLol::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");

}

