#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: beacon_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass beacon_Skeleton_AnimBlueprint.beacon_Skeleton_AnimBlueprint_C
// 0x0040 (0x0300 - 0x02C0)
class Ubeacon_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	float                                         Closed;                                            // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_beacon_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"beacon_Skeleton_AnimBlueprint_C">();
	}
	static class Ubeacon_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubeacon_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(Ubeacon_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on Ubeacon_Skeleton_AnimBlueprint_C");
static_assert(sizeof(Ubeacon_Skeleton_AnimBlueprint_C) == 0x000300, "Wrong size on Ubeacon_Skeleton_AnimBlueprint_C");
static_assert(offsetof(Ubeacon_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'Ubeacon_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Ubeacon_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'Ubeacon_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Ubeacon_Skeleton_AnimBlueprint_C, Closed) == 0x0002F8, "Member 'Ubeacon_Skeleton_AnimBlueprint_C::Closed' has a wrong offset!");

}

