#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bed_m

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function bed_m.bed_m_C.getActionOptions
// 0x0058 (0x0058 - 0x0000)
struct bed_m_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(bed_m_C_GetActionOptions) == 0x000008, "Wrong alignment on bed_m_C_GetActionOptions");
static_assert(sizeof(bed_m_C_GetActionOptions) == 0x000058, "Wrong size on bed_m_C_GetActionOptions");
static_assert(offsetof(bed_m_C_GetActionOptions, Player) == 0x000000, "Member 'bed_m_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(bed_m_C_GetActionOptions, Component) == 0x000008, "Member 'bed_m_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(bed_m_C_GetActionOptions, Actor) == 0x000010, "Member 'bed_m_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(bed_m_C_GetActionOptions, Options) == 0x000018, "Member 'bed_m_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(bed_m_C_GetActionOptions, Options_enum) == 0x000028, "Member 'bed_m_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(bed_m_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'bed_m_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(bed_m_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000048, "Member 'bed_m_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

