#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: begoExplosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function begoExplosion.begoExplosion_C.ExecuteUbergraph_begoExplosion
// 0x0130 (0x0130 - 0x0000)
struct begoExplosion_C_ExecuteUbergraph_begoExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFB[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFC[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFD[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFE[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bego_spikeball_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(begoExplosion_C_ExecuteUbergraph_begoExplosion) == 0x000010, "Wrong alignment on begoExplosion_C_ExecuteUbergraph_begoExplosion");
static_assert(sizeof(begoExplosion_C_ExecuteUbergraph_begoExplosion) == 0x000130, "Wrong size on begoExplosion_C_ExecuteUbergraph_begoExplosion");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, EntryPoint) == 0x000000, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, Temp_int_Variable) == 0x000008, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, Temp_int_Variable_1) == 0x000018, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomRotator_ReturnValue) == 0x000030, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomUnitVector_ReturnValue) == 0x00003C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomFloatInRange_ReturnValue) == 0x000048, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000058, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomUnitVector_ReturnValue_1) == 0x00005C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000074, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RotateAngleAxis_ReturnValue) == 0x000080, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00008C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00009C, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_MakeVector_ReturnValue_1) == 0x0000AC, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x0000B8, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, Temp_bool_IsClosed_Variable) == 0x0000C4, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0000C8, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0000D4, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000110, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000118, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(begoExplosion_C_ExecuteUbergraph_begoExplosion, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000120, "Member 'begoExplosion_C_ExecuteUbergraph_begoExplosion::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");

}

