#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: birber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass birber.birber_C
// 0x0020 (0x0240 - 0x0220)
class Abirber_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NoBirb;                                            // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Silencer;                                          // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Deactivate;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_birber(int32 EntryPoint);
	void ReceiveBeginPlay();
	void PlayBirb(class USoundBase* Sound, bool IgnoreDay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"birber_C">();
	}
	static class Abirber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abirber_C>();
	}
};
static_assert(alignof(Abirber_C) == 0x000008, "Wrong alignment on Abirber_C");
static_assert(sizeof(Abirber_C) == 0x000240, "Wrong size on Abirber_C");
static_assert(offsetof(Abirber_C, UberGraphFrame) == 0x000220, "Member 'Abirber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abirber_C, DefaultSceneRoot) == 0x000228, "Member 'Abirber_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abirber_C, NoBirb) == 0x000230, "Member 'Abirber_C::NoBirb' has a wrong offset!");
static_assert(offsetof(Abirber_C, Silencer) == 0x000234, "Member 'Abirber_C::Silencer' has a wrong offset!");
static_assert(offsetof(Abirber_C, Deactivate) == 0x000238, "Member 'Abirber_C::Deactivate' has a wrong offset!");

}

