#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: blackFog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function blackFog.blackFog_C.ExecuteUbergraph_blackFog
// 0x01B0 (0x01B0 - 0x0000)
struct blackFog_C_ExecuteUbergraph_blackFog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1F91[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F92[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F93[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F94[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut_1;       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F95[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F96[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_1;      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F97[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F98[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F99[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9A[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9B[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9C[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9D[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9E[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEyer_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEyer_C*                                CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9F[0x2];                                     // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(blackFog_C_ExecuteUbergraph_blackFog) == 0x000010, "Wrong alignment on blackFog_C_ExecuteUbergraph_blackFog");
static_assert(sizeof(blackFog_C_ExecuteUbergraph_blackFog) == 0x0001B0, "Wrong size on blackFog_C_ExecuteUbergraph_blackFog");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, EntryPoint) == 0x000000, "Member 'blackFog_C_ExecuteUbergraph_blackFog::EntryPoint' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'blackFog_C_ExecuteUbergraph_blackFog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, Temp_int_Variable) == 0x000020, "Member 'blackFog_C_ExecuteUbergraph_blackFog::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'blackFog_C_ExecuteUbergraph_blackFog::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, Temp_bool_IsClosed_Variable) == 0x00002C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, Temp_bool_Has_Been_Initd_Variable_1) == 0x00002D, "Member 'blackFog_C_ExecuteUbergraph_blackFog::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000030, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000034, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00003C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000050, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000054, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000058, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_VictoryFloatMinusEquals_FloatOut_1) == 0x00005C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_VictoryFloatMinusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000061, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RandomFloatInRange_ReturnValue) == 0x000064, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000068, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000070, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000074, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000080, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000084, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RotateAngleAxis_ReturnValue) == 0x000094, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x0000AC, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_FMin_ReturnValue) == 0x0000B0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000B4, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_SelectFloat_ReturnValue) == 0x0000BC, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_FMin_ReturnValue_1) == 0x0000C0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GetGlobalTimeDilation_ReturnValue_1) == 0x0000C4, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GetGlobalTimeDilation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000C8, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_SelectFloat_ReturnValue_1) == 0x0000CC, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0000D8, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0000E0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, K2Node_Event_DeltaSeconds) == 0x0000E4, "Member 'blackFog_C_ExecuteUbergraph_blackFog::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000E8, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, Temp_bool_IsClosed_Variable_1) == 0x0000F0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0000F4, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x0000F8, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000104, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000110, "Member 'blackFog_C_ExecuteUbergraph_blackFog::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x00011C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000120, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x00012C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000130, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x00013C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_BooleanAND_ReturnValue) == 0x000170, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000178, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_FinishSpawningActor_ReturnValue) == 0x000180, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000188, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Array_Add_ReturnValue) == 0x00018C, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000190, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Array_Get_Item) == 0x000198, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A0, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001A1, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Array_Length_ReturnValue) == 0x0001A4, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_BooleanOR_ReturnValue) == 0x0001A8, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_ExecuteUbergraph_blackFog, CallFunc_Less_IntInt_ReturnValue) == 0x0001A9, "Member 'blackFog_C_ExecuteUbergraph_blackFog::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function blackFog.blackFog_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct blackFog_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(blackFog_C_ReceiveTick) == 0x000004, "Wrong alignment on blackFog_C_ReceiveTick");
static_assert(sizeof(blackFog_C_ReceiveTick) == 0x000004, "Wrong size on blackFog_C_ReceiveTick");
static_assert(offsetof(blackFog_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'blackFog_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function blackFog.blackFog_C.set
// 0x0038 (0x0038 - 0x0000)
struct blackFog_C_Set final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrigger_ambientSound_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(blackFog_C_Set) == 0x000008, "Wrong alignment on blackFog_C_Set");
static_assert(sizeof(blackFog_C_Set) == 0x000038, "Wrong size on blackFog_C_Set");
static_assert(offsetof(blackFog_C_Set, Temp_int_Variable) == 0x000000, "Member 'blackFog_C_Set::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(blackFog_C_Set, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'blackFog_C_Set::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_Set, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'blackFog_C_Set::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(blackFog_C_Set, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'blackFog_C_Set::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
