#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: blackFog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass blackFog.blackFog_C
// 0x0040 (0x0260 - 0x0220)
class AblackFog_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A;                                                 // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F8F[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spd;                                               // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          M;                                                 // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F90[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEyer_C*>                        Eyes;                                              // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_blackFog(int32 EntryPoint);
	void SpawnGhost();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void Set();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"blackFog_C">();
	}
	static class AblackFog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AblackFog_C>();
	}
};
static_assert(alignof(AblackFog_C) == 0x000008, "Wrong alignment on AblackFog_C");
static_assert(sizeof(AblackFog_C) == 0x000260, "Wrong size on AblackFog_C");
static_assert(offsetof(AblackFog_C, UberGraphFrame) == 0x000220, "Member 'AblackFog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AblackFog_C, PostProcess) == 0x000228, "Member 'AblackFog_C::PostProcess' has a wrong offset!");
static_assert(offsetof(AblackFog_C, DefaultSceneRoot) == 0x000230, "Member 'AblackFog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AblackFog_C, A) == 0x000238, "Member 'AblackFog_C::A' has a wrong offset!");
static_assert(offsetof(AblackFog_C, Dynmat) == 0x000240, "Member 'AblackFog_C::Dynmat' has a wrong offset!");
static_assert(offsetof(AblackFog_C, Spd) == 0x000248, "Member 'AblackFog_C::Spd' has a wrong offset!");
static_assert(offsetof(AblackFog_C, M) == 0x00024C, "Member 'AblackFog_C::M' has a wrong offset!");
static_assert(offsetof(AblackFog_C, Eyes) == 0x000250, "Member 'AblackFog_C::Eyes' has a wrong offset!");

}

