#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: blooder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function blooder.blooder_C.ExecuteUbergraph_blooder
// 0x01D0 (0x01D0 - 0x0000)
struct blooder_C_ExecuteUbergraph_blooder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0060(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0074(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrunge_C*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(blooder_C_ExecuteUbergraph_blooder) == 0x000010, "Wrong alignment on blooder_C_ExecuteUbergraph_blooder");
static_assert(sizeof(blooder_C_ExecuteUbergraph_blooder) == 0x0001D0, "Wrong size on blooder_C_ExecuteUbergraph_blooder");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, EntryPoint) == 0x000000, "Member 'blooder_C_ExecuteUbergraph_blooder::EntryPoint' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, Temp_int_Variable) == 0x000004, "Member 'blooder_C_ExecuteUbergraph_blooder::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'blooder_C_ExecuteUbergraph_blooder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_RandomUnitVector_ReturnValue) == 0x00001C, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_Add_VectorVector_ReturnValue) == 0x000034, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, Temp_object_Variable) == 0x000048, "Member 'blooder_C_ExecuteUbergraph_blooder::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_RandomFloatInRange_ReturnValue) == 0x000058, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_obj_statDyn_obj) == 0x000060, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000070, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000074, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0000FC, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_bBlockingHit) == 0x0000FD, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000FE, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_Time) == 0x000100, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_Distance) == 0x000104, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_Location) == 0x000108, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_ImpactPoint) == 0x000114, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_Normal) == 0x000120, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_ImpactNormal) == 0x00012C, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_PhysMat) == 0x000138, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_HitActor) == 0x000140, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_HitComponent) == 0x000148, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_HitBoneName) == 0x000150, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_HitItem) == 0x000158, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_ElementIndex) == 0x00015C, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_FaceIndex) == 0x000160, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_TraceStart) == 0x000164, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BreakHitResult_TraceEnd) == 0x000170, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_GetCollisionObjectType_ReturnValue) == 0x00017C, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000180, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00018C, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C0, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(blooder_C_ExecuteUbergraph_blooder, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C8, "Member 'blooder_C_ExecuteUbergraph_blooder::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function blooder.blooder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct blooder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(blooder_C_ReceiveTick) == 0x000004, "Wrong alignment on blooder_C_ReceiveTick");
static_assert(sizeof(blooder_C_ReceiveTick) == 0x000004, "Wrong size on blooder_C_ReceiveTick");
static_assert(offsetof(blooder_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'blooder_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

