#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: borderFence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass borderFence.borderFence_C
// 0x0040 (0x0260 - 0x0220)
class AborderFence_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Gen;                                               // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Size;                                              // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              Skip;                                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     Aes;                                               // 0x0248(0x0010)(Edit, BlueprintVisible)
	bool                                          Rend;                                              // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Build();
	void Prepare();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_borderFence(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"borderFence_C">();
	}
	static class AborderFence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AborderFence_C>();
	}
};
static_assert(alignof(AborderFence_C) == 0x000008, "Wrong alignment on AborderFence_C");
static_assert(sizeof(AborderFence_C) == 0x000260, "Wrong size on AborderFence_C");
static_assert(offsetof(AborderFence_C, UberGraphFrame) == 0x000220, "Member 'AborderFence_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AborderFence_C, HierarchicalInstancedStaticMesh) == 0x000228, "Member 'AborderFence_C::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(AborderFence_C, DefaultSceneRoot) == 0x000230, "Member 'AborderFence_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AborderFence_C, Gen) == 0x000238, "Member 'AborderFence_C::Gen' has a wrong offset!");
static_assert(offsetof(AborderFence_C, Size) == 0x00023C, "Member 'AborderFence_C::Size' has a wrong offset!");
static_assert(offsetof(AborderFence_C, Skip) == 0x000240, "Member 'AborderFence_C::Skip' has a wrong offset!");
static_assert(offsetof(AborderFence_C, Aes) == 0x000248, "Member 'AborderFence_C::Aes' has a wrong offset!");
static_assert(offsetof(AborderFence_C, Rend) == 0x000258, "Member 'AborderFence_C::Rend' has a wrong offset!");

}

