#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: borders

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass borders.borders_C
// 0x0040 (0x0260 - 0x0220)
class Aborders_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane5;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane4;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane3;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane2;                                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane1;                                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_borders(int32 EntryPoint);
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"borders_C">();
	}
	static class Aborders_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aborders_C>();
	}
};
static_assert(alignof(Aborders_C) == 0x000008, "Wrong alignment on Aborders_C");
static_assert(sizeof(Aborders_C) == 0x000260, "Wrong size on Aborders_C");
static_assert(offsetof(Aborders_C, UberGraphFrame) == 0x000220, "Member 'Aborders_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Aborders_C, Plane5) == 0x000228, "Member 'Aborders_C::Plane5' has a wrong offset!");
static_assert(offsetof(Aborders_C, Plane4) == 0x000230, "Member 'Aborders_C::Plane4' has a wrong offset!");
static_assert(offsetof(Aborders_C, Plane3) == 0x000238, "Member 'Aborders_C::Plane3' has a wrong offset!");
static_assert(offsetof(Aborders_C, Plane2) == 0x000240, "Member 'Aborders_C::Plane2' has a wrong offset!");
static_assert(offsetof(Aborders_C, Plane1) == 0x000248, "Member 'Aborders_C::Plane1' has a wrong offset!");
static_assert(offsetof(Aborders_C, Plane) == 0x000250, "Member 'Aborders_C::Plane' has a wrong offset!");
static_assert(offsetof(Aborders_C, DefaultSceneRoot) == 0x000258, "Member 'Aborders_C::DefaultSceneRoot' has a wrong offset!");

}

