#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bs_spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function bs_spawner.bs_spawner_C.ExecuteUbergraph_bs_spawner
// 0x02C0 (0x02C0 - 0x0000)
struct bs_spawner_C_ExecuteUbergraph_bs_spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0018(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	class Abs_C*                                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x00E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_1;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x02A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bs_spawner_C_ExecuteUbergraph_bs_spawner) == 0x000010, "Wrong alignment on bs_spawner_C_ExecuteUbergraph_bs_spawner");
static_assert(sizeof(bs_spawner_C_ExecuteUbergraph_bs_spawner) == 0x0002C0, "Wrong size on bs_spawner_C_ExecuteUbergraph_bs_spawner");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, EntryPoint) == 0x000000, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, Temp_object_Variable) == 0x000008, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_obj_static_obj) == 0x000018, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000034, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000038, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_MakeVector_ReturnValue) == 0x00003C, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x000048, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000060, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000064, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000070, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00007C, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, Temp_object_Variable_1) == 0x0000C8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0000E0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000168, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_bBlockingHit) == 0x000169, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x00016A, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_Time) == 0x00016C, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_Distance) == 0x000170, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_Location) == 0x000174, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_ImpactPoint) == 0x000180, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_Normal) == 0x00018C, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_ImpactNormal) == 0x000198, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_HitActor) == 0x0001B0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_HitComponent) == 0x0001B8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_HitBoneName) == 0x0001C0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_HitItem) == 0x0001C8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_ElementIndex) == 0x0001CC, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_FaceIndex) == 0x0001D0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_TraceStart) == 0x0001D4, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_BreakHitResult_TraceEnd) == 0x0001E0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001F0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001F8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_GetDistanceTo_ReturnValue) == 0x000280, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000288, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_Less_FloatFloat_ReturnValue) == 0x000290, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_GetDistanceTo_ReturnValue_1) == 0x000294, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_GetDistanceTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000298, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_WasRecentlyRendered_ReturnValue_1) == 0x000299, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_WasRecentlyRendered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0002A0, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_SphereOverlapActors_OutActors) == 0x0002A8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_SphereOverlapActors_ReturnValue) == 0x0002B8, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0002B9, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(bs_spawner_C_ExecuteUbergraph_bs_spawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002BA, "Member 'bs_spawner_C_ExecuteUbergraph_bs_spawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

