#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bs_spawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bs_spawner.bs_spawner_C
// 0x0040 (0x0260 - 0x0220)
class Abs_spawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Rend;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Rad;                                               // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Abs_C*                                  bs;                                                // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Onj;                                               // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_bs_spawner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bs_spawner_C">();
	}
	static class Abs_spawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abs_spawner_C>();
	}
};
static_assert(alignof(Abs_spawner_C) == 0x000008, "Wrong alignment on Abs_spawner_C");
static_assert(sizeof(Abs_spawner_C) == 0x000260, "Wrong size on Abs_spawner_C");
static_assert(offsetof(Abs_spawner_C, UberGraphFrame) == 0x000220, "Member 'Abs_spawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abs_spawner_C, Rend) == 0x000228, "Member 'Abs_spawner_C::Rend' has a wrong offset!");
static_assert(offsetof(Abs_spawner_C, Sphere) == 0x000230, "Member 'Abs_spawner_C::Sphere' has a wrong offset!");
static_assert(offsetof(Abs_spawner_C, DefaultSceneRoot) == 0x000238, "Member 'Abs_spawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abs_spawner_C, Rad) == 0x000240, "Member 'Abs_spawner_C::Rad' has a wrong offset!");
static_assert(offsetof(Abs_spawner_C, bs) == 0x000248, "Member 'Abs_spawner_C::bs' has a wrong offset!");
static_assert(offsetof(Abs_spawner_C, Onj) == 0x000250, "Member 'Abs_spawner_C::Onj' has a wrong offset!");

}

