#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bunkerHatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bunkerHatch.bunkerHatch_C
// 0x0020 (0x0240 - 0x0220)
class AbunkerHatch_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveDestroyed();
	void ExecuteUbergraph_bunkerHatch(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bunkerHatch_C">();
	}
	static class AbunkerHatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AbunkerHatch_C>();
	}
};
static_assert(alignof(AbunkerHatch_C) == 0x000008, "Wrong alignment on AbunkerHatch_C");
static_assert(sizeof(AbunkerHatch_C) == 0x000240, "Wrong size on AbunkerHatch_C");
static_assert(offsetof(AbunkerHatch_C, UberGraphFrame) == 0x000220, "Member 'AbunkerHatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AbunkerHatch_C, StaticMesh1) == 0x000228, "Member 'AbunkerHatch_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AbunkerHatch_C, StaticMesh) == 0x000230, "Member 'AbunkerHatch_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AbunkerHatch_C, DefaultSceneRoot) == 0x000238, "Member 'AbunkerHatch_C::DefaultSceneRoot' has a wrong offset!");

}

