#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bunkhouse

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass bunkhouse.bunkhouse_C
// 0x0020 (0x0240 - 0x0220)
class Abunkhouse_C final : public AActor
{
public:
	class UChildActorComponent*                   Indoors1;                                          // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Door;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   building;                                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"bunkhouse_C">();
	}
	static class Abunkhouse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abunkhouse_C>();
	}
};
static_assert(alignof(Abunkhouse_C) == 0x000008, "Wrong alignment on Abunkhouse_C");
static_assert(sizeof(Abunkhouse_C) == 0x000240, "Wrong size on Abunkhouse_C");
static_assert(offsetof(Abunkhouse_C, Indoors1) == 0x000220, "Member 'Abunkhouse_C::Indoors1' has a wrong offset!");
static_assert(offsetof(Abunkhouse_C, Door) == 0x000228, "Member 'Abunkhouse_C::Door' has a wrong offset!");
static_assert(offsetof(Abunkhouse_C, PhysicsConstraint) == 0x000230, "Member 'Abunkhouse_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(Abunkhouse_C, building) == 0x000238, "Member 'Abunkhouse_C::building' has a wrong offset!");

}

