#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: burningDebris

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function burningDebris.burningDebris_C.ExecuteUbergraph_burningDebris
// 0x001C (0x001C - 0x0000)
struct burningDebris_C_ExecuteUbergraph_burningDebris final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(burningDebris_C_ExecuteUbergraph_burningDebris) == 0x000004, "Wrong alignment on burningDebris_C_ExecuteUbergraph_burningDebris");
static_assert(sizeof(burningDebris_C_ExecuteUbergraph_burningDebris) == 0x00001C, "Wrong size on burningDebris_C_ExecuteUbergraph_burningDebris");
static_assert(offsetof(burningDebris_C_ExecuteUbergraph_burningDebris, EntryPoint) == 0x000000, "Member 'burningDebris_C_ExecuteUbergraph_burningDebris::EntryPoint' has a wrong offset!");
static_assert(offsetof(burningDebris_C_ExecuteUbergraph_burningDebris, CallFunc_RandomUnitVector_ReturnValue) == 0x000004, "Member 'burningDebris_C_ExecuteUbergraph_burningDebris::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(burningDebris_C_ExecuteUbergraph_burningDebris, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'burningDebris_C_ExecuteUbergraph_burningDebris::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

}

