#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: buttons

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass buttons.buttons_C
// 0x0018 (0x02A0 - 0x0288)
class Abuttons_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_buttons_C;                          // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void LandedOn(class AMainPlayer_C* Player, bool* IgnoreFallDamage);
	void IsButtonUsed(bool* Failed);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void NoRespawn(bool Param_NoRespawn, bool* Return);
	void CanPickup(bool* Return);
	void AsProp(class AProp_C** Return);
	void CanBePutInContainer(bool* Return);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);
	void OnNotifyEnd_0148CEB84DE38329DFA5769609C745AE(class FName NotifyName);
	void OnNotifyBegin_0148CEB84DE38329DFA5769609C745AE(class FName NotifyName);
	void OnInterrupted_0148CEB84DE38329DFA5769609C745AE(class FName NotifyName);
	void OnBlendOut_0148CEB84DE38329DFA5769609C745AE(class FName NotifyName);
	void OnCompleted_0148CEB84DE38329DFA5769609C745AE(class FName NotifyName);
	void DriveDetached();
	void Player_use(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void Kicked(bool Kick);
	void SendName(class FName Param_Name);
	void broken();
	void broken_fire();
	void Thrown(class AMainPlayer_C* Player);
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Hit, float Damage);
	void UpdateStrAgl();
	void PlayerUnequip(class AMainPlayer_C* Player);
	void PlayerHold(class AMainPlayer_C* Player);
	void PlayerR(class AMainPlayer_C* Player);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, Enum_interactionActions Action);
	void ExecuteUbergraph_buttons(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"buttons_C">();
	}
	static class Abuttons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abuttons_C>();
	}
};
static_assert(alignof(Abuttons_C) == 0x000008, "Wrong alignment on Abuttons_C");
static_assert(sizeof(Abuttons_C) == 0x0002A0, "Wrong size on Abuttons_C");
static_assert(offsetof(Abuttons_C, UberGraphFrame_buttons_C) == 0x000288, "Member 'Abuttons_C::UberGraphFrame_buttons_C' has a wrong offset!");
static_assert(offsetof(Abuttons_C, Box) == 0x000290, "Member 'Abuttons_C::Box' has a wrong offset!");
static_assert(offsetof(Abuttons_C, SkeletalMesh) == 0x000298, "Member 'Abuttons_C::SkeletalMesh' has a wrong offset!");

}

