#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CentipedeSegmet

#include "Basic.hpp"


namespace SDK::Params
{

// Function centipedeSegmet.centipedeSegmet_C.ExecuteUbergraph_centipedeSegmet
// 0x0028 (0x0028 - 0x0000)
struct CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2191[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet) == 0x000008, "Wrong alignment on CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet");
static_assert(sizeof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet) == 0x000028, "Wrong size on CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet");
static_assert(offsetof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet, EntryPoint) == 0x000000, "Member 'CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet::EntryPoint' has a wrong offset!");
static_assert(offsetof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet, Temp_bool_Variable) == 0x000004, "Member 'CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet, Temp_object_Variable) == 0x000008, "Member 'CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet, Temp_object_Variable_1) == 0x000010, "Member 'CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet, K2Node_Select_Default) == 0x000018, "Member 'CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet, CallFunc_SetStaticMesh_ReturnValue) == 0x000020, "Member 'CentipedeSegmet_C_ExecuteUbergraph_centipedeSegmet::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

