#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function cig.cig_C.ExecuteUbergraph_cig
// 0x01A0 (0x01A0 - 0x0000)
struct Cig_C_ExecuteUbergraph_cig final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Pressed)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_pressed_2;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_pressed_1;                      // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFire_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_pressed;                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_lighter_C*                        K2Node_DynamicCast_AsProp_Lighter;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Pressed)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Cig_C_ExecuteUbergraph_cig) == 0x000010, "Wrong alignment on Cig_C_ExecuteUbergraph_cig");
static_assert(sizeof(Cig_C_ExecuteUbergraph_cig) == 0x0001A0, "Wrong size on Cig_C_ExecuteUbergraph_cig");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, EntryPoint) == 0x000000, "Member 'Cig_C_ExecuteUbergraph_cig::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000024, "Member 'Cig_C_ExecuteUbergraph_cig::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, Temp_bool_Has_Been_Initd_Variable) == 0x000025, "Member 'Cig_C_ExecuteUbergraph_cig::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000038, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainPlayer_AsMain_Player) == 0x000048, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000050, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_pressed_2) == 0x000052, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_pressed_2' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_pressed_1) == 0x000053, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_pressed_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000068, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_RandomFloatInRange_ReturnValue) == 0x000074, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getSaveSlot_saveSlot) == 0x000078, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000080, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000088, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000090, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000098, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0000A0, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetComponentBounds_Origin) == 0x0000B4, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetComponentBounds_BoxExtent) == 0x0000C0, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_GetComponentBounds_SphereRadius) == 0x0000CC, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000DC, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000120, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_FinishSpawningActor_ReturnValue) == 0x000138, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_pressed) == 0x000140, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_pressed' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, Temp_bool_IsClosed_Variable) == 0x000141, "Member 'Cig_C_ExecuteUbergraph_cig::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainPlayer_AsMain_Player_2) == 0x000148, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_DynamicCast_AsProp_Lighter) == 0x000150, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_DynamicCast_AsProp_Lighter' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00015C, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000160, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000168, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, CallFunc_VLerp_ReturnValue) == 0x000170, "Member 'Cig_C_ExecuteUbergraph_cig::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CustomEvent_DestroyedActor) == 0x000180, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Cig_C_ExecuteUbergraph_cig, K2Node_CreateDelegate_OutputDelegate_4) == 0x000188, "Member 'Cig_C_ExecuteUbergraph_cig::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function cig.cig_C.destroyed
// 0x0008 (0x0008 - 0x0000)
struct Cig_C_Destroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_Destroyed) == 0x000008, "Wrong alignment on Cig_C_Destroyed");
static_assert(sizeof(Cig_C_Destroyed) == 0x000008, "Wrong size on Cig_C_Destroyed");
static_assert(offsetof(Cig_C_Destroyed, DestroyedActor) == 0x000000, "Member 'Cig_C_Destroyed::DestroyedActor' has a wrong offset!");

// Function cig.cig_C.usedRMB
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_UsedRMB final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_UsedRMB) == 0x000001, "Wrong alignment on Cig_C_UsedRMB");
static_assert(sizeof(Cig_C_UsedRMB) == 0x000001, "Wrong size on Cig_C_UsedRMB");
static_assert(offsetof(Cig_C_UsedRMB, Pressed) == 0x000000, "Member 'Cig_C_UsedRMB::Pressed' has a wrong offset!");

// Function cig.cig_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Cig_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cig_C_ReceiveTick) == 0x000004, "Wrong alignment on Cig_C_ReceiveTick");
static_assert(sizeof(Cig_C_ReceiveTick) == 0x000004, "Wrong size on Cig_C_ReceiveTick");
static_assert(offsetof(Cig_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Cig_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function cig.cig_C.usedR
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_UsedR final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_UsedR) == 0x000001, "Wrong alignment on Cig_C_UsedR");
static_assert(sizeof(Cig_C_UsedR) == 0x000001, "Wrong size on Cig_C_UsedR");
static_assert(offsetof(Cig_C_UsedR, Pressed) == 0x000000, "Member 'Cig_C_UsedR::Pressed' has a wrong offset!");

// Function cig.cig_C.usedAlt
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_UsedAlt final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_UsedAlt) == 0x000001, "Wrong alignment on Cig_C_UsedAlt");
static_assert(sizeof(Cig_C_UsedAlt) == 0x000001, "Wrong size on Cig_C_UsedAlt");
static_assert(offsetof(Cig_C_UsedAlt, Pressed) == 0x000000, "Member 'Cig_C_UsedAlt::Pressed' has a wrong offset!");

// Function cig.cig_C.lit
// 0x0001 (0x0001 - 0x0000)
struct Cig_C_Lit final
{
public:
	bool                                          Param_LitUp;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cig_C_Lit) == 0x000001, "Wrong alignment on Cig_C_Lit");
static_assert(sizeof(Cig_C_Lit) == 0x000001, "Wrong size on Cig_C_Lit");
static_assert(offsetof(Cig_C_Lit, Param_LitUp) == 0x000000, "Member 'Cig_C_Lit::Param_LitUp' has a wrong offset!");

}

