#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cleanball

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass cleanball.cleanball_C
// 0x0030 (0x0250 - 0x0220)
class ACleanball_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FuckYou;                                           // 0x0230(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AD_window_C*                            Spogen;                                            // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AProp_sponge_C*                         Sponge;                                            // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_cleanball(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"cleanball_C">();
	}
	static class ACleanball_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACleanball_C>();
	}
};
static_assert(alignof(ACleanball_C) == 0x000008, "Wrong alignment on ACleanball_C");
static_assert(sizeof(ACleanball_C) == 0x000250, "Wrong size on ACleanball_C");
static_assert(offsetof(ACleanball_C, UberGraphFrame) == 0x000220, "Member 'ACleanball_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACleanball_C, Sphere) == 0x000228, "Member 'ACleanball_C::Sphere' has a wrong offset!");
static_assert(offsetof(ACleanball_C, FuckYou) == 0x000230, "Member 'ACleanball_C::FuckYou' has a wrong offset!");
static_assert(offsetof(ACleanball_C, Spogen) == 0x000240, "Member 'ACleanball_C::Spogen' has a wrong offset!");
static_assert(offsetof(ACleanball_C, Sponge) == 0x000248, "Member 'ACleanball_C::Sponge' has a wrong offset!");

}

