#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cleanball

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function cleanball.cleanball_C.ExecuteUbergraph_cleanball
// 0x00B8 (0x00B8 - 0x0000)
struct Cleanball_C_ExecuteUbergraph_cleanball final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x002C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Cleanball_C_ExecuteUbergraph_cleanball) == 0x000008, "Wrong alignment on Cleanball_C_ExecuteUbergraph_cleanball");
static_assert(sizeof(Cleanball_C_ExecuteUbergraph_cleanball) == 0x0000B8, "Wrong size on Cleanball_C_ExecuteUbergraph_cleanball");
static_assert(offsetof(Cleanball_C_ExecuteUbergraph_cleanball, EntryPoint) == 0x000000, "Member 'Cleanball_C_ExecuteUbergraph_cleanball::EntryPoint' has a wrong offset!");
static_assert(offsetof(Cleanball_C_ExecuteUbergraph_cleanball, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'Cleanball_C_ExecuteUbergraph_cleanball::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Cleanball_C_ExecuteUbergraph_cleanball, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Cleanball_C_ExecuteUbergraph_cleanball::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Cleanball_C_ExecuteUbergraph_cleanball, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Cleanball_C_ExecuteUbergraph_cleanball::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Cleanball_C_ExecuteUbergraph_cleanball, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'Cleanball_C_ExecuteUbergraph_cleanball::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Cleanball_C_ExecuteUbergraph_cleanball, K2Node_ComponentBoundEvent_Hit) == 0x00002C, "Member 'Cleanball_C_ExecuteUbergraph_cleanball::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");

// Function cleanball.cleanball_C.BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'Cleanball_C_BndEvt__cleanball_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

}

