#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CockroachMaster

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function cockroachMaster.cockroachMaster_C.ExecuteUbergraph_cockroachMaster
// 0x0CA0 (0x0CA0 - 0x0000)
struct CockroachMaster_C_ExecuteUbergraph_cockroachMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_damage_7;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_8;                                // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_2;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_2;                             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0100(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0150(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name_1;                               // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x01F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_6;                             // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x02A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x038C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0470(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x04A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0568(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor;                                // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0624(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x06C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x075C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x075D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75E[0x2];                                      // 0x075E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0770(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_795[0x3];                                      // 0x0795(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UStaticMeshComponent*             Temp_object_Variable_3;                            // 0x0798(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_4;                            // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x07B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x07C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x07CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x07D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorInt_ReturnValue;           // 0x07E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F6[0x2];                                      // 0x07F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x07F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0804(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0818(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0830(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0844(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0854(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x086C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0878(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0884(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0890(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0919(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x091A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x091B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0924(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0930(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x093C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0948(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_954[0x4];                                      // 0x0954(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0968(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x097C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0984(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0990(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x099C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A8[0x8];                                      // 0x09A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x09B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x09E0(0x00F0)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0AD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_cockroachNest_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE4[0x4];                                      // 0x0AE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0AE8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0AF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0AF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF5[0x3];                                      // 0x0AF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UStaticMeshComponent*             Temp_object_Variable_5;                            // 0x0AF8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B01[0x7];                                      // 0x0B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0B10(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0B98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UStaticMeshComponent*             Temp_object_Variable_6;                            // 0x0BA0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0BA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0BAA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BAB[0x1];                                      // 0x0BAB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0BAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0BB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0BB4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0BC0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0BCC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0BD8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE4[0x4];                                      // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0BF8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0C0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0C10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0C14(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0C20(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue_1;       // 0x0C2C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0C38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C41[0x3];                                      // 0x0C41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0C44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0C4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x0C50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0C51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C52[0x6];                                      // 0x0C52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0C58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0C60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C64[0x4];                                      // 0x0C64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_component;                            // 0x0C68(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0C74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_progressAdvancement_finished;             // 0x0C75(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C76[0x2];                                      // 0x0C76(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_progressAdvancement_name;                 // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0C88(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster) == 0x000010, "Wrong alignment on CockroachMaster_C_ExecuteUbergraph_cockroachMaster");
static_assert(sizeof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster) == 0x000CA0, "Wrong size on CockroachMaster_C_ExecuteUbergraph_cockroachMaster");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, EntryPoint) == 0x000000, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_object_Variable) == 0x000010, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_int_Array_Index_Variable) == 0x000020, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_int_Variable) == 0x000024, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_object_Variable_1) == 0x000030, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, Temp_object_Variable_2) == 0x000040, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_damage_7) == 0x000050, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_damage_7' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_hit_8) == 0x000054, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_hit_8' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_actor_2) == 0x0000E0, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_actor_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_impact_2) == 0x0000E8, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_impact_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_gamemode) == 0x0000F8, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_key_2) == 0x000100, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_pressed_1) == 0x000118, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_color) == 0x00011C, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_picker) == 0x000130, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_texture) == 0x000138, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_index) == 0x000140, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_18) == 0x000148, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_hit_7) == 0x000150, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_kick) == 0x0001D8, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_name_1) == 0x0001DC, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_17) == 0x0001E8, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_16) == 0x0001F0, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_hit_6) == 0x0001F8, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_damage_6) == 0x000280, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_15) == 0x000288, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_14) == 0x000290, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_13) == 0x000298, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_damage_5) == 0x0002A0, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_hit_5) == 0x0002A4, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_actor_1) == 0x000330, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_impact_1) == 0x000338, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_water_3) == 0x000348, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_water_2) == 0x000350, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_water_1) == 0x000358, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_water) == 0x000360, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_activate) == 0x000368, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_static) == 0x000369, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_frozen) == 0x00036A, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_active) == 0x00036B, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_key_1) == 0x000370, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_damage_4) == 0x000380, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_fuel) == 0x000384, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_damage_3) == 0x000388, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_hot) == 0x00038C, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_12) == 0x000418, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_11) == 0x000420, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_damage_2) == 0x000428, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_location_1) == 0x00042C, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_10) == 0x000438, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_9) == 0x000440, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_8) == 0x000448, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_wheelDelta) == 0x000450, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_7) == 0x000458, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_mouse) == 0x000460, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_6) == 0x000468, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_key) == 0x000470, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_pressed) == 0x000488, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_temperature_1) == 0x00048C, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_temperature) == 0x000490, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_speed) == 0x000494, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_5) == 0x000498, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_hit_4) == 0x0004A0, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_name) == 0x000528, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_volume) == 0x000538, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_player_4) == 0x000540, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(CockroachMaster_C_ExecuteUbergraph_cockroachMaster, K2Node_Event_location) == 0x000548, "Member 'CockroachMaster_C_ExecuteUbergraph_cockroachMaster::K2Node_Event_location' has a wrong offset!");
