#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_zerog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function comp_zerog.comp_zerog_C.ExecuteUbergraph_comp_zerog
// 0x00D0 (0x00D0 - 0x0000)
struct Comp_zerog_C_ExecuteUbergraph_comp_zerog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_zerog_C_ExecuteUbergraph_comp_zerog) == 0x000010, "Wrong alignment on Comp_zerog_C_ExecuteUbergraph_comp_zerog");
static_assert(sizeof(Comp_zerog_C_ExecuteUbergraph_comp_zerog) == 0x0000D0, "Wrong size on Comp_zerog_C_ExecuteUbergraph_comp_zerog");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, EntryPoint) == 0x000000, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::EntryPoint' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_GetComponentBounds_Origin) == 0x000040, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_GetComponentBounds_BoxExtent) == 0x00004C, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_GetComponentBounds_SphereRadius) == 0x000058, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_InverseTransformLocation_ReturnValue) == 0x00005C, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000068, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000078, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, K2Node_Event_EndPlayReason) == 0x000080, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, K2Node_DynamicCast_AsPrimitive_Component) == 0x000088, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, K2Node_Event_DeltaSeconds) == 0x000094, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_SelectFloat_ReturnValue) == 0x00009C, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000A0, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0000A8, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_FClamp_ReturnValue) == 0x0000AC, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000B1, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_BooleanOR_ReturnValue) == 0x0000B2, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_BooleanAND_ReturnValue) == 0x0000B3, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_SelectFloat_ReturnValue_1) == 0x0000B4, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000B8, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_zerog_C_ExecuteUbergraph_comp_zerog, CallFunc_MakeVector_ReturnValue) == 0x0000BC, "Member 'Comp_zerog_C_ExecuteUbergraph_comp_zerog::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function comp_zerog.comp_zerog_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Comp_zerog_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_zerog_C_ReceiveTick) == 0x000004, "Wrong alignment on Comp_zerog_C_ReceiveTick");
static_assert(sizeof(Comp_zerog_C_ReceiveTick) == 0x000004, "Wrong size on Comp_zerog_C_ReceiveTick");
static_assert(offsetof(Comp_zerog_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Comp_zerog_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function comp_zerog.comp_zerog_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Comp_zerog_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_zerog_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Comp_zerog_C_ReceiveEndPlay");
static_assert(sizeof(Comp_zerog_C_ReceiveEndPlay) == 0x000001, "Wrong size on Comp_zerog_C_ReceiveEndPlay");
static_assert(offsetof(Comp_zerog_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Comp_zerog_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

