#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_radarPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass comp_radarPoint.comp_radarPoint_C
// 0x0028 (0x00D8 - 0x00B0)
class UComp_radarPoint_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Owner;                                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Important;                                         // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x00C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_comp_radarPoint(int32 EntryPoint);
	void Des(class AActor* DestroyedActor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"comp_radarPoint_C">();
	}
	static class UComp_radarPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComp_radarPoint_C>();
	}
};
static_assert(alignof(UComp_radarPoint_C) == 0x000008, "Wrong alignment on UComp_radarPoint_C");
static_assert(sizeof(UComp_radarPoint_C) == 0x0000D8, "Wrong size on UComp_radarPoint_C");
static_assert(offsetof(UComp_radarPoint_C, UberGraphFrame) == 0x0000B0, "Member 'UComp_radarPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComp_radarPoint_C, Owner) == 0x0000B8, "Member 'UComp_radarPoint_C::Owner' has a wrong offset!");
static_assert(offsetof(UComp_radarPoint_C, Important) == 0x0000C0, "Member 'UComp_radarPoint_C::Important' has a wrong offset!");
static_assert(offsetof(UComp_radarPoint_C, Active) == 0x0000C1, "Member 'UComp_radarPoint_C::Active' has a wrong offset!");
static_assert(offsetof(UComp_radarPoint_C, Color) == 0x0000C4, "Member 'UComp_radarPoint_C::Color' has a wrong offset!");

}

