#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_jetpack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass comp_jetpack.comp_jetpack_C
// 0x0018 (0x00C8 - 0x00B0)
class UComp_jetpack_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMainPlayer_C*                          Player;                                            // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Snd;                                               // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_comp_jetpack(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Press(bool Pressed);
	void Assign(class AMainPlayer_C* Param_Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"comp_jetpack_C">();
	}
	static class UComp_jetpack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComp_jetpack_C>();
	}
};
static_assert(alignof(UComp_jetpack_C) == 0x000008, "Wrong alignment on UComp_jetpack_C");
static_assert(sizeof(UComp_jetpack_C) == 0x0000C8, "Wrong size on UComp_jetpack_C");
static_assert(offsetof(UComp_jetpack_C, UberGraphFrame) == 0x0000B0, "Member 'UComp_jetpack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComp_jetpack_C, Player) == 0x0000B8, "Member 'UComp_jetpack_C::Player' has a wrong offset!");
static_assert(offsetof(UComp_jetpack_C, Snd) == 0x0000C0, "Member 'UComp_jetpack_C::Snd' has a wrong offset!");

}

