#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_radiation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function comp_radiation.comp_radiation_C.ExecuteUbergraph_comp_radiation
// 0x0180 (0x0180 - 0x0000)
struct Comp_radiation_C_ExecuteUbergraph_comp_radiation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasEquipment_return;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_phys_obj;                             // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_pawn_obj;                             // 0x00E8(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x00F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_radDetec_C*                       K2Node_DynamicCast_AsProp_Rad_Detec;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_radiation_C_ExecuteUbergraph_comp_radiation) == 0x000008, "Wrong alignment on Comp_radiation_C_ExecuteUbergraph_comp_radiation");
static_assert(sizeof(Comp_radiation_C_ExecuteUbergraph_comp_radiation) == 0x000180, "Wrong size on Comp_radiation_C_ExecuteUbergraph_comp_radiation");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, EntryPoint) == 0x000000, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, Temp_object_Variable) == 0x000008, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetComponentBounds_Origin) == 0x000028, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetComponentBounds_BoxExtent) == 0x000034, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetComponentBounds_SphereRadius) == 0x000040, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000044, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000058, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_hasEquipment_return) == 0x00005C, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_hasEquipment_return' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, Temp_object_Variable_1) == 0x000070, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000080, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetComponentBounds_Origin_1) == 0x000088, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetComponentBounds_BoxExtent_1) == 0x000094, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetComponentBounds_SphereRadius_1) == 0x0000A0, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000A8, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetDistanceTo_ReturnValue) == 0x0000B0, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_obj_phys_obj) == 0x0000B8, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_obj_phys_obj' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000C8, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_SphereOverlapActors_OutActors) == 0x0000D0, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_SphereOverlapActors_ReturnValue) == 0x0000E0, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_obj_pawn_obj) == 0x0000E8, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_obj_pawn_obj' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_SphereOverlapActors_OutActors_1) == 0x0000F8, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_SphereOverlapActors_OutActors_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_SphereOverlapActors_ReturnValue_1) == 0x000108, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_SphereOverlapActors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Array_Get_Item) == 0x000110, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_DynamicCast_AsMain_Player) == 0x000120, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Less_IntInt_ReturnValue) == 0x000129, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x00012C, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x000138, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_DynamicCast_AsProp_Rad_Detec) == 0x000140, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_DynamicCast_AsProp_Rad_Detec' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_FClamp_ReturnValue) == 0x00014C, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000150, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000158, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000160, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000164, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Array_RemoveItem_ReturnValue) == 0x000168, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x00016C, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000170, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, CallFunc_Array_Add_ReturnValue) == 0x000174, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_ExecuteUbergraph_comp_radiation, K2Node_CustomEvent_DestroyedActor) == 0x000178, "Member 'Comp_radiation_C_ExecuteUbergraph_comp_radiation::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");

// Function comp_radiation.comp_radiation_C.Dest
// 0x0008 (0x0008 - 0x0000)
struct Comp_radiation_C_Dest final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_radiation_C_Dest) == 0x000008, "Wrong alignment on Comp_radiation_C_Dest");
static_assert(sizeof(Comp_radiation_C_Dest) == 0x000008, "Wrong size on Comp_radiation_C_Dest");
static_assert(offsetof(Comp_radiation_C_Dest, DestroyedActor) == 0x000000, "Member 'Comp_radiation_C_Dest::DestroyedActor' has a wrong offset!");

// Function comp_radiation.comp_radiation_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Comp_radiation_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_radiation_C_ReceiveTick) == 0x000004, "Wrong alignment on Comp_radiation_C_ReceiveTick");
static_assert(sizeof(Comp_radiation_C_ReceiveTick) == 0x000004, "Wrong size on Comp_radiation_C_ReceiveTick");
static_assert(offsetof(Comp_radiation_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Comp_radiation_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function comp_radiation.comp_radiation_C.calcRadAmount
// 0x003C (0x003C - 0x0000)
struct Comp_radiation_C_CalcRadAmount final
{
public:
	struct FVector                                PointA;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PointB;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rad;                                               // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Comp_radiation_C_CalcRadAmount) == 0x000004, "Wrong alignment on Comp_radiation_C_CalcRadAmount");
static_assert(sizeof(Comp_radiation_C_CalcRadAmount) == 0x00003C, "Wrong size on Comp_radiation_C_CalcRadAmount");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, PointA) == 0x000000, "Member 'Comp_radiation_C_CalcRadAmount::PointA' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, PointB) == 0x00000C, "Member 'Comp_radiation_C_CalcRadAmount::PointB' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, Rad) == 0x000018, "Member 'Comp_radiation_C_CalcRadAmount::Rad' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_Vector_Distance_ReturnValue) == 0x00001C, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000028, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000030, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000034, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Comp_radiation_C_CalcRadAmount, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'Comp_radiation_C_CalcRadAmount::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

