#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Comp_zerog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass comp_zerog.comp_zerog_C
// 0x0028 (0x00D8 - 0x00B0)
class UComp_zerog_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Owner;                                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff;                                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A;                                                 // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dir;                                               // 0x00D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_comp_zerog(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"comp_zerog_C">();
	}
	static class UComp_zerog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComp_zerog_C>();
	}
};
static_assert(alignof(UComp_zerog_C) == 0x000008, "Wrong alignment on UComp_zerog_C");
static_assert(sizeof(UComp_zerog_C) == 0x0000D8, "Wrong size on UComp_zerog_C");
static_assert(offsetof(UComp_zerog_C, UberGraphFrame) == 0x0000B0, "Member 'UComp_zerog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComp_zerog_C, Owner) == 0x0000B8, "Member 'UComp_zerog_C::Owner' has a wrong offset!");
static_assert(offsetof(UComp_zerog_C, Component) == 0x0000C0, "Member 'UComp_zerog_C::Component' has a wrong offset!");
static_assert(offsetof(UComp_zerog_C, Eff) == 0x0000C8, "Member 'UComp_zerog_C::Eff' has a wrong offset!");
static_assert(offsetof(UComp_zerog_C, A) == 0x0000D0, "Member 'UComp_zerog_C::A' has a wrong offset!");
static_assert(offsetof(UComp_zerog_C, Dir) == 0x0000D4, "Member 'UComp_zerog_C::Dir' has a wrong offset!");

}

