#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Conveyor_turnR_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function conveyor_turnR_2.conveyor_turnR_2_C.ExecuteUbergraph_conveyor_turnR_2
// 0x0840 (0x0840 - 0x0000)
struct Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0118(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x0254(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0270(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_5;                             // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalRotation_SweepHitResult;  // 0x0328(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x03DC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_fuel;                                 // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0478(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_key;                                  // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x052C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x05C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x05C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_activate;                             // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x05F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67B[0x1];                                      // 0x067B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68E[0x2];                                      // 0x068E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_tryAttach_attached;                       // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x06CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD[0x3];                                      // 0x06CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x06D0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0758(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0768(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_tryAttach_attached_1;                     // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_tryAttach_attached_2;                     // 0x0775(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0776(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_777[0x1];                                      // 0x0777(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0784(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0818(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0830(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2");
static_assert(sizeof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2) == 0x000840, "Wrong size on Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, EntryPoint) == 0x000000, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_18) == 0x000008, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_mouse) == 0x000010, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_17) == 0x000018, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_key_1) == 0x000020, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_pressed) == 0x000038, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_temperature_1) == 0x00003C, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_temperature) == 0x000040, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_speed) == 0x000044, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_16) == 0x000048, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_7) == 0x000050, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_name_1) == 0x0000D8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_volume) == 0x0000E8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_15) == 0x0000F0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_location_1) == 0x0000F8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage_6) == 0x000104, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_clean_1) == 0x000108, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_14) == 0x000110, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_6) == 0x000118, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hook_1) == 0x0001A0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_clean) == 0x0001A8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_13) == 0x0001B0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hook) == 0x0001B8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_12) == 0x0001C0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_5) == 0x0001C8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_kick) == 0x000250, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_name) == 0x000254, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_11) == 0x000260, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_10) == 0x000268, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_4) == 0x000270, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage_5) == 0x0002F8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_9) == 0x000300, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_8) == 0x000308, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_7) == 0x000310, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_DeltaSeconds) == 0x000318, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_6) == 0x000320, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_K2_AddActorLocalRotation_SweepHitResult) == 0x000328, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_K2_AddActorLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_5) == 0x0003B0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage_4) == 0x0003B8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_location) == 0x0003BC, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_4) == 0x0003C8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_3) == 0x0003D0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage_3) == 0x0003D8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hot) == 0x0003DC, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_fuel) == 0x000464, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage_2) == 0x000468, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_2) == 0x000470, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_3) == 0x000478, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_key) == 0x000500, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player_1) == 0x000510, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_wheelDelta) == 0x000518, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_actor_1) == 0x000520, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage_1) == 0x000528, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_2) == 0x00052C, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_impact_1) == 0x0005B4, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_skipSetting) == 0x0005C0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_static) == 0x0005C1, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_frozen) == 0x0005C2, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_active) == 0x0005C3, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_activate) == 0x0005C4, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_water_3) == 0x0005C8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_water_2) == 0x0005D0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0005D8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0005E4, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_player) == 0x0005E8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit_1) == 0x0005F0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_action) == 0x000678, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_SwitchEnum_CmpSuccess) == 0x000679, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x00067A, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_GetComponentVelocity_ReturnValue) == 0x00067C, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_VSize_ReturnValue) == 0x000688, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00068C, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_BooleanOR_ReturnValue) == 0x00068D, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_water_1) == 0x000690, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_SelectFloat_ReturnValue) == 0x000698, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_water) == 0x0006A0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_tryAttach_attached) == 0x0006A8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_tryAttach_attached' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0006B0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0006B8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0006C0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0006C8, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_bFromSweep) == 0x0006CC, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_SweepResult) == 0x0006D0, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000758, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OtherActor) == 0x000760, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OtherComp) == 0x000768, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000770, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_tryAttach_attached_1) == 0x000774, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_tryAttach_attached_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_tryAttach_attached_2) == 0x000775, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_tryAttach_attached_2' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_Not_PreBool_ReturnValue) == 0x000776, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000778, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_FClamp_ReturnValue) == 0x00077C, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_damage) == 0x000780, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_hit) == 0x000784, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_actor) == 0x000810, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, K2Node_Event_impact) == 0x000818, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000824, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000828, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00082C, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2, CallFunc_MakeRotator_ReturnValue) == 0x000830, "Member 'Conveyor_turnR_2_C_ExecuteUbergraph_conveyor_turnR_2::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Conveyor_turnR_2_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_ImpactDamage) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_ImpactDamage");
static_assert(sizeof(Conveyor_turnR_2_C_ImpactDamage) == 0x0000A8, "Wrong size on Conveyor_turnR_2_C_ImpactDamage");
static_assert(offsetof(Conveyor_turnR_2_C_ImpactDamage, Damage) == 0x000000, "Member 'Conveyor_turnR_2_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ImpactDamage, Hit) == 0x000004, "Member 'Conveyor_turnR_2_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ImpactDamage, Actor) == 0x000090, "Member 'Conveyor_turnR_2_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ImpactDamage, Impact) == 0x000098, "Member 'Conveyor_turnR_2_C_ImpactDamage::Impact' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Conveyor_turnR_2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_turnR_2_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_EnterWater) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_EnterWater");
static_assert(sizeof(Conveyor_turnR_2_C_EnterWater) == 0x000008, "Wrong size on Conveyor_turnR_2_C_EnterWater");
static_assert(offsetof(Conveyor_turnR_2_C_EnterWater, Water) == 0x000000, "Member 'Conveyor_turnR_2_C_EnterWater::Water' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_turnR_2_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_LeaveWater) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_LeaveWater");
static_assert(sizeof(Conveyor_turnR_2_C_LeaveWater) == 0x000008, "Wrong size on Conveyor_turnR_2_C_LeaveWater");
static_assert(offsetof(Conveyor_turnR_2_C_LeaveWater, Water) == 0x000000, "Member 'Conveyor_turnR_2_C_LeaveWater::Water' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Conveyor_turnR_2_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_ActionOptionIndex");
static_assert(sizeof(Conveyor_turnR_2_C_ActionOptionIndex) == 0x000098, "Wrong size on Conveyor_turnR_2_C_ActionOptionIndex");
static_assert(offsetof(Conveyor_turnR_2_C_ActionOptionIndex, Player) == 0x000000, "Member 'Conveyor_turnR_2_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Conveyor_turnR_2_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Conveyor_turnR_2_C_ActionOptionIndex, Action) == 0x000090, "Member 'Conveyor_turnR_2_C_ActionOptionIndex::Action' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_turnR_2_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_EnterWaterOrigin");
static_assert(sizeof(Conveyor_turnR_2_C_EnterWaterOrigin) == 0x000008, "Wrong size on Conveyor_turnR_2_C_EnterWaterOrigin");
static_assert(offsetof(Conveyor_turnR_2_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Conveyor_turnR_2_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_turnR_2_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_turnR_2_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Conveyor_turnR_2_C_LeaveWaterOrigin");
static_assert(sizeof(Conveyor_turnR_2_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Conveyor_turnR_2_C_LeaveWaterOrigin");
static_assert(offsetof(Conveyor_turnR_2_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Conveyor_turnR_2_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function conveyor_turnR_2.conveyor_turnR_2_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Conveyor_turnR_2_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
