#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Conveyor_2x2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function conveyor_2x2.conveyor_2x2_C.ExecuteUbergraph_conveyor_2x2
// 0x0920 (0x0920 - 0x0000)
struct Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x0010(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_temperature_1;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0240(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x02CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_5;                             // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x03FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_fuel;                                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0498(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x052C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x05C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x064A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64B[0x1];                                      // 0x064B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x064C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x065D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65E[0x2];                                      // 0x065E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key;                                  // 0x0660(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0684(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x070C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_tryAttach_attached;                       // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0728(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0738(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0748(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x07E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC[0x4];                                      // 0x07EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x07F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0820(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x082D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x082E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82F[0x1];                                      // 0x082F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0830(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x083C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D[0x3];                                      // 0x083D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0840(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_tryAttach_attached_1;                     // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_tryAttach_attached_2;                     // 0x0871(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0872(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_873[0x1];                                      // 0x0873(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage;                               // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0878(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor;                                // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0908(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2) == 0x000010, "Wrong alignment on Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2");
static_assert(sizeof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2) == 0x000920, "Wrong size on Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, EntryPoint) == 0x000000, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_18) == 0x000008, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_key_1) == 0x000010, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_pressed) == 0x000028, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x00002C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_temperature_1) == 0x0000B4, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_temperature) == 0x0000B8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_speed) == 0x0000BC, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_17) == 0x0000C0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_7) == 0x0000C8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_name_1) == 0x000150, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_volume) == 0x000160, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_16) == 0x000168, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_location_1) == 0x000170, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage_6) == 0x00017C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_clean_1) == 0x000180, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_15) == 0x000188, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_6) == 0x000190, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hook_1) == 0x000218, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_clean) == 0x000220, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_14) == 0x000228, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hook) == 0x000230, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_13) == 0x000238, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_5) == 0x000240, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_kick) == 0x0002C8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_name) == 0x0002CC, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_12) == 0x0002D8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_11) == 0x0002E0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_4) == 0x0002E8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage_5) == 0x000370, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_10) == 0x000378, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_9) == 0x000380, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_8) == 0x000388, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_DeltaSeconds) == 0x000390, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000394, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_FClamp_ReturnValue) == 0x000398, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_7) == 0x0003A0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_mouse) == 0x0003A8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003B0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_6) == 0x0003B8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_wheelDelta) == 0x0003C0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0003C4, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_5) == 0x0003C8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_4) == 0x0003D0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage_4) == 0x0003D8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_location) == 0x0003DC, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_3) == 0x0003E8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_2) == 0x0003F0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage_3) == 0x0003F8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hot) == 0x0003FC, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_fuel) == 0x000484, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage_2) == 0x000488, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player_1) == 0x000490, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_3) == 0x000498, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000520, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00052C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0005B4, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_player) == 0x0005B8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_2) == 0x0005C0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_action) == 0x000648, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_SwitchEnum_CmpSuccess) == 0x000649, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x00064A, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_GetComponentVelocity_ReturnValue) == 0x00064C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_VSize_ReturnValue) == 0x000658, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00065C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_BooleanOR_ReturnValue) == 0x00065D, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_key) == 0x000660, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_SelectFloat_ReturnValue) == 0x000670, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_actor_1) == 0x000678, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage_1) == 0x000680, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit_1) == 0x000684, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_impact_1) == 0x00070C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_skipSetting) == 0x000718, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00071C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_tryAttach_attached) == 0x000720, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_tryAttach_attached' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000728, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000730, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000738, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000740, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_bFromSweep) == 0x000744, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_SweepResult) == 0x000748, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0007D0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OtherActor) == 0x0007D8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OtherComp) == 0x0007E0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0007E8, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_GetTransform_ReturnValue) == 0x0007F0, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_GetForwardVector_ReturnValue) == 0x000820, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_static) == 0x00082C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_frozen) == 0x00082D, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_active) == 0x00082E, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_InverseTransformDirection_ReturnValue) == 0x000830, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_activate) == 0x00083C, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000840, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_water_3) == 0x000850, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_water_2) == 0x000858, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_water_1) == 0x000860, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_water) == 0x000868, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_tryAttach_attached_1) == 0x000870, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_tryAttach_attached_1' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_tryAttach_attached_2) == 0x000871, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_tryAttach_attached_2' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, CallFunc_Not_PreBool_ReturnValue) == 0x000872, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_damage) == 0x000874, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_hit) == 0x000878, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_actor) == 0x000900, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2, K2Node_Event_impact) == 0x000908, "Member 'Conveyor_2x2_C_ExecuteUbergraph_conveyor_2x2::K2Node_Event_impact' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Conveyor_2x2_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_ImpactDamage) == 0x000008, "Wrong alignment on Conveyor_2x2_C_ImpactDamage");
static_assert(sizeof(Conveyor_2x2_C_ImpactDamage) == 0x0000A8, "Wrong size on Conveyor_2x2_C_ImpactDamage");
static_assert(offsetof(Conveyor_2x2_C_ImpactDamage, Damage) == 0x000000, "Member 'Conveyor_2x2_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ImpactDamage, Hit) == 0x000004, "Member 'Conveyor_2x2_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ImpactDamage, Actor) == 0x000090, "Member 'Conveyor_2x2_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_ImpactDamage, Impact) == 0x000098, "Member 'Conveyor_2x2_C_ImpactDamage::Impact' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_2x2_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_EnterWater) == 0x000008, "Wrong alignment on Conveyor_2x2_C_EnterWater");
static_assert(sizeof(Conveyor_2x2_C_EnterWater) == 0x000008, "Wrong size on Conveyor_2x2_C_EnterWater");
static_assert(offsetof(Conveyor_2x2_C_EnterWater, Water) == 0x000000, "Member 'Conveyor_2x2_C_EnterWater::Water' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_2x2_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_LeaveWater) == 0x000008, "Wrong alignment on Conveyor_2x2_C_LeaveWater");
static_assert(sizeof(Conveyor_2x2_C_LeaveWater) == 0x000008, "Wrong size on Conveyor_2x2_C_LeaveWater");
static_assert(offsetof(Conveyor_2x2_C_LeaveWater, Water) == 0x000000, "Member 'Conveyor_2x2_C_LeaveWater::Water' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_2x2_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Conveyor_2x2_C_EnterWaterOrigin");
static_assert(sizeof(Conveyor_2x2_C_EnterWaterOrigin) == 0x000008, "Wrong size on Conveyor_2x2_C_EnterWaterOrigin");
static_assert(offsetof(Conveyor_2x2_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Conveyor_2x2_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Conveyor_2x2_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Conveyor_2x2_C_LeaveWaterOrigin");
static_assert(sizeof(Conveyor_2x2_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Conveyor_2x2_C_LeaveWaterOrigin");
static_assert(offsetof(Conveyor_2x2_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Conveyor_2x2_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Conveyor_2x2_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Conveyor_2x2_C_Virus) == 0x000001, "Wrong alignment on Conveyor_2x2_C_Virus");
static_assert(sizeof(Conveyor_2x2_C_Virus) == 0x000001, "Wrong size on Conveyor_2x2_C_Virus");
static_assert(offsetof(Conveyor_2x2_C_Virus, Activate) == 0x000000, "Member 'Conveyor_2x2_C_Virus::Activate' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Conveyor_2x2_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Conveyor_2x2_C_SetPropProps) == 0x000001, "Wrong alignment on Conveyor_2x2_C_SetPropProps");
static_assert(sizeof(Conveyor_2x2_C_SetPropProps) == 0x000003, "Wrong size on Conveyor_2x2_C_SetPropProps");
static_assert(offsetof(Conveyor_2x2_C_SetPropProps, Static) == 0x000000, "Member 'Conveyor_2x2_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_SetPropProps, Frozen) == 0x000001, "Member 'Conveyor_2x2_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_SetPropProps, Active) == 0x000002, "Member 'Conveyor_2x2_C_SetPropProps::Active' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function conveyor_2x2.conveyor_2x2_C.BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Conveyor_2x2_C_BndEvt__conveyor_turnR_2_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
