#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cookier

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "AIModule_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "Struct_physSound_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function cookier.cookier_C.skipRadial
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_SkipRadial final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_SkipRadial) == 0x000001, "Wrong alignment on Cookier_C_SkipRadial");
static_assert(sizeof(Cookier_C_SkipRadial) == 0x000001, "Wrong size on Cookier_C_SkipRadial");
static_assert(offsetof(Cookier_C_SkipRadial, Skip) == 0x000000, "Member 'Cookier_C_SkipRadial::Skip' has a wrong offset!");

// Function cookier.cookier_C.gascanFuel
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_GascanFuel final
{
public:
	class AProp_gascan_C*                         Gascan;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fueled;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_GascanFuel) == 0x000008, "Wrong alignment on Cookier_C_GascanFuel");
static_assert(sizeof(Cookier_C_GascanFuel) == 0x000010, "Wrong size on Cookier_C_GascanFuel");
static_assert(offsetof(Cookier_C_GascanFuel, Gascan) == 0x000000, "Member 'Cookier_C_GascanFuel::Gascan' has a wrong offset!");
static_assert(offsetof(Cookier_C_GascanFuel, Fueled) == 0x000008, "Member 'Cookier_C_GascanFuel::Fueled' has a wrong offset!");

// Function cookier.cookier_C.getActionOptions
// 0x0048 (0x0048 - 0x0000)
struct Cookier_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
};
static_assert(alignof(Cookier_C_GetActionOptions) == 0x000008, "Wrong alignment on Cookier_C_GetActionOptions");
static_assert(sizeof(Cookier_C_GetActionOptions) == 0x000048, "Wrong size on Cookier_C_GetActionOptions");
static_assert(offsetof(Cookier_C_GetActionOptions, Player) == 0x000000, "Member 'Cookier_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetActionOptions, Component) == 0x000008, "Member 'Cookier_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetActionOptions, Actor) == 0x000010, "Member 'Cookier_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetActionOptions, Options) == 0x000018, "Member 'Cookier_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Cookier_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Cookier_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");

// Function cookier.cookier_C.setPath
// 0x0018 (0x0018 - 0x0000)
struct Cookier_C_SetPath final
{
public:
	TArray<struct FVector>                        Path;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_SetPath) == 0x000008, "Wrong alignment on Cookier_C_SetPath");
static_assert(sizeof(Cookier_C_SetPath) == 0x000018, "Wrong size on Cookier_C_SetPath");
static_assert(offsetof(Cookier_C_SetPath, Path) == 0x000000, "Member 'Cookier_C_SetPath::Path' has a wrong offset!");
static_assert(offsetof(Cookier_C_SetPath, Return) == 0x000010, "Member 'Cookier_C_SetPath::Return' has a wrong offset!");

// Function cookier.cookier_C.toolboxFix
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_ToolboxFix final
{
public:
	class AProp_toolbox_C*                        Toolbox;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_ToolboxFix) == 0x000008, "Wrong alignment on Cookier_C_ToolboxFix");
static_assert(sizeof(Cookier_C_ToolboxFix) == 0x000010, "Wrong size on Cookier_C_ToolboxFix");
static_assert(offsetof(Cookier_C_ToolboxFix, Toolbox) == 0x000000, "Member 'Cookier_C_ToolboxFix::Toolbox' has a wrong offset!");
static_assert(offsetof(Cookier_C_ToolboxFix, Return) == 0x000008, "Member 'Cookier_C_ToolboxFix::Return' has a wrong offset!");

// Function cookier.cookier_C.GetKey
// 0x0050 (0x0050 - 0x0000)
struct Cookier_C_GetKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_433E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x0020(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BytesToBase64Url_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_GetKey) == 0x000008, "Wrong alignment on Cookier_C_GetKey");
static_assert(sizeof(Cookier_C_GetKey) == 0x000050, "Wrong size on Cookier_C_GetKey");
static_assert(offsetof(Cookier_C_GetKey, Param_Key) == 0x000000, "Member 'Cookier_C_GetKey::Param_Key' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'Cookier_C_GetKey::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000018, "Member 'Cookier_C_GetKey::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_GenerateRandomBytes_ByteArray) == 0x000020, "Member 'Cookier_C_GetKey::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_BytesToBase64Url_ReturnValue) == 0x000030, "Member 'Cookier_C_GetKey::CallFunc_BytesToBase64Url_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'Cookier_C_GetKey::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_Array_Add_ReturnValue_1) == 0x000044, "Member 'Cookier_C_GetKey::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_Array_Find_ReturnValue) == 0x000048, "Member 'Cookier_C_GetKey::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetKey, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'Cookier_C_GetKey::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function cookier.cookier_C.canBeUsedHold
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_CanBeUsedHold final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_CanBeUsedHold) == 0x000001, "Wrong alignment on Cookier_C_CanBeUsedHold");
static_assert(sizeof(Cookier_C_CanBeUsedHold) == 0x000001, "Wrong size on Cookier_C_CanBeUsedHold");
static_assert(offsetof(Cookier_C_CanBeUsedHold, Return) == 0x000000, "Member 'Cookier_C_CanBeUsedHold::Return' has a wrong offset!");

// Function cookier.cookier_C.processKeys
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_ProcessKeys) == 0x000001, "Wrong alignment on Cookier_C_ProcessKeys");
static_assert(sizeof(Cookier_C_ProcessKeys) == 0x000001, "Wrong size on Cookier_C_ProcessKeys");
static_assert(offsetof(Cookier_C_ProcessKeys, Return) == 0x000000, "Member 'Cookier_C_ProcessKeys::Return' has a wrong offset!");

// Function cookier.cookier_C.getOnlyKey
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_GetOnlyKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_GetOnlyKey) == 0x000008, "Wrong alignment on Cookier_C_GetOnlyKey");
static_assert(sizeof(Cookier_C_GetOnlyKey) == 0x000010, "Wrong size on Cookier_C_GetOnlyKey");
static_assert(offsetof(Cookier_C_GetOnlyKey, Param_Key) == 0x000000, "Member 'Cookier_C_GetOnlyKey::Param_Key' has a wrong offset!");

// Function cookier.cookier_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on Cookier_C_IgnoreSave_trigger");
static_assert(sizeof(Cookier_C_IgnoreSave_trigger) == 0x000001, "Wrong size on Cookier_C_IgnoreSave_trigger");
static_assert(offsetof(Cookier_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'Cookier_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function cookier.cookier_C.loadTriggerData
// 0x0100 (0x0100 - 0x0000)
struct Cookier_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_433F[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_LoadTriggerData) == 0x000010, "Wrong alignment on Cookier_C_LoadTriggerData");
static_assert(sizeof(Cookier_C_LoadTriggerData) == 0x000100, "Wrong size on Cookier_C_LoadTriggerData");
static_assert(offsetof(Cookier_C_LoadTriggerData, Data) == 0x000000, "Member 'Cookier_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Cookier_C_LoadTriggerData, Return) == 0x0000F0, "Member 'Cookier_C_LoadTriggerData::Return' has a wrong offset!");
static_assert(offsetof(Cookier_C_LoadTriggerData, CallFunc_Array_Get_Item) == 0x0000F4, "Member 'Cookier_C_LoadTriggerData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Cookier_C_LoadTriggerData, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'Cookier_C_LoadTriggerData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function cookier.cookier_C.getTriggerData
// 0x0240 (0x0240 - 0x0000)
struct Cookier_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	TArray<bool>                                  K2Node_MakeArray_Array_1;                          // 0x0100(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0110(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4340[0x8];                                     // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_triggerSave                    K2Node_MakeStruct_struct_triggerSave;              // 0x0150(0x00F0)(HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_GetTriggerData) == 0x000010, "Wrong alignment on Cookier_C_GetTriggerData");
static_assert(sizeof(Cookier_C_GetTriggerData) == 0x000240, "Wrong size on Cookier_C_GetTriggerData");
static_assert(offsetof(Cookier_C_GetTriggerData, Data) == 0x000000, "Member 'Cookier_C_GetTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetTriggerData, K2Node_MakeArray_Array) == 0x0000F0, "Member 'Cookier_C_GetTriggerData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetTriggerData, K2Node_MakeArray_Array_1) == 0x000100, "Member 'Cookier_C_GetTriggerData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetTriggerData, CallFunc_GetTransform_ReturnValue) == 0x000110, "Member 'Cookier_C_GetTriggerData::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetTriggerData, CallFunc_GetObjectClass_ReturnValue) == 0x000140, "Member 'Cookier_C_GetTriggerData::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_GetTriggerData, K2Node_MakeStruct_struct_triggerSave) == 0x000150, "Member 'Cookier_C_GetTriggerData::K2Node_MakeStruct_struct_triggerSave' has a wrong offset!");

// Function cookier.cookier_C.setPoint
// 0x000C (0x000C - 0x0000)
struct Cookier_C_SetPoint final
{
public:
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_SetPoint) == 0x000004, "Wrong alignment on Cookier_C_SetPoint");
static_assert(sizeof(Cookier_C_SetPoint) == 0x00000C, "Wrong size on Cookier_C_SetPoint");
static_assert(offsetof(Cookier_C_SetPoint, CallFunc_Array_Get_Item) == 0x000000, "Member 'Cookier_C_SetPoint::CallFunc_Array_Get_Item' has a wrong offset!");

// Function cookier.cookier_C.stepOn
// 0x01A0 (0x01A0 - 0x0000)
struct Cookier_C_StepOn final
{
public:
	TArray<EObjectTypeQuery>                      A;                                                 // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4341[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4342[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4343[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      CallFunc_physSound_return;                         // 0x0160(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_StepOn) == 0x000008, "Wrong alignment on Cookier_C_StepOn");
static_assert(sizeof(Cookier_C_StepOn) == 0x0001A0, "Wrong size on Cookier_C_StepOn");
static_assert(offsetof(Cookier_C_StepOn, A) == 0x000000, "Member 'Cookier_C_StepOn::A' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, Temp_object_Variable) == 0x000010, "Member 'Cookier_C_StepOn::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, K2Node_MakeArray_Array) == 0x000020, "Member 'Cookier_C_StepOn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'Cookier_C_StepOn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'Cookier_C_StepOn::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'Cookier_C_StepOn::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_FClamp_ReturnValue) == 0x00004C, "Member 'Cookier_C_StepOn::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000050, "Member 'Cookier_C_StepOn::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0000D8, "Member 'Cookier_C_StepOn::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_bBlockingHit) == 0x0000D9, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000DA, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_Time) == 0x0000DC, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_Distance) == 0x0000E0, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_Location) == 0x0000E4, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_ImpactPoint) == 0x0000F0, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_Normal) == 0x0000FC, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_ImpactNormal) == 0x000108, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_PhysMat) == 0x000118, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_HitActor) == 0x000120, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_HitComponent) == 0x000128, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_HitBoneName) == 0x000130, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_HitItem) == 0x000138, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_ElementIndex) == 0x00013C, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_FaceIndex) == 0x000140, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_TraceStart) == 0x000144, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_BreakHitResult_TraceEnd) == 0x000150, "Member 'Cookier_C_StepOn::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Cookier_C_StepOn, CallFunc_physSound_return) == 0x000160, "Member 'Cookier_C_StepOn::CallFunc_physSound_return' has a wrong offset!");

// Function cookier.cookier_C.OnFail_F2065A824C5947295CDFD3A28F161E58
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58) == 0x000001, "Wrong alignment on Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58");
static_assert(sizeof(Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58) == 0x000001, "Wrong size on Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58");
static_assert(offsetof(Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58, MovementResult) == 0x000000, "Member 'Cookier_C_OnFail_F2065A824C5947295CDFD3A28F161E58::MovementResult' has a wrong offset!");

// Function cookier.cookier_C.OnSuccess_F2065A824C5947295CDFD3A28F161E58
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58) == 0x000001, "Wrong alignment on Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58");
static_assert(sizeof(Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58) == 0x000001, "Wrong size on Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58");
static_assert(offsetof(Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58, MovementResult) == 0x000000, "Member 'Cookier_C_OnSuccess_F2065A824C5947295CDFD3A28F161E58::MovementResult' has a wrong offset!");

// Function cookier.cookier_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Cookier_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_4344[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_ImpactDamage) == 0x000008, "Wrong alignment on Cookier_C_ImpactDamage");
static_assert(sizeof(Cookier_C_ImpactDamage) == 0x0000A8, "Wrong size on Cookier_C_ImpactDamage");
static_assert(offsetof(Cookier_C_ImpactDamage, Damage) == 0x000000, "Member 'Cookier_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Cookier_C_ImpactDamage, Hit) == 0x000004, "Member 'Cookier_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Cookier_C_ImpactDamage, Actor) == 0x000090, "Member 'Cookier_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Cookier_C_ImpactDamage, Impact) == 0x000098, "Member 'Cookier_C_ImpactDamage::Impact' has a wrong offset!");

// Function cookier.cookier_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_EnterWater) == 0x000008, "Wrong alignment on Cookier_C_EnterWater");
static_assert(sizeof(Cookier_C_EnterWater) == 0x000008, "Wrong size on Cookier_C_EnterWater");
static_assert(offsetof(Cookier_C_EnterWater, Water) == 0x000000, "Member 'Cookier_C_EnterWater::Water' has a wrong offset!");

// Function cookier.cookier_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_LeaveWater) == 0x000008, "Wrong alignment on Cookier_C_LeaveWater");
static_assert(sizeof(Cookier_C_LeaveWater) == 0x000008, "Wrong size on Cookier_C_LeaveWater");
static_assert(offsetof(Cookier_C_LeaveWater, Water) == 0x000000, "Member 'Cookier_C_LeaveWater::Water' has a wrong offset!");

// Function cookier.cookier_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Cookier_C_EnterWaterOrigin");
static_assert(sizeof(Cookier_C_EnterWaterOrigin) == 0x000008, "Wrong size on Cookier_C_EnterWaterOrigin");
static_assert(offsetof(Cookier_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Cookier_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function cookier.cookier_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Cookier_C_LeaveWaterOrigin");
static_assert(sizeof(Cookier_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Cookier_C_LeaveWaterOrigin");
static_assert(offsetof(Cookier_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Cookier_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function cookier.cookier_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_Virus) == 0x000001, "Wrong alignment on Cookier_C_Virus");
static_assert(sizeof(Cookier_C_Virus) == 0x000001, "Wrong size on Cookier_C_Virus");
static_assert(offsetof(Cookier_C_Virus, Activate) == 0x000000, "Member 'Cookier_C_Virus::Activate' has a wrong offset!");

// Function cookier.cookier_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Cookier_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_SetPropProps) == 0x000001, "Wrong alignment on Cookier_C_SetPropProps");
static_assert(sizeof(Cookier_C_SetPropProps) == 0x000003, "Wrong size on Cookier_C_SetPropProps");
static_assert(offsetof(Cookier_C_SetPropProps, Static) == 0x000000, "Member 'Cookier_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Cookier_C_SetPropProps, Frozen) == 0x000001, "Member 'Cookier_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Cookier_C_SetPropProps, Active) == 0x000002, "Member 'Cookier_C_SetPropProps::Active' has a wrong offset!");

// Function cookier.cookier_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Cookier_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_AddDamage) == 0x000008, "Wrong alignment on Cookier_C_AddDamage");
static_assert(sizeof(Cookier_C_AddDamage) == 0x0000A8, "Wrong size on Cookier_C_AddDamage");
static_assert(offsetof(Cookier_C_AddDamage, Actor) == 0x000000, "Member 'Cookier_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Cookier_C_AddDamage, Damage) == 0x000008, "Member 'Cookier_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Cookier_C_AddDamage, Hit) == 0x00000C, "Member 'Cookier_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Cookier_C_AddDamage, Impact) == 0x000094, "Member 'Cookier_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Cookier_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Cookier_C_AddDamage::SkipSetting' has a wrong offset!");

// Function cookier.cookier_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_SetKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_SetKey) == 0x000008, "Wrong alignment on Cookier_C_SetKey");
static_assert(sizeof(Cookier_C_SetKey) == 0x000010, "Wrong size on Cookier_C_SetKey");
static_assert(offsetof(Cookier_C_SetKey, Param_Key) == 0x000000, "Member 'Cookier_C_SetKey::Param_Key' has a wrong offset!");

// Function cookier.cookier_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Cookier_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Cookier_C_SteppedOn) == 0x000008, "Wrong alignment on Cookier_C_SteppedOn");
static_assert(sizeof(Cookier_C_SteppedOn) == 0x000090, "Wrong size on Cookier_C_SteppedOn");
static_assert(offsetof(Cookier_C_SteppedOn, Player) == 0x000000, "Member 'Cookier_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_SteppedOn, Hit) == 0x000008, "Member 'Cookier_C_SteppedOn::Hit' has a wrong offset!");

// Function cookier.cookier_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Cookier_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_FireDamage) == 0x000004, "Wrong alignment on Cookier_C_FireDamage");
static_assert(sizeof(Cookier_C_FireDamage) == 0x000004, "Wrong size on Cookier_C_FireDamage");
static_assert(offsetof(Cookier_C_FireDamage, Damage) == 0x000000, "Member 'Cookier_C_FireDamage::Damage' has a wrong offset!");

// Function cookier.cookier_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Cookier_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_Ignite) == 0x000004, "Wrong alignment on Cookier_C_Ignite");
static_assert(sizeof(Cookier_C_Ignite) == 0x000004, "Wrong size on Cookier_C_Ignite");
static_assert(offsetof(Cookier_C_Ignite, Fuel) == 0x000000, "Member 'Cookier_C_Ignite::Fuel' has a wrong offset!");

// Function cookier.cookier_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Cookier_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Cookier_C_ActionOptionIndex");
static_assert(sizeof(Cookier_C_ActionOptionIndex) == 0x000098, "Wrong size on Cookier_C_ActionOptionIndex");
static_assert(offsetof(Cookier_C_ActionOptionIndex, Player) == 0x000000, "Member 'Cookier_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Cookier_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Cookier_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Cookier_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Cookier_C_ActionOptionIndex, Action) == 0x000094, "Member 'Cookier_C_ActionOptionIndex::Action' has a wrong offset!");

// Function cookier.cookier_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandUse_RMB");
static_assert(sizeof(Cookier_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Cookier_C_PlayerHandUse_RMB");
static_assert(offsetof(Cookier_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Cookier_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function cookier.cookier_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandUse_LMB");
static_assert(sizeof(Cookier_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Cookier_C_PlayerHandUse_LMB");
static_assert(offsetof(Cookier_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Cookier_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function cookier.cookier_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_Exploded) == 0x000004, "Wrong alignment on Cookier_C_Exploded");
static_assert(sizeof(Cookier_C_Exploded) == 0x000010, "Wrong size on Cookier_C_Exploded");
static_assert(offsetof(Cookier_C_Exploded, Damage) == 0x000000, "Member 'Cookier_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Cookier_C_Exploded, Location) == 0x000004, "Member 'Cookier_C_Exploded::Location' has a wrong offset!");

// Function cookier.cookier_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandRelease_RMB");
static_assert(sizeof(Cookier_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Cookier_C_PlayerHandRelease_RMB");
static_assert(offsetof(Cookier_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Cookier_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function cookier.cookier_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandRelease_LMB");
static_assert(sizeof(Cookier_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Cookier_C_PlayerHandRelease_LMB");
static_assert(offsetof(Cookier_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Cookier_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function cookier.cookier_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandMouseWheel");
static_assert(sizeof(Cookier_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Cookier_C_PlayerHandMouseWheel");
static_assert(offsetof(Cookier_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Cookier_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Cookier_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function cookier.cookier_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandMouse");
static_assert(sizeof(Cookier_C_PlayerHandMouse) == 0x000010, "Wrong size on Cookier_C_PlayerHandMouse");
static_assert(offsetof(Cookier_C_PlayerHandMouse, Player) == 0x000000, "Member 'Cookier_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Cookier_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function cookier.cookier_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Cookier_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Param_Key;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Cookier_C_PlayerHandAnyKey");
static_assert(sizeof(Cookier_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Cookier_C_PlayerHandAnyKey");
static_assert(offsetof(Cookier_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Cookier_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_PlayerHandAnyKey, Param_Key) == 0x000008, "Member 'Cookier_C_PlayerHandAnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(Cookier_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Cookier_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function cookier.cookier_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Cookier_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_AddTemperature) == 0x000004, "Wrong alignment on Cookier_C_AddTemperature");
static_assert(sizeof(Cookier_C_AddTemperature) == 0x000004, "Wrong size on Cookier_C_AddTemperature");
static_assert(offsetof(Cookier_C_AddTemperature, Temperature) == 0x000000, "Member 'Cookier_C_AddTemperature::Temperature' has a wrong offset!");

// Function cookier.cookier_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Cookier_C_AccumulateTemperature");
static_assert(sizeof(Cookier_C_AccumulateTemperature) == 0x000008, "Wrong size on Cookier_C_AccumulateTemperature");
static_assert(offsetof(Cookier_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Cookier_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Cookier_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Cookier_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function cookier.cookier_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Cookier_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_ActionName) == 0x000008, "Wrong alignment on Cookier_C_ActionName");
static_assert(sizeof(Cookier_C_ActionName) == 0x0000A0, "Wrong size on Cookier_C_ActionName");
static_assert(offsetof(Cookier_C_ActionName, Player) == 0x000000, "Member 'Cookier_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_ActionName, Hit) == 0x000008, "Member 'Cookier_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Cookier_C_ActionName, Param_Name) == 0x000090, "Member 'Cookier_C_ActionName::Param_Name' has a wrong offset!");

// Function cookier.cookier_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Cookier_C_Stepped final
{
public:
	float                                         Param_Volume;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_Stepped) == 0x000004, "Wrong alignment on Cookier_C_Stepped");
static_assert(sizeof(Cookier_C_Stepped) == 0x000004, "Wrong size on Cookier_C_Stepped");
static_assert(offsetof(Cookier_C_Stepped, Param_Volume) == 0x000000, "Member 'Cookier_C_Stepped::Param_Volume' has a wrong offset!");

// Function cookier.cookier_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_PlayerLookAway) == 0x000008, "Wrong alignment on Cookier_C_PlayerLookAway");
static_assert(sizeof(Cookier_C_PlayerLookAway) == 0x000008, "Wrong size on Cookier_C_PlayerLookAway");
static_assert(offsetof(Cookier_C_PlayerLookAway, Player) == 0x000000, "Member 'Cookier_C_PlayerLookAway::Player' has a wrong offset!");

// Function cookier.cookier_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Cookier_C_ReachedByExplosion");
static_assert(sizeof(Cookier_C_ReachedByExplosion) == 0x000010, "Wrong size on Cookier_C_ReachedByExplosion");
static_assert(offsetof(Cookier_C_ReachedByExplosion, Location) == 0x000000, "Member 'Cookier_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Cookier_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Cookier_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function cookier.cookier_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_Slice) == 0x000001, "Wrong alignment on Cookier_C_Slice");
static_assert(sizeof(Cookier_C_Slice) == 0x000001, "Wrong size on Cookier_C_Slice");
static_assert(offsetof(Cookier_C_Slice, Clean) == 0x000000, "Member 'Cookier_C_Slice::Clean' has a wrong offset!");

// Function cookier.cookier_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Cookier_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Cookier_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Cookier_C_PlayerUsedOn");
static_assert(sizeof(Cookier_C_PlayerUsedOn) == 0x000090, "Wrong size on Cookier_C_PlayerUsedOn");
static_assert(offsetof(Cookier_C_PlayerUsedOn, Player) == 0x000000, "Member 'Cookier_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Cookier_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Cookier_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function cookier.cookier_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Cookier_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_Hooked) == 0x000008, "Wrong alignment on Cookier_C_Hooked");
static_assert(sizeof(Cookier_C_Hooked) == 0x000008, "Wrong size on Cookier_C_Hooked");
static_assert(offsetof(Cookier_C_Hooked, Hook) == 0x000000, "Member 'Cookier_C_Hooked::Hook' has a wrong offset!");

// Function cookier.cookier_C.set_ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Cookier_C_Set_ignoreSave_trigger final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Cookier_C_Set_ignoreSave_trigger) == 0x000001, "Wrong alignment on Cookier_C_Set_ignoreSave_trigger");
static_assert(sizeof(Cookier_C_Set_ignoreSave_trigger) == 0x000001, "Wrong size on Cookier_C_Set_ignoreSave_trigger");
static_assert(offsetof(Cookier_C_Set_ignoreSave_trigger, NewParam) == 0x000000, "Member 'Cookier_C_Set_ignoreSave_trigger::NewParam' has a wrong offset!");

// Function cookier.cookier_C.cordPlugged
// 0x0010 (0x0010 - 0x0000)
struct Cookier_C_CordPlugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Cookier_C_CordPlugged) == 0x000008, "Wrong alignment on Cookier_C_CordPlugged");
static_assert(sizeof(Cookier_C_CordPlugged) == 0x000010, "Wrong size on Cookier_C_CordPlugged");
static_assert(offsetof(Cookier_C_CordPlugged, Cord) == 0x000000, "Member 'Cookier_C_CordPlugged::Cord' has a wrong offset!");
static_assert(offsetof(Cookier_C_CordPlugged, Socket) == 0x000008, "Member 'Cookier_C_CordPlugged::Socket' has a wrong offset!");

// Function cookier.cookier_C.cordUnplugged
// 0x0010 (0x0010 - 0x0000)
