#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWall_unfinished

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_physSound_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function customWall_unfinished.customWall_unfinished_C.ExecuteUbergraph_customWall_unfinished
// 0x01A8 (0x01A8 - 0x0000)
struct CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_component;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x00D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_findMat_return;                           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_customWall_material_material;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_drop;                 // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_requirement;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished");
static_assert(sizeof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished) == 0x0001A8, "Wrong size on CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, EntryPoint) == 0x000000, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000014, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_Event_component) == 0x000018, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, Temp_int_Variable) == 0x000020, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000028, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_ComponentBoundEvent_OtherActor) == 0x000030, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_ComponentBoundEvent_OtherComp) == 0x000038, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000040, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_Event_damage) == 0x0000D0, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_Event_hit) == 0x0000D4, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_Event_actor) == 0x000160, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_Event_impact) == 0x000168, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_DynamicCast_AsProp) == 0x000178, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_findMat_return) == 0x000181, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_findMat_return' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_Less_IntInt_ReturnValue) == 0x000182, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_customWall_material_material) == 0x000188, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_customWall_material_material' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_customWall_material_drop) == 0x000190, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_customWall_material_drop' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_customWall_material_requirement) == 0x000198, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_customWall_material_requirement' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001A0, "Member 'CustomWall_unfinished_C_ExecuteUbergraph_customWall_unfinished::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'CustomWall_unfinished_C_BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.impactSquishCPP
// 0x0008 (0x0008 - 0x0000)
struct CustomWall_unfinished_C_ImpactSquishCPP final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_ImpactSquishCPP) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_ImpactSquishCPP");
static_assert(sizeof(CustomWall_unfinished_C_ImpactSquishCPP) == 0x000008, "Wrong size on CustomWall_unfinished_C_ImpactSquishCPP");
static_assert(offsetof(CustomWall_unfinished_C_ImpactSquishCPP, Component) == 0x000000, "Member 'CustomWall_unfinished_C_ImpactSquishCPP::Component' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.impactDamageCPP
// 0x00A8 (0x00A8 - 0x0000)
struct CustomWall_unfinished_C_ImpactDamageCPP final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_ImpactDamageCPP) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_ImpactDamageCPP");
static_assert(sizeof(CustomWall_unfinished_C_ImpactDamageCPP) == 0x0000A8, "Wrong size on CustomWall_unfinished_C_ImpactDamageCPP");
static_assert(offsetof(CustomWall_unfinished_C_ImpactDamageCPP, Damage) == 0x000000, "Member 'CustomWall_unfinished_C_ImpactDamageCPP::Damage' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ImpactDamageCPP, Hit) == 0x000004, "Member 'CustomWall_unfinished_C_ImpactDamageCPP::Hit' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ImpactDamageCPP, Actor) == 0x000090, "Member 'CustomWall_unfinished_C_ImpactDamageCPP::Actor' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_ImpactDamageCPP, Impact) == 0x000098, "Member 'CustomWall_unfinished_C_ImpactDamageCPP::Impact' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.Msg
// 0x00A8 (0x00A8 - 0x0000)
struct CustomWall_unfinished_C_Msg final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(CustomWall_unfinished_C_Msg) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_Msg");
static_assert(sizeof(CustomWall_unfinished_C_Msg) == 0x0000A8, "Wrong size on CustomWall_unfinished_C_Msg");
static_assert(offsetof(CustomWall_unfinished_C_Msg, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'CustomWall_unfinished_C_Msg::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Msg, K2Node_MakeStruct_FormatArgumentData_1) == 0x000040, "Member 'CustomWall_unfinished_C_Msg::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Msg, K2Node_MakeArray_Array) == 0x000080, "Member 'CustomWall_unfinished_C_Msg::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Msg, CallFunc_Format_ReturnValue) == 0x000090, "Member 'CustomWall_unfinished_C_Msg::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.upd
// 0x0198 (0x0198 - 0x0000)
struct CustomWall_unfinished_C_Upd final
{
public:
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CustomWall_unfinished_C_Upd) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_Upd");
static_assert(sizeof(CustomWall_unfinished_C_Upd) == 0x000198, "Wrong size on CustomWall_unfinished_C_Upd");
static_assert(offsetof(CustomWall_unfinished_C_Upd, Temp_byte_Variable) == 0x000000, "Member 'CustomWall_unfinished_C_Upd::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000001, "Member 'CustomWall_unfinished_C_Upd::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, Temp_byte_Variable_1) == 0x000002, "Member 'CustomWall_unfinished_C_Upd::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'CustomWall_unfinished_C_Upd::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, Temp_bool_Variable) == 0x000048, "Member 'CustomWall_unfinished_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, K2Node_MakeStruct_FormatArgumentData_1) == 0x000050, "Member 'CustomWall_unfinished_C_Upd::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, K2Node_MakeArray_Array) == 0x000090, "Member 'CustomWall_unfinished_C_Upd::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A0, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, K2Node_Select_Default) == 0x0000C0, "Member 'CustomWall_unfinished_C_Upd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C4, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000C8, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000CC, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Lerp_ReturnValue) == 0x0000D0, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_MakeVector_ReturnValue) == 0x0000D4, "Member 'CustomWall_unfinished_C_Upd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'CustomWall_unfinished_C_Upd::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_MakeVector_ReturnValue_1) == 0x0000E4, "Member 'CustomWall_unfinished_C_Upd::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_SelectFloat_ReturnValue) == 0x0000F0, "Member 'CustomWall_unfinished_C_Upd::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_SelectVector_ReturnValue) == 0x0000F4, "Member 'CustomWall_unfinished_C_Upd::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_Lerp_ReturnValue_1) == 0x000100, "Member 'CustomWall_unfinished_C_Upd::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_MakeVector_ReturnValue_2) == 0x000104, "Member 'CustomWall_unfinished_C_Upd::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Upd, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000110, "Member 'CustomWall_unfinished_C_Upd::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.buildWall
// 0x0050 (0x0050 - 0x0000)
struct CustomWall_unfinished_C_buildWall final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomWall_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_buildWall) == 0x000010, "Wrong alignment on CustomWall_unfinished_C_buildWall");
static_assert(sizeof(CustomWall_unfinished_C_buildWall) == 0x000050, "Wrong size on CustomWall_unfinished_C_buildWall");
static_assert(offsetof(CustomWall_unfinished_C_buildWall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'CustomWall_unfinished_C_buildWall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_buildWall, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'CustomWall_unfinished_C_buildWall::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_buildWall, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'CustomWall_unfinished_C_buildWall::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_buildWall, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'CustomWall_unfinished_C_buildWall::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.setShape
// 0x0028 (0x0028 - 0x0000)
struct CustomWall_unfinished_C_SetShape final
{
public:
	class UMaterialInterface*                     CallFunc_customWall_material_material;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_drop;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_requirement;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_customWall_shape_shape;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWall_unfinished_C_SetShape) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_SetShape");
static_assert(sizeof(CustomWall_unfinished_C_SetShape) == 0x000028, "Wrong size on CustomWall_unfinished_C_SetShape");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_customWall_material_material) == 0x000000, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_customWall_material_material' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_customWall_material_drop) == 0x000008, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_customWall_material_drop' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_customWall_material_requirement) == 0x000010, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_customWall_material_requirement' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_customWall_shape_shape) == 0x000018, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_customWall_shape_shape' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_SetStaticMesh_ReturnValue) == 0x000020, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000021, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_SetShape, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000022, "Member 'CustomWall_unfinished_C_SetShape::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.Init
// 0x00D0 (0x00D0 - 0x0000)
struct CustomWall_unfinished_C_Init final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UComp_nametag_C*                        CallFunc_AddComponent_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue_1;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_customWall_getBricks_ToCeil;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_2;            // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue_1;       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_Init) == 0x000010, "Wrong alignment on CustomWall_unfinished_C_Init");
static_assert(sizeof(CustomWall_unfinished_C_Init) == 0x0000D0, "Wrong size on CustomWall_unfinished_C_Init");
static_assert(offsetof(CustomWall_unfinished_C_Init, Temp_struct_Variable) == 0x000000, "Member 'CustomWall_unfinished_C_Init::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_AddComponent_ReturnValue) == 0x000030, "Member 'CustomWall_unfinished_C_Init::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, Temp_struct_Variable_1) == 0x000040, "Member 'CustomWall_unfinished_C_Init::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'CustomWall_unfinished_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_AddComponent_ReturnValue_1) == 0x000078, "Member 'CustomWall_unfinished_C_Init::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_GetActorScale3D_ReturnValue) == 0x000080, "Member 'CustomWall_unfinished_C_Init::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_customWall_getBricks_ToCeil) == 0x00008C, "Member 'CustomWall_unfinished_C_Init::CallFunc_customWall_getBricks_ToCeil' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_FCeil_ReturnValue) == 0x000090, "Member 'CustomWall_unfinished_C_Init::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000094, "Member 'CustomWall_unfinished_C_Init::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x0000A0, "Member 'CustomWall_unfinished_C_Init::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_GetActorScale3D_ReturnValue_2) == 0x0000AC, "Member 'CustomWall_unfinished_C_Init::CallFunc_GetActorScale3D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_Init, CallFunc_Subtract_VectorFloat_ReturnValue_1) == 0x0000B8, "Member 'CustomWall_unfinished_C_Init::CallFunc_Subtract_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.findMat
// 0x0038 (0x0038 - 0x0000)
struct CustomWall_unfinished_C_FindMat final
{
public:
	class FName                                   B;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_customWall_material_material;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_drop;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_customWall_material_requirement;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWall_unfinished_C_FindMat) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_FindMat");
static_assert(sizeof(CustomWall_unfinished_C_FindMat) == 0x000038, "Wrong size on CustomWall_unfinished_C_FindMat");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, B) == 0x000000, "Member 'CustomWall_unfinished_C_FindMat::B' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, Return) == 0x000008, "Member 'CustomWall_unfinished_C_FindMat::Return' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, Temp_int_Variable) == 0x00000C, "Member 'CustomWall_unfinished_C_FindMat::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CustomWall_unfinished_C_FindMat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, CallFunc_customWall_material_material) == 0x000018, "Member 'CustomWall_unfinished_C_FindMat::CallFunc_customWall_material_material' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, CallFunc_customWall_material_drop) == 0x000020, "Member 'CustomWall_unfinished_C_FindMat::CallFunc_customWall_material_drop' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, CallFunc_customWall_material_requirement) == 0x000028, "Member 'CustomWall_unfinished_C_FindMat::CallFunc_customWall_material_requirement' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000030, "Member 'CustomWall_unfinished_C_FindMat::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_FindMat, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'CustomWall_unfinished_C_FindMat::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.getPhys
// 0x0058 (0x0058 - 0x0000)
struct CustomWall_unfinished_C_GetPhys final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_GetPhysicalMaterial_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_physSound_return;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      CallFunc_physSound_data;                           // 0x0018(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_GetPhys) == 0x000008, "Wrong alignment on CustomWall_unfinished_C_GetPhys");
static_assert(sizeof(CustomWall_unfinished_C_GetPhys) == 0x000058, "Wrong size on CustomWall_unfinished_C_GetPhys");
static_assert(offsetof(CustomWall_unfinished_C_GetPhys, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'CustomWall_unfinished_C_GetPhys::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_GetPhys, CallFunc_GetPhysicalMaterial_ReturnValue) == 0x000008, "Member 'CustomWall_unfinished_C_GetPhys::CallFunc_GetPhysicalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_GetPhys, CallFunc_physSound_return) == 0x000010, "Member 'CustomWall_unfinished_C_GetPhys::CallFunc_physSound_return' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_GetPhys, CallFunc_physSound_data) == 0x000018, "Member 'CustomWall_unfinished_C_GetPhys::CallFunc_physSound_data' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct CustomWall_unfinished_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_LoadData) == 0x000010, "Wrong alignment on CustomWall_unfinished_C_LoadData");
static_assert(sizeof(CustomWall_unfinished_C_LoadData) == 0x0000F0, "Wrong size on CustomWall_unfinished_C_LoadData");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, Data) == 0x000000, "Member 'CustomWall_unfinished_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, Return) == 0x0000C0, "Member 'CustomWall_unfinished_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'CustomWall_unfinished_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'CustomWall_unfinished_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'CustomWall_unfinished_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, CallFunc_Array_Get_Item_2) == 0x0000DC, "Member 'CustomWall_unfinished_C_LoadData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, CallFunc_Array_Get_Item_3) == 0x0000E0, "Member 'CustomWall_unfinished_C_LoadData::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_LoadData, CallFunc_Array_Get_Item_4) == 0x0000E4, "Member 'CustomWall_unfinished_C_LoadData::CallFunc_Array_Get_Item_4' has a wrong offset!");

// Function customWall_unfinished.customWall_unfinished_C.getData
// 0x0270 (0x0270 - 0x0000)
struct CustomWall_unfinished_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(CustomWall_unfinished_C_GetData) == 0x000010, "Wrong alignment on CustomWall_unfinished_C_GetData");
static_assert(sizeof(CustomWall_unfinished_C_GetData) == 0x000270, "Wrong size on CustomWall_unfinished_C_GetData");
static_assert(offsetof(CustomWall_unfinished_C_GetData, Data) == 0x000000, "Member 'CustomWall_unfinished_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'CustomWall_unfinished_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'CustomWall_unfinished_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomWall_unfinished_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'CustomWall_unfinished_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
