#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWall_unfinished

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_physSound_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass customWall_unfinished.customWall_unfinished_C
// 0x0088 (0x02D0 - 0x0248)
class ACustomWall_unfinished_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CustomWall_unfinished_C;            // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Overlap;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GhostOut;                                          // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   buildProg;                                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GhostIn;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Requirement;                                       // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         bricks;                                            // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComp_nametag_C*                        NametagComponent;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Shape;                                             // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Material;                                          // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USoundBase*                             Snd;                                               // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_physSound                      Phys;                                              // 0x0290(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_customWall_unfinished(int32 EntryPoint);
	void ReceiveDestroyed();
	void BndEvt__customWall_unfinished_overlap_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void ImpactSquishCPP(class UPrimitiveComponent* Component);
	void ImpactDamageCPP(float Damage, const struct FHitResult& Hit, class AActor* Actor, const struct FVector& Impact);
	void ExitTheWater();
	void EnteredTheWater();
	void Msg();
	void Upd();
	void buildWall();
	void SetShape();
	void Init();
	void FindMat(class FName B, bool* Return);
	void GetPhys();
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"customWall_unfinished_C">();
	}
	static class ACustomWall_unfinished_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACustomWall_unfinished_C>();
	}
};
static_assert(alignof(ACustomWall_unfinished_C) == 0x000008, "Wrong alignment on ACustomWall_unfinished_C");
static_assert(sizeof(ACustomWall_unfinished_C) == 0x0002D0, "Wrong size on ACustomWall_unfinished_C");
static_assert(offsetof(ACustomWall_unfinished_C, UberGraphFrame_CustomWall_unfinished_C) == 0x000248, "Member 'ACustomWall_unfinished_C::UberGraphFrame_CustomWall_unfinished_C' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, Overlap) == 0x000250, "Member 'ACustomWall_unfinished_C::Overlap' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, GhostOut) == 0x000258, "Member 'ACustomWall_unfinished_C::GhostOut' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, buildProg) == 0x000260, "Member 'ACustomWall_unfinished_C::buildProg' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, GhostIn) == 0x000268, "Member 'ACustomWall_unfinished_C::GhostIn' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, Requirement) == 0x000270, "Member 'ACustomWall_unfinished_C::Requirement' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, bricks) == 0x000274, "Member 'ACustomWall_unfinished_C::bricks' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, NametagComponent) == 0x000278, "Member 'ACustomWall_unfinished_C::NametagComponent' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, Shape) == 0x000280, "Member 'ACustomWall_unfinished_C::Shape' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, Material) == 0x000284, "Member 'ACustomWall_unfinished_C::Material' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, Snd) == 0x000288, "Member 'ACustomWall_unfinished_C::Snd' has a wrong offset!");
static_assert(offsetof(ACustomWall_unfinished_C, Phys) == 0x000290, "Member 'ACustomWall_unfinished_C::Phys' has a wrong offset!");

}

