#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Darkrock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass darkrock.darkrock_C
// 0x0038 (0x0258 - 0x0220)
class ADarkrock_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPnormal_C*                             Pnormal;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rend;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CanAppear;                                         // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Appeared;                                          // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_darkrock(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"darkrock_C">();
	}
	static class ADarkrock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkrock_C>();
	}
};
static_assert(alignof(ADarkrock_C) == 0x000008, "Wrong alignment on ADarkrock_C");
static_assert(sizeof(ADarkrock_C) == 0x000258, "Wrong size on ADarkrock_C");
static_assert(offsetof(ADarkrock_C, UberGraphFrame) == 0x000220, "Member 'ADarkrock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, Pnormal) == 0x000228, "Member 'ADarkrock_C::Pnormal' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, Sphere) == 0x000230, "Member 'ADarkrock_C::Sphere' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, Rend) == 0x000238, "Member 'ADarkrock_C::Rend' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, StaticMesh) == 0x000240, "Member 'ADarkrock_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, DefaultSceneRoot) == 0x000248, "Member 'ADarkrock_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, CanAppear) == 0x000250, "Member 'ADarkrock_C::CanAppear' has a wrong offset!");
static_assert(offsetof(ADarkrock_C, Appeared) == 0x000251, "Member 'ADarkrock_C::Appeared' has a wrong offset!");

}

