#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Deer_ded

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function deer_ded.deer_ded_C.ExecuteUbergraph_deer_ded
// 0x03A0 (0x03A0 - 0x0000)
struct Deer_ded_C_ExecuteUbergraph_deer_ded final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC6[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC7[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC8[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC9[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DCA[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DCB[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DCC[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1DCD[0x4];                                     // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DCE[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DCF[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_GetCurrentPath_ReturnValue;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartial_ReturnValue;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD0[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0260(0x0010)(ReferenceParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0278(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD1[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD2[0x1];                                     // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD3[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Deer_ded_C_ExecuteUbergraph_deer_ded) == 0x000008, "Wrong alignment on Deer_ded_C_ExecuteUbergraph_deer_ded");
static_assert(sizeof(Deer_ded_C_ExecuteUbergraph_deer_ded) == 0x0003A0, "Wrong size on Deer_ded_C_ExecuteUbergraph_deer_ded");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, EntryPoint) == 0x000000, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::EntryPoint' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CustomEvent_MovementResult_3) == 0x000004, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CustomEvent_MovementResult_2) == 0x000018, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, Temp_byte_Variable) == 0x00002C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, Temp_object_Variable) == 0x000030, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000040, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CustomEvent_MovementResult_1) == 0x000054, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CustomEvent_MovementResult) == 0x000055, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, Temp_byte_Variable_1) == 0x000068, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_RandomFloatInRange_ReturnValue) == 0x00006C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000070, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetActorForwardVector_ReturnValue) == 0x000078, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_bBlockingHit) == 0x000084, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_bInitialOverlap) == 0x000085, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Time) == 0x000088, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Distance) == 0x00008C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Location) == 0x000090, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_ImpactPoint) == 0x00009C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Normal) == 0x0000A8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_ImpactNormal) == 0x0000B4, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_PhysMat) == 0x0000C0, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitActor) == 0x0000C8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitComponent) == 0x0000D0, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitBoneName) == 0x0000D8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitItem) == 0x0000E0, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_ElementIndex) == 0x0000E4, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_FaceIndex) == 0x0000E8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_TraceStart) == 0x0000EC, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_TraceEnd) == 0x0000F8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Cross_VectorVector_ReturnValue) == 0x000104, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000110, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000118, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000124, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000130, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x00013C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x000148, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00014C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x0001D8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E0, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_IsValid_ReturnValue) == 0x0001EC, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0001F0, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001F8, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000204, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_ClampVectorSize_ReturnValue) == 0x000210, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Add_VectorVector_ReturnValue) == 0x00021C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000228, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_CreateMoveToProxyObject_ReturnValue_1) == 0x000230, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_CreateMoveToProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_IsValid_ReturnValue_1) == 0x000238, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetController_ReturnValue) == 0x000240, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetCurrentPath_ReturnValue) == 0x000248, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetCurrentPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_IsPartial_ReturnValue) == 0x000250, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_IsPartial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000258, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_obj_statDyn_obj) == 0x000260, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000270, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000278, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000300, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_GetDistanceTo_ReturnValue) == 0x000304, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Less_FloatFloat_ReturnValue) == 0x000308, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000309, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00030A, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Time_1) == 0x00030C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Distance_1) == 0x000310, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Location_1) == 0x000314, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000320, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_Normal_1) == 0x00032C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000338, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_PhysMat_1) == 0x000348, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitActor_1) == 0x000350, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitComponent_1) == 0x000358, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitBoneName_1) == 0x000360, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_HitItem_1) == 0x000368, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_ElementIndex_1) == 0x00036C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_FaceIndex_1) == 0x000370, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_TraceStart_1) == 0x000374, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_BreakHitResult_TraceEnd_1) == 0x000380, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Vector_Distance_ReturnValue) == 0x00038C, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_getMainPlayer_AsMain_Player) == 0x000390, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Deer_ded_C_ExecuteUbergraph_deer_ded, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000398, "Member 'Deer_ded_C_ExecuteUbergraph_deer_ded::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function deer_ded.deer_ded_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Deer_ded_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deer_ded_C_ReceiveTick) == 0x000004, "Wrong alignment on Deer_ded_C_ReceiveTick");
static_assert(sizeof(Deer_ded_C_ReceiveTick) == 0x000004, "Wrong size on Deer_ded_C_ReceiveTick");
static_assert(offsetof(Deer_ded_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Deer_ded_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function deer_ded.deer_ded_C.OnSuccess_DCB43D1B433EA780BE18C7BBD401893F
// 0x0001 (0x0001 - 0x0000)
struct Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F) == 0x000001, "Wrong alignment on Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F");
static_assert(sizeof(Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F) == 0x000001, "Wrong size on Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F");
static_assert(offsetof(Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F, MovementResult) == 0x000000, "Member 'Deer_ded_C_OnSuccess_DCB43D1B433EA780BE18C7BBD401893F::MovementResult' has a wrong offset!");

// Function deer_ded.deer_ded_C.OnFail_DCB43D1B433EA780BE18C7BBD401893F
// 0x0001 (0x0001 - 0x0000)
struct Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F) == 0x000001, "Wrong alignment on Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F");
static_assert(sizeof(Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F) == 0x000001, "Wrong size on Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F");
static_assert(offsetof(Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F, MovementResult) == 0x000000, "Member 'Deer_ded_C_OnFail_DCB43D1B433EA780BE18C7BBD401893F::MovementResult' has a wrong offset!");

// Function deer_ded.deer_ded_C.OnSuccess_0986349A439BCCE82A54A0840411644B
// 0x0001 (0x0001 - 0x0000)
struct Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B) == 0x000001, "Wrong alignment on Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B");
static_assert(sizeof(Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B) == 0x000001, "Wrong size on Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B");
static_assert(offsetof(Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B, MovementResult) == 0x000000, "Member 'Deer_ded_C_OnSuccess_0986349A439BCCE82A54A0840411644B::MovementResult' has a wrong offset!");

// Function deer_ded.deer_ded_C.OnFail_0986349A439BCCE82A54A0840411644B
// 0x0001 (0x0001 - 0x0000)
struct Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B) == 0x000001, "Wrong alignment on Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B");
static_assert(sizeof(Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B) == 0x000001, "Wrong size on Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B");
static_assert(offsetof(Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B, MovementResult) == 0x000000, "Member 'Deer_ded_C_OnFail_0986349A439BCCE82A54A0840411644B::MovementResult' has a wrong offset!");

}

