#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Deer_ded

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "Deer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass deer_ded.deer_ded_C
// 0x0020 (0x0530 - 0x0510)
class ADeer_ded_C final : public ADeer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Deer_ded_C;                         // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_a_190A342749EEDB8749136080BC0C5017;     // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_190A342749EEDB8749136080BC0C5017; // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Walkr;                                             // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Dmg;                                               // 0x0529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_deer_ded(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnSuccess_DCB43D1B433EA780BE18C7BBD401893F(EPathFollowingResult MovementResult);
	void OnFail_DCB43D1B433EA780BE18C7BBD401893F(EPathFollowingResult MovementResult);
	void OnSuccess_0986349A439BCCE82A54A0840411644B(EPathFollowingResult MovementResult);
	void OnFail_0986349A439BCCE82A54A0840411644B(EPathFollowingResult MovementResult);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"deer_ded_C">();
	}
	static class ADeer_ded_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeer_ded_C>();
	}
};
static_assert(alignof(ADeer_ded_C) == 0x000010, "Wrong alignment on ADeer_ded_C");
static_assert(sizeof(ADeer_ded_C) == 0x000530, "Wrong size on ADeer_ded_C");
static_assert(offsetof(ADeer_ded_C, UberGraphFrame_Deer_ded_C) == 0x000510, "Member 'ADeer_ded_C::UberGraphFrame_Deer_ded_C' has a wrong offset!");
static_assert(offsetof(ADeer_ded_C, Timeline_0_a_190A342749EEDB8749136080BC0C5017) == 0x000518, "Member 'ADeer_ded_C::Timeline_0_a_190A342749EEDB8749136080BC0C5017' has a wrong offset!");
static_assert(offsetof(ADeer_ded_C, Timeline_0__Direction_190A342749EEDB8749136080BC0C5017) == 0x00051C, "Member 'ADeer_ded_C::Timeline_0__Direction_190A342749EEDB8749136080BC0C5017' has a wrong offset!");
static_assert(offsetof(ADeer_ded_C, Timeline_0) == 0x000520, "Member 'ADeer_ded_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ADeer_ded_C, Walkr) == 0x000528, "Member 'ADeer_ded_C::Walkr' has a wrong offset!");
static_assert(offsetof(ADeer_ded_C, Dmg) == 0x000529, "Member 'ADeer_ded_C::Dmg' has a wrong offset!");

}

