#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeerSk_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass deerSk_Skeleton_AnimBlueprint.deerSk_Skeleton_AnimBlueprint_C
// 0x03E0 (0x06A0 - 0x02C0)
class UDeerSk_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_21B9[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x02C8(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0420(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0468(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0490(0x00C0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0550(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0638(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0660(0x0030)()
	float                                         Alpha;                                             // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21BA[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Pawn;                                              // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_88F64C30459431425F52D2B253327D51();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"deerSk_Skeleton_AnimBlueprint_C">();
	}
	static class UDeerSk_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeerSk_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UDeerSk_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UDeerSk_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UDeerSk_Skeleton_AnimBlueprint_C) == 0x0006A0, "Wrong size on UDeerSk_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0002C8, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000420, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x000468, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x000490, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x000550, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000638, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000660, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, Alpha) == 0x000690, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::Alpha' has a wrong offset!");
static_assert(offsetof(UDeerSk_Skeleton_AnimBlueprint_C, Pawn) == 0x000698, "Member 'UDeerSk_Skeleton_AnimBlueprint_C::Pawn' has a wrong offset!");

}

