#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeerSk_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function deerSk_Skeleton_AnimBlueprint.deerSk_Skeleton_AnimBlueprint_C.ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint
// 0x0048 (0x0048 - 0x0000)
struct DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint");
static_assert(sizeof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint) == 0x000048, "Wrong size on DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_GetMovementComponent_ReturnValue) == 0x000020, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x000028, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_GetMaxSpeed_ReturnValue) == 0x000034, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_VSize_ReturnValue) == 0x000038, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000040, "Member 'DeerSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerSk_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function deerSk_Skeleton_AnimBlueprint.deerSk_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'DeerSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function deerSk_Skeleton_AnimBlueprint.deerSk_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct DeerSk_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DeerSk_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on DeerSk_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(DeerSk_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on DeerSk_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(DeerSk_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'DeerSk_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

