#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Deer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass deer.deer_C
// 0x0050 (0x0510 - 0x04C0)
class ADeer_C : public ACharacter
{
public:
	uint8                                         Pad_21BD[0x8];                                     // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPnormal_C*                             Pnormal;                                           // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadarPointComponent_C*                 RadarPoint;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Root;                                              // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         D_a_3F010BB341E44AAC5F403FA869BF6B7B;              // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            D__Direction_3F010BB341E44AAC5F403FA869BF6B7B;     // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21BE[0x3];                                     // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     D;                                                 // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Diss;                                              // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_deer(int32 EntryPoint);
	void Disappear();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnCompleted_2B335E8D47F780E7A147A08168D3E410(class FName NotifyName);
	void OnBlendOut_2B335E8D47F780E7A147A08168D3E410(class FName NotifyName);
	void OnInterrupted_2B335E8D47F780E7A147A08168D3E410(class FName NotifyName);
	void OnNotifyBegin_2B335E8D47F780E7A147A08168D3E410(class FName NotifyName);
	void OnNotifyEnd_2B335E8D47F780E7A147A08168D3E410(class FName NotifyName);
	void OnSuccess_75A9BA0E4DB0CE711F734395D44D4C89(EPathFollowingResult MovementResult);
	void OnFail_75A9BA0E4DB0CE711F734395D44D4C89(EPathFollowingResult MovementResult);
	void D__UpdateFunc();
	void D__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"deer_C">();
	}
	static class ADeer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeer_C>();
	}
};
static_assert(alignof(ADeer_C) == 0x000010, "Wrong alignment on ADeer_C");
static_assert(sizeof(ADeer_C) == 0x000510, "Wrong size on ADeer_C");
static_assert(offsetof(ADeer_C, UberGraphFrame) == 0x0004C0, "Member 'ADeer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADeer_C, Pnormal) == 0x0004C8, "Member 'ADeer_C::Pnormal' has a wrong offset!");
static_assert(offsetof(ADeer_C, RadarPoint) == 0x0004D0, "Member 'ADeer_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(ADeer_C, Root) == 0x0004D8, "Member 'ADeer_C::Root' has a wrong offset!");
static_assert(offsetof(ADeer_C, SpringArm) == 0x0004E0, "Member 'ADeer_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ADeer_C, SkeletalMesh) == 0x0004E8, "Member 'ADeer_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ADeer_C, D_a_3F010BB341E44AAC5F403FA869BF6B7B) == 0x0004F0, "Member 'ADeer_C::D_a_3F010BB341E44AAC5F403FA869BF6B7B' has a wrong offset!");
static_assert(offsetof(ADeer_C, D__Direction_3F010BB341E44AAC5F403FA869BF6B7B) == 0x0004F4, "Member 'ADeer_C::D__Direction_3F010BB341E44AAC5F403FA869BF6B7B' has a wrong offset!");
static_assert(offsetof(ADeer_C, D) == 0x0004F8, "Member 'ADeer_C::D' has a wrong offset!");
static_assert(offsetof(ADeer_C, Dynmat) == 0x000500, "Member 'ADeer_C::Dynmat' has a wrong offset!");
static_assert(offsetof(ADeer_C, Diss) == 0x000508, "Member 'ADeer_C::Diss' has a wrong offset!");

}

