#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeerZombSk_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function deerZombSk_Skeleton_AnimBlueprint.deerZombSk_Skeleton_AnimBlueprint_C.ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint
// 0x0060 (0x0060 - 0x0000)
struct DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint");
static_assert(sizeof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint) == 0x000060, "Wrong size on DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000008, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x00000C, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x000024, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_VSize_ReturnValue) == 0x000030, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_GetOwningComponent_ReturnValue) == 0x000038, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000044, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000048, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function deerZombSk_Skeleton_AnimBlueprint.deerZombSk_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function deerZombSk_Skeleton_AnimBlueprint.deerZombSk_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'DeerZombSk_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

