#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeerZombSk_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass deerZombSk_Skeleton_AnimBlueprint.deerZombSk_Skeleton_AnimBlueprint_C
// 0x0820 (0x0AE0 - 0x02C0)
class UDeerZombSk_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x02C8(0x0158)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0420(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0508(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0530(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0560(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0580(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x05A0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0750(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0900(0x01B0)()
	float                                         Alpha;                                             // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB4[0x4];                                      // 0x0AB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Pawn;                                              // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAt;                                            // 0x0AC0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               R;                                                 // 0x0ACC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 Sk;                                                // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_D4D0F2D44C4D3F0C3B7EE0B86102EC7B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_C7BC34F14589E8DAA33492B31C09B2A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_5A0798564F4C7A21BF8673A775A23574();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_deerZombSk_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_34FBD9344EF4D7F3863AD1A0D8B56A66();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"deerZombSk_Skeleton_AnimBlueprint_C">();
	}
	static class UDeerZombSk_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeerZombSk_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UDeerZombSk_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UDeerZombSk_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UDeerZombSk_Skeleton_AnimBlueprint_C) == 0x000AE0, "Wrong size on UDeerZombSk_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0002C8, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x000420, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000508, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000530, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000560, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000580, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_2) == 0x0005A0, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x000750, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000900, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, Alpha) == 0x000AB0, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::Alpha' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, Pawn) == 0x000AB8, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::Pawn' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, LookAt) == 0x000AC0, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::LookAt' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, R) == 0x000ACC, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::R' has a wrong offset!");
static_assert(offsetof(UDeerZombSk_Skeleton_AnimBlueprint_C, Sk) == 0x000AD8, "Member 'UDeerZombSk_Skeleton_AnimBlueprint_C::Sk' has a wrong offset!");

}

