#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DigcamMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function digcamMaster.digcamMaster_C.ExecuteUbergraph_digcamMaster
// 0x0020 (0x0020 - 0x0000)
struct DigcamMaster_C_ExecuteUbergraph_digcamMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F8D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(DigcamMaster_C_ExecuteUbergraph_digcamMaster) == 0x000008, "Wrong alignment on DigcamMaster_C_ExecuteUbergraph_digcamMaster");
static_assert(sizeof(DigcamMaster_C_ExecuteUbergraph_digcamMaster) == 0x000020, "Wrong size on DigcamMaster_C_ExecuteUbergraph_digcamMaster");
static_assert(offsetof(DigcamMaster_C_ExecuteUbergraph_digcamMaster, EntryPoint) == 0x000000, "Member 'DigcamMaster_C_ExecuteUbergraph_digcamMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(DigcamMaster_C_ExecuteUbergraph_digcamMaster, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'DigcamMaster_C_ExecuteUbergraph_digcamMaster::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DigcamMaster_C_ExecuteUbergraph_digcamMaster, K2Node_MakeStruct_WeightedBlendable) == 0x000010, "Member 'DigcamMaster_C_ExecuteUbergraph_digcamMaster::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");

}

