#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dirthole

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "Struct_mString_structs.hpp"


namespace SDK::Params
{

// Function dirthole.dirthole_C.ExecuteUbergraph_dirthole
// 0x0D30 (0x0D30 - 0x0000)
struct Dirthole_C_ExecuteUbergraph_dirthole final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x0244(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0328(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0358(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0420(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x04D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x055C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0578(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0630(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0640(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_651[0x3];                                      // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0660(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirthole_item_C*                       K2Node_DynamicCast_AsDirthole_Item;                // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x06A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x06C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x06D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x06F0(0x00C0)(HasGetValueTypeHash)
	struct FStruct_mString                        CallFunc_Array_Get_Item_1;                         // 0x07B0(0x0010)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x07D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x07E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E2[0x6];                                      // 0x07E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x07E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x07F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0804(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_805[0x3];                                      // 0x0805(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0808(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891[0x3];                                      // 0x0891(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x0894(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x08C0(0x0080)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0940(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_951[0x7];                                      // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_garbageClump_C*                   K2Node_DynamicCast_AsProp_Garbage_Clump;           // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0961(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_962[0x6];                                      // 0x0962(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsProp_Dirtball;           // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_979[0x3];                                      // 0x0979(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x097C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981[0x3];                                      // 0x0981(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0984(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x098C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0999(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99A[0x2];                                      // 0x099A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x099C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x09A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main_1;                  // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x09B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A41[0x3];                                      // 0x0A41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0A44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0A48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0A4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4D[0x3];                                      // 0x0A4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0A50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0x4];                                      // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0A60(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0AE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0AE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AEA[0x6];                                      // 0x0AEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1_1;                 // 0x0AF0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B01[0xF];                                      // 0x0B01(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data_1;                           // 0x0B10(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_filterItems_blocked;                      // 0x0BD1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD2[0x6];                                      // 0x0BD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_dirtball_C*                       K2Node_DynamicCast_AsProp_Dirtball;                // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE1[0x3];                                      // 0x0BE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0BE4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_trigger_obj;                          // 0x0BF0(0x0010)(ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0C00(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0C10(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x0C20(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C31[0x3];                                      // 0x0C31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0C34(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0C40(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_rune_1_C*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0C89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C8A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C8B[0x1];                                      // 0x0C8B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0C90(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9C[0x4];                                      // 0x0C9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0CA0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0CD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0CE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0CE8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0D00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0D08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0D20(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Dirthole_C_ExecuteUbergraph_dirthole) == 0x000010, "Wrong alignment on Dirthole_C_ExecuteUbergraph_dirthole");
static_assert(sizeof(Dirthole_C_ExecuteUbergraph_dirthole) == 0x000D30, "Wrong size on Dirthole_C_ExecuteUbergraph_dirthole");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, EntryPoint) == 0x000000, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_getMainSave_save_main) == 0x000008, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_object_Variable) == 0x000010, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable) == 0x000020, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_6) == 0x000024, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_7) == 0x000028, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_actor_1) == 0x0000B0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_impact_1) == 0x0000B8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water_3) == 0x0000C8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water_2) == 0x0000D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water_1) == 0x0000D8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water) == 0x0000E0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_activate) == 0x0000E8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_static) == 0x0000E9, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_frozen) == 0x0000EA, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_active) == 0x0000EB, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_actor) == 0x0000F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_5) == 0x0000F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_6) == 0x0000FC, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_impact) == 0x000184, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_skipSetting) == 0x000190, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_key_1) == 0x000198, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_18) == 0x0001A8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_5) == 0x0001B0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_4) == 0x000238, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_fuel) == 0x00023C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_3) == 0x000240, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hot) == 0x000244, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_17) == 0x0002D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_16) == 0x0002D8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_2) == 0x0002E0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_location_1) == 0x0002E4, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_15) == 0x0002F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_14) == 0x0002F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_13) == 0x000300, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_wheelDelta) == 0x000308, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_12) == 0x000310, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_mouse) == 0x000318, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_11) == 0x000320, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_key) == 0x000328, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_pressed) == 0x000340, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_temperature_1) == 0x000344, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_temperature) == 0x000348, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_speed) == 0x00034C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_10) == 0x000350, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_4) == 0x000358, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_name_1) == 0x0003E0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_volume) == 0x0003F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_9) == 0x0003F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_location) == 0x000400, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_1) == 0x00040C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_clean_1) == 0x000410, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_8) == 0x000418, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_3) == 0x000420, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hook_1) == 0x0004A8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_clean) == 0x0004B0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_7) == 0x0004B8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hook) == 0x0004C0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_6) == 0x0004C8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_2) == 0x0004D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_kick) == 0x000558, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_name) == 0x00055C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_5) == 0x000568, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_4) == 0x000570, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_1) == 0x000578, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage) == 0x000600, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_3) == 0x000608, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_2) == 0x000610, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_1) == 0x000618, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000620, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_MakeArray_Array) == 0x000630, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_SphereOverlapActors_OutActors) == 0x000640, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_SphereOverlapActors_ReturnValue) == 0x000650, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000654, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_MakeTransform_ReturnValue) == 0x000660, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Array_Get_Item) == 0x000690, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsDirthole_Item) == 0x000698, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsDirthole_Item' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess) == 0x0006A0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Objects) == 0x0006A8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_1) == 0x0006B8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Objects_1) == 0x0006C0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_2) == 0x0006D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Save_1) == 0x0006D8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Save_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_3) == 0x0006E8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_getData_data) == 0x0006F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Array_Get_Item_1) == 0x0007B0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0007C0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_FinishSpawningActor_ReturnValue) == 0x0007C8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Array_Get_Item_2) == 0x0007D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_IsValidClass_ReturnValue) == 0x0007E0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x0007E1, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0007E8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OtherActor) == 0x0007F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OtherComp) == 0x0007F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000800, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_bFromSweep) == 0x000804, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_SweepResult) == 0x000808, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_ReturnValue) == 0x000890, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_foodData) == 0x000894, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_object) == 0x0008B0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_isFood) == 0x0008B8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_propData) == 0x0008C0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_GetDisplayName_ReturnValue) == 0x000940, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_IsValidClass_ReturnValue_1) == 0x000950, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsProp_Garbage_Clump) == 0x000958, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsProp_Garbage_Clump' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_4) == 0x000960, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000961, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_GetObjectClass_ReturnValue) == 0x000968, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ClassDynamicCast_AsProp_Dirtball) == 0x000970, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ClassDynamicCast_AsProp_Dirtball' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ClassDynamicCast_bSuccess) == 0x000978, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable_1) == 0x00097C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000980, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Add_IntInt_ReturnValue) == 0x000984, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable_2) == 0x000988, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00098C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000998, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000999, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Add_IntInt_ReturnValue_1) == 0x00099C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0009A0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
