#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dirthole

#include "Basic.hpp"

#include "Struct_food1_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_mString_structs.hpp"


namespace SDK::Params
{

// Function dirthole.dirthole_C.ExecuteUbergraph_dirthole
// 0x0C40 (0x0C40 - 0x0000)
struct Dirthole_C_ExecuteUbergraph_dirthole final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3417[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3418[0xC];                                     // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3419[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x008C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_341A[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341B[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341C[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0164(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341D[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0218(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341E[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0300(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341F[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0330(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3420[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3421[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x03F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0490(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3422[0x3];                                     // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x051C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3423[0x4];                                     // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0538(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3424[0x4];                                     // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x05D0(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x05E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3425[0x3];                                     // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x05F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0600(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirthole_item_C*                       K2Node_DynamicCast_AsDirthole_Item;                // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3426[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3427[0x7];                                     // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0660(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3428[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3429[0x7];                                     // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0690(0x00C0)(HasGetValueTypeHash)
	struct FStruct_mString                        CallFunc_Array_Get_Item_1;                         // 0x0750(0x0010)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0770(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342A[0x6];                                     // 0x0782(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0788(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0798(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342B[0x3];                                     // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x07A8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsProp_Dirtball;           // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0841(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342C[0x2];                                     // 0x0842(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x0844(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342D[0x4];                                     // 0x085C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342E[0x7];                                     // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0870(0x0080)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342F[0x7];                                     // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0908(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3430[0x7];                                     // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x092C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3431[0x3];                                     // 0x092D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0938(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0944(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0945(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3432[0x2];                                     // 0x0946(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x094C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0960(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x09E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3433[0x3];                                     // 0x09E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x09EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3434[0x3];                                     // 0x09F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x09F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3435[0x4];                                     // 0x09FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0A08(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0A90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0A94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0A95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3436[0x2];                                     // 0x0A96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1_1;                 // 0x0A98(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0AA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3437[0x7];                                     // 0x0AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data_1;                           // 0x0AB0(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0B70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3438[0x7];                                     // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_dirtball_C*                       K2Node_DynamicCast_AsProp_Dirtball;                // 0x0B78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3439[0x7];                                     // 0x0B81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_shovel_C*                         K2Node_DynamicCast_AsProp_Shovel;                  // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0B90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343A[0x3];                                     // 0x0B91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0B94(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_trigger_obj;                          // 0x0BA0(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0BB0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0BBC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0BD0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0C00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343B[0x7];                                     // 0x0C09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_rune_1_C*                         CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0C10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0C18(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x0C28(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0C39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0C3A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343C[0x1];                                     // 0x0C3B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0C3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dirthole_C_ExecuteUbergraph_dirthole) == 0x000010, "Wrong alignment on Dirthole_C_ExecuteUbergraph_dirthole");
static_assert(sizeof(Dirthole_C_ExecuteUbergraph_dirthole) == 0x000C40, "Wrong size on Dirthole_C_ExecuteUbergraph_dirthole");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, EntryPoint) == 0x000000, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_object_Variable) == 0x000008, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable) == 0x000060, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000078, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000080, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_4) == 0x000088, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_7) == 0x00008C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_actor_1) == 0x000118, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_impact_1) == 0x000120, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water_3) == 0x000130, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water_2) == 0x000138, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water_1) == 0x000140, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_water) == 0x000148, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_activate) == 0x000150, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_static) == 0x000151, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_frozen) == 0x000152, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_active) == 0x000153, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_actor) == 0x000158, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_3) == 0x000160, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_6) == 0x000164, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_impact) == 0x0001EC, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_skipSetting) == 0x0001F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_key_1) == 0x000200, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_14) == 0x000210, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_5) == 0x000218, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_2) == 0x0002A0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_fuel) == 0x0002A4, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_13) == 0x0002A8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_12) == 0x0002B0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage_1) == 0x0002B8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_location_1) == 0x0002BC, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_11) == 0x0002C8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_10) == 0x0002D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_9) == 0x0002D8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_wheelDelta) == 0x0002E0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_8) == 0x0002E8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_mouse) == 0x0002F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_7) == 0x0002F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_key) == 0x000300, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_pressed) == 0x000318, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_temperature_1) == 0x00031C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_temperature) == 0x000320, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_speed) == 0x000324, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_6) == 0x000328, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_4) == 0x000330, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_name_1) == 0x0003B8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_volume) == 0x0003C8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_5) == 0x0003D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_location) == 0x0003D8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_damage) == 0x0003E4, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_clean) == 0x0003E8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_4) == 0x0003F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_3) == 0x0003F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hook) == 0x000480, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_3) == 0x000488, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_2) == 0x000490, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_kick) == 0x000518, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_name) == 0x00051C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_2) == 0x000528, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player_1) == 0x000530, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit_1) == 0x000538, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0005C0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_MakeArray_Array) == 0x0005D0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_SphereOverlapActors_OutActors) == 0x0005E0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_SphereOverlapActors_ReturnValue) == 0x0005F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0005F4, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_MakeTransform_ReturnValue_1) == 0x000600, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Array_Get_Item) == 0x000630, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsDirthole_Item) == 0x000638, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsDirthole_Item' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess) == 0x000640, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Objects) == 0x000648, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_1) == 0x000658, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Objects_1) == 0x000660, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_2) == 0x000670, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Save_1) == 0x000678, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Save_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_3) == 0x000688, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_getData_data) == 0x000690, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Array_Get_Item_1) == 0x000750, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000760, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000768, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Array_Get_Item_2) == 0x000770, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_IsValidClass_ReturnValue) == 0x000780, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000781, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000788, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OtherActor) == 0x000790, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OtherComp) == 0x000798, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0007A0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_bFromSweep) == 0x0007A4, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ComponentBoundEvent_SweepResult) == 0x0007A8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_GetObjectClass_ReturnValue) == 0x000830, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ClassDynamicCast_AsProp_Dirtball) == 0x000838, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ClassDynamicCast_AsProp_Dirtball' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_ClassDynamicCast_bSuccess) == 0x000840, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_ReturnValue) == 0x000841, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_foodData) == 0x000844, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_object) == 0x000860, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_isFood) == 0x000868, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_propToObject_propData) == 0x000870, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0008F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_IsValidClass_ReturnValue_1) == 0x0008F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000900, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Player) == 0x000908, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_4) == 0x000918, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_asProp_return) == 0x000920, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable_1) == 0x000928, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00092C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Add_IntInt_ReturnValue) == 0x000930, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable_2) == 0x000934, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000938, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000944, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000945, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Add_IntInt_ReturnValue_1) == 0x000948, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x00094C, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_getMainSave_save_main) == 0x000958, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000960, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0009E8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, Temp_int_Variable_3) == 0x0009EC, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Add_IntInt_ReturnValue_2) == 0x0009F0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0009F4, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_Add_IntInt_ReturnValue_3) == 0x0009F8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_player) == 0x000A00, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_hit) == 0x000A08, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_index) == 0x000A90, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_Event_action) == 0x000A94, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_SwitchEnum_CmpSuccess) == 0x000A95, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_AsInt_Save_1_1) == 0x000A98, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_AsInt_Save_1_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, K2Node_DynamicCast_bSuccess_5) == 0x000AA8, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_getData_data_1) == 0x000AB0, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_getData_data_1' has a wrong offset!");
static_assert(offsetof(Dirthole_C_ExecuteUbergraph_dirthole, CallFunc_IsValid_ReturnValue) == 0x000B70, "Member 'Dirthole_C_ExecuteUbergraph_dirthole::CallFunc_IsValid_ReturnValue' has a wrong offset!");
