#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dish_Child

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function dish_Child.dish_Child_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Dish_Child_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dish_Child_C_ReceiveTick) == 0x000004, "Wrong alignment on Dish_Child_C_ReceiveTick");
static_assert(sizeof(Dish_Child_C_ReceiveTick) == 0x000004, "Wrong size on Dish_Child_C_ReceiveTick");
static_assert(offsetof(Dish_Child_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Dish_Child_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function dish_Child.dish_Child_C.ExecuteUbergraph_dish_Child
// 0x00A0 (0x00A0 - 0x0000)
struct Dish_Child_C_ExecuteUbergraph_dish_Child final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class NewBlueprint3_0::ANewBlueprint3_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dish_Child_C_ExecuteUbergraph_dish_Child) == 0x000010, "Wrong alignment on Dish_Child_C_ExecuteUbergraph_dish_Child");
static_assert(sizeof(Dish_Child_C_ExecuteUbergraph_dish_Child) == 0x0000A0, "Wrong size on Dish_Child_C_ExecuteUbergraph_dish_Child");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, EntryPoint) == 0x000000, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000040, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000060, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000074, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x00008C, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_Vector_Distance_ReturnValue) == 0x000098, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_IsValid_ReturnValue_1) == 0x00009C, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dish_Child_C_ExecuteUbergraph_dish_Child, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00009D, "Member 'Dish_Child_C_ExecuteUbergraph_dish_Child::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

