#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisintegrateComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass disintegrateComponent.disintegrateComponent_C
// 0x0040 (0x00F0 - 0x00B0)
class UDisintegrateComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Force;                                             // 0x00B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         A;                                                 // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            Comps;                                             // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       Mats;                                              // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystemComponent*               Particle;                                          // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_disintegrateComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"disintegrateComponent_C">();
	}
	static class UDisintegrateComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisintegrateComponent_C>();
	}
};
static_assert(alignof(UDisintegrateComponent_C) == 0x000008, "Wrong alignment on UDisintegrateComponent_C");
static_assert(sizeof(UDisintegrateComponent_C) == 0x0000F0, "Wrong size on UDisintegrateComponent_C");
static_assert(offsetof(UDisintegrateComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UDisintegrateComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDisintegrateComponent_C, Force) == 0x0000B8, "Member 'UDisintegrateComponent_C::Force' has a wrong offset!");
static_assert(offsetof(UDisintegrateComponent_C, A) == 0x0000C4, "Member 'UDisintegrateComponent_C::A' has a wrong offset!");
static_assert(offsetof(UDisintegrateComponent_C, Comps) == 0x0000C8, "Member 'UDisintegrateComponent_C::Comps' has a wrong offset!");
static_assert(offsetof(UDisintegrateComponent_C, Mats) == 0x0000D8, "Member 'UDisintegrateComponent_C::Mats' has a wrong offset!");
static_assert(offsetof(UDisintegrateComponent_C, Particle) == 0x0000E8, "Member 'UDisintegrateComponent_C::Particle' has a wrong offset!");

}

