#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoohickeyLazer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass doohickeyLazer.doohickeyLazer_C
// 0x0028 (0x0248 - 0x0220)
class ADoohickeyLazer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Laser;                                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Reflections;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_doohickeyLazer(int32 EntryPoint);
	void Shoot();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"doohickeyLazer_C">();
	}
	static class ADoohickeyLazer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADoohickeyLazer_C>();
	}
};
static_assert(alignof(ADoohickeyLazer_C) == 0x000008, "Wrong alignment on ADoohickeyLazer_C");
static_assert(sizeof(ADoohickeyLazer_C) == 0x000248, "Wrong size on ADoohickeyLazer_C");
static_assert(offsetof(ADoohickeyLazer_C, UberGraphFrame) == 0x000220, "Member 'ADoohickeyLazer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADoohickeyLazer_C, PointLight) == 0x000228, "Member 'ADoohickeyLazer_C::PointLight' has a wrong offset!");
static_assert(offsetof(ADoohickeyLazer_C, Arrow) == 0x000230, "Member 'ADoohickeyLazer_C::Arrow' has a wrong offset!");
static_assert(offsetof(ADoohickeyLazer_C, Laser) == 0x000238, "Member 'ADoohickeyLazer_C::Laser' has a wrong offset!");
static_assert(offsetof(ADoohickeyLazer_C, Reflections) == 0x000240, "Member 'ADoohickeyLazer_C::Reflections' has a wrong offset!");

}

