#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Door

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function door.door_C.ExecuteUbergraph_door
// 0x07D0 (0x07D0 - 0x0000)
struct Door_C_ExecuteUbergraph_door final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_1;                             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0180(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bypassCheck_1;                  // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bypassCheck;                    // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_197[0x1];                                      // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput;                // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_1;              // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_opened;                         // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Temp_byte_Variable_2;                              // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ANavModifierBox_C*                      K2Node_DynamicCast_AsNav_Modifier_Box;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0284(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Select_Default_1;                           // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x030E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30F[0x1];                                      // 0x030F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0310(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration;                       // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0418(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A2[0x2];                                      // 0x04A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x04CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0554(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0578(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0584(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0590(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0618(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x06A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_4;  // 0x06AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0734(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_5;  // 0x0740(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Door_C_ExecuteUbergraph_door) == 0x000010, "Wrong alignment on Door_C_ExecuteUbergraph_door");
static_assert(sizeof(Door_C_ExecuteUbergraph_door) == 0x0007D0, "Wrong size on Door_C_ExecuteUbergraph_door");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, EntryPoint) == 0x000000, "Member 'Door_C_ExecuteUbergraph_door::EntryPoint' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_bool_Variable) == 0x000004, "Member 'Door_C_ExecuteUbergraph_door::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_bool_Variable_1) == 0x000005, "Member 'Door_C_ExecuteUbergraph_door::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_byte_Variable) == 0x000006, "Member 'Door_C_ExecuteUbergraph_door::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_byte_Variable_1) == 0x000007, "Member 'Door_C_ExecuteUbergraph_door::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_VLerp_ReturnValue) == 0x00000C, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_VLerp_ReturnValue_1) == 0x000018, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player_6) == 0x000028, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_hit_3) == 0x000030, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_kick) == 0x0000B8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_name) == 0x0000BC, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player_5) == 0x0000C8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player_4) == 0x0000D0, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_hit_2) == 0x0000D8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_damage_1) == 0x000160, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player_3) == 0x000168, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player_2) == 0x000170, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player_1) == 0x000178, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000180, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Greater_IntInt_ReturnValue) == 0x000194, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_CustomEvent_bypassCheck_1) == 0x000195, "Member 'Door_C_ExecuteUbergraph_door::K2Node_CustomEvent_bypassCheck_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_CustomEvent_bypassCheck) == 0x000196, "Member 'Door_C_ExecuteUbergraph_door::K2Node_CustomEvent_bypassCheck' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000198, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x0001A0, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_owner) == 0x0001A8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_index) == 0x0001B0, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_SwitchInteger_CmpSuccess) == 0x0001B4, "Member 'Door_C_ExecuteUbergraph_door::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_runTrigger_self_CastInput) == 0x0001B8, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_runTrigger_self_CastInput' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_runTrigger_self_CastInput_1) == 0x0001C8, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_runTrigger_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_bool_Variable_2) == 0x0001D9, "Member 'Door_C_ExecuteUbergraph_door::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Not_PreBool_ReturnValue) == 0x0001DA, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001DB, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BooleanAND_ReturnValue) == 0x0001DC, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BooleanAND_ReturnValue_1) == 0x0001DD, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001DE, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BooleanAND_ReturnValue_2) == 0x0001DF, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BooleanAND_ReturnValue_3) == 0x0001E0, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_CustomEvent_opened) == 0x0001E1, "Member 'Door_C_ExecuteUbergraph_door::K2Node_CustomEvent_opened' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0001E4, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Select_Default) == 0x0001E8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_byte_Variable_2) == 0x0001E9, "Member 'Door_C_ExecuteUbergraph_door::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_DynamicCast_AsNav_Modifier_Box) == 0x0001F0, "Member 'Door_C_ExecuteUbergraph_door::K2Node_DynamicCast_AsNav_Modifier_Box' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001FC, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000284, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Select_Default_1) == 0x00030C, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_SwitchEnum_CmpSuccess) == 0x00030D, "Member 'Door_C_ExecuteUbergraph_door::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_SwitchEnum_CmpSuccess_1) == 0x00030E, "Member 'Door_C_ExecuteUbergraph_door::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, Temp_name_Variable) == 0x000310, "Member 'Door_C_ExecuteUbergraph_door::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000318, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_CustomEvent_Duration) == 0x000324, "Member 'Door_C_ExecuteUbergraph_door::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_GetActorRightVector_ReturnValue) == 0x000328, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000334, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000340, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000350, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000358, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BreakRotator_Roll) == 0x000364, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BreakRotator_Pitch) == 0x000368, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BreakRotator_Yaw) == 0x00036C, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000370, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Add_FloatFloat_ReturnValue) == 0x00037C, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000380, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00038C, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Normal_ReturnValue) == 0x000390, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_MakeRotator_ReturnValue) == 0x00039C, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Dot_VectorVector_ReturnValue) == 0x0003A8, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003AC, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_SelectFloat_ReturnValue) == 0x0003B0, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_IsValid_ReturnValue_1) == 0x0003B4, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003B8, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Add_VectorVector_ReturnValue) == 0x0003C4, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_MakeTransform_ReturnValue) == 0x0003D0, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000400, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_FinishSpawningActor_ReturnValue) == 0x000408, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_player) == 0x000410, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_hit_1) == 0x000418, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_action) == 0x0004A0, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_IsValid_ReturnValue_2) == 0x0004A1, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0004A4, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0004B0, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_actor) == 0x0004C0, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_damage) == 0x0004C8, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_hit) == 0x0004CC, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_impact) == 0x000554, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, K2Node_Event_skipSetting) == 0x000560, "Member 'Door_C_ExecuteUbergraph_door::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000564, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000568, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x00056C, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000570, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000574, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_VInterpTo_ReturnValue) == 0x000578, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_VLerp_ReturnValue_2) == 0x000584, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000590, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000618, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_VInterpTo_ReturnValue_1) == 0x0006A0, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_SetRelativeLocation_SweepHitResult_4) == 0x0006AC, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_SetRelativeLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_VLerp_ReturnValue_3) == 0x000734, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_K2_SetRelativeLocation_SweepHitResult_5) == 0x000740, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_K2_SetRelativeLocation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Vector_Distance_ReturnValue) == 0x0007C8, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_ExecuteUbergraph_door, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0007CC, "Member 'Door_C_ExecuteUbergraph_door::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function door.door_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Door_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Door_C_ActionOptionIndex");
static_assert(sizeof(Door_C_ActionOptionIndex) == 0x000098, "Wrong size on Door_C_ActionOptionIndex");
static_assert(offsetof(Door_C_ActionOptionIndex, Player) == 0x000000, "Member 'Door_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Door_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Door_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Door_C_ActionOptionIndex, Action) == 0x000090, "Member 'Door_C_ActionOptionIndex::Action' has a wrong offset!");

// Function door.door_C.jamCancel
// 0x0004 (0x0004 - 0x0000)
struct Door_C_JamCancel final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_JamCancel) == 0x000004, "Wrong alignment on Door_C_JamCancel");
static_assert(sizeof(Door_C_JamCancel) == 0x000004, "Wrong size on Door_C_JamCancel");
static_assert(offsetof(Door_C_JamCancel, Duration) == 0x000000, "Member 'Door_C_JamCancel::Duration' has a wrong offset!");

// Function door.door_C.settime
// 0x0001 (0x0001 - 0x0000)
struct Door_C_Settime final
{
public:
	bool                                          Opened;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Door_C_Settime) == 0x000001, "Wrong alignment on Door_C_Settime");
static_assert(sizeof(Door_C_Settime) == 0x000001, "Wrong size on Door_C_Settime");
static_assert(offsetof(Door_C_Settime, Opened) == 0x000000, "Member 'Door_C_Settime::Opened' has a wrong offset!");

// Function door.door_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Door_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_RunTrigger) == 0x000008, "Wrong alignment on Door_C_RunTrigger");
static_assert(sizeof(Door_C_RunTrigger) == 0x000010, "Wrong size on Door_C_RunTrigger");
static_assert(offsetof(Door_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Door_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Door_C_RunTrigger, Param_Index) == 0x000008, "Member 'Door_C_RunTrigger::Param_Index' has a wrong offset!");

// Function door.door_C.doorOpen
// 0x0001 (0x0001 - 0x0000)
struct Door_C_DoorOpen final
{
public:
	bool                                          bypassCheck;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Door_C_DoorOpen) == 0x000001, "Wrong alignment on Door_C_DoorOpen");
static_assert(sizeof(Door_C_DoorOpen) == 0x000001, "Wrong size on Door_C_DoorOpen");
static_assert(offsetof(Door_C_DoorOpen, bypassCheck) == 0x000000, "Member 'Door_C_DoorOpen::bypassCheck' has a wrong offset!");

// Function door.door_C.doorClose
// 0x0001 (0x0001 - 0x0000)
struct Door_C_DoorClose final
{
public:
	bool                                          bypassCheck;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Door_C_DoorClose) == 0x000001, "Wrong alignment on Door_C_DoorClose");
static_assert(sizeof(Door_C_DoorClose) == 0x000001, "Wrong size on Door_C_DoorClose");
static_assert(offsetof(Door_C_DoorClose, bypassCheck) == 0x000000, "Member 'Door_C_DoorClose::bypassCheck' has a wrong offset!");

// Function door.door_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct Door_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_PlayerR) == 0x000008, "Wrong alignment on Door_C_PlayerR");
static_assert(sizeof(Door_C_PlayerR) == 0x000008, "Wrong size on Door_C_PlayerR");
static_assert(offsetof(Door_C_PlayerR, Player) == 0x000000, "Member 'Door_C_PlayerR::Player' has a wrong offset!");

// Function door.door_C.playerHold
// 0x0008 (0x0008 - 0x0000)
struct Door_C_PlayerHold final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_PlayerHold) == 0x000008, "Wrong alignment on Door_C_PlayerHold");
static_assert(sizeof(Door_C_PlayerHold) == 0x000008, "Wrong size on Door_C_PlayerHold");
static_assert(offsetof(Door_C_PlayerHold, Player) == 0x000000, "Member 'Door_C_PlayerHold::Player' has a wrong offset!");

// Function door.door_C.playerUnequip
// 0x0008 (0x0008 - 0x0000)
struct Door_C_PlayerUnequip final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_PlayerUnequip) == 0x000008, "Wrong alignment on Door_C_PlayerUnequip");
static_assert(sizeof(Door_C_PlayerUnequip) == 0x000008, "Wrong size on Door_C_PlayerUnequip");
static_assert(offsetof(Door_C_PlayerUnequip, Player) == 0x000000, "Member 'Door_C_PlayerUnequip::Player' has a wrong offset!");

// Function door.door_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct Door_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_DamageByPlayer) == 0x000008, "Wrong alignment on Door_C_DamageByPlayer");
static_assert(sizeof(Door_C_DamageByPlayer) == 0x000098, "Wrong size on Door_C_DamageByPlayer");
static_assert(offsetof(Door_C_DamageByPlayer, Player) == 0x000000, "Member 'Door_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Door_C_DamageByPlayer, Hit) == 0x000008, "Member 'Door_C_DamageByPlayer::Hit' has a wrong offset!");
static_assert(offsetof(Door_C_DamageByPlayer, Damage) == 0x000090, "Member 'Door_C_DamageByPlayer::Damage' has a wrong offset!");

// Function door.door_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Door_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_Thrown) == 0x000008, "Wrong alignment on Door_C_Thrown");
static_assert(sizeof(Door_C_Thrown) == 0x000008, "Wrong size on Door_C_Thrown");
static_assert(offsetof(Door_C_Thrown, Player) == 0x000000, "Member 'Door_C_Thrown::Player' has a wrong offset!");

// Function door.door_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Door_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_SendName) == 0x000004, "Wrong alignment on Door_C_SendName");
static_assert(sizeof(Door_C_SendName) == 0x000008, "Wrong size on Door_C_SendName");
static_assert(offsetof(Door_C_SendName, Param_Name) == 0x000000, "Member 'Door_C_SendName::Param_Name' has a wrong offset!");

// Function door.door_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct Door_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Door_C_Kicked) == 0x000001, "Wrong alignment on Door_C_Kicked");
static_assert(sizeof(Door_C_Kicked) == 0x000001, "Wrong size on Door_C_Kicked");
static_assert(offsetof(Door_C_Kicked, Kick) == 0x000000, "Member 'Door_C_Kicked::Kick' has a wrong offset!");

// Function door.door_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Door_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Door_C_Player_use) == 0x000008, "Wrong alignment on Door_C_Player_use");
static_assert(sizeof(Door_C_Player_use) == 0x000090, "Wrong size on Door_C_Player_use");
static_assert(offsetof(Door_C_Player_use, Player) == 0x000000, "Member 'Door_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Door_C_Player_use, Hit) == 0x000008, "Member 'Door_C_Player_use::Hit' has a wrong offset!");

// Function door.door_C.snd
// 0x0008 (0x0008 - 0x0000)
struct Door_C_Snd final
{
public:
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_Snd) == 0x000008, "Wrong alignment on Door_C_Snd");
static_assert(sizeof(Door_C_Snd) == 0x000008, "Wrong size on Door_C_Snd");
static_assert(offsetof(Door_C_Snd, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000000, "Member 'Door_C_Snd::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

// Function door.door_C.upd
// 0x0028 (0x0028 - 0x0000)
struct Door_C_Upd final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_Upd) == 0x000008, "Wrong alignment on Door_C_Upd");
static_assert(sizeof(Door_C_Upd) == 0x000028, "Wrong size on Door_C_Upd");
static_assert(offsetof(Door_C_Upd, Temp_bool_Variable) == 0x000000, "Member 'Door_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_Upd, Temp_class_Variable) == 0x000008, "Member 'Door_C_Upd::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_Upd, Temp_class_Variable_1) == 0x000010, "Member 'Door_C_Upd::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(Door_C_Upd, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'Door_C_Upd::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_Upd, K2Node_Select_Default) == 0x000020, "Member 'Door_C_Upd::K2Node_Select_Default' has a wrong offset!");

// Function door.door_C.hack
// 0x0018 (0x0018 - 0x0000)
struct Door_C_Hack final
{
public:
	struct FVector                                Source;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APasswordLock_C*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_Hack) == 0x000008, "Wrong alignment on Door_C_Hack");
static_assert(sizeof(Door_C_Hack) == 0x000018, "Wrong size on Door_C_Hack");
static_assert(offsetof(Door_C_Hack, Source) == 0x000000, "Member 'Door_C_Hack::Source' has a wrong offset!");
static_assert(offsetof(Door_C_Hack, CallFunc_Array_Get_Item) == 0x000010, "Member 'Door_C_Hack::CallFunc_Array_Get_Item' has a wrong offset!");

// Function door.door_C.jam
// 0x0070 (0x0070 - 0x0000)
struct Door_C_Jam final
{
public:
	bool                                          AutoCancel;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APasswordLock_C*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEsparkEffect_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Door_C_Jam) == 0x000010, "Wrong alignment on Door_C_Jam");
static_assert(sizeof(Door_C_Jam) == 0x000070, "Wrong size on Door_C_Jam");
static_assert(offsetof(Door_C_Jam, AutoCancel) == 0x000000, "Member 'Door_C_Jam::AutoCancel' has a wrong offset!");
static_assert(offsetof(Door_C_Jam, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Door_C_Jam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_Jam, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Door_C_Jam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Door_C_Jam, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Door_C_Jam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Door_C_Jam, CallFunc_Array_Get_Item) == 0x000010, "Member 'Door_C_Jam::CallFunc_Array_Get_Item' has a wrong offset!");
