#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_boulders

#include "Basic.hpp"

#include "DreamBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass dream_boulders.dream_boulders_C
// 0x0038 (0x02A8 - 0x0270)
class ADream_boulders_C final : public ADreamBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dream_boulders_C;                   // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane3;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane2;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane1;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_dream_boulders(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void SpawnBoulder();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"dream_boulders_C">();
	}
	static class ADream_boulders_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADream_boulders_C>();
	}
};
static_assert(alignof(ADream_boulders_C) == 0x000008, "Wrong alignment on ADream_boulders_C");
static_assert(sizeof(ADream_boulders_C) == 0x0002A8, "Wrong size on ADream_boulders_C");
static_assert(offsetof(ADream_boulders_C, UberGraphFrame_Dream_boulders_C) == 0x000270, "Member 'ADream_boulders_C::UberGraphFrame_Dream_boulders_C' has a wrong offset!");
static_assert(offsetof(ADream_boulders_C, Plane3) == 0x000278, "Member 'ADream_boulders_C::Plane3' has a wrong offset!");
static_assert(offsetof(ADream_boulders_C, Plane2) == 0x000280, "Member 'ADream_boulders_C::Plane2' has a wrong offset!");
static_assert(offsetof(ADream_boulders_C, Plane1) == 0x000288, "Member 'ADream_boulders_C::Plane1' has a wrong offset!");
static_assert(offsetof(ADream_boulders_C, Arrow) == 0x000290, "Member 'ADream_boulders_C::Arrow' has a wrong offset!");
static_assert(offsetof(ADream_boulders_C, Plane) == 0x000298, "Member 'ADream_boulders_C::Plane' has a wrong offset!");
static_assert(offsetof(ADream_boulders_C, Alpha) == 0x0002A0, "Member 'ADream_boulders_C::Alpha' has a wrong offset!");

}

