#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_room

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function dream_room.dream_room_C.ExecuteUbergraph_dream_room
// 0x0014 (0x0014 - 0x0000)
struct Dream_room_C_ExecuteUbergraph_dream_room final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_room_C_ExecuteUbergraph_dream_room) == 0x000004, "Wrong alignment on Dream_room_C_ExecuteUbergraph_dream_room");
static_assert(sizeof(Dream_room_C_ExecuteUbergraph_dream_room) == 0x000014, "Wrong size on Dream_room_C_ExecuteUbergraph_dream_room");
static_assert(offsetof(Dream_room_C_ExecuteUbergraph_dream_room, EntryPoint) == 0x000000, "Member 'Dream_room_C_ExecuteUbergraph_dream_room::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dream_room_C_ExecuteUbergraph_dream_room, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Dream_room_C_ExecuteUbergraph_dream_room::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_room_C_ExecuteUbergraph_dream_room, CallFunc_VLerp_ReturnValue) == 0x000008, "Member 'Dream_room_C_ExecuteUbergraph_dream_room::CallFunc_VLerp_ReturnValue' has a wrong offset!");

}

