#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DreamBase

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function dreamBase.dreamBase_C.ExecuteUbergraph_dreamBase
// 0x0198 (0x0198 - 0x0000)
struct DreamBase_C_ExecuteUbergraph_dreamBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0020(0x00F0)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0110(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DreamBase_C_ExecuteUbergraph_dreamBase) == 0x000008, "Wrong alignment on DreamBase_C_ExecuteUbergraph_dreamBase");
static_assert(sizeof(DreamBase_C_ExecuteUbergraph_dreamBase) == 0x000198, "Wrong size on DreamBase_C_ExecuteUbergraph_dreamBase");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, EntryPoint) == 0x000000, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_addFood_full) == 0x000010, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_gamemode) == 0x000018, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_settings) == 0x000020, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_key) == 0x000110, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_pressed) == 0x000128, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_color) == 0x00012C, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_picker) == 0x000140, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_texture) == 0x000148, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_index) == 0x000150, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000158, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, K2Node_Event_DeltaSeconds) == 0x000160, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000168, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000170, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00017C, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000188, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_Vector_Distance_ReturnValue) == 0x000190, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DreamBase_C_ExecuteUbergraph_dreamBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000194, "Member 'DreamBase_C_ExecuteUbergraph_dreamBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function dreamBase.dreamBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DreamBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DreamBase_C_ReceiveTick) == 0x000004, "Wrong alignment on DreamBase_C_ReceiveTick");
static_assert(sizeof(DreamBase_C_ReceiveTick) == 0x000004, "Wrong size on DreamBase_C_ReceiveTick");
static_assert(offsetof(DreamBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DreamBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function dreamBase.dreamBase_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct DreamBase_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DreamBase_C_TexturePickerApply) == 0x000008, "Wrong alignment on DreamBase_C_TexturePickerApply");
static_assert(sizeof(DreamBase_C_TexturePickerApply) == 0x000018, "Wrong size on DreamBase_C_TexturePickerApply");
static_assert(offsetof(DreamBase_C_TexturePickerApply, Picker) == 0x000000, "Member 'DreamBase_C_TexturePickerApply::Picker' has a wrong offset!");
static_assert(offsetof(DreamBase_C_TexturePickerApply, Texture) == 0x000008, "Member 'DreamBase_C_TexturePickerApply::Texture' has a wrong offset!");
static_assert(offsetof(DreamBase_C_TexturePickerApply, Param_Index) == 0x000010, "Member 'DreamBase_C_TexturePickerApply::Param_Index' has a wrong offset!");

// Function dreamBase.dreamBase_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct DreamBase_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DreamBase_C_ApplyColor) == 0x000004, "Wrong alignment on DreamBase_C_ApplyColor");
static_assert(sizeof(DreamBase_C_ApplyColor) == 0x000010, "Wrong size on DreamBase_C_ApplyColor");
static_assert(offsetof(DreamBase_C_ApplyColor, Color) == 0x000000, "Member 'DreamBase_C_ApplyColor::Color' has a wrong offset!");

// Function dreamBase.dreamBase_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct DreamBase_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DreamBase_C_AnyKey) == 0x000008, "Wrong alignment on DreamBase_C_AnyKey");
static_assert(sizeof(DreamBase_C_AnyKey) == 0x000020, "Wrong size on DreamBase_C_AnyKey");
static_assert(offsetof(DreamBase_C_AnyKey, Key) == 0x000000, "Member 'DreamBase_C_AnyKey::Key' has a wrong offset!");
static_assert(offsetof(DreamBase_C_AnyKey, Pressed) == 0x000018, "Member 'DreamBase_C_AnyKey::Pressed' has a wrong offset!");

// Function dreamBase.dreamBase_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct DreamBase_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(DreamBase_C_SettingsApplied) == 0x000008, "Wrong alignment on DreamBase_C_SettingsApplied");
static_assert(sizeof(DreamBase_C_SettingsApplied) == 0x0000F0, "Wrong size on DreamBase_C_SettingsApplied");
static_assert(offsetof(DreamBase_C_SettingsApplied, Settings) == 0x000000, "Member 'DreamBase_C_SettingsApplied::Settings' has a wrong offset!");

// Function dreamBase.dreamBase_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct DreamBase_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DreamBase_C_StuffUpgraded) == 0x000008, "Wrong alignment on DreamBase_C_StuffUpgraded");
static_assert(sizeof(DreamBase_C_StuffUpgraded) == 0x000008, "Wrong size on DreamBase_C_StuffUpgraded");
static_assert(offsetof(DreamBase_C_StuffUpgraded, GameMode) == 0x000000, "Member 'DreamBase_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function dreamBase.dreamBase_C.dreamInv
// 0x0018 (0x0018 - 0x0000)
struct DreamBase_C_DreamInv final
{
public:
	TArray<struct FStruct_save>                   Invv;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ADreamBase_C*                           Base;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DreamBase_C_DreamInv) == 0x000008, "Wrong alignment on DreamBase_C_DreamInv");
static_assert(sizeof(DreamBase_C_DreamInv) == 0x000018, "Wrong size on DreamBase_C_DreamInv");
static_assert(offsetof(DreamBase_C_DreamInv, Invv) == 0x000000, "Member 'DreamBase_C_DreamInv::Invv' has a wrong offset!");
static_assert(offsetof(DreamBase_C_DreamInv, Base) == 0x000010, "Member 'DreamBase_C_DreamInv::Base' has a wrong offset!");

}

