#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_fill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function dream_fill.dream_fill_C.ExecuteUbergraph_dream_fill
// 0x0108 (0x0108 - 0x0000)
struct Dream_fill_C_ExecuteUbergraph_dream_fill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0064(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChildActorComponent*>           K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_fill_C_ExecuteUbergraph_dream_fill) == 0x000008, "Wrong alignment on Dream_fill_C_ExecuteUbergraph_dream_fill");
static_assert(sizeof(Dream_fill_C_ExecuteUbergraph_dream_fill) == 0x000108, "Wrong size on Dream_fill_C_ExecuteUbergraph_dream_fill");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, EntryPoint) == 0x000000, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, Temp_int_Variable) == 0x000004, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_getMainPlayer_AsMain_Player) == 0x000018, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_GetActorForwardVector_ReturnValue) == 0x000020, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_addFood_full) == 0x00002C, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_RandomFloatInRange_ReturnValue) == 0x00003C, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_VLerp_ReturnValue) == 0x000040, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_MakeVector_ReturnValue) == 0x00004C, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_RotateAngleAxis_ReturnValue) == 0x000058, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000064, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, K2Node_MakeArray_Array) == 0x0000F0, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_ExecuteUbergraph_dream_fill, CallFunc_Array_Get_Item) == 0x000100, "Member 'Dream_fill_C_ExecuteUbergraph_dream_fill::CallFunc_Array_Get_Item' has a wrong offset!");

// Function dream_fill.dream_fill_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct Dream_fill_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_fill_C_UserConstructionScript) == 0x000010, "Wrong alignment on Dream_fill_C_UserConstructionScript");
static_assert(sizeof(Dream_fill_C_UserConstructionScript) == 0x0000F0, "Wrong size on Dream_fill_C_UserConstructionScript");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'Dream_fill_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Divide_VectorInt_ReturnValue) == 0x00001C, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Divide_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, Temp_int_Variable_1) == 0x000028, "Member 'Dream_fill_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00002C, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000030, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000048, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x0000A0, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A4, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x0000B0, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_fill_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue_1) == 0x0000E0, "Member 'Dream_fill_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");

}

