#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DreamfillDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass dreamfillDoor.dreamfillDoor_C
// 0x0030 (0x0250 - 0x0220)
class ADreamfillDoor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorL;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorR;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorFr;                                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_dreamfillDoor(int32 EntryPoint);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"dreamfillDoor_C">();
	}
	static class ADreamfillDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADreamfillDoor_C>();
	}
};
static_assert(alignof(ADreamfillDoor_C) == 0x000008, "Wrong alignment on ADreamfillDoor_C");
static_assert(sizeof(ADreamfillDoor_C) == 0x000250, "Wrong size on ADreamfillDoor_C");
static_assert(offsetof(ADreamfillDoor_C, UberGraphFrame) == 0x000220, "Member 'ADreamfillDoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADreamfillDoor_C, Box) == 0x000228, "Member 'ADreamfillDoor_C::Box' has a wrong offset!");
static_assert(offsetof(ADreamfillDoor_C, DoorL) == 0x000230, "Member 'ADreamfillDoor_C::DoorL' has a wrong offset!");
static_assert(offsetof(ADreamfillDoor_C, DoorR) == 0x000238, "Member 'ADreamfillDoor_C::DoorR' has a wrong offset!");
static_assert(offsetof(ADreamfillDoor_C, DoorFr) == 0x000240, "Member 'ADreamfillDoor_C::DoorFr' has a wrong offset!");
static_assert(offsetof(ADreamfillDoor_C, DefaultSceneRoot) == 0x000248, "Member 'ADreamfillDoor_C::DefaultSceneRoot' has a wrong offset!");

}

