#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_boulders

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function dream_boulders.dream_boulders_C.ExecuteUbergraph_dream_boulders
// 0x0130 (0x0130 - 0x0000)
struct Dream_boulders_C_ExecuteUbergraph_dream_boulders final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADreamBoulder_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_boulders_C_ExecuteUbergraph_dream_boulders) == 0x000010, "Wrong alignment on Dream_boulders_C_ExecuteUbergraph_dream_boulders");
static_assert(sizeof(Dream_boulders_C_ExecuteUbergraph_dream_boulders) == 0x000130, "Wrong size on Dream_boulders_C_ExecuteUbergraph_dream_boulders");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, EntryPoint) == 0x000000, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, Temp_int_Variable) == 0x000010, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_GetForwardVector_ReturnValue) == 0x000024, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_RandomFloatInRange_ReturnValue) == 0x00003C, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000040, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000058, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_RandomFloat_ReturnValue) == 0x000068, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_GetForwardVector_ReturnValue_1) == 0x000084, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Dot_VectorVector_ReturnValue) == 0x000090, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000094, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Lerp_ReturnValue_1) == 0x000098, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00009C, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000B8, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_getMainPlayer_AsMain_Player) == 0x000100, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000108, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_addFood_full) == 0x000110, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_FinishSpawningActor_ReturnValue) == 0x000118, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_getMainSave_save_main) == 0x000120, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Dream_boulders_C_ExecuteUbergraph_dream_boulders, CallFunc_Add_IntInt_ReturnValue) == 0x000128, "Member 'Dream_boulders_C_ExecuteUbergraph_dream_boulders::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function dream_boulders.dream_boulders_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Dream_boulders_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_boulders_C_ReceiveTick) == 0x000004, "Wrong alignment on Dream_boulders_C_ReceiveTick");
static_assert(sizeof(Dream_boulders_C_ReceiveTick) == 0x000004, "Wrong size on Dream_boulders_C_ReceiveTick");
static_assert(offsetof(Dream_boulders_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Dream_boulders_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

