#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_room

#include "Basic.hpp"

#include "DreamBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass dream_room.dream_room_C
// 0x00A8 (0x0318 - 0x0270)
class ADream_room_C final : public ADreamBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dream_room_C;                       // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Prop1;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop16;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop15;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop14;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop13;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop12;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop11;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop10;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop8;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop7;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop6;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop5;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop4;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop3;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop2;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop9;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Prop0;                                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_775C86EB44887BD8F8F0279EED56208A;              // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_775C86EB44887BD8F8F0279EED56208A;     // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_dream_room(int32 EntryPoint);
	void ReceiveBeginPlay();
	void A__UpdateFunc();
	void A__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"dream_room_C">();
	}
	static class ADream_room_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADream_room_C>();
	}
};
static_assert(alignof(ADream_room_C) == 0x000008, "Wrong alignment on ADream_room_C");
static_assert(sizeof(ADream_room_C) == 0x000318, "Wrong size on ADream_room_C");
static_assert(offsetof(ADream_room_C, UberGraphFrame_Dream_room_C) == 0x000270, "Member 'ADream_room_C::UberGraphFrame_Dream_room_C' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop1) == 0x000278, "Member 'ADream_room_C::Prop1' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop16) == 0x000280, "Member 'ADream_room_C::Prop16' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop15) == 0x000288, "Member 'ADream_room_C::Prop15' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop14) == 0x000290, "Member 'ADream_room_C::Prop14' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop13) == 0x000298, "Member 'ADream_room_C::Prop13' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop12) == 0x0002A0, "Member 'ADream_room_C::Prop12' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop11) == 0x0002A8, "Member 'ADream_room_C::Prop11' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop10) == 0x0002B0, "Member 'ADream_room_C::Prop10' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop8) == 0x0002B8, "Member 'ADream_room_C::Prop8' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop7) == 0x0002C0, "Member 'ADream_room_C::Prop7' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop6) == 0x0002C8, "Member 'ADream_room_C::Prop6' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop5) == 0x0002D0, "Member 'ADream_room_C::Prop5' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop4) == 0x0002D8, "Member 'ADream_room_C::Prop4' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop3) == 0x0002E0, "Member 'ADream_room_C::Prop3' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop2) == 0x0002E8, "Member 'ADream_room_C::Prop2' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop9) == 0x0002F0, "Member 'ADream_room_C::Prop9' has a wrong offset!");
static_assert(offsetof(ADream_room_C, Prop0) == 0x0002F8, "Member 'ADream_room_C::Prop0' has a wrong offset!");
static_assert(offsetof(ADream_room_C, StaticMesh) == 0x000300, "Member 'ADream_room_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ADream_room_C, A_a_775C86EB44887BD8F8F0279EED56208A) == 0x000308, "Member 'ADream_room_C::A_a_775C86EB44887BD8F8F0279EED56208A' has a wrong offset!");
static_assert(offsetof(ADream_room_C, A__Direction_775C86EB44887BD8F8F0279EED56208A) == 0x00030C, "Member 'ADream_room_C::A__Direction_775C86EB44887BD8F8F0279EED56208A' has a wrong offset!");
static_assert(offsetof(ADream_room_C, A) == 0x000310, "Member 'ADream_room_C::A' has a wrong offset!");

}

