#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DreamBoulder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass dreamBoulder.dreamBoulder_C
// 0x0030 (0x0250 - 0x0220)
class ADreamBoulder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ADream_boulders_C*                      Dreamer;                                           // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Vel;                                               // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_dreamBoulder(int32 EntryPoint);
	void BndEvt__dreamBoulder_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"dreamBoulder_C">();
	}
	static class ADreamBoulder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADreamBoulder_C>();
	}
};
static_assert(alignof(ADreamBoulder_C) == 0x000008, "Wrong alignment on ADreamBoulder_C");
static_assert(sizeof(ADreamBoulder_C) == 0x000250, "Wrong size on ADreamBoulder_C");
static_assert(offsetof(ADreamBoulder_C, UberGraphFrame) == 0x000220, "Member 'ADreamBoulder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADreamBoulder_C, Audio) == 0x000228, "Member 'ADreamBoulder_C::Audio' has a wrong offset!");
static_assert(offsetof(ADreamBoulder_C, StaticMesh) == 0x000230, "Member 'ADreamBoulder_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ADreamBoulder_C, Dreamer) == 0x000238, "Member 'ADreamBoulder_C::Dreamer' has a wrong offset!");
static_assert(offsetof(ADreamBoulder_C, Vel) == 0x000240, "Member 'ADreamBoulder_C::Vel' has a wrong offset!");

}

