#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_burger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function dream_burger.dream_burger_C.ExecuteUbergraph_dream_burger
// 0x0148 (0x0148 - 0x0000)
struct Dream_burger_C_ExecuteUbergraph_dream_burger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_DynamicCast_AsChild_Actor_Component;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ADreamBurger_coll_C*                    K2Node_DynamicCast_AsDream_Burger_Coll;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_1;         // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_burger_C_ExecuteUbergraph_dream_burger) == 0x000008, "Wrong alignment on Dream_burger_C_ExecuteUbergraph_dream_burger");
static_assert(sizeof(Dream_burger_C_ExecuteUbergraph_dream_burger) == 0x000148, "Wrong size on Dream_burger_C_ExecuteUbergraph_dream_burger");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, EntryPoint) == 0x000000, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_getMainSave_save_main) == 0x000008, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, Temp_int_Array_Index_Variable) == 0x000024, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, Temp_int_Variable) == 0x00002C, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_GetChildrenComponents_Children) == 0x000030, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Array_Get_Item) == 0x000040, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, K2Node_DynamicCast_AsChild_Actor_Component) == 0x000050, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::K2Node_DynamicCast_AsChild_Actor_Component' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, K2Node_DynamicCast_AsDream_Burger_Coll) == 0x000060, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::K2Node_DynamicCast_AsDream_Burger_Coll' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_getMainPlayer_AsMain_Player) == 0x000070, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_addFood_full) == 0x00007C, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00007D, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_GetChildrenComponents_Children_1) == 0x000080, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_GetChildrenComponents_Children_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_RandomRotator_ReturnValue) == 0x000090, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000B0, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_RandomFloatInRange_ReturnValue) == 0x000138, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_ExecuteUbergraph_dream_burger, CallFunc_Conv_FloatToVector_ReturnValue) == 0x00013C, "Member 'Dream_burger_C_ExecuteUbergraph_dream_burger::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");

// Function dream_burger.dream_burger_C.collec
// 0x0010 (0x0010 - 0x0000)
struct Dream_burger_C_Collec final
{
public:
	const class ADreamBurger_coll_C*              Item;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Dream_burger_C_Collec) == 0x000008, "Wrong alignment on Dream_burger_C_Collec");
static_assert(sizeof(Dream_burger_C_Collec) == 0x000010, "Wrong size on Dream_burger_C_Collec");
static_assert(offsetof(Dream_burger_C_Collec, Item) == 0x000000, "Member 'Dream_burger_C_Collec::Item' has a wrong offset!");
static_assert(offsetof(Dream_burger_C_Collec, CallFunc_Array_RemoveItem_ReturnValue) == 0x000008, "Member 'Dream_burger_C_Collec::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

}

