#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DreamfillDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function dreamfillDoor.dreamfillDoor_C.ExecuteUbergraph_dreamfillDoor
// 0x00D8 (0x00D8 - 0x0000)
struct DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor) == 0x000008, "Wrong alignment on DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor");
static_assert(sizeof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor) == 0x0000D8, "Wrong size on DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, EntryPoint) == 0x000000, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, CallFunc_getMainSave_save_main) == 0x000008, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000B8, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, CallFunc_getMainPlayer_AsMain_Player) == 0x0000C8, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, Temp_int_Variable) == 0x0000D0, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor, CallFunc_addFood_full) == 0x0000D4, "Member 'DreamfillDoor_C_ExecuteUbergraph_dreamfillDoor::CallFunc_addFood_full' has a wrong offset!");

// Function dreamfillDoor.dreamfillDoor_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'DreamfillDoor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

