#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_mann

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function dream_mann.dream_mann_C.ExecuteUbergraph_dream_mann
// 0x00B0 (0x00B0 - 0x0000)
struct Dream_mann_C_ExecuteUbergraph_dream_mann final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C7C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMann_C*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C7D[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C7E[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C7F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C80[0xF];                                     // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C81[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMann_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Dream_mann_C_ExecuteUbergraph_dream_mann) == 0x000010, "Wrong alignment on Dream_mann_C_ExecuteUbergraph_dream_mann");
static_assert(sizeof(Dream_mann_C_ExecuteUbergraph_dream_mann) == 0x0000B0, "Wrong size on Dream_mann_C_ExecuteUbergraph_dream_mann");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, EntryPoint) == 0x000000, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::EntryPoint' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_getMainSave_save_main) == 0x000008, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, Temp_int_Variable) == 0x000018, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, Temp_int_Variable_1) == 0x00001C, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_Array_Get_Item) == 0x000020, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_getMainPlayer_AsMain_Player) == 0x000030, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_addFood_full) == 0x000038, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00003C, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, K2Node_Select_Default) == 0x000048, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000060, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Dream_mann_C_ExecuteUbergraph_dream_mann, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'Dream_mann_C_ExecuteUbergraph_dream_mann::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

