#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dream_ufo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DreamBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass dream_ufo.dream_ufo_C
// 0x01E8 (0x0458 - 0x0270)
class ADream_ufo_C final : public ADreamBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dream_ufo_C;                        // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Tree32;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree31;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree30;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree29;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree28;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree27;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree26;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree25;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree24;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree23;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree22;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   SuperLight;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 GrayUfoSk;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightLand;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    UfoRoot;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock9;                                             // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock1;                                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock8;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock7;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock6;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock5;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock4;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock3;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock2;                                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree20;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree19;                                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree18;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree17;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree16;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree15;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree14;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree13;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree12;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree11;                                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree21;                                            // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Pines;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rock;                                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Rocks;                                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree10;                                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree9;                                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree8;                                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree7;                                             // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree2;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree5;                                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree4;                                             // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree3;                                             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree6;                                             // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree1;                                             // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tree0;                                             // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Trees;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FlyTo_a_7321E6604A5B52450D29AB96E4E19D3D;          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FlyTo__Direction_7321E6604A5B52450D29AB96E4E19D3D; // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296C[0x3];                                     // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FlyTo;                                             // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_a_88DC19334F539F9941925A9E9D9E821C;          // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Light__Direction_88DC19334F539F9941925A9E9D9E821C; // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296D[0x3];                                     // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Light;                                             // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyAlpha;                                          // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_dream_ufo(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void FlyTo__UpdateFunc();
	void FlyTo__FinishedFunc();
	void Light__UpdateFunc();
	void Light__FinishedFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"dream_ufo_C">();
	}
	static class ADream_ufo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADream_ufo_C>();
	}
};
static_assert(alignof(ADream_ufo_C) == 0x000008, "Wrong alignment on ADream_ufo_C");
static_assert(sizeof(ADream_ufo_C) == 0x000458, "Wrong size on ADream_ufo_C");
static_assert(offsetof(ADream_ufo_C, UberGraphFrame_Dream_ufo_C) == 0x000270, "Member 'ADream_ufo_C::UberGraphFrame_Dream_ufo_C' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree32) == 0x000278, "Member 'ADream_ufo_C::Tree32' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree31) == 0x000280, "Member 'ADream_ufo_C::Tree31' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree30) == 0x000288, "Member 'ADream_ufo_C::Tree30' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree29) == 0x000290, "Member 'ADream_ufo_C::Tree29' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree28) == 0x000298, "Member 'ADream_ufo_C::Tree28' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree27) == 0x0002A0, "Member 'ADream_ufo_C::Tree27' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree26) == 0x0002A8, "Member 'ADream_ufo_C::Tree26' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree25) == 0x0002B0, "Member 'ADream_ufo_C::Tree25' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree24) == 0x0002B8, "Member 'ADream_ufo_C::Tree24' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree23) == 0x0002C0, "Member 'ADream_ufo_C::Tree23' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree22) == 0x0002C8, "Member 'ADream_ufo_C::Tree22' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, SuperLight) == 0x0002D0, "Member 'ADream_ufo_C::SuperLight' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, GrayUfoSk) == 0x0002D8, "Member 'ADream_ufo_C::GrayUfoSk' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, SpotLight1) == 0x0002E0, "Member 'ADream_ufo_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Audio) == 0x0002E8, "Member 'ADream_ufo_C::Audio' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, LightLand) == 0x0002F0, "Member 'ADream_ufo_C::LightLand' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, PointLight) == 0x0002F8, "Member 'ADream_ufo_C::PointLight' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, UfoRoot) == 0x000300, "Member 'ADream_ufo_C::UfoRoot' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, DirectionalLight) == 0x000308, "Member 'ADream_ufo_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock9) == 0x000310, "Member 'ADream_ufo_C::Rock9' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock1) == 0x000318, "Member 'ADream_ufo_C::Rock1' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock8) == 0x000320, "Member 'ADream_ufo_C::Rock8' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock7) == 0x000328, "Member 'ADream_ufo_C::Rock7' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock6) == 0x000330, "Member 'ADream_ufo_C::Rock6' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock5) == 0x000338, "Member 'ADream_ufo_C::Rock5' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock4) == 0x000340, "Member 'ADream_ufo_C::Rock4' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock3) == 0x000348, "Member 'ADream_ufo_C::Rock3' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock2) == 0x000350, "Member 'ADream_ufo_C::Rock2' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree20) == 0x000358, "Member 'ADream_ufo_C::Tree20' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree19) == 0x000360, "Member 'ADream_ufo_C::Tree19' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree18) == 0x000368, "Member 'ADream_ufo_C::Tree18' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree17) == 0x000370, "Member 'ADream_ufo_C::Tree17' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree16) == 0x000378, "Member 'ADream_ufo_C::Tree16' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree15) == 0x000380, "Member 'ADream_ufo_C::Tree15' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree14) == 0x000388, "Member 'ADream_ufo_C::Tree14' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree13) == 0x000390, "Member 'ADream_ufo_C::Tree13' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree12) == 0x000398, "Member 'ADream_ufo_C::Tree12' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree11) == 0x0003A0, "Member 'ADream_ufo_C::Tree11' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree21) == 0x0003A8, "Member 'ADream_ufo_C::Tree21' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Pines) == 0x0003B0, "Member 'ADream_ufo_C::Pines' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rock) == 0x0003B8, "Member 'ADream_ufo_C::Rock' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Rocks) == 0x0003C0, "Member 'ADream_ufo_C::Rocks' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree10) == 0x0003C8, "Member 'ADream_ufo_C::Tree10' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree9) == 0x0003D0, "Member 'ADream_ufo_C::Tree9' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree8) == 0x0003D8, "Member 'ADream_ufo_C::Tree8' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree7) == 0x0003E0, "Member 'ADream_ufo_C::Tree7' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree2) == 0x0003E8, "Member 'ADream_ufo_C::Tree2' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree5) == 0x0003F0, "Member 'ADream_ufo_C::Tree5' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree4) == 0x0003F8, "Member 'ADream_ufo_C::Tree4' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree3) == 0x000400, "Member 'ADream_ufo_C::Tree3' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree6) == 0x000408, "Member 'ADream_ufo_C::Tree6' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree1) == 0x000410, "Member 'ADream_ufo_C::Tree1' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Tree0) == 0x000418, "Member 'ADream_ufo_C::Tree0' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Trees) == 0x000420, "Member 'ADream_ufo_C::Trees' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Plane) == 0x000428, "Member 'ADream_ufo_C::Plane' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, FlyTo_a_7321E6604A5B52450D29AB96E4E19D3D) == 0x000430, "Member 'ADream_ufo_C::FlyTo_a_7321E6604A5B52450D29AB96E4E19D3D' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, FlyTo__Direction_7321E6604A5B52450D29AB96E4E19D3D) == 0x000434, "Member 'ADream_ufo_C::FlyTo__Direction_7321E6604A5B52450D29AB96E4E19D3D' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, FlyTo) == 0x000438, "Member 'ADream_ufo_C::FlyTo' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Light_a_88DC19334F539F9941925A9E9D9E821C) == 0x000440, "Member 'ADream_ufo_C::Light_a_88DC19334F539F9941925A9E9D9E821C' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Light__Direction_88DC19334F539F9941925A9E9D9E821C) == 0x000444, "Member 'ADream_ufo_C::Light__Direction_88DC19334F539F9941925A9E9D9E821C' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, Light) == 0x000448, "Member 'ADream_ufo_C::Light' has a wrong offset!");
static_assert(offsetof(ADream_ufo_C, FlyAlpha) == 0x000450, "Member 'ADream_ufo_C::FlyAlpha' has a wrong offset!");

}

