#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DroneSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function droneSpline.droneSpline_C.ExecuteUbergraph_droneSpline
// 0x0004 (0x0004 - 0x0000)
struct DroneSpline_C_ExecuteUbergraph_droneSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DroneSpline_C_ExecuteUbergraph_droneSpline) == 0x000004, "Wrong alignment on DroneSpline_C_ExecuteUbergraph_droneSpline");
static_assert(sizeof(DroneSpline_C_ExecuteUbergraph_droneSpline) == 0x000004, "Wrong size on DroneSpline_C_ExecuteUbergraph_droneSpline");
static_assert(offsetof(DroneSpline_C_ExecuteUbergraph_droneSpline, EntryPoint) == 0x000000, "Member 'DroneSpline_C_ExecuteUbergraph_droneSpline::EntryPoint' has a wrong offset!");

// Function droneSpline.droneSpline_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct DroneSpline_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DroneSpline_C_UserConstructionScript) == 0x000004, "Wrong alignment on DroneSpline_C_UserConstructionScript");
static_assert(sizeof(DroneSpline_C_UserConstructionScript) == 0x000038, "Wrong size on DroneSpline_C_UserConstructionScript");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, Temp_int_Variable) == 0x000004, "Member 'DroneSpline_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000008, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00000C, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x000018, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000024, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DroneSpline_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'DroneSpline_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

