#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DroneSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass droneSpline.droneSpline_C
// 0x0038 (0x0258 - 0x0220)
class ADroneSpline_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Upd;                                               // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2771[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Points;                                            // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        PointsSPawn;                                       // 0x0240(0x0010)(Edit, BlueprintVisible)
	class ADrone_C*                               Drone;                                             // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_droneSpline(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"droneSpline_C">();
	}
	static class ADroneSpline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADroneSpline_C>();
	}
};
static_assert(alignof(ADroneSpline_C) == 0x000008, "Wrong alignment on ADroneSpline_C");
static_assert(sizeof(ADroneSpline_C) == 0x000258, "Wrong size on ADroneSpline_C");
static_assert(offsetof(ADroneSpline_C, UberGraphFrame) == 0x000220, "Member 'ADroneSpline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADroneSpline_C, Spline) == 0x000228, "Member 'ADroneSpline_C::Spline' has a wrong offset!");
static_assert(offsetof(ADroneSpline_C, DefaultSceneRoot) == 0x000230, "Member 'ADroneSpline_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADroneSpline_C, Upd) == 0x000238, "Member 'ADroneSpline_C::Upd' has a wrong offset!");
static_assert(offsetof(ADroneSpline_C, Points) == 0x00023C, "Member 'ADroneSpline_C::Points' has a wrong offset!");
static_assert(offsetof(ADroneSpline_C, PointsSPawn) == 0x000240, "Member 'ADroneSpline_C::PointsSPawn' has a wrong offset!");
static_assert(offsetof(ADroneSpline_C, Drone) == 0x000250, "Member 'ADroneSpline_C::Drone' has a wrong offset!");

}

