#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Drone

#include "Basic.hpp"

#include "Struct_mString_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_store_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_storeOrder_structs.hpp"
#include "Enum_emailChars_structs.hpp"
#include "Enum_signalResponse_structs.hpp"


namespace SDK::Params
{

// Function drone.drone_C.ExecuteUbergraph_drone
// 0x0B80 (0x0B80 - 0x0000)
struct Drone_C_ExecuteUbergraph_drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BB[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0074(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0120(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_grab;                           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BC[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDrone_sk_Skeleton_AnimBlueprint_C*     K2Node_DynamicCast_AsDrone_Sk_Skeleton_Anim_Blueprint; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BD[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BE[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_2;                      // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27BF[0x2];                                     // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C0[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C1[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C2[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C3[0x2];                                     // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x02D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue_3;                      // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C4[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_canSell_can;                              // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_canSell_isItembox;                        // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C5[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_4;                      // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_5;                      // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x041C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C6[0x3];                                     // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x04A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0544(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_2;            // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_4;       // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C7[0x3];                                     // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_NewParam;                             // 0x062D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C8[0x2];                                     // 0x062E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0630(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x063C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_6;                      // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue_1;            // 0x0650(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C9[0x3];                                     // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27CA[0x4];                                     // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mString                        CallFunc_Array_Get_Item_1;                         // 0x0670(0x0010)(HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0680(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x069C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x06DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x06F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x06FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0708(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x0714(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x0720(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0740(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x074C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_storeOrder                     K2Node_CustomEvent_order;                          // 0x0758(0x0018)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0770(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27CB[0x4];                                     // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isDreaming_dreaming;                      // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27CC[0x3];                                     // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0790(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x079C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_2;     // 0x07B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x083C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_6;      // 0x0848(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_3;            // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0858(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_5;       // 0x0864(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27CD[0x3];                                     // 0x0865(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27CE[0x4];                                     // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0878(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27CF[0x7];                                     // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0890(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x08C0(0x00C0)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D0[0x7];                                     // 0x0981(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0988(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x09A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x09B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x09C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Select_Default;                             // 0x09D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x09E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USceneComponent*                        K2Node_Select_Default_1;                           // 0x0A68(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D1[0x3];                                     // 0x0A71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_sell_points;                              // 0x0A74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_signalResponse                           CallFunc_sell_responseEmail;                       // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_sell_checked;                             // 0x0A79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D2[0x6];                                     // 0x0A7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_getResponse_topic;                        // 0x0A80(0x0018)()
	class FText                                   CallFunc_getResponse_desc;                         // 0x0A98(0x0018)()
	Enum_emailChars                               CallFunc_getResponse_character;                    // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D3[0x7];                                     // 0x0AB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_getResponse_avatar;                       // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0AC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0AC8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0AD8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0AE8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0AF8(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0B11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0B12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0B13(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D4[0x4];                                     // 0x0B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0B20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0B29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D5[0x6];                                     // 0x0B2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_1;      // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0B3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_2;      // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_8;       // 0x0B4C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_9;       // 0x0B5C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue_3;      // 0x0B68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x0B6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x0B70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Drone_C_ExecuteUbergraph_drone) == 0x000010, "Wrong alignment on Drone_C_ExecuteUbergraph_drone");
static_assert(sizeof(Drone_C_ExecuteUbergraph_drone) == 0x000B80, "Wrong size on Drone_C_ExecuteUbergraph_drone");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, EntryPoint) == 0x000000, "Member 'Drone_C_ExecuteUbergraph_drone::EntryPoint' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000004, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Array_Get_Item) == 0x000010, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetForwardVector_ReturnValue) == 0x00001C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_X) == 0x000028, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Y) == 0x00002C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Z) == 0x000030, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00004C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000058, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_SwitchInteger_CmpSuccess) == 0x000064, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000074, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetSocketLocation_ReturnValue) == 0x0000FC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000108, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VLerp_ReturnValue) == 0x000114, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000120, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_CustomEvent_grab) == 0x0001A8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_CustomEvent_grab' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetAnimInstance_ReturnValue) == 0x0001B0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_DynamicCast_AsDrone_Sk_Skeleton_Anim_Blueprint) == 0x0001B8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_DynamicCast_AsDrone_Sk_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue) == 0x0001C4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0001C8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001D4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001D8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_SetVectorLength_ReturnValue) == 0x000260, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_1) == 0x00026C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000270, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_2) == 0x000274, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000278, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000279, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Array_LastIndex_ReturnValue) == 0x00027C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_SelectInt_ReturnValue) == 0x000280, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_DeltaSeconds) == 0x000284, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_IntInt_ReturnValue) == 0x000288, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Subtract_IntInt_ReturnValue) == 0x00028C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000290, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_sentFrom) == 0x0002A0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_active) == 0x0002A8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_owner) == 0x0002B0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_index) == 0x0002B8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_cord_1) == 0x0002C0, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_socket_1) == 0x0002C8, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_IsValid_ReturnValue) == 0x0002D0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002D1, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0002D4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_3) == 0x00035C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000360, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetForwardVector_ReturnValue_1) == 0x000364, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_X_1) == 0x000370, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Y_1) == 0x000374, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_BreakVector_Z_1) == 0x000378, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00037C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_canSell_can) == 0x000380, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_canSell_can' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_canSell_isItembox) == 0x000381, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_canSell_isItembox' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000384, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_ClampVectorSize_ReturnValue) == 0x000388, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetComponentVelocity_ReturnValue) == 0x000394, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003A0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_4) == 0x0003AC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0003B0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0003B4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x0003B8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_VSize_ReturnValue_5) == 0x0003C4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_VSize_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0003C8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0003D4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0003D8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003E4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0003E8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0003F4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0003F8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_FInterpTo_ReturnValue) == 0x000404, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_FClamp_ReturnValue) == 0x000408, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x00040C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Vector_Distance_ReturnValue) == 0x000418, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x00041C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x0004A4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0004A8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000530, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Vector_Distance_ReturnValue_1) == 0x000534, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_RInterpTo_ReturnValue) == 0x000538, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000544, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x0005CC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0005D8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x0005E4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Vector_Distance_ReturnValue_2) == 0x0005F0, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Vector_Distance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_LessEqual_FloatFloat_ReturnValue_4) == 0x0005F4, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_LessEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0005F8, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_FClamp_ReturnValue_1) == 0x0005FC, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_RandomFloatInRange_ReturnValue) == 0x000600, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000604, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000608, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x00060C, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_cord) == 0x000610, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, K2Node_Event_socket) == 0x000618, "Member 'Drone_C_ExecuteUbergraph_drone::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, CallFunc_MakeVector_ReturnValue) == 0x000620, "Member 'Drone_C_ExecuteUbergraph_drone::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Drone_C_ExecuteUbergraph_drone, Temp_bool_Variable) == 0x00062C, "Member 'Drone_C_ExecuteUbergraph_drone::Temp_bool_Variable' has a wrong offset!");
