#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_foodPoison

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"


namespace SDK::Params
{

// Function effect_foodPoison.effect_foodPoison_C.ExecuteUbergraph_effect_foodPoison
// 0x0038 (0x0038 - 0x0000)
struct Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison) == 0x000008, "Wrong alignment on Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison");
static_assert(sizeof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison) == 0x000038, "Wrong size on Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, EntryPoint) == 0x000000, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00000C, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000020, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000024, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_getMainPlayer_AsMain_Player) == 0x000028, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, Temp_bool_Has_Been_Initd_Variable) == 0x000030, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function effect_foodPoison.effect_foodPoison_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_foodPoison_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_foodPoison_C_ReceiveTick) == 0x000004, "Wrong alignment on Effect_foodPoison_C_ReceiveTick");
static_assert(sizeof(Effect_foodPoison_C_ReceiveTick) == 0x000004, "Wrong size on Effect_foodPoison_C_ReceiveTick");
static_assert(offsetof(Effect_foodPoison_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_foodPoison_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function effect_foodPoison.effect_foodPoison_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Effect_foodPoison_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7D[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_3;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_foodPoison_C_LoadData) == 0x000010, "Wrong alignment on Effect_foodPoison_C_LoadData");
static_assert(sizeof(Effect_foodPoison_C_LoadData) == 0x0000F0, "Wrong size on Effect_foodPoison_C_LoadData");
static_assert(offsetof(Effect_foodPoison_C_LoadData, Data) == 0x000000, "Member 'Effect_foodPoison_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, Return) == 0x0000C0, "Member 'Effect_foodPoison_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Effect_foodPoison_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Effect_foodPoison_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Effect_foodPoison_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, CallFunc_Array_Get_Item_2) == 0x0000DC, "Member 'Effect_foodPoison_C_LoadData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, CallFunc_Array_Get_Item_3) == 0x0000E0, "Member 'Effect_foodPoison_C_LoadData::CallFunc_Array_Get_Item_3' has a wrong offset!");

// Function effect_foodPoison.effect_foodPoison_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Effect_foodPoison_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Effect_foodPoison_C_GetData) == 0x000010, "Wrong alignment on Effect_foodPoison_C_GetData");
static_assert(sizeof(Effect_foodPoison_C_GetData) == 0x000270, "Wrong size on Effect_foodPoison_C_GetData");
static_assert(offsetof(Effect_foodPoison_C_GetData, Data) == 0x000000, "Member 'Effect_foodPoison_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Effect_foodPoison_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Effect_foodPoison_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x000190, "Member 'Effect_foodPoison_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Effect_foodPoison_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Effect_foodPoison_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

