#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_foodPoison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Effect_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass effect_foodPoison.effect_foodPoison_C
// 0x0010 (0x0268 - 0x0258)
class AEffect_foodPoison_C final : public AEffect_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Effect_foodPoison_C;                // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Alpha;                                             // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitTime;                                          // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_effect_foodPoison(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void LoadData(const struct FStruct_save& Data, bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"effect_foodPoison_C">();
	}
	static class AEffect_foodPoison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_foodPoison_C>();
	}
};
static_assert(alignof(AEffect_foodPoison_C) == 0x000008, "Wrong alignment on AEffect_foodPoison_C");
static_assert(sizeof(AEffect_foodPoison_C) == 0x000268, "Wrong size on AEffect_foodPoison_C");
static_assert(offsetof(AEffect_foodPoison_C, UberGraphFrame_Effect_foodPoison_C) == 0x000258, "Member 'AEffect_foodPoison_C::UberGraphFrame_Effect_foodPoison_C' has a wrong offset!");
static_assert(offsetof(AEffect_foodPoison_C, Alpha) == 0x000260, "Member 'AEffect_foodPoison_C::Alpha' has a wrong offset!");
static_assert(offsetof(AEffect_foodPoison_C, InitTime) == 0x000264, "Member 'AEffect_foodPoison_C::InitTime' has a wrong offset!");

}

