#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_nausea

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function effect_nausea.effect_nausea_C.ExecuteUbergraph_effect_nausea
// 0x00A0 (0x00A0 - 0x0000)
struct Effect_nausea_C_ExecuteUbergraph_effect_nausea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACar1_C*                                K2Node_DynamicCast_AsCar_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeAlive_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_1;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue_1;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_ariralVaccine_C*                   CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_nausea_C_ExecuteUbergraph_effect_nausea) == 0x000008, "Wrong alignment on Effect_nausea_C_ExecuteUbergraph_effect_nausea");
static_assert(sizeof(Effect_nausea_C_ExecuteUbergraph_effect_nausea) == 0x0000A0, "Wrong size on Effect_nausea_C_ExecuteUbergraph_effect_nausea");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, EntryPoint) == 0x000000, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_GetTimeAlive_ReturnValue) == 0x000004, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, K2Node_DynamicCast_AsCar_1) == 0x000020, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::K2Node_DynamicCast_AsCar_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_DegCos_ReturnValue) == 0x00003C, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_GetActorRightVector_ReturnValue) == 0x000040, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_DegSin_ReturnValue) == 0x00004C, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_GetTimeAlive_ReturnValue_1) == 0x000050, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_GetTimeAlive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000058, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_DegSin_ReturnValue_1) == 0x000060, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_DegSin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000064, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_DegCos_ReturnValue_1) == 0x000068, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_DegCos_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Create_ReturnValue) == 0x000070, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00007C, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000080, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000084, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000088, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x00008C, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000090, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000094, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Effect_nausea_C_ExecuteUbergraph_effect_nausea, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000098, "Member 'Effect_nausea_C_ExecuteUbergraph_effect_nausea::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");

// Function effect_nausea.effect_nausea_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_nausea_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_nausea_C_ReceiveTick) == 0x000004, "Wrong alignment on Effect_nausea_C_ReceiveTick");
static_assert(sizeof(Effect_nausea_C_ReceiveTick) == 0x000004, "Wrong size on Effect_nausea_C_ReceiveTick");
static_assert(offsetof(Effect_nausea_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_nausea_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

