#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_ariralVaccine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function effect_ariralVaccine.effect_ariralVaccine_C.ExecuteUbergraph_effect_ariralVaccine
// 0x0080 (0x0080 - 0x0000)
struct Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_ariralVaccine_C*                   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine) == 0x000008, "Wrong alignment on Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine");
static_assert(sizeof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine) == 0x000080, "Wrong size on Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, EntryPoint) == 0x000000, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Abs_ReturnValue) == 0x000014, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Ease_ReturnValue) == 0x000020, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Lerp_ReturnValue_1) == 0x000028, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Lerp_ReturnValue_2) == 0x00002C, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_getMainPlayer_AsMain_Player) == 0x000030, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_GetActorRightVector_ReturnValue) == 0x00003C, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_GetTimeAlive_ReturnValue) == 0x000054, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000058, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00005C, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_DegCos_ReturnValue) == 0x000060, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_DegSin_ReturnValue) == 0x000064, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000068, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x00006C, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000070, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000074, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000078, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine, CallFunc_FClamp_ReturnValue) == 0x00007C, "Member 'Effect_ariralVaccine_C_ExecuteUbergraph_effect_ariralVaccine::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function effect_ariralVaccine.effect_ariralVaccine_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_ariralVaccine_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_ariralVaccine_C_ReceiveTick) == 0x000004, "Wrong alignment on Effect_ariralVaccine_C_ReceiveTick");
static_assert(sizeof(Effect_ariralVaccine_C_ReceiveTick) == 0x000004, "Wrong size on Effect_ariralVaccine_C_ReceiveTick");
static_assert(offsetof(Effect_ariralVaccine_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_ariralVaccine_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

