#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_foodPoison

#include "Basic.hpp"

#include "Effect_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass effect_foodPoison.effect_foodPoison_C
// 0x0018 (0x0260 - 0x0248)
class AEffect_foodPoison_C final : public AEffect_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Effect_foodPoison_C;                // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Strength;                                          // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Delay;                                             // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_effect_foodPoison(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"effect_foodPoison_C">();
	}
	static class AEffect_foodPoison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEffect_foodPoison_C>();
	}
};
static_assert(alignof(AEffect_foodPoison_C) == 0x000008, "Wrong alignment on AEffect_foodPoison_C");
static_assert(sizeof(AEffect_foodPoison_C) == 0x000260, "Wrong size on AEffect_foodPoison_C");
static_assert(offsetof(AEffect_foodPoison_C, UberGraphFrame_Effect_foodPoison_C) == 0x000248, "Member 'AEffect_foodPoison_C::UberGraphFrame_Effect_foodPoison_C' has a wrong offset!");
static_assert(offsetof(AEffect_foodPoison_C, Strength) == 0x000250, "Member 'AEffect_foodPoison_C::Strength' has a wrong offset!");
static_assert(offsetof(AEffect_foodPoison_C, Delay) == 0x000254, "Member 'AEffect_foodPoison_C::Delay' has a wrong offset!");
static_assert(offsetof(AEffect_foodPoison_C, Alpha) == 0x000258, "Member 'AEffect_foodPoison_C::Alpha' has a wrong offset!");

}

