#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Effect_foodPoison

#include "Basic.hpp"

#include "Struct_save_structs.hpp"


namespace SDK::Params
{

// Function effect_foodPoison.effect_foodPoison_C.ExecuteUbergraph_effect_foodPoison
// 0x0038 (0x0038 - 0x0000)
struct Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison) == 0x000008, "Wrong alignment on Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison");
static_assert(sizeof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison) == 0x000038, "Wrong size on Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, EntryPoint) == 0x000000, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::EntryPoint' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_getMainPlayer_AsMain_Player) == 0x000010, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00001C, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000020, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00002C, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000030, "Member 'Effect_foodPoison_C_ExecuteUbergraph_effect_foodPoison::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");

// Function effect_foodPoison.effect_foodPoison_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Effect_foodPoison_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Effect_foodPoison_C_ReceiveTick) == 0x000004, "Wrong alignment on Effect_foodPoison_C_ReceiveTick");
static_assert(sizeof(Effect_foodPoison_C_ReceiveTick) == 0x000004, "Wrong size on Effect_foodPoison_C_ReceiveTick");
static_assert(offsetof(Effect_foodPoison_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Effect_foodPoison_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function effect_foodPoison.effect_foodPoison_C.loadData
// 0x00D0 (0x00D0 - 0x0000)
struct Effect_foodPoison_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Effect_foodPoison_C_LoadData) == 0x000010, "Wrong alignment on Effect_foodPoison_C_LoadData");
static_assert(sizeof(Effect_foodPoison_C_LoadData) == 0x0000D0, "Wrong size on Effect_foodPoison_C_LoadData");
static_assert(offsetof(Effect_foodPoison_C_LoadData, Data) == 0x000000, "Member 'Effect_foodPoison_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, Return) == 0x0000C0, "Member 'Effect_foodPoison_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Effect_foodPoison_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Effect_foodPoison_C_LoadData::CallFunc_loadData_return' has a wrong offset!");

}

