#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Eg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass eg.eg_C
// 0x0060 (0x0520 - 0x04C0)
class AEg_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComp_radarPoint_C*                     RadarPoint;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Four;                                              // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Three;                                             // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Two;                                               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   One;                                               // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Zero;                                              // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Check;                                             // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          R;                                                 // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug;                                             // 0x0512(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Rendered;                                          // 0x0513(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Move;                                              // 0x0514(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_eg(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDestroyed();
	void OnLanded(const struct FHitResult& Hit);
	void Retrieve();
	void ReceiveBeginPlay();
	void OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14(EPathFollowingResult MovementResult);
	void OnFail_AA4F896342A93FE29B9E3B89BADDFD14(EPathFollowingResult MovementResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"eg_C">();
	}
	static class AEg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEg_C>();
	}
};
static_assert(alignof(AEg_C) == 0x000010, "Wrong alignment on AEg_C");
static_assert(sizeof(AEg_C) == 0x000520, "Wrong size on AEg_C");
static_assert(offsetof(AEg_C, UberGraphFrame) == 0x0004C0, "Member 'AEg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEg_C, RadarPoint) == 0x0004C8, "Member 'AEg_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(AEg_C, Four) == 0x0004D0, "Member 'AEg_C::Four' has a wrong offset!");
static_assert(offsetof(AEg_C, Three) == 0x0004D8, "Member 'AEg_C::Three' has a wrong offset!");
static_assert(offsetof(AEg_C, Two) == 0x0004E0, "Member 'AEg_C::Two' has a wrong offset!");
static_assert(offsetof(AEg_C, One) == 0x0004E8, "Member 'AEg_C::One' has a wrong offset!");
static_assert(offsetof(AEg_C, Zero) == 0x0004F0, "Member 'AEg_C::Zero' has a wrong offset!");
static_assert(offsetof(AEg_C, StaticMesh) == 0x0004F8, "Member 'AEg_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AEg_C, SpringArm) == 0x000500, "Member 'AEg_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AEg_C, Audio) == 0x000508, "Member 'AEg_C::Audio' has a wrong offset!");
static_assert(offsetof(AEg_C, Check) == 0x000510, "Member 'AEg_C::Check' has a wrong offset!");
static_assert(offsetof(AEg_C, R) == 0x000511, "Member 'AEg_C::R' has a wrong offset!");
static_assert(offsetof(AEg_C, Debug) == 0x000512, "Member 'AEg_C::Debug' has a wrong offset!");
static_assert(offsetof(AEg_C, Rendered) == 0x000513, "Member 'AEg_C::Rendered' has a wrong offset!");
static_assert(offsetof(AEg_C, Move) == 0x000514, "Member 'AEg_C::Move' has a wrong offset!");

}

