#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Eg

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function eg.eg_C.ExecuteUbergraph_eg
// 0x01E8 (0x01E8 - 0x0000)
struct Eg_C_ExecuteUbergraph_eg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0118(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Eg_C_ExecuteUbergraph_eg) == 0x000008, "Wrong alignment on Eg_C_ExecuteUbergraph_eg");
static_assert(sizeof(Eg_C_ExecuteUbergraph_eg) == 0x0001E8, "Wrong size on Eg_C_ExecuteUbergraph_eg");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, EntryPoint) == 0x000000, "Member 'Eg_C_ExecuteUbergraph_eg::EntryPoint' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Eg_C_ExecuteUbergraph_eg::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, K2Node_CustomEvent_MovementResult_1) == 0x000008, "Member 'Eg_C_ExecuteUbergraph_eg::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, K2Node_CustomEvent_MovementResult) == 0x000009, "Member 'Eg_C_ExecuteUbergraph_eg::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Eg_C_ExecuteUbergraph_eg::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, Temp_byte_Variable) == 0x00001C, "Member 'Eg_C_ExecuteUbergraph_eg::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_GetTimeAlive_ReturnValue) == 0x000020, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_DegSin_ReturnValue) == 0x000034, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000038, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000044, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_MakeVector_ReturnValue) == 0x00004C, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000058, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000060, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000EC, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'Eg_C_ExecuteUbergraph_eg::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_BreakVector_X) == 0x000100, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_BreakVector_Y) == 0x000104, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_BreakVector_Z) == 0x000108, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_MakeVector_ReturnValue_1) == 0x00010C, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, K2Node_Event_hit) == 0x000118, "Member 'Eg_C_ExecuteUbergraph_eg::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A0, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001B0, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001B8, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_Vector_Distance_ReturnValue) == 0x0001C4, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001C8, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_BooleanAND_ReturnValue) == 0x0001C9, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001CC, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_RandomFloat_ReturnValue) == 0x0001D0, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_Ease_ReturnValue) == 0x0001D4, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0001D8, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0001E0, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_Not_PreBool_ReturnValue) == 0x0001E1, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0001E2, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eg_C_ExecuteUbergraph_eg, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E3, "Member 'Eg_C_ExecuteUbergraph_eg::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function eg.eg_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Eg_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Eg_C_ReceiveTick) == 0x000004, "Wrong alignment on Eg_C_ReceiveTick");
static_assert(sizeof(Eg_C_ReceiveTick) == 0x000004, "Wrong size on Eg_C_ReceiveTick");
static_assert(offsetof(Eg_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Eg_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function eg.eg_C.OnLanded
// 0x0088 (0x0088 - 0x0000)
struct Eg_C_OnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Eg_C_OnLanded) == 0x000004, "Wrong alignment on Eg_C_OnLanded");
static_assert(sizeof(Eg_C_OnLanded) == 0x000088, "Wrong size on Eg_C_OnLanded");
static_assert(offsetof(Eg_C_OnLanded, Hit) == 0x000000, "Member 'Eg_C_OnLanded::Hit' has a wrong offset!");

// Function eg.eg_C.OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14
// 0x0001 (0x0001 - 0x0000)
struct Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14) == 0x000001, "Wrong alignment on Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14");
static_assert(sizeof(Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14) == 0x000001, "Wrong size on Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14");
static_assert(offsetof(Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14, MovementResult) == 0x000000, "Member 'Eg_C_OnSuccess_AA4F896342A93FE29B9E3B89BADDFD14::MovementResult' has a wrong offset!");

// Function eg.eg_C.OnFail_AA4F896342A93FE29B9E3B89BADDFD14
// 0x0001 (0x0001 - 0x0000)
struct Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14) == 0x000001, "Wrong alignment on Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14");
static_assert(sizeof(Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14) == 0x000001, "Wrong size on Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14");
static_assert(offsetof(Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14, MovementResult) == 0x000000, "Member 'Eg_C_OnFail_AA4F896342A93FE29B9E3B89BADDFD14::MovementResult' has a wrong offset!");

}

