#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErieDrag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function erieDrag.erieDrag_C.ExecuteUbergraph_erieDrag
// 0x0760 (0x0760 - 0x0000)
struct ErieDrag_C_ExecuteUbergraph_erieDrag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0180(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_name;                                 // 0x0364(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_kick;                                 // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0378(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   K2Node_Select_Default;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0430(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0470(0x0030)(IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x04C4(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x054D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54E[0x2];                                      // 0x054E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0558(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0564(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0598(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x05B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x05C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CD[0x3];                                      // 0x05CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEriePlushLive_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x05F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AEriePlushLive_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0680(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0710(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_erieHold_C*                       CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_collectObject_collected;                  // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErieDrag_C_ExecuteUbergraph_erieDrag) == 0x000010, "Wrong alignment on ErieDrag_C_ExecuteUbergraph_erieDrag");
static_assert(sizeof(ErieDrag_C_ExecuteUbergraph_erieDrag) == 0x000760, "Wrong size on ErieDrag_C_ExecuteUbergraph_erieDrag");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, EntryPoint) == 0x000000, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::EntryPoint' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_object_Variable) == 0x000008, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_bool_Variable) == 0x000018, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_name_Variable) == 0x00001C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_name_Variable_1) == 0x000024, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_bool_Variable_1) == 0x00002C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_name_Variable_2) == 0x000030, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, Temp_name_Variable_3) == 0x000038, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_player_5) == 0x000040, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_player_4) == 0x000048, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_hit_1) == 0x000050, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_damage) == 0x0000D8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_player_3) == 0x0000E0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_player_2) == 0x0000E8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_ignore) == 0x0000F0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_DeltaSeconds) == 0x0000F4, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_GetVelocity_ReturnValue) == 0x0000F8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000104, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000110, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_GetActorForwardVector_ReturnValue) == 0x00011C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000128, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000134, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakRotator_Roll) == 0x000140, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakRotator_Pitch) == 0x000144, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakRotator_Yaw) == 0x000148, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Cross_VectorVector_ReturnValue) == 0x00014C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000158, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000164, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakRotator_Roll_1) == 0x000170, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakRotator_Pitch_1) == 0x000174, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakRotator_Yaw_1) == 0x000178, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_obj_static_obj) == 0x000180, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_MakeRotator_ReturnValue) == 0x000190, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00019C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0001A8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000230, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_bBlockingHit) == 0x000231, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_bInitialOverlap) == 0x000232, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Time) == 0x000234, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Distance) == 0x000238, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Location) == 0x00023C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ImpactPoint) == 0x000248, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Normal) == 0x000254, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ImpactNormal) == 0x000260, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitItem) == 0x000290, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ElementIndex) == 0x000294, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_FaceIndex) == 0x000298, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_TraceStart) == 0x00029C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_TraceEnd) == 0x0002A8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002B4, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002B5, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Time_1) == 0x0002B8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Distance_1) == 0x0002BC, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Location_1) == 0x0002C0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002CC, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Normal_1) == 0x0002D8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002E4, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_PhysMat_1) == 0x0002F0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitActor_1) == 0x0002F8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitComponent_1) == 0x000300, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitBoneName_1) == 0x000308, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitItem_1) == 0x000310, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ElementIndex_1) == 0x000314, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_FaceIndex_1) == 0x000318, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_TraceStart_1) == 0x00031C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_TraceEnd_1) == 0x000328, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Add_VectorVector_ReturnValue) == 0x000334, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Dot_VectorVector_ReturnValue) == 0x000340, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000344, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Abs_ReturnValue) == 0x000350, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000354, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Less_FloatFloat_ReturnValue) == 0x000355, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000358, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_name) == 0x000364, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_kick) == 0x00036C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_player_1) == 0x000370, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_hit) == 0x000378, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Select_Default) == 0x000400, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Select_Default_1) == 0x000408, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_GetActorScale3D_ReturnValue) == 0x000410, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_SelectFloat_ReturnValue) == 0x00041C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000420, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_Add_FloatFloat_ReturnValue) == 0x00042C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_MakeTransform_ReturnValue) == 0x000430, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_MakeRotator_ReturnValue_1) == 0x000460, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_MakeTransform_ReturnValue_1) == 0x000470, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_ComponentBoundEvent_HitComponent) == 0x0004A0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_ComponentBoundEvent_OtherActor) == 0x0004A8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_ComponentBoundEvent_OtherComp) == 0x0004B0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0004B8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_ComponentBoundEvent_Hit) == 0x0004C4, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_bBlockingHit_2) == 0x00054C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x00054D, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Time_2) == 0x000550, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Distance_2) == 0x000554, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Location_2) == 0x000558, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ImpactPoint_2) == 0x000564, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_Normal_2) == 0x000570, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ImpactNormal_2) == 0x00057C, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_PhysMat_2) == 0x000588, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitActor_2) == 0x000590, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitComponent_2) == 0x000598, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitBoneName_2) == 0x0005A0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_HitItem_2) == 0x0005A8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_ElementIndex_2) == 0x0005AC, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_FaceIndex_2) == 0x0005B0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_TraceStart_2) == 0x0005B4, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BreakHitResult_TraceEnd_2) == 0x0005C0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_GetCollisionObjectType_ReturnValue) == 0x0005CC, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0005D0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0005D8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_FinishSpawningActor_ReturnValue) == 0x0005E0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0005E8, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0005F0, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000678, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000680, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, K2Node_Event_player) == 0x000708, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_GetTransform_ReturnValue) == 0x000710, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000740, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000748, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_ExecuteUbergraph_erieDrag, CallFunc_collectObject_collected) == 0x000750, "Member 'ErieDrag_C_ExecuteUbergraph_erieDrag::CallFunc_collectObject_collected' has a wrong offset!");

// Function erieDrag.erieDrag_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct ErieDrag_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieDrag_C_PlayerR) == 0x000008, "Wrong alignment on ErieDrag_C_PlayerR");
static_assert(sizeof(ErieDrag_C_PlayerR) == 0x000008, "Wrong size on ErieDrag_C_PlayerR");
static_assert(offsetof(ErieDrag_C_PlayerR, Player) == 0x000000, "Member 'ErieDrag_C_PlayerR::Player' has a wrong offset!");

// Function erieDrag.erieDrag_C.BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'ErieDrag_C_BndEvt__erieDrag_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function erieDrag.erieDrag_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct ErieDrag_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ErieDrag_C_Player_use) == 0x000008, "Wrong alignment on ErieDrag_C_Player_use");
static_assert(sizeof(ErieDrag_C_Player_use) == 0x000090, "Wrong size on ErieDrag_C_Player_use");
static_assert(offsetof(ErieDrag_C_Player_use, Player) == 0x000000, "Member 'ErieDrag_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(ErieDrag_C_Player_use, Hit) == 0x000008, "Member 'ErieDrag_C_Player_use::Hit' has a wrong offset!");

// Function erieDrag.erieDrag_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct ErieDrag_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErieDrag_C_Kicked) == 0x000001, "Wrong alignment on ErieDrag_C_Kicked");
static_assert(sizeof(ErieDrag_C_Kicked) == 0x000001, "Wrong size on ErieDrag_C_Kicked");
static_assert(offsetof(ErieDrag_C_Kicked, Kick) == 0x000000, "Member 'ErieDrag_C_Kicked::Kick' has a wrong offset!");

// Function erieDrag.erieDrag_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct ErieDrag_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieDrag_C_SendName) == 0x000004, "Wrong alignment on ErieDrag_C_SendName");
static_assert(sizeof(ErieDrag_C_SendName) == 0x000008, "Wrong size on ErieDrag_C_SendName");
static_assert(offsetof(ErieDrag_C_SendName, Param_Name) == 0x000000, "Member 'ErieDrag_C_SendName::Param_Name' has a wrong offset!");

// Function erieDrag.erieDrag_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ErieDrag_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieDrag_C_ReceiveTick) == 0x000004, "Wrong alignment on ErieDrag_C_ReceiveTick");
static_assert(sizeof(ErieDrag_C_ReceiveTick) == 0x000004, "Wrong size on ErieDrag_C_ReceiveTick");
static_assert(offsetof(ErieDrag_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ErieDrag_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function erieDrag.erieDrag_C.setIgnoreSave
// 0x0001 (0x0001 - 0x0000)
struct ErieDrag_C_SetIgnoreSave final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErieDrag_C_SetIgnoreSave) == 0x000001, "Wrong alignment on ErieDrag_C_SetIgnoreSave");
