#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErieLive_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function erieLive_Skeleton_AnimBlueprint.erieLive_Skeleton_AnimBlueprint_C.ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint
// 0x00E0 (0x00E0 - 0x0000)
struct ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint");
static_assert(sizeof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint) == 0x0000E0, "Wrong size on ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_GetForwardVector_ReturnValue) == 0x000010, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsCharacter) == 0x000020, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_GetRightVector_ReturnValue) == 0x00002C, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000044, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue) == 0x00005C, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000068, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000074, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000080, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00008C, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000090, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000094, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_FMax_ReturnValue) == 0x000098, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00009C, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0000A8, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0000B4, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x0000C0, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000C8, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000D0, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_VSize_ReturnValue) == 0x0000D4, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x0000D8, "Member 'ErieLive_Skeleton_AnimBlueprint_C_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function erieLive_Skeleton_AnimBlueprint.erieLive_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ErieLive_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function erieLive_Skeleton_AnimBlueprint.erieLive_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ErieLive_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ErieLive_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on ErieLive_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(ErieLive_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on ErieLive_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(ErieLive_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ErieLive_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

