#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErieLive_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass erieLive_Skeleton_AnimBlueprint.erieLive_Skeleton_AnimBlueprint_C
// 0x0A50 (0x0D10 - 0x02C0)
class UErieLive_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2219[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x02F8(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E0(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x0428(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04F0(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0570(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0638(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06B8(0x0020)()
	uint8                                         Pad_221A[0x8];                                     // 0x06D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x06E0(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0890(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x08B0(0x01B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A60(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B20(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0C78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0CA0(0x0028)()
	float                                         WalkAlpha;                                         // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221B[0x4];                                     // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Pawn;                                              // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            Controller;                                        // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Character;                                         // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpSpeed;                                       // 0x0CE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Splatloop;                                         // 0x0CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplatFall;                                         // 0x0CF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221C[0x4];                                     // 0x0CF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Component;                                         // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Carrying;                                          // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_35FA435F40D82C87F4C26D991ABE306F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_DF4E052D412D96C070E8E8BC7FAC13AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_erieLive_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_8EF94EC94D3570920791CE929C2D5D5F();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"erieLive_Skeleton_AnimBlueprint_C">();
	}
	static class UErieLive_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErieLive_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UErieLive_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UErieLive_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UErieLive_Skeleton_AnimBlueprint_C) == 0x000D10, "Wrong size on UErieLive_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x0002F8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x0003E0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_TwoWayBlend_1) == 0x000428, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x0004F0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_TwoWayBlend) == 0x000570, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000638, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0006B8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x0006E0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000890, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x0008B0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x000A60, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000B20, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x000C78, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000CA0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, WalkAlpha) == 0x000CC8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::WalkAlpha' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, Pawn) == 0x000CD0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::Pawn' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, Controller) == 0x000CD8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::Controller' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, Character) == 0x000CE0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::Character' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, InterpSpeed) == 0x000CE8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::InterpSpeed' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, Splatloop) == 0x000CEC, "Member 'UErieLive_Skeleton_AnimBlueprint_C::Splatloop' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, SplatFall) == 0x000CF0, "Member 'UErieLive_Skeleton_AnimBlueprint_C::SplatFall' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, Component) == 0x000CF8, "Member 'UErieLive_Skeleton_AnimBlueprint_C::Component' has a wrong offset!");
static_assert(offsetof(UErieLive_Skeleton_AnimBlueprint_C, Carrying) == 0x000D00, "Member 'UErieLive_Skeleton_AnimBlueprint_C::Carrying' has a wrong offset!");

}

