#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EriePlushLive_evil

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function eriePlushLive_evil.eriePlushLive_evil_C.ExecuteUbergraph_eriePlushLive_evil
// 0x0020 (0x0020 - 0x0000)
struct EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil) == 0x000008, "Wrong alignment on EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil");
static_assert(sizeof(EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil) == 0x000020, "Wrong size on EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil");
static_assert(offsetof(EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil, EntryPoint) == 0x000000, "Member 'EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil::EntryPoint' has a wrong offset!");
static_assert(offsetof(EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'EriePlushLive_evil_C_ExecuteUbergraph_eriePlushLive_evil::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

