#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErieZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"


namespace SDK::Params
{

// Function erieZone.erieZone_C.OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27
// 0x0008 (0x0008 - 0x0000)
struct ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27) == 0x000004, "Wrong alignment on ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27");
static_assert(sizeof(ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27) == 0x000008, "Wrong size on ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27");
static_assert(offsetof(ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27, NotifyName) == 0x000000, "Member 'ErieZone_C_OnNotifyEnd_63DA58004E460D72EA30F586FBD21C27::NotifyName' has a wrong offset!");

// Function erieZone.erieZone_C.OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27
// 0x0008 (0x0008 - 0x0000)
struct ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27) == 0x000004, "Wrong alignment on ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27");
static_assert(sizeof(ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27) == 0x000008, "Wrong size on ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27");
static_assert(offsetof(ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27, NotifyName) == 0x000000, "Member 'ErieZone_C_OnNotifyBegin_63DA58004E460D72EA30F586FBD21C27::NotifyName' has a wrong offset!");

// Function erieZone.erieZone_C.OnInterrupted_63DA58004E460D72EA30F586FBD21C27
// 0x0008 (0x0008 - 0x0000)
struct ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27) == 0x000004, "Wrong alignment on ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27");
static_assert(sizeof(ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27) == 0x000008, "Wrong size on ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27");
static_assert(offsetof(ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27, NotifyName) == 0x000000, "Member 'ErieZone_C_OnInterrupted_63DA58004E460D72EA30F586FBD21C27::NotifyName' has a wrong offset!");

// Function erieZone.erieZone_C.OnBlendOut_63DA58004E460D72EA30F586FBD21C27
// 0x0008 (0x0008 - 0x0000)
struct ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27) == 0x000004, "Wrong alignment on ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27");
static_assert(sizeof(ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27) == 0x000008, "Wrong size on ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27");
static_assert(offsetof(ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27, NotifyName) == 0x000000, "Member 'ErieZone_C_OnBlendOut_63DA58004E460D72EA30F586FBD21C27::NotifyName' has a wrong offset!");

// Function erieZone.erieZone_C.OnCompleted_63DA58004E460D72EA30F586FBD21C27
// 0x0008 (0x0008 - 0x0000)
struct ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27) == 0x000004, "Wrong alignment on ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27");
static_assert(sizeof(ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27) == 0x000008, "Wrong size on ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27");
static_assert(offsetof(ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27, NotifyName) == 0x000000, "Member 'ErieZone_C_OnCompleted_63DA58004E460D72EA30F586FBD21C27::NotifyName' has a wrong offset!");

// Function erieZone.erieZone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ErieZone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ErieZone_C_ReceiveTick) == 0x000004, "Wrong alignment on ErieZone_C_ReceiveTick");
static_assert(sizeof(ErieZone_C_ReceiveTick) == 0x000004, "Wrong size on ErieZone_C_ReceiveTick");
static_assert(offsetof(ErieZone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ErieZone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function erieZone.erieZone_C.ExecuteUbergraph_erieZone
// 0x0400 (0x0400 - 0x0000)
struct ErieZone_C_ExecuteUbergraph_erieZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_trigger_obj;                          // 0x00C0(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_eriePlush_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0188(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x01A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirthole_item_C*                       K2Node_DynamicCast_AsDirthole_Item;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0xF];                                      // 0x0291(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x02A0(0x00C0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mString                        CallFunc_Array_Get_Item_1;                         // 0x0368(0x0010)(HasGetValueTypeHash)
	struct FStruct_mInt                           CallFunc_Array_Get_Item_2;                         // 0x0378(0x0010)(HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsProp_Garbage_Bag;        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirthole_C*                            CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ErieZone_C_ExecuteUbergraph_erieZone) == 0x000010, "Wrong alignment on ErieZone_C_ExecuteUbergraph_erieZone");
static_assert(sizeof(ErieZone_C_ExecuteUbergraph_erieZone) == 0x000400, "Wrong size on ErieZone_C_ExecuteUbergraph_erieZone");
static_assert(offsetof(ErieZone_C_ExecuteUbergraph_erieZone, EntryPoint) == 0x000000, "Member 'ErieZone_C_ExecuteUbergraph_erieZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(ErieZone_C_ExecuteUbergraph_erieZone, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'ErieZone_C_ExecuteUbergraph_erieZone::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ErieZone_C_ExecuteUbergraph_erieZone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'ErieZone_C_ExecuteUbergraph_erieZone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
