#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsparkEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass esparkEffect.esparkEffect_C
// 0x0020 (0x0240 - 0x0220)
class AEsparkEffect_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_esparkEffect(int32 EntryPoint);
	void BndEvt__esparkEffect_ParticleSystem_K2Node_ComponentBoundEvent_0_OnSystemFinished__DelegateSignature(class UParticleSystemComponent* PSystem);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"esparkEffect_C">();
	}
	static class AEsparkEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEsparkEffect_C>();
	}
};
static_assert(alignof(AEsparkEffect_C) == 0x000008, "Wrong alignment on AEsparkEffect_C");
static_assert(sizeof(AEsparkEffect_C) == 0x000240, "Wrong size on AEsparkEffect_C");
static_assert(offsetof(AEsparkEffect_C, UberGraphFrame) == 0x000220, "Member 'AEsparkEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEsparkEffect_C, PointLight) == 0x000228, "Member 'AEsparkEffect_C::PointLight' has a wrong offset!");
static_assert(offsetof(AEsparkEffect_C, Audio) == 0x000230, "Member 'AEsparkEffect_C::Audio' has a wrong offset!");
static_assert(offsetof(AEsparkEffect_C, ParticleSystem) == 0x000238, "Member 'AEsparkEffect_C::ParticleSystem' has a wrong offset!");

}

