#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_arirTreehouseSleep

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function event_arirTreehouseSleep.event_arirTreehouseSleep_C.ExecuteUbergraph_event_arirTreehouseSleep
// 0x0090 (0x0090 - 0x0000)
struct Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATreehouse_C*                           K2Node_DynamicCast_AsTreehouse;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep) == 0x000010, "Wrong alignment on Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep");
static_assert(sizeof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep) == 0x000090, "Wrong size on Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, EntryPoint) == 0x000000, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::EntryPoint' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000018, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, CallFunc_getObjectFromKey_Output) == 0x000020, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, K2Node_DynamicCast_AsTreehouse) == 0x000028, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::K2Node_DynamicCast_AsTreehouse' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, CallFunc_getMainPlayer_AsMain_Player) == 0x000038, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Event_arirTreehouseSleep_C_ExecuteUbergraph_event_arirTreehouseSleep::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

}

