#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_bottomHoleController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function event_bottomHoleController.event_bottomHoleController_C.ExecuteUbergraph_event_bottomHoleController
// 0x0370 (0x0370 - 0x0000)
struct Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ECA[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_rozitalBeacon_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKavotiaPatrolController_C*             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ECB[0x8];                                     // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AProp_rozitalBeacon_C*                  CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	class AProp_rozitalBeacon_C*                  CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ECC[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_rozitalBeacon_C*                  CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ECD[0xC];                                     // 0x0164(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_5;              // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ECE[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01C0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ECF[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHoleDevice_C*                          CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_1;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED0[0xF];                                     // 0x0291(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x02A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_6;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED1[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_6;              // 0x0300(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHoleBottom_C*                          CallFunc_FinishSpawningActor_ReturnValue_7;        // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0344(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED2[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_rozitalBeacon_C*                  CallFunc_Array_Get_Item;                           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController) == 0x000010, "Wrong alignment on Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController");
static_assert(sizeof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController) == 0x000370, "Wrong size on Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, EntryPoint) == 0x000000, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::EntryPoint' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue_1) == 0x000040, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000078, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000088, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue_2) == 0x000090, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0000C0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue_3) == 0x0000D0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000100, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000108, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue_4) == 0x000110, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000140, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000148, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, Temp_int_Variable) == 0x000150, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x000158, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Add_IntInt_ReturnValue) == 0x000160, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue_5) == 0x000170, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001A0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_ComponentBoundEvent_OtherActor) == 0x0001A8, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_ComponentBoundEvent_OtherComp) == 0x0001B0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001B8, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001BC, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_ComponentBoundEvent_SweepResult) == 0x0001C0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x000248, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_IsValid_ReturnValue) == 0x000250, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x000258, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000260, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000268, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_getObjectFromKey_Output) == 0x000270, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_getObjectFromKey_Output_1) == 0x000278, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_getObjectFromKey_Output_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_DynamicCast_AsInt_Player) == 0x000280, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_DynamicCast_bSuccess) == 0x000290, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_GetTransform_ReturnValue) == 0x0002A0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_asProp_return) == 0x0002D0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6) == 0x0002D8, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_6) == 0x0002E0, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_DynamicCast_AsInt_Objects) == 0x0002E8, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, K2Node_DynamicCast_bSuccess_1) == 0x0002F8, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_MakeTransform_ReturnValue_6) == 0x000300, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_MakeTransform_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7) == 0x000330, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_FinishSpawningActor_ReturnValue_7) == 0x000338, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_FinishSpawningActor_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Array_Add_ReturnValue) == 0x000340, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, Temp_name_Variable) == 0x000344, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Array_Add_ReturnValue_1) == 0x00034C, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Array_Add_ReturnValue_2) == 0x000350, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Array_Add_ReturnValue_3) == 0x000354, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Array_Length_ReturnValue) == 0x000358, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Array_Get_Item) == 0x000360, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController, CallFunc_Less_IntInt_ReturnValue) == 0x000368, "Member 'Event_bottomHoleController_C_ExecuteUbergraph_event_bottomHoleController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function event_bottomHoleController.event_bottomHoleController_C.BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Event_bottomHoleController_C_BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED3[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Event_bottomHoleController_C_BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Event_bottomHoleController_C_BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Event_bottomHoleController_C_BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Event_bottomHoleController_C_BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
