#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_bottomHoleController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass event_bottomHoleController.event_bottomHoleController_C
// 0x0038 (0x0280 - 0x0248)
class AEvent_bottomHoleController_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Event_bottomHoleController_C;       // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AHoleBottom_C*                          Room;                                              // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHoleDevice_C*                          Device;                                            // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKavotiaPatrolController_C*             KavotiaPatrol;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AProp_rozitalBeacon_C*>          beacons;                                           // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_event_bottomHoleController(int32 EntryPoint);
	void ReceiveDestroyed();
	void BndEvt__event_bottomHoleController_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"event_bottomHoleController_C">();
	}
	static class AEvent_bottomHoleController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEvent_bottomHoleController_C>();
	}
};
static_assert(alignof(AEvent_bottomHoleController_C) == 0x000008, "Wrong alignment on AEvent_bottomHoleController_C");
static_assert(sizeof(AEvent_bottomHoleController_C) == 0x000280, "Wrong size on AEvent_bottomHoleController_C");
static_assert(offsetof(AEvent_bottomHoleController_C, UberGraphFrame_Event_bottomHoleController_C) == 0x000248, "Member 'AEvent_bottomHoleController_C::UberGraphFrame_Event_bottomHoleController_C' has a wrong offset!");
static_assert(offsetof(AEvent_bottomHoleController_C, Box) == 0x000250, "Member 'AEvent_bottomHoleController_C::Box' has a wrong offset!");
static_assert(offsetof(AEvent_bottomHoleController_C, Room) == 0x000258, "Member 'AEvent_bottomHoleController_C::Room' has a wrong offset!");
static_assert(offsetof(AEvent_bottomHoleController_C, Device) == 0x000260, "Member 'AEvent_bottomHoleController_C::Device' has a wrong offset!");
static_assert(offsetof(AEvent_bottomHoleController_C, KavotiaPatrol) == 0x000268, "Member 'AEvent_bottomHoleController_C::KavotiaPatrol' has a wrong offset!");
static_assert(offsetof(AEvent_bottomHoleController_C, beacons) == 0x000270, "Member 'AEvent_bottomHoleController_C::beacons' has a wrong offset!");

}

