#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_arirStealsGun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function event_arirStealsGun.event_arirStealsGun_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Event_arirStealsGun_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Event_arirStealsGun_C_ReceiveTick) == 0x000004, "Wrong alignment on Event_arirStealsGun_C_ReceiveTick");
static_assert(sizeof(Event_arirStealsGun_C_ReceiveTick) == 0x000004, "Wrong size on Event_arirStealsGun_C_ReceiveTick");
static_assert(offsetof(Event_arirStealsGun_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Event_arirStealsGun_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function event_arirStealsGun.event_arirStealsGun_C.ExecuteUbergraph_event_arirStealsGun
// 0x00B0 (0x00B0 - 0x0000)
struct Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_arirGun_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AArirGunStealer_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun) == 0x000010, "Wrong alignment on Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun");
static_assert(sizeof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun) == 0x0000B0, "Wrong size on Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, EntryPoint) == 0x000000, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_GetActorOfClass_ReturnValue) == 0x000018, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000022, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000023, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_GetPlayerPawn_ReturnValue) == 0x000028, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_BooleanOR_ReturnValue) == 0x000030, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_RotateAngleAxis_ReturnValue) == 0x000048, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000060, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'Event_arirStealsGun_C_ExecuteUbergraph_event_arirStealsGun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

