#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_arirFuelsAtv

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass event_arirFuelsAtv.event_arirFuelsAtv_C
// 0x0028 (0x0270 - 0x0248)
class AEvent_arirFuelsAtv_C : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Event_arirFuelsAtv_C;               // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Arir;                                              // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fuel;                                              // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Health;                                            // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_event_arirFuelsAtv(int32 EntryPoint);
	void ReceiveBeginPlay();
	void CheckVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"event_arirFuelsAtv_C">();
	}
	static class AEvent_arirFuelsAtv_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEvent_arirFuelsAtv_C>();
	}
};
static_assert(alignof(AEvent_arirFuelsAtv_C) == 0x000008, "Wrong alignment on AEvent_arirFuelsAtv_C");
static_assert(sizeof(AEvent_arirFuelsAtv_C) == 0x000270, "Wrong size on AEvent_arirFuelsAtv_C");
static_assert(offsetof(AEvent_arirFuelsAtv_C, UberGraphFrame_Event_arirFuelsAtv_C) == 0x000248, "Member 'AEvent_arirFuelsAtv_C::UberGraphFrame_Event_arirFuelsAtv_C' has a wrong offset!");
static_assert(offsetof(AEvent_arirFuelsAtv_C, Cube) == 0x000250, "Member 'AEvent_arirFuelsAtv_C::Cube' has a wrong offset!");
static_assert(offsetof(AEvent_arirFuelsAtv_C, Box) == 0x000258, "Member 'AEvent_arirFuelsAtv_C::Box' has a wrong offset!");
static_assert(offsetof(AEvent_arirFuelsAtv_C, Arir) == 0x000260, "Member 'AEvent_arirFuelsAtv_C::Arir' has a wrong offset!");
static_assert(offsetof(AEvent_arirFuelsAtv_C, Fuel) == 0x000268, "Member 'AEvent_arirFuelsAtv_C::Fuel' has a wrong offset!");
static_assert(offsetof(AEvent_arirFuelsAtv_C, Health) == 0x00026C, "Member 'AEvent_arirFuelsAtv_C::Health' has a wrong offset!");

}

