#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_consoleWrite

#include "Basic.hpp"


namespace SDK::Params
{

// Function event_consoleWrite.event_consoleWrite_C.ExecuteUbergraph_event_consoleWrite
// 0x0050 (0x0050 - 0x0000)
struct Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_12;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_13;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_14;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_15;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite) == 0x000008, "Wrong alignment on Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite");
static_assert(sizeof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite) == 0x000050, "Wrong size on Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, EntryPoint) == 0x000000, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::EntryPoint' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000014, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00001C, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000020, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000024, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x000028, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x00002C, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000030, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x000034, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x000038, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x00003C, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_12) == 0x000040, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_13) == 0x000044, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_14) == 0x000048, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite, CallFunc_RandomFloatInRange_ReturnValue_15) == 0x00004C, "Member 'Event_consoleWrite_C_ExecuteUbergraph_event_consoleWrite::CallFunc_RandomFloatInRange_ReturnValue_15' has a wrong offset!");

// Function event_consoleWrite.event_consoleWrite_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct Event_consoleWrite_C_UserConstructionScript final
{
public:
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x0000(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BytesToStringUtf8_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Event_consoleWrite_C_UserConstructionScript) == 0x000008, "Wrong alignment on Event_consoleWrite_C_UserConstructionScript");
static_assert(sizeof(Event_consoleWrite_C_UserConstructionScript) == 0x000020, "Wrong size on Event_consoleWrite_C_UserConstructionScript");
static_assert(offsetof(Event_consoleWrite_C_UserConstructionScript, CallFunc_GenerateRandomBytes_ByteArray) == 0x000000, "Member 'Event_consoleWrite_C_UserConstructionScript::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Event_consoleWrite_C_UserConstructionScript, CallFunc_BytesToStringUtf8_ReturnValue) == 0x000010, "Member 'Event_consoleWrite_C_UserConstructionScript::CallFunc_BytesToStringUtf8_ReturnValue' has a wrong offset!");

}

