#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Event_consoleWrite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass event_consoleWrite.event_consoleWrite_C
// 0x0028 (0x0248 - 0x0220)
class AEvent_consoleWrite_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUmg_console_C*                         C;                                                 // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 NewVar_0;                                          // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_event_consoleWrite(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"event_consoleWrite_C">();
	}
	static class AEvent_consoleWrite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEvent_consoleWrite_C>();
	}
};
static_assert(alignof(AEvent_consoleWrite_C) == 0x000008, "Wrong alignment on AEvent_consoleWrite_C");
static_assert(sizeof(AEvent_consoleWrite_C) == 0x000248, "Wrong size on AEvent_consoleWrite_C");
static_assert(offsetof(AEvent_consoleWrite_C, UberGraphFrame) == 0x000220, "Member 'AEvent_consoleWrite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEvent_consoleWrite_C, DefaultSceneRoot) == 0x000228, "Member 'AEvent_consoleWrite_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEvent_consoleWrite_C, C) == 0x000230, "Member 'AEvent_consoleWrite_C::C' has a wrong offset!");
static_assert(offsetof(AEvent_consoleWrite_C, NewVar_0) == 0x000238, "Member 'AEvent_consoleWrite_C::NewVar_0' has a wrong offset!");

}

