#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function explosion.explosion_C.ExecuteUbergraph_explosion
// 0x0370 (0x0370 - 0x0000)
struct Explosion_C_ExecuteUbergraph_explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CAD[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0040(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0070(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CAE[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AburningDebris_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CAF[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0160(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB0[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB1[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB2[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB3[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB4[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB5[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB6[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_2;                // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB7[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_3;                // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB8[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0254(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB9[0x2];                                     // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x02E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Explosion_C_ExecuteUbergraph_explosion) == 0x000010, "Wrong alignment on Explosion_C_ExecuteUbergraph_explosion");
static_assert(sizeof(Explosion_C_ExecuteUbergraph_explosion) == 0x000370, "Wrong size on Explosion_C_ExecuteUbergraph_explosion");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, EntryPoint) == 0x000000, "Member 'Explosion_C_ExecuteUbergraph_explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable) == 0x000008, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00001C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000030, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_obj_statDyn_obj) == 0x000040, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000050, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00005C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000068, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Lerp_ReturnValue) == 0x00006C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_object_Variable) == 0x000070, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomUnitVector_ReturnValue) == 0x000084, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000090, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x00009C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000A8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomRotator_ReturnValue) == 0x0000C4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000100, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000110, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000114, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Vector_Distance_ReturnValue) == 0x000118, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x00011C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000128, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorScale3D_ReturnValue) == 0x000134, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_X) == 0x000140, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_Y) == 0x000144, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_Z) == 0x000148, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00014C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000150, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000154, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000158, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_SphereOverlapActors_OutActors) == 0x000160, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_SphereOverlapActors_ReturnValue) == 0x000170, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000174, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Get_Item) == 0x000178, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_FClamp_ReturnValue) == 0x000180, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects) == 0x000188, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x00019C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001A0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0001A8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsPrimitive_Component) == 0x0001B0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0001BC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x0001C0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x0001CC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0001D0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0001D4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_1) == 0x0001D8, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_2) == 0x0001F0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_3) == 0x000200, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_3) == 0x000208, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_4) == 0x000218, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x00021C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_MakeArray_Array) == 0x000228, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorBounds_Origin) == 0x000238, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorBounds_BoxExtent) == 0x000244, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000254, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0002DC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Less_IntInt_ReturnValue) == 0x0002DD, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MakeHitResult_ReturnValue) == 0x0002E0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000368, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");

// Function explosion.explosion_C.runeCheck
// 0x00F0 (0x00F0 - 0x0000)
struct Explosion_C_RuneCheck final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CBA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CBB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_phys_obj;                             // 0x0028(0x0010)(ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CBC[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CBD[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CBE[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CBF[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CC0[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CC1[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_rune_2_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosion_C_RuneCheck) == 0x000010, "Wrong alignment on Explosion_C_RuneCheck");
static_assert(sizeof(Explosion_C_RuneCheck) == 0x0000F0, "Wrong size on Explosion_C_RuneCheck");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Explosion_C_RuneCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Explosion_C_RuneCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Explosion_C_RuneCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_object_Variable) == 0x000010, "Member 'Explosion_C_RuneCheck::Temp_object_Variable' has a wrong offset!");
