#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function explosion.explosion_C.ExecuteUbergraph_explosion
// 0x0460 (0x0460 - 0x0000)
struct Explosion_C_ExecuteUbergraph_explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0058(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0xC];                                       // 0x00E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AburningDebris_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0188(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_2;                // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_3;                // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x027C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0310(0x0010)(ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_Select_Default;                             // 0x0320(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0330(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x1];                                      // 0x03BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor_Chip_Pile;         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosion_C_ExecuteUbergraph_explosion) == 0x000010, "Wrong alignment on Explosion_C_ExecuteUbergraph_explosion");
static_assert(sizeof(Explosion_C_ExecuteUbergraph_explosion) == 0x000460, "Wrong size on Explosion_C_ExecuteUbergraph_explosion");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, EntryPoint) == 0x000000, "Member 'Explosion_C_ExecuteUbergraph_explosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable) == 0x000010, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable_1) == 0x00001C, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000034, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_int_Variable_2) == 0x000040, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000044, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_obj_statDyn_obj) == 0x000058, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000068, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000074, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_bool_IsClosed_Variable) == 0x000080, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000081, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomUnitVector_ReturnValue) == 0x000084, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000090, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00009C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000A8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, Temp_object_Variable) == 0x0000C8, "Member 'Explosion_C_ExecuteUbergraph_explosion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomRotator_ReturnValue) == 0x0000D8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000120, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000128, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000130, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000138, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Vector_Distance_ReturnValue) == 0x00013C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000140, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x00014C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000150, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Lerp_ReturnValue) == 0x00015C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorScale3D_ReturnValue) == 0x000160, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_X) == 0x00016C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_Y) == 0x000170, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakVector_Z) == 0x000174, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000178, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00017C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000180, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000184, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_SphereOverlapActors_OutActors) == 0x000188, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_SphereOverlapActors_ReturnValue) == 0x000198, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00019C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_FClamp_ReturnValue) == 0x0001A8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects) == 0x0001B0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0001C4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001C8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0001D0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsPrimitive_Component) == 0x0001D8, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0001E4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x0001E8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x0001F4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0001F8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0001FC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_1) == 0x000200, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_2) == 0x000210, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_2) == 0x000218, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_2' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_3) == 0x000228, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_AsInt_Objects_3) == 0x000230, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_AsInt_Objects_3' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_DynamicCast_bSuccess_4) == 0x000240, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_MakeArray_Array) == 0x000248, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x000258, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorBounds_Origin) == 0x000264, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetActorBounds_BoxExtent) == 0x000270, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_MakeHitResult_ReturnValue) == 0x00027C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Length_ReturnValue) == 0x000304, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Less_IntInt_ReturnValue_1) == 0x000308, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x00030C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_obj_static_obj) == 0x000310, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_Select_Default) == 0x000320, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000330, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0003B8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_bBlockingHit) == 0x0003B9, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003BA, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Time) == 0x0003BC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Distance) == 0x0003C0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Location) == 0x0003C4, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_ImpactPoint) == 0x0003D0, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_Normal) == 0x0003DC, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_ImpactNormal) == 0x0003E8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_PhysMat) == 0x0003F8, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitActor) == 0x000400, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitComponent) == 0x000408, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitBoneName) == 0x000410, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_HitItem) == 0x000418, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_ElementIndex) == 0x00041C, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_FaceIndex) == 0x000420, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_TraceStart) == 0x000424, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_BreakHitResult_TraceEnd) == 0x000430, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_GetObjectClass_ReturnValue) == 0x000440, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, CallFunc_Array_Add_ReturnValue) == 0x000448, "Member 'Explosion_C_ExecuteUbergraph_explosion::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_ClassDynamicCast_AsActor_Chip_Pile) == 0x000450, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_ClassDynamicCast_AsActor_Chip_Pile' has a wrong offset!");
static_assert(offsetof(Explosion_C_ExecuteUbergraph_explosion, K2Node_ClassDynamicCast_bSuccess) == 0x000458, "Member 'Explosion_C_ExecuteUbergraph_explosion::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function explosion.explosion_C.runeCheck
// 0x00F0 (0x00F0 - 0x0000)
struct Explosion_C_RuneCheck final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_phys_obj;                             // 0x0028(0x0010)(ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_rune_2_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Explosion_C_RuneCheck) == 0x000010, "Wrong alignment on Explosion_C_RuneCheck");
static_assert(sizeof(Explosion_C_RuneCheck) == 0x0000F0, "Wrong size on Explosion_C_RuneCheck");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Explosion_C_RuneCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Explosion_C_RuneCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Explosion_C_RuneCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, Temp_object_Variable) == 0x000010, "Member 'Explosion_C_RuneCheck::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'Explosion_C_RuneCheck::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_obj_phys_obj) == 0x000028, "Member 'Explosion_C_RuneCheck::CallFunc_obj_phys_obj' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'Explosion_C_RuneCheck::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'Explosion_C_RuneCheck::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'Explosion_C_RuneCheck::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_FMin_ReturnValue) == 0x000044, "Member 'Explosion_C_RuneCheck::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Explosion_C_RuneCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Conv_FloatToString_ReturnValue) == 0x000058, "Member 'Explosion_C_RuneCheck::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_SphereOverlapActors_OutActors) == 0x000068, "Member 'Explosion_C_RuneCheck::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_SphereOverlapActors_ReturnValue) == 0x000078, "Member 'Explosion_C_RuneCheck::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Array_Get_Item) == 0x000080, "Member 'Explosion_C_RuneCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'Explosion_C_RuneCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, K2Node_DynamicCast_AsProp) == 0x000090, "Member 'Explosion_C_RuneCheck::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'Explosion_C_RuneCheck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'Explosion_C_RuneCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'Explosion_C_RuneCheck::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'Explosion_C_RuneCheck::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000D8, "Member 'Explosion_C_RuneCheck::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E0, "Member 'Explosion_C_RuneCheck::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Explosion_C_RuneCheck, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000E8, "Member 'Explosion_C_RuneCheck::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function explosion.explosion_C.scorchMark
// 0x01B8 (0x01B8 - 0x0000)
struct Explosion_C_ScorchMark final
{
public:
	TArray<struct FVector>                        Vecs;                                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0058(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
