#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Eyer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass eyer.eyer_C
// 0x0040 (0x0500 - 0x04C0)
class AEyer_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eye1;                                              // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eye2;                                              // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IgnoreDaySpawn;                                    // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_eyer(int32 EntryPoint);
	void Del();
	void Despawn();
	void blink();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"eyer_C">();
	}
	static class AEyer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEyer_C>();
	}
};
static_assert(alignof(AEyer_C) == 0x000010, "Wrong alignment on AEyer_C");
static_assert(sizeof(AEyer_C) == 0x000500, "Wrong size on AEyer_C");
static_assert(offsetof(AEyer_C, UberGraphFrame) == 0x0004C0, "Member 'AEyer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEyer_C, ParticleSystem) == 0x0004C8, "Member 'AEyer_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AEyer_C, Eye1) == 0x0004D0, "Member 'AEyer_C::Eye1' has a wrong offset!");
static_assert(offsetof(AEyer_C, Eye2) == 0x0004D8, "Member 'AEyer_C::Eye2' has a wrong offset!");
static_assert(offsetof(AEyer_C, Arrow1) == 0x0004E0, "Member 'AEyer_C::Arrow1' has a wrong offset!");
static_assert(offsetof(AEyer_C, Offset) == 0x0004E8, "Member 'AEyer_C::Offset' has a wrong offset!");
static_assert(offsetof(AEyer_C, Distance) == 0x0004EC, "Member 'AEyer_C::Distance' has a wrong offset!");
static_assert(offsetof(AEyer_C, IgnoreDaySpawn) == 0x0004F0, "Member 'AEyer_C::IgnoreDaySpawn' has a wrong offset!");

}

