#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Eyer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function eyer.eyer_C.ExecuteUbergraph_eyer
// 0x01C0 (0x01C0 - 0x0000)
struct Eyer_C_ExecuteUbergraph_eyer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Eyer_C_ExecuteUbergraph_eyer) == 0x000008, "Wrong alignment on Eyer_C_ExecuteUbergraph_eyer");
static_assert(sizeof(Eyer_C_ExecuteUbergraph_eyer) == 0x0001C0, "Wrong size on Eyer_C_ExecuteUbergraph_eyer");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, EntryPoint) == 0x000000, "Member 'Eyer_C_ExecuteUbergraph_eyer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000004, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Eyer_C_ExecuteUbergraph_eyer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'Eyer_C_ExecuteUbergraph_eyer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'Eyer_C_ExecuteUbergraph_eyer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00003C, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000048, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_VSize_ReturnValue) == 0x000074, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000078, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000080, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_FindLookAtRotation_ReturnValue) == 0x00008C, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000098, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000120, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_GetTimeAlive_ReturnValue) == 0x000124, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000128, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Add_FloatFloat_ReturnValue) == 0x00012C, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000130, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000134, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_RotateAngleAxis_ReturnValue) == 0x000138, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_WasRecentlyRendered_ReturnValue_1) == 0x000144, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_WasRecentlyRendered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000148, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000158, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000160, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000170, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Vector_Distance_ReturnValue) == 0x000178, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, K2Node_CreateDelegate_OutputDelegate_2) == 0x00017C, "Member 'Eyer_C_ExecuteUbergraph_eyer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000190, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Greater_IntInt_ReturnValue) == 0x000198, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000199, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_BooleanAND_ReturnValue) == 0x00019A, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00019C, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_SetVectorLength_ReturnValue) == 0x0001A0, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001AC, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Normal_ReturnValue) == 0x0001B0, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001BC, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_Not_PreBool_ReturnValue) == 0x0001BD, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_BooleanAND_ReturnValue_1) == 0x0001BE, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Eyer_C_ExecuteUbergraph_eyer, CallFunc_BooleanOR_ReturnValue) == 0x0001BF, "Member 'Eyer_C_ExecuteUbergraph_eyer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function eyer.eyer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Eyer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Eyer_C_ReceiveTick) == 0x000004, "Wrong alignment on Eyer_C_ReceiveTick");
static_assert(sizeof(Eyer_C_ReceiveTick) == 0x000004, "Wrong size on Eyer_C_ReceiveTick");
static_assert(offsetof(Eyer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Eyer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

