#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FakeRadarWalker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function fakeRadarWalker.fakeRadarWalker_C.ExecuteUbergraph_fakeRadarWalker
// 0x00F8 (0x00F8 - 0x0000)
struct FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker) == 0x000008, "Wrong alignment on FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker");
static_assert(sizeof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker) == 0x0000F8, "Wrong size on FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, EntryPoint) == 0x000000, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::EntryPoint' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_RandomUnitVector_ReturnValue) == 0x000020, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_RandomFloatInRange_ReturnValue) == 0x00002C, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000060, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000E8, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_GetDistanceTo_ReturnValue) == 0x0000EC, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000F0, "Member 'FakeRadarWalker_C_ExecuteUbergraph_fakeRadarWalker::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

