#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Firetank_thread_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass firetank_thread_Skeleton_AnimBlueprint.firetank_thread_Skeleton_AnimBlueprint_C
// 0x1150 (0x1410 - 0x02C0)
class UFiretank_thread_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0430(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0538(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0640(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0748(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0850(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0958(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0A60(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0B68(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0C70(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0D78(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0E80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0F88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1090(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1198(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x12A0(0x0020)()
	struct FTransform                             Wh_0;                                              // 0x12C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Wh_1;                                              // 0x12F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Wh_2;                                              // 0x1320(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Wh_3;                                              // 0x1350(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Wh_4;                                              // 0x1380(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Wh_5;                                              // 0x13B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Wh_6;                                              // 0x13E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_40FD87CF47BEEF6D2853F5BBFFEEB3B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_D7C199B247BEB7ED0ED1DD87B5698964();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_C29957EE421C58AD15EE71948BB31E6D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_0B36ED2347027C1F75AC528D249C98BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_BE03E518430F8F3EB33ED7BAF6EC4412();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_B2E081E74C88F43EC0A429B664547407();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_420FAE69480B0E00A1632E94697ADC6F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_F147C6E24231AA3DDA64248CEB322806();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_833FBEF94CB71C66745F40BAADC860F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_86ADD3634E9BC8EF5B099385E568AE6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_A3AED5844C090AF361A76AA06930852E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_6CA77A5A4FFD6F42D40940B676CEB093();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_9086962B4973992A8BD417BBF7442FF4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_firetank_thread_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5D0A99E240AE4E03BAFC58A79E0E9DD4();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"firetank_thread_Skeleton_AnimBlueprint_C">();
	}
	static class UFiretank_thread_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFiretank_thread_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UFiretank_thread_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UFiretank_thread_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UFiretank_thread_Skeleton_AnimBlueprint_C) == 0x001410, "Wrong size on UFiretank_thread_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_13) == 0x000430, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_12) == 0x000538, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_11) == 0x000640, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_10) == 0x000748, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_9) == 0x000850, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_8) == 0x000958, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_7) == 0x000A60, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_6) == 0x000B68, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_5) == 0x000C70, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_4) == 0x000D78, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_3) == 0x000E80, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x000F88, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x001090, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x001198, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0012A0, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_0) == 0x0012C0, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_0' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_1) == 0x0012F0, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_1' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_2) == 0x001320, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_2' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_3) == 0x001350, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_3' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_4) == 0x001380, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_4' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_5) == 0x0013B0, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_5' has a wrong offset!");
static_assert(offsetof(UFiretank_thread_Skeleton_AnimBlueprint_C, Wh_6) == 0x0013E0, "Member 'UFiretank_thread_Skeleton_AnimBlueprint_C::Wh_6' has a wrong offset!");

}

