#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FiretankDeploy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function firetankDeploy.firetankDeploy_C.ExecuteUbergraph_firetankDeploy
// 0x0410 (0x0410 - 0x0000)
struct FiretankDeploy_C_ExecuteUbergraph_firetankDeploy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VEase_ReturnValue;                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x00BC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0194(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionChannel                             CallFunc_GetCollisionObjectType_ReturnValue;       // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F[0x1];                                      // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0220(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0240(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0268(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3[0x1];                                      // 0x02F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0374(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy) == 0x000008, "Wrong alignment on FiretankDeploy_C_ExecuteUbergraph_firetankDeploy");
static_assert(sizeof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy) == 0x000410, "Wrong size on FiretankDeploy_C_ExecuteUbergraph_firetankDeploy");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, EntryPoint) == 0x000000, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::EntryPoint' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_VEase_ReturnValue) == 0x000004, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_VEase_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000098, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_CustomEvent_SelfActor) == 0x0000A0, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_CustomEvent_OtherActor) == 0x0000A8, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_CustomEvent_NormalImpulse) == 0x0000B0, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_CustomEvent_Hit) == 0x0000BC, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_Lerp_ReturnValue) == 0x000144, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_Event_DeltaSeconds) == 0x000148, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_Lerp_ReturnValue_1) == 0x00014C, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000150, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_Lerp_ReturnValue_2) == 0x000154, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000158, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00015C, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_Lerp_ReturnValue_3) == 0x000160, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000164, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_ComponentBoundEvent_HitComponent) == 0x000170, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_ComponentBoundEvent_OtherActor) == 0x000178, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_ComponentBoundEvent_OtherComp) == 0x000180, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000188, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, K2Node_ComponentBoundEvent_Hit) == 0x000194, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_IsValid_ReturnValue) == 0x00021C, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_GetCollisionObjectType_ReturnValue) == 0x00021D, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_GetCollisionObjectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00021E, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, Temp_object_Variable) == 0x000220, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000230, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_obj_static_obj) == 0x000240, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000250, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00025C, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000268, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0002F0, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_bBlockingHit) == 0x0002F1, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002F2, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_Time) == 0x0002F4, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_Distance) == 0x0002F8, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_Location) == 0x0002FC, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_ImpactPoint) == 0x000308, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_Normal) == 0x000314, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_ImpactNormal) == 0x000320, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_PhysMat) == 0x000330, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_HitActor) == 0x000338, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_HitComponent) == 0x000340, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_HitBoneName) == 0x000348, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_HitItem) == 0x000350, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_ElementIndex) == 0x000354, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_FaceIndex) == 0x000358, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_TraceStart) == 0x00035C, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_BreakHitResult_TraceEnd) == 0x000368, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000374, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0003FC, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ExecuteUbergraph_firetankDeploy, CallFunc_MakeVector_ReturnValue) == 0x000400, "Member 'FiretankDeploy_C_ExecuteUbergraph_firetankDeploy::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function firetankDeploy.firetankDeploy_C.BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'FiretankDeploy_C_BndEvt__firetankDeploy_firetankBox_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function firetankDeploy.firetankDeploy_C.actorHit
// 0x00A8 (0x00A8 - 0x0000)
struct FiretankDeploy_C_ActorHit final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x001C(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FiretankDeploy_C_ActorHit) == 0x000008, "Wrong alignment on FiretankDeploy_C_ActorHit");
static_assert(sizeof(FiretankDeploy_C_ActorHit) == 0x0000A8, "Wrong size on FiretankDeploy_C_ActorHit");
static_assert(offsetof(FiretankDeploy_C_ActorHit, SelfActor) == 0x000000, "Member 'FiretankDeploy_C_ActorHit::SelfActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ActorHit, OtherActor) == 0x000008, "Member 'FiretankDeploy_C_ActorHit::OtherActor' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ActorHit, NormalImpulse) == 0x000010, "Member 'FiretankDeploy_C_ActorHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_ActorHit, Hit) == 0x00001C, "Member 'FiretankDeploy_C_ActorHit::Hit' has a wrong offset!");

// Function firetankDeploy.firetankDeploy_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct FiretankDeploy_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FiretankDeploy_C_ReceiveTick) == 0x000004, "Wrong alignment on FiretankDeploy_C_ReceiveTick");
static_assert(sizeof(FiretankDeploy_C_ReceiveTick) == 0x000004, "Wrong size on FiretankDeploy_C_ReceiveTick");
static_assert(offsetof(FiretankDeploy_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'FiretankDeploy_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function firetankDeploy.firetankDeploy_C.spawnParts
// 0x0350 (0x0350 - 0x0000)
struct FiretankDeploy_C_SpawnParts final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TArray<struct FRotator>                       K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Array_Get_Item;                           // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AFiretank_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_4;                               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x0200(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0228(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_safeAsProp_isValid;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_safeAsProp_prop;                          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FiretankDeploy_C_SpawnParts) == 0x000010, "Wrong alignment on FiretankDeploy_C_SpawnParts");
static_assert(sizeof(FiretankDeploy_C_SpawnParts) == 0x000350, "Wrong size on FiretankDeploy_C_SpawnParts");
static_assert(offsetof(FiretankDeploy_C_SpawnParts, Temp_int_Variable) == 0x000000, "Member 'FiretankDeploy_C_SpawnParts::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_SpawnParts, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'FiretankDeploy_C_SpawnParts::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FiretankDeploy_C_SpawnParts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'FiretankDeploy_C_SpawnParts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
