#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function fire.fire_C.ExecuteUbergraph_fire
// 0x0060 (0x0060 - 0x0000)
struct Fire_C_ExecuteUbergraph_fire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UFlammable_C*                           CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Fire_C_ExecuteUbergraph_fire) == 0x000010, "Wrong alignment on Fire_C_ExecuteUbergraph_fire");
static_assert(sizeof(Fire_C_ExecuteUbergraph_fire) == 0x000060, "Wrong size on Fire_C_ExecuteUbergraph_fire");
static_assert(offsetof(Fire_C_ExecuteUbergraph_fire, EntryPoint) == 0x000000, "Member 'Fire_C_ExecuteUbergraph_fire::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fire_C_ExecuteUbergraph_fire, Temp_struct_Variable) == 0x000010, "Member 'Fire_C_ExecuteUbergraph_fire::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Fire_C_ExecuteUbergraph_fire, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'Fire_C_ExecuteUbergraph_fire::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fire_C_ExecuteUbergraph_fire, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'Fire_C_ExecuteUbergraph_fire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

