#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FishingDropSpot

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass fishingDropSpot.fishingDropSpot_C
// 0x0068 (0x0288 - 0x0220)
class AFishingDropSpot_C final : public AActor
{
public:
	class USphereComponent*                       Sphere;                                            // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      Drop;                                              // 0x0238(0x0050)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();
	void AppendDrop(const TMap<class FName, float>& InputPin, TMap<class FName, float>* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"fishingDropSpot_C">();
	}
	static class AFishingDropSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFishingDropSpot_C>();
	}
};
static_assert(alignof(AFishingDropSpot_C) == 0x000008, "Wrong alignment on AFishingDropSpot_C");
static_assert(sizeof(AFishingDropSpot_C) == 0x000288, "Wrong size on AFishingDropSpot_C");
static_assert(offsetof(AFishingDropSpot_C, Sphere) == 0x000220, "Member 'AFishingDropSpot_C::Sphere' has a wrong offset!");
static_assert(offsetof(AFishingDropSpot_C, DefaultSceneRoot) == 0x000228, "Member 'AFishingDropSpot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AFishingDropSpot_C, Radius) == 0x000230, "Member 'AFishingDropSpot_C::Radius' has a wrong offset!");
static_assert(offsetof(AFishingDropSpot_C, Drop) == 0x000238, "Member 'AFishingDropSpot_C::Drop' has a wrong offset!");

}

