#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flammable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass flammable.flammable_C
// 0x0050 (0x0100 - 0x00B0)
class UFlammable_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Owner;                                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Particle;                                          // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBurning;                                         // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E71[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Fuel;                                              // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Static;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                b_orig;                                            // 0x00E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                b_ext;                                             // 0x00F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_flammable(int32 EntryPoint);
	void Des(class AActor* DestroyedActor);
	void Extinguish();
	void Ignite_s(float Param_Fuel);
	void ReceiveBeginPlay();
	void bound(const class USceneComponent* Param_Component, struct FVector* Origin, struct FVector* BoxExtent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"flammable_C">();
	}
	static class UFlammable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlammable_C>();
	}
};
static_assert(alignof(UFlammable_C) == 0x000008, "Wrong alignment on UFlammable_C");
static_assert(sizeof(UFlammable_C) == 0x000100, "Wrong size on UFlammable_C");
static_assert(offsetof(UFlammable_C, UberGraphFrame) == 0x0000B0, "Member 'UFlammable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFlammable_C, Owner) == 0x0000B8, "Member 'UFlammable_C::Owner' has a wrong offset!");
static_assert(offsetof(UFlammable_C, Component) == 0x0000C0, "Member 'UFlammable_C::Component' has a wrong offset!");
static_assert(offsetof(UFlammable_C, Audio) == 0x0000C8, "Member 'UFlammable_C::Audio' has a wrong offset!");
static_assert(offsetof(UFlammable_C, Particle) == 0x0000D0, "Member 'UFlammable_C::Particle' has a wrong offset!");
static_assert(offsetof(UFlammable_C, IsBurning) == 0x0000D8, "Member 'UFlammable_C::IsBurning' has a wrong offset!");
static_assert(offsetof(UFlammable_C, Fuel) == 0x0000DC, "Member 'UFlammable_C::Fuel' has a wrong offset!");
static_assert(offsetof(UFlammable_C, Static) == 0x0000E0, "Member 'UFlammable_C::Static' has a wrong offset!");
static_assert(offsetof(UFlammable_C, b_orig) == 0x0000E8, "Member 'UFlammable_C::b_orig' has a wrong offset!");
static_assert(offsetof(UFlammable_C, b_ext) == 0x0000F4, "Member 'UFlammable_C::b_ext' has a wrong offset!");

}

