#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flamethrower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function flamethrower.flamethrower_C.ExecuteUbergraph_flamethrower
// 0x0228 (0x0228 - 0x0000)
struct Flamethrower_C_ExecuteUbergraph_flamethrower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_dynPhysPawn_obj;                      // 0x0068(0x0010)(ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPawn_obj;                      // 0x0078(0x0010)(ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x01E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Flamethrower_C_ExecuteUbergraph_flamethrower) == 0x000008, "Wrong alignment on Flamethrower_C_ExecuteUbergraph_flamethrower");
static_assert(sizeof(Flamethrower_C_ExecuteUbergraph_flamethrower) == 0x000228, "Wrong size on Flamethrower_C_ExecuteUbergraph_flamethrower");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, EntryPoint) == 0x000000, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::EntryPoint' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, Temp_int_Variable) == 0x000004, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000018, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00001C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, Temp_object_Variable) == 0x000020, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000030, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_GetForwardVector_ReturnValue) == 0x000034, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000040, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_RandomUnitVector_ReturnValue) == 0x00004C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_obj_dynPhysPawn_obj) == 0x000068, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_obj_dynPhysPawn_obj' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_obj_statDynPawn_obj) == 0x000078, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_obj_statDynPawn_obj' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000088, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_VLerp_ReturnValue) == 0x00008C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000098, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00009C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_SetVectorLength_ReturnValue) == 0x0000A8, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0000B4, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0000C0, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000148, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_bBlockingHit) == 0x000149, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_bInitialOverlap) == 0x00014A, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_Location) == 0x000154, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_Normal) == 0x00016C, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_HitItem) == 0x0001A8, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_ElementIndex) == 0x0001AC, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_FaceIndex) == 0x0001B0, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_TraceStart) == 0x0001B4, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_BreakHitResult_TraceEnd) == 0x0001C0, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Vector_Distance_ReturnValue) == 0x0001CC, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001D4, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001D8, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0001DC, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001E0, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Array_Add_ReturnValue) == 0x0001E4, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_SphereOverlapActors_OutActors) == 0x0001E8, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_SphereOverlapActors_ReturnValue) == 0x0001F8, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Array_Get_Item) == 0x000200, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, K2Node_DynamicCast_AsInt_Objects) == 0x000210, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_ExecuteUbergraph_flamethrower, CallFunc_Less_IntInt_ReturnValue) == 0x000221, "Member 'Flamethrower_C_ExecuteUbergraph_flamethrower::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function flamethrower.flamethrower_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Flamethrower_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Flamethrower_C_ReceiveTick) == 0x000004, "Wrong alignment on Flamethrower_C_ReceiveTick");
static_assert(sizeof(Flamethrower_C_ReceiveTick) == 0x000004, "Wrong size on Flamethrower_C_ReceiveTick");
static_assert(offsetof(Flamethrower_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Flamethrower_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function flamethrower.flamethrower_C.Activate
// 0x0002 (0x0002 - 0x0000)
struct Flamethrower_C_Activate final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Flamethrower_C_Activate) == 0x000001, "Wrong alignment on Flamethrower_C_Activate");
static_assert(sizeof(Flamethrower_C_Activate) == 0x000002, "Wrong size on Flamethrower_C_Activate");
static_assert(offsetof(Flamethrower_C_Activate, bNewActive) == 0x000000, "Member 'Flamethrower_C_Activate::bNewActive' has a wrong offset!");
static_assert(offsetof(Flamethrower_C_Activate, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'Flamethrower_C_Activate::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

