#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fossilhound_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass fossilhound_Skeleton_AnimBlueprint.fossilhound_Skeleton_AnimBlueprint_C
// 0x03E0 (0x06A0 - 0x02C0)
class UFossilhound_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_21B7[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x02C8(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x03B0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0470(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x04A0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x05F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0620(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0648(0x0048)()
	float                                         Run;                                               // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21B8[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFossilhound_C*                         Owner;                                             // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_D77881814FD698BAF6AC08AD971C1F90();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"fossilhound_Skeleton_AnimBlueprint_C">();
	}
	static class UFossilhound_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFossilhound_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UFossilhound_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UFossilhound_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UFossilhound_Skeleton_AnimBlueprint_C) == 0x0006A0, "Wrong size on UFossilhound_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x0002C8, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x0003B0, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x000470, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0004A0, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x0005F8, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000620, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000648, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, Run) == 0x000690, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::Run' has a wrong offset!");
static_assert(offsetof(UFossilhound_Skeleton_AnimBlueprint_C, Owner) == 0x000698, "Member 'UFossilhound_Skeleton_AnimBlueprint_C::Owner' has a wrong offset!");

}

