#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fossilhound_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function fossilhound_Skeleton_AnimBlueprint.fossilhound_Skeleton_AnimBlueprint_C.ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint
// 0x0028 (0x0028 - 0x0000)
struct Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint");
static_assert(sizeof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint) == 0x000028, "Wrong size on Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, CallFunc_VSize_ReturnValue) == 0x00001C, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000024, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_ExecuteUbergraph_fossilhound_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function fossilhound_Skeleton_AnimBlueprint.fossilhound_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function fossilhound_Skeleton_AnimBlueprint.fossilhound_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Fossilhound_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

