#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fossilhound

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "InputCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_physSound_structs.hpp"


namespace SDK::Params
{

// Function fossilhound.fossilhound_C.ExecuteUbergraph_fossilhound
// 0x0BD0 (0x0BD0 - 0x0000)
struct Fossilhound_C_ExecuteUbergraph_fossilhound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0088(0x0010)(ConstParm, ReferenceParm)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x0224(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x03A0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x03D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0498(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0540(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0578(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFossilhound_Skeleton_AnimBlueprint_C*  K2Node_DynamicCast_AsFossilhound_Skeleton_Anim_Blueprint; // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x3];                                      // 0x05A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x05C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_filterPawns_pass;                         // 0x05C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C7[0x1];                                      // 0x05C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x05D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x065D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x065E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65F[0x1];                                      // 0x065F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66A[0x2];                                      // 0x066A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x0672(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_673[0x5];                                      // 0x0673(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0684(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_biteZone_OutActors;                       // 0x06A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_biteZone_ReturnValue;                     // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x3];                                      // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x06B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_biteZone_OutActors_1;                     // 0x06C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_biteZone_ReturnValue_1;                   // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x06E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_709[0x3];                                      // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x070C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0718(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0728(0x0010)(ReferenceParm)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x073C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x07C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C5[0x3];                                      // 0x07C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x07CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CE[0x2];                                      // 0x07CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x07D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x07E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x07F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x07FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0818(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0834(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0840(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_physSound_return;                         // 0x084C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84D[0x3];                                      // 0x084D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      CallFunc_physSound_data;                           // 0x0850(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0894(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x091C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x091D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91E[0x2];                                      // 0x091E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0928(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0934(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0940(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x094C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0968(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x097C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0984(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0990(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x099C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x09A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x09B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x09C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x09D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASusDirtHole_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11[0x3];                                      // 0x0A11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0A14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0A20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0A24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0A25(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A26[0x2];                                      // 0x0A26(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0A34(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0ABC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0AC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC9[0x3];                                      // 0x0AC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0ACC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0AD8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0AE4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0AF0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0AFC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0B04(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B14[0xC];                                      // 0x0B14(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0B20(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B51[0x7];                                      // 0x0B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0B58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0B60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0B68(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B74[0xC];                                      // 0x0B74(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0B80(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0BB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_fossCrys_C*                       CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0BC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fossilhound_C_ExecuteUbergraph_fossilhound) == 0x000010, "Wrong alignment on Fossilhound_C_ExecuteUbergraph_fossilhound");
static_assert(sizeof(Fossilhound_C_ExecuteUbergraph_fossilhound) == 0x000BD0, "Wrong size on Fossilhound_C_ExecuteUbergraph_fossilhound");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, EntryPoint) == 0x000000, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_byte_Variable) == 0x000004, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_4) == 0x000008, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_3) == 0x000020, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_2) == 0x000038, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_1) == 0x000050, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName) == 0x000068, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_name_Variable) == 0x000080, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_object_Variable) == 0x000088, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_byte_Variable_1) == 0x000098, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_MovementResult) == 0x000099, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_MovementResult_2) == 0x00009A, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_5) == 0x0000A8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_6) == 0x0000AC, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_actor_1) == 0x000138, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_impact_1) == 0x000140, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water_3) == 0x000150, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water_2) == 0x000158, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water_1) == 0x000160, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water) == 0x000168, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_activate) == 0x000170, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_static) == 0x000171, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_frozen) == 0x000172, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_active) == 0x000173, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_key_1) == 0x000178, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_12) == 0x000188, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_5) == 0x000190, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_4) == 0x000218, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_fuel) == 0x00021C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_3) == 0x000220, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hot) == 0x000224, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_11) == 0x0002B0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_4) == 0x0002B8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_action) == 0x000340, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_10) == 0x000348, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_9) == 0x000350, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_2) == 0x000358, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_location_1) == 0x00035C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_8) == 0x000368, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_7) == 0x000370, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_6) == 0x000378, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_wheelDelta) == 0x000380, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_5) == 0x000388, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_mouse) == 0x000390, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_4) == 0x000398, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_key) == 0x0003A0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_pressed) == 0x0003B8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_temperature_1) == 0x0003BC, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_temperature) == 0x0003C0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_speed) == 0x0003C4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_3) == 0x0003C8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_3) == 0x0003D0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_name) == 0x000458, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_volume) == 0x000468, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_2) == 0x000470, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_location) == 0x000478, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_1) == 0x000484, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_clean_1) == 0x000488, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_1) == 0x000490, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_2) == 0x000498, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hook_1) == 0x000520, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_clean) == 0x000528, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player) == 0x000530, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hook) == 0x000538, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_5) == 0x000540, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000550, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_RandomFloatInRange_ReturnValue) == 0x00055C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000560, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x00056C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000570, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_6) == 0x000578, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue) == 0x000588, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_GetAnimInstance_ReturnValue) == 0x000590, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_DynamicCast_AsFossilhound_Skeleton_Anim_Blueprint) == 0x000598, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_DynamicCast_AsFossilhound_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_DynamicCast_bSuccess) == 0x0005A0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_DeltaSeconds) == 0x0005A4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0005A8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_GetVelocity_ReturnValue) == 0x0005AC, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
