#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fossilhound

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_physSound_structs.hpp"


namespace SDK::Params
{

// Function fossilhound.fossilhound_C.ExecuteUbergraph_fossilhound
// 0x0B10 (0x0B10 - 0x0000)
struct Fossilhound_C_ExecuteUbergraph_fossilhound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_240C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0088(0x0010)(ConstParm, ReferenceParm)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_240D[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_240E[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_240F[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2410[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0228(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2411[0x3];                                     // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2412[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0310(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2413[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0340(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2414[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2415[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0408(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0498(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2416[0x3];                                     // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x04D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2417[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFossilhound_Skeleton_AnimBlueprint_C*  K2Node_DynamicCast_AsFossilhound_Skeleton_Anim_Blueprint; // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2418[0x3];                                     // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2419[0x3];                                     // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x051D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241A[0x2];                                     // 0x051E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x052C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241B[0x1];                                     // 0x05B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241C[0x2];                                     // 0x05C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241D[0x5];                                     // 0x05CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241E[0x3];                                     // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x05DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x05E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241F[0x4];                                     // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_biteZone_OutActors;                       // 0x05F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_biteZone_ReturnValue;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2420[0x3];                                     // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x060C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2421[0x4];                                     // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_biteZone_OutActors_1;                     // 0x0620(0x0010)(ReferenceParm)
	bool                                          CallFunc_biteZone_ReturnValue_1;                   // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2422[0x7];                                     // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0640(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2423[0x3];                                     // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0670(0x0010)(ReferenceParm)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0684(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2424[0x3];                                     // 0x070D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0715(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2425[0x2];                                     // 0x0716(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0720(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0760(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2426[0x4];                                     // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      CallFunc_physSound_return;                         // 0x0798(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x07DC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0864(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0865(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2427[0x2];                                     // 0x0866(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0870(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x087C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0888(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0894(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x08B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x08CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x08D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x08E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x08F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0900(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x090C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2428[0x8];                                     // 0x0918(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0920(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASusDirtHole_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2429[0x3];                                     // 0x0961(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0974(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0975(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242A[0x2];                                     // 0x0976(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0984(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0A0C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242B[0x2];                                     // 0x0A1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0A1C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0A28(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0A34(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0A40(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0A4C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0A54(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242C[0xC];                                     // 0x0A64(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0A70(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242D[0x7];                                     // 0x0AA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0AB8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242E[0xC];                                     // 0x0AC4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0AD0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_fossCrys_C*                       CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fossilhound_C_ExecuteUbergraph_fossilhound) == 0x000010, "Wrong alignment on Fossilhound_C_ExecuteUbergraph_fossilhound");
static_assert(sizeof(Fossilhound_C_ExecuteUbergraph_fossilhound) == 0x000B10, "Wrong size on Fossilhound_C_ExecuteUbergraph_fossilhound");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, EntryPoint) == 0x000000, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_byte_Variable) == 0x000004, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_4) == 0x000008, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_3) == 0x000020, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_2) == 0x000038, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName_1) == 0x000050, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_NotifyName) == 0x000068, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_name_Variable) == 0x000080, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_object_Variable) == 0x000088, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_byte_Variable_1) == 0x000098, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_MovementResult) == 0x000099, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_MovementResult_2) == 0x00009A, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_4) == 0x0000A8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_6) == 0x0000AC, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_actor_1) == 0x000138, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_impact_1) == 0x000140, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water_3) == 0x000150, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water_2) == 0x000158, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water_1) == 0x000160, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_water) == 0x000168, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_activate) == 0x000170, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_static) == 0x000171, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_frozen) == 0x000172, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_active) == 0x000173, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_key_1) == 0x000178, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_11) == 0x000188, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_5) == 0x000190, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_3) == 0x000218, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_fuel) == 0x00021C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_10) == 0x000220, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_4) == 0x000228, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_index) == 0x0002B0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_action) == 0x0002B4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_9) == 0x0002B8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_8) == 0x0002C0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_2) == 0x0002C8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_location_1) == 0x0002CC, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_7) == 0x0002D8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_6) == 0x0002E0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_5) == 0x0002E8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_wheelDelta) == 0x0002F0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_4) == 0x0002F8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_mouse) == 0x000300, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_3) == 0x000308, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_key) == 0x000310, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_pressed) == 0x000328, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_temperature_1) == 0x00032C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_temperature) == 0x000330, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_speed) == 0x000334, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_2) == 0x000338, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_3) == 0x000340, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_name) == 0x0003C8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_volume) == 0x0003D8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player_1) == 0x0003E0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_location) == 0x0003E8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_damage_1) == 0x0003F4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_clean) == 0x0003F8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_player) == 0x000400, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hit_2) == 0x000408, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_hook) == 0x000490, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_5) == 0x000498, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004A8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_RandomFloatInRange_ReturnValue) == 0x0004B4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x0004B8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x0004C4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x0004C8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004D0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue) == 0x0004E0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_GetAnimInstance_ReturnValue) == 0x0004E8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_DynamicCast_AsFossilhound_Skeleton_Anim_Blueprint) == 0x0004F0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_DynamicCast_AsFossilhound_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_DynamicCast_bSuccess) == 0x0004F8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_Event_DeltaSeconds) == 0x0004FC, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000500, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_GetVelocity_ReturnValue) == 0x000504, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_ComponentBoundEvent_Pawn) == 0x000510, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_VSize_ReturnValue) == 0x000518, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue_1) == 0x00051C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00051D, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000520, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00052C, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, K2Node_CustomEvent_MovementResult_1) == 0x0005B4, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue_2) == 0x0005B5, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue_3) == 0x0005B6, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_CreateMoveToProxyObject_ReturnValue_1) == 0x0005B8, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_CreateMoveToProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue_4) == 0x0005C0, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fossilhound_C_ExecuteUbergraph_fossilhound, CallFunc_IsValid_ReturnValue_5) == 0x0005C1, "Member 'Fossilhound_C_ExecuteUbergraph_fossilhound::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
