#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fprints

#include "Basic.hpp"


namespace SDK::Params
{

// Function fprints.fprints_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Fprints_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fprints_C_ReceiveTick) == 0x000004, "Wrong alignment on Fprints_C_ReceiveTick");
static_assert(sizeof(Fprints_C_ReceiveTick) == 0x000004, "Wrong size on Fprints_C_ReceiveTick");
static_assert(offsetof(Fprints_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Fprints_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function fprints.fprints_C.ExecuteUbergraph_fprints
// 0x0010 (0x0010 - 0x0000)
struct Fprints_C_ExecuteUbergraph_fprints final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fprints_C_ExecuteUbergraph_fprints) == 0x000004, "Wrong alignment on Fprints_C_ExecuteUbergraph_fprints");
static_assert(sizeof(Fprints_C_ExecuteUbergraph_fprints) == 0x000010, "Wrong size on Fprints_C_ExecuteUbergraph_fprints");
static_assert(offsetof(Fprints_C_ExecuteUbergraph_fprints, EntryPoint) == 0x000000, "Member 'Fprints_C_ExecuteUbergraph_fprints::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fprints_C_ExecuteUbergraph_fprints, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Fprints_C_ExecuteUbergraph_fprints::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Fprints_C_ExecuteUbergraph_fprints, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'Fprints_C_ExecuteUbergraph_fprints::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Fprints_C_ExecuteUbergraph_fprints, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Fprints_C_ExecuteUbergraph_fprints::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Fprints_C_ExecuteUbergraph_fprints, CallFunc_WasRecentlyRendered_ReturnValue) == 0x00000C, "Member 'Fprints_C_ExecuteUbergraph_fprints::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fprints_C_ExecuteUbergraph_fprints, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00000D, "Member 'Fprints_C_ExecuteUbergraph_fprints::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

}

