#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fridge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function fridge.fridge_C.R
// 0x0068 (0x0068 - 0x0000)
struct Fridge_C_R final
{
public:
	struct FVector                                Param_Elepor;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue_1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fridge_C_R) == 0x000004, "Wrong alignment on Fridge_C_R");
static_assert(sizeof(Fridge_C_R) == 0x000068, "Wrong size on Fridge_C_R");
static_assert(offsetof(Fridge_C_R, Param_Elepor) == 0x000000, "Member 'Fridge_C_R::Param_Elepor' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, Temp_int_Variable) == 0x00000C, "Member 'Fridge_C_R::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'Fridge_C_R::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_SignOfFloat_ReturnValue) == 0x000014, "Member 'Fridge_C_R::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'Fridge_C_R::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'Fridge_C_R::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'Fridge_C_R::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000024, "Member 'Fridge_C_R::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000028, "Member 'Fridge_C_R::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'Fridge_C_R::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000038, "Member 'Fridge_C_R::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_SignOfFloat_ReturnValue_1) == 0x00003C, "Member 'Fridge_C_R::CallFunc_SignOfFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000040, "Member 'Fridge_C_R::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000044, "Member 'Fridge_C_R::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000048, "Member 'Fridge_C_R::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x00004C, "Member 'Fridge_C_R::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, CallFunc_MakeVector_ReturnValue_1) == 0x000050, "Member 'Fridge_C_R::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_R, K2Node_Select_Default) == 0x00005C, "Member 'Fridge_C_R::K2Node_Select_Default' has a wrong offset!");

// Function fridge.fridge_C.G
// 0x0028 (0x0028 - 0x0000)
struct Fridge_C_G final
{
public:
	class UMaterialInstanceDynamic*               Dyn;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_Base64ToBytes_ReturnValue;                // 0x0008(0x0010)(ReferenceParm)
	class UTexture2D*                             CallFunc_ImportBufferAsTexture2D_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fridge_C_G) == 0x000008, "Wrong alignment on Fridge_C_G");
static_assert(sizeof(Fridge_C_G) == 0x000028, "Wrong size on Fridge_C_G");
static_assert(offsetof(Fridge_C_G, Dyn) == 0x000000, "Member 'Fridge_C_G::Dyn' has a wrong offset!");
static_assert(offsetof(Fridge_C_G, CallFunc_Base64ToBytes_ReturnValue) == 0x000008, "Member 'Fridge_C_G::CallFunc_Base64ToBytes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_G, CallFunc_ImportBufferAsTexture2D_ReturnValue) == 0x000018, "Member 'Fridge_C_G::CallFunc_ImportBufferAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_G, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'Fridge_C_G::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function fridge.fridge_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Fridge_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fridge_C_ReceiveTick) == 0x000004, "Wrong alignment on Fridge_C_ReceiveTick");
static_assert(sizeof(Fridge_C_ReceiveTick) == 0x000004, "Wrong size on Fridge_C_ReceiveTick");
static_assert(offsetof(Fridge_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Fridge_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function fridge.fridge_C.ExecuteUbergraph_fridge
// 0x0260 (0x0260 - 0x0000)
struct Fridge_C_ExecuteUbergraph_fridge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue_1;            // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBox_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWalking_ReturnValue;                    // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_r_elepor;                                 // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x017C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0257(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fridge_C_ExecuteUbergraph_fridge) == 0x000008, "Wrong alignment on Fridge_C_ExecuteUbergraph_fridge");
static_assert(sizeof(Fridge_C_ExecuteUbergraph_fridge) == 0x000260, "Wrong size on Fridge_C_ExecuteUbergraph_fridge");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, EntryPoint) == 0x000000, "Member 'Fridge_C_ExecuteUbergraph_fridge::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000018, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000024, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_VSize_ReturnValue) == 0x000034, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Cross_VectorVector_ReturnValue) == 0x000038, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Less_FloatFloat_ReturnValue) == 0x000044, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_SetVectorLength_ReturnValue) == 0x000048, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_SetVectorLength_ReturnValue_1) == 0x000054, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_SetVectorLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000060, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000068, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000074, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x000080, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_IsPointInBox_ReturnValue) == 0x00008C, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_IsPointInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Not_PreBool_ReturnValue) == 0x00009C, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_BooleanOR_ReturnValue) == 0x00009D, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_IsWalking_ReturnValue) == 0x00009E, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_IsWalking_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_r_elepor) == 0x0000A0, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_r_elepor' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000AC, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000B0, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000138, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_SetGamePaused_ReturnValue) == 0x000139, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_GetPlayerController_ReturnValue) == 0x000140, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, K2Node_Event_DeltaSeconds) == 0x000148, "Member 'Fridge_C_ExecuteUbergraph_fridge::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000150, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000158, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000164, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_FindLookAtRotation_ReturnValue) == 0x000170, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00017C, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000204, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000208, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00020C, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000218, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_GetActorForwardVector_ReturnValue) == 0x000220, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x00022C, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x000238, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Normal_ReturnValue) == 0x000244, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Dot_VectorVector_ReturnValue) == 0x000250, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000254, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_BooleanAND_ReturnValue) == 0x000255, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_BooleanAND_ReturnValue_1) == 0x000256, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_BooleanAND_ReturnValue_2) == 0x000257, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fridge_C_ExecuteUbergraph_fridge, CallFunc_BooleanAND_ReturnValue_3) == 0x000258, "Member 'Fridge_C_ExecuteUbergraph_fridge::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

}

