#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FuelingArir

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass fuelingArir.fuelingArir_C
// 0x0038 (0x0258 - 0x0220)
class AFuelingArir_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Spawn;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Eye;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Gas;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Drop;                                              // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_fuelingArir(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void CheckVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"fuelingArir_C">();
	}
	static class AFuelingArir_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFuelingArir_C>();
	}
};
static_assert(alignof(AFuelingArir_C) == 0x000008, "Wrong alignment on AFuelingArir_C");
static_assert(sizeof(AFuelingArir_C) == 0x000258, "Wrong size on AFuelingArir_C");
static_assert(offsetof(AFuelingArir_C, UberGraphFrame) == 0x000220, "Member 'AFuelingArir_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFuelingArir_C, Spawn) == 0x000228, "Member 'AFuelingArir_C::Spawn' has a wrong offset!");
static_assert(offsetof(AFuelingArir_C, Eye) == 0x000230, "Member 'AFuelingArir_C::Eye' has a wrong offset!");
static_assert(offsetof(AFuelingArir_C, Gas) == 0x000238, "Member 'AFuelingArir_C::Gas' has a wrong offset!");
static_assert(offsetof(AFuelingArir_C, StaticMesh) == 0x000240, "Member 'AFuelingArir_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AFuelingArir_C, DefaultSceneRoot) == 0x000248, "Member 'AFuelingArir_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AFuelingArir_C, Drop) == 0x000250, "Member 'AFuelingArir_C::Drop' has a wrong offset!");

}

