#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FuelingArir

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function fuelingArir.fuelingArir_C.ExecuteUbergraph_fuelingArir
// 0x01E0 (0x01E0 - 0x0000)
struct FuelingArir_C_ExecuteUbergraph_fuelingArir final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class AArirSlapper_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0140(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0150(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FuelingArir_C_ExecuteUbergraph_fuelingArir) == 0x000010, "Wrong alignment on FuelingArir_C_ExecuteUbergraph_fuelingArir");
static_assert(sizeof(FuelingArir_C_ExecuteUbergraph_fuelingArir) == 0x0001E0, "Wrong size on FuelingArir_C_ExecuteUbergraph_fuelingArir");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, EntryPoint) == 0x000000, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::EntryPoint' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, Temp_object_Variable) == 0x000020, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, K2Node_CreateDelegate_OutputDelegate) == 0x0000A8, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C0, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_RandomUnitVector_ReturnValue) == 0x0000C8, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_RandomUnitVector_ReturnValue_1) == 0x0000D4, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000E0, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000EC, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F8, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000104, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000110, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000118, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, K2Node_DynamicCast_AsInt_Player) == 0x000120, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_asProp_return) == 0x000138, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_obj_statDyn_obj) == 0x000140, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000150, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(FuelingArir_C_ExecuteUbergraph_fuelingArir, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001D8, "Member 'FuelingArir_C_ExecuteUbergraph_fuelingArir::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");

}

