#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Funguy_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass funguy_Skeleton_AnimBlueprint.funguy_Skeleton_AnimBlueprint_C
// 0x0370 (0x0630 - 0x02C0)
class UFunguy_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0320(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0348(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x03C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03F8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04E0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0510(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05C0(0x0048)()
	float                                         Alpha;                                             // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Pawn;                                              // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Character;                                         // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFunguy_C*                              Funguy;                                            // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InGround;                                          // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_funguy_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_funguy_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_02684C654F02F666EC4107B352FDABE7();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"funguy_Skeleton_AnimBlueprint_C">();
	}
	static class UFunguy_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFunguy_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UFunguy_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UFunguy_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UFunguy_Skeleton_AnimBlueprint_C) == 0x000630, "Wrong size on UFunguy_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UFunguy_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_1) == 0x0002F8, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x000320, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000348, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x0003C8, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x0003F8, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x0004E0, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000510, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x0005C0, "Member 'UFunguy_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, Alpha) == 0x000608, "Member 'UFunguy_Skeleton_AnimBlueprint_C::Alpha' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, Pawn) == 0x000610, "Member 'UFunguy_Skeleton_AnimBlueprint_C::Pawn' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, Character) == 0x000618, "Member 'UFunguy_Skeleton_AnimBlueprint_C::Character' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, Funguy) == 0x000620, "Member 'UFunguy_Skeleton_AnimBlueprint_C::Funguy' has a wrong offset!");
static_assert(offsetof(UFunguy_Skeleton_AnimBlueprint_C, InGround) == 0x000628, "Member 'UFunguy_Skeleton_AnimBlueprint_C::InGround' has a wrong offset!");

}

