#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Funguy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass funguy.funguy_C
// 0x00D0 (0x0590 - 0x04C0)
class AFunguy_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPnormal_C*                             Pnormal;                                           // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Shroomer_0;                                        // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Shr2;                                              // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Shr1;                                              // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Shr0;                                              // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    ShroomerEnd;                                       // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Shroomer_3;                                        // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Shroomer_2;                                        // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Shroomer_1;                                        // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       EventRadius;                                       // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_radarPoint_C*                     Comp_radarPoint;                                   // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FunguyVoice;                                       // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       KnockOutRadius;                                    // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SeeRadius;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AwakeRadius;                                       // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RunSpeed;                                          // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkSpeed;                                         // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFunguy_Skeleton_AnimBlueprint_C*       Anim;                                              // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Landed;                                            // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Panic;                                             // 0x0561(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562[0x6];                                      // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         FilterIgnore;                                      // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         VoiceMode;                                         // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Awoken;                                            // 0x057C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Seen;                                              // 0x057D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E[0x2];                                      // 0x057E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         I;                                                 // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RunawayFrom;                                       // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_funguy(int32 EntryPoint);
	void Shroomed();
	void ReceiveDestroyed();
	void BndEvt__funguy_eventRadius_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__funguy_eventRadius_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Despawn();
	void TryAwake();
	void BndEvt__funguy_funguyVoice_K2Node_ComponentBoundEvent_3_OnAudioFinished__DelegateSignature();
	void BndEvt__funguy_knockOutRadius_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void RunAway();
	void Sensing();
	void OnLanded(const struct FHitResult& Hit);
	void Awake();
	void BndEvt__funguy_awakeRadius_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Move();
	void Step();
	void ReceiveBeginPlay();
	void OnCompleted_CAEC23214F9D301378099C97307A6B42(class FName NotifyName);
	void OnBlendOut_CAEC23214F9D301378099C97307A6B42(class FName NotifyName);
	void OnInterrupted_CAEC23214F9D301378099C97307A6B42(class FName NotifyName);
	void OnNotifyBegin_CAEC23214F9D301378099C97307A6B42(class FName NotifyName);
	void OnNotifyEnd_CAEC23214F9D301378099C97307A6B42(class FName NotifyName);
	void OnSuccess_7E6E02C047AC62F85EA40DA74522CB13(EPathFollowingResult MovementResult);
	void OnFail_7E6E02C047AC62F85EA40DA74522CB13(EPathFollowingResult MovementResult);
	void Sense(bool* Detected);
	void SetVoice();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"funguy_C">();
	}
	static class AFunguy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunguy_C>();
	}
};
static_assert(alignof(AFunguy_C) == 0x000010, "Wrong alignment on AFunguy_C");
static_assert(sizeof(AFunguy_C) == 0x000590, "Wrong size on AFunguy_C");
static_assert(offsetof(AFunguy_C, UberGraphFrame) == 0x0004C0, "Member 'AFunguy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Pnormal) == 0x0004C8, "Member 'AFunguy_C::Pnormal' has a wrong offset!");
static_assert(offsetof(AFunguy_C, ParticleSystem) == 0x0004D0, "Member 'AFunguy_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shroomer_0) == 0x0004D8, "Member 'AFunguy_C::Shroomer_0' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shr2) == 0x0004E0, "Member 'AFunguy_C::Shr2' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shr1) == 0x0004E8, "Member 'AFunguy_C::Shr1' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shr0) == 0x0004F0, "Member 'AFunguy_C::Shr0' has a wrong offset!");
static_assert(offsetof(AFunguy_C, ShroomerEnd) == 0x0004F8, "Member 'AFunguy_C::ShroomerEnd' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shroomer_3) == 0x000500, "Member 'AFunguy_C::Shroomer_3' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shroomer_2) == 0x000508, "Member 'AFunguy_C::Shroomer_2' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Shroomer_1) == 0x000510, "Member 'AFunguy_C::Shroomer_1' has a wrong offset!");
static_assert(offsetof(AFunguy_C, EventRadius) == 0x000518, "Member 'AFunguy_C::EventRadius' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Comp_radarPoint) == 0x000520, "Member 'AFunguy_C::Comp_radarPoint' has a wrong offset!");
static_assert(offsetof(AFunguy_C, FunguyVoice) == 0x000528, "Member 'AFunguy_C::FunguyVoice' has a wrong offset!");
static_assert(offsetof(AFunguy_C, KnockOutRadius) == 0x000530, "Member 'AFunguy_C::KnockOutRadius' has a wrong offset!");
static_assert(offsetof(AFunguy_C, SeeRadius) == 0x000538, "Member 'AFunguy_C::SeeRadius' has a wrong offset!");
static_assert(offsetof(AFunguy_C, AwakeRadius) == 0x000540, "Member 'AFunguy_C::AwakeRadius' has a wrong offset!");
static_assert(offsetof(AFunguy_C, SpringArm) == 0x000548, "Member 'AFunguy_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AFunguy_C, RunSpeed) == 0x000550, "Member 'AFunguy_C::RunSpeed' has a wrong offset!");
static_assert(offsetof(AFunguy_C, WalkSpeed) == 0x000554, "Member 'AFunguy_C::WalkSpeed' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Anim) == 0x000558, "Member 'AFunguy_C::Anim' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Landed) == 0x000560, "Member 'AFunguy_C::Landed' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Panic) == 0x000561, "Member 'AFunguy_C::Panic' has a wrong offset!");
static_assert(offsetof(AFunguy_C, FilterIgnore) == 0x000568, "Member 'AFunguy_C::FilterIgnore' has a wrong offset!");
static_assert(offsetof(AFunguy_C, VoiceMode) == 0x000578, "Member 'AFunguy_C::VoiceMode' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Awoken) == 0x00057C, "Member 'AFunguy_C::Awoken' has a wrong offset!");
static_assert(offsetof(AFunguy_C, Seen) == 0x00057D, "Member 'AFunguy_C::Seen' has a wrong offset!");
static_assert(offsetof(AFunguy_C, I) == 0x000580, "Member 'AFunguy_C::I' has a wrong offset!");
static_assert(offsetof(AFunguy_C, RunawayFrom) == 0x000588, "Member 'AFunguy_C::RunawayFrom' has a wrong offset!");

}

