#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FurfurAltarSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass furfurAltarSpawner.furfurAltarSpawner_C
// 0x0018 (0x0260 - 0x0248)
class AFurfurAltarSpawner_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FurfurAltarSpawner_C;               // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ADirthole_item_C*                       Hole;                                              // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void Dest(class AActor* DestroyedActor);
	void ExecuteUbergraph_furfurAltarSpawner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"furfurAltarSpawner_C">();
	}
	static class AFurfurAltarSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFurfurAltarSpawner_C>();
	}
};
static_assert(alignof(AFurfurAltarSpawner_C) == 0x000008, "Wrong alignment on AFurfurAltarSpawner_C");
static_assert(sizeof(AFurfurAltarSpawner_C) == 0x000260, "Wrong size on AFurfurAltarSpawner_C");
static_assert(offsetof(AFurfurAltarSpawner_C, UberGraphFrame_FurfurAltarSpawner_C) == 0x000248, "Member 'AFurfurAltarSpawner_C::UberGraphFrame_FurfurAltarSpawner_C' has a wrong offset!");
static_assert(offsetof(AFurfurAltarSpawner_C, ChildActor) == 0x000250, "Member 'AFurfurAltarSpawner_C::ChildActor' has a wrong offset!");
static_assert(offsetof(AFurfurAltarSpawner_C, Hole) == 0x000258, "Member 'AFurfurAltarSpawner_C::Hole' has a wrong offset!");

}

