#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FurfurAltarSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function furfurAltarSpawner.furfurAltarSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct FurfurAltarSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FurfurAltarSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on FurfurAltarSpawner_C_ReceiveTick");
static_assert(sizeof(FurfurAltarSpawner_C_ReceiveTick) == 0x000004, "Wrong size on FurfurAltarSpawner_C_ReceiveTick");
static_assert(offsetof(FurfurAltarSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'FurfurAltarSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function furfurAltarSpawner.furfurAltarSpawner_C.Dest
// 0x0008 (0x0008 - 0x0000)
struct FurfurAltarSpawner_C_Dest final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FurfurAltarSpawner_C_Dest) == 0x000008, "Wrong alignment on FurfurAltarSpawner_C_Dest");
static_assert(sizeof(FurfurAltarSpawner_C_Dest) == 0x000008, "Wrong size on FurfurAltarSpawner_C_Dest");
static_assert(offsetof(FurfurAltarSpawner_C_Dest, DestroyedActor) == 0x000000, "Member 'FurfurAltarSpawner_C_Dest::DestroyedActor' has a wrong offset!");

// Function furfurAltarSpawner.furfurAltarSpawner_C.ExecuteUbergraph_furfurAltarSpawner
// 0x0090 (0x0090 - 0x0000)
struct FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADirthole_item_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_save1_C>          CallFunc_setIgnoreSave_self_CastInput;             // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner) == 0x000010, "Wrong alignment on FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner");
static_assert(sizeof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner) == 0x000090, "Wrong size on FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, EntryPoint) == 0x000000, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000050, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, K2Node_CustomEvent_DestroyedActor) == 0x000070, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_setIgnoreSave_self_CastInput) == 0x000078, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_setIgnoreSave_self_CastInput' has a wrong offset!");
static_assert(offsetof(FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'FurfurAltarSpawner_C_ExecuteUbergraph_furfurAltarSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

