#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gearer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function gearer.gearer_C.ExecuteUbergraph_gearer
// 0x0040 (0x0040 - 0x0000)
struct Gearer_C_ExecuteUbergraph_gearer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EBB[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gearer_C_ExecuteUbergraph_gearer) == 0x000008, "Wrong alignment on Gearer_C_ExecuteUbergraph_gearer");
static_assert(sizeof(Gearer_C_ExecuteUbergraph_gearer) == 0x000040, "Wrong size on Gearer_C_ExecuteUbergraph_gearer");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, EntryPoint) == 0x000000, "Member 'Gearer_C_ExecuteUbergraph_gearer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, Temp_int_Variable) == 0x000004, "Member 'Gearer_C_ExecuteUbergraph_gearer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, Temp_int_Variable_1) == 0x00000C, "Member 'Gearer_C_ExecuteUbergraph_gearer::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, K2Node_Event_owner) == 0x000010, "Member 'Gearer_C_ExecuteUbergraph_gearer::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, K2Node_Event_index) == 0x000018, "Member 'Gearer_C_ExecuteUbergraph_gearer::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Array_Get_Item) == 0x000020, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_ExecuteUbergraph_gearer, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003C, "Member 'Gearer_C_ExecuteUbergraph_gearer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function gearer.gearer_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Gearer_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Gearer_C_RunTrigger) == 0x000008, "Wrong alignment on Gearer_C_RunTrigger");
static_assert(sizeof(Gearer_C_RunTrigger) == 0x000010, "Wrong size on Gearer_C_RunTrigger");
static_assert(offsetof(Gearer_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Gearer_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Gearer_C_RunTrigger, Param_Index) == 0x000008, "Member 'Gearer_C_RunTrigger::Param_Index' has a wrong offset!");

// Function gearer.gearer_C.gen_gear
// 0x0300 (0x0300 - 0x0000)
struct Gearer_C_Gen_gear final
{
public:
	struct FVector                                B;                                                 // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EBC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    A;                                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         I;                                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EBD[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EBE[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EBF[0x8];                                     // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC0[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC1[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_checkDist_overlap;                        // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC2[0x2];                                     // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC3[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC4[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0118(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0128(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC5[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC6[0x1];                                     // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0274(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Gearer_C_Gen_gear) == 0x000010, "Wrong alignment on Gearer_C_Gen_gear");
static_assert(sizeof(Gearer_C_Gen_gear) == 0x000300, "Wrong size on Gearer_C_Gen_gear");
static_assert(offsetof(Gearer_C_Gen_gear, B) == 0x000000, "Member 'Gearer_C_Gen_gear::B' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, A) == 0x000010, "Member 'Gearer_C_Gen_gear::A' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, I) == 0x000020, "Member 'Gearer_C_Gen_gear::I' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, Loc) == 0x000024, "Member 'Gearer_C_Gen_gear::Loc' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, K2Node_MakeArray_Array) == 0x000030, "Member 'Gearer_C_Gen_gear::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, Temp_int_Variable) == 0x000040, "Member 'Gearer_C_Gen_gear::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'Gearer_C_Gen_gear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RandomFloatInRange_ReturnValue) == 0x000048, "Member 'Gearer_C_Gen_gear::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00004C, "Member 'Gearer_C_Gen_gear::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000050, "Member 'Gearer_C_Gen_gear::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RandomBool_ReturnValue) == 0x000054, "Member 'Gearer_C_Gen_gear::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000058, "Member 'Gearer_C_Gen_gear::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_SelectFloat_ReturnValue) == 0x000064, "Member 'Gearer_C_Gen_gear::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Gearer_C_Gen_gear::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'Gearer_C_Gen_gear::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_AddComponent_ReturnValue) == 0x0000B0, "Member 'Gearer_C_Gen_gear::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'Gearer_C_Gen_gear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'Gearer_C_Gen_gear::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000C0, "Member 'Gearer_C_Gen_gear::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Gearer_C_Gen_gear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'Gearer_C_Gen_gear::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D4, "Member 'Gearer_C_Gen_gear::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_checkDist_overlap) == 0x0000D5, "Member 'Gearer_C_Gen_gear::CallFunc_checkDist_overlap' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'Gearer_C_Gen_gear::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BooleanAND_ReturnValue) == 0x0000E4, "Member 'Gearer_C_Gen_gear::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E8, "Member 'Gearer_C_Gen_gear::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0000F4, "Member 'Gearer_C_Gen_gear::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, Temp_int_Variable_1) == 0x0000F8, "Member 'Gearer_C_Gen_gear::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_MakeVector_ReturnValue_1) == 0x0000FC, "Member 'Gearer_C_Gen_gear::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_RotateAngleAxis_ReturnValue) == 0x000108, "Member 'Gearer_C_Gen_gear::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Greater_IntInt_ReturnValue) == 0x000114, "Member 'Gearer_C_Gen_gear::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, Temp_object_Variable) == 0x000118, "Member 'Gearer_C_Gen_gear::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_SphereTraceSingle_OutHit) == 0x000128, "Member 'Gearer_C_Gen_gear::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001B0, "Member 'Gearer_C_Gen_gear::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Array_Get_Item_1) == 0x0001B8, "Member 'Gearer_C_Gen_gear::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'Gearer_C_Gen_gear::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Less_IntInt_ReturnValue) == 0x0001C4, "Member 'Gearer_C_Gen_gear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C5, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C6, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_Time) == 0x0001C8, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_Distance) == 0x0001CC, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_Location) == 0x0001D0, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_ImpactPoint) == 0x0001DC, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_Normal) == 0x0001E8, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F4, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_HitItem) == 0x000220, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_ElementIndex) == 0x000224, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_FaceIndex) == 0x000228, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_TraceStart) == 0x00022C, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_BreakHitResult_TraceEnd) == 0x000238, "Member 'Gearer_C_Gen_gear::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000244, "Member 'Gearer_C_Gen_gear::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Normal_ReturnValue) == 0x000250, "Member 'Gearer_C_Gen_gear::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_Cross_VectorVector_ReturnValue) == 0x00025C, "Member 'Gearer_C_Gen_gear::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000268, "Member 'Gearer_C_Gen_gear::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_Gen_gear, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000274, "Member 'Gearer_C_Gen_gear::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function gearer.gearer_C.checkDist
// 0x0038 (0x0038 - 0x0000)
struct Gearer_C_CheckDist final
{
public:
	struct FVector                                V2;                                                // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Overlap;                                           // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EC8[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gearer_C_CheckDist) == 0x000004, "Wrong alignment on Gearer_C_CheckDist");
static_assert(sizeof(Gearer_C_CheckDist) == 0x000038, "Wrong size on Gearer_C_CheckDist");
static_assert(offsetof(Gearer_C_CheckDist, V2) == 0x000000, "Member 'Gearer_C_CheckDist::V2' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, Overlap) == 0x00000C, "Member 'Gearer_C_CheckDist::Overlap' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Gearer_C_CheckDist::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'Gearer_C_CheckDist::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Gearer_C_CheckDist::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Gearer_C_CheckDist::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, CallFunc_Array_Get_Item) == 0x000020, "Member 'Gearer_C_CheckDist::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Gearer_C_CheckDist::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, CallFunc_Vector_Distance_ReturnValue) == 0x000030, "Member 'Gearer_C_CheckDist::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Gearer_C_CheckDist, CallFunc_Less_FloatFloat_ReturnValue) == 0x000034, "Member 'Gearer_C_CheckDist::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function gearer.gearer_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Gearer_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Gearer_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on Gearer_C_IgnoreSave_trigger");
static_assert(sizeof(Gearer_C_IgnoreSave_trigger) == 0x000001, "Wrong size on Gearer_C_IgnoreSave_trigger");
static_assert(offsetof(Gearer_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'Gearer_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

}

