#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gearer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass gearer.gearer_C
// 0x0038 (0x02C0 - 0x0288)
class AGearer_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Gearer_C;                           // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Gears_loop_Cue;                                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Gears;                                             // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Amountt;                                           // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EBA[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Locs;                                              // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_gearer(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void Gen_gear();
	void CheckDist(const struct FVector& V2, bool* Overlap);
	void IgnoreSave_trigger(bool* Ignore);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"gearer_C">();
	}
	static class AGearer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGearer_C>();
	}
};
static_assert(alignof(AGearer_C) == 0x000008, "Wrong alignment on AGearer_C");
static_assert(sizeof(AGearer_C) == 0x0002C0, "Wrong size on AGearer_C");
static_assert(offsetof(AGearer_C, UberGraphFrame_Gearer_C) == 0x000288, "Member 'AGearer_C::UberGraphFrame_Gearer_C' has a wrong offset!");
static_assert(offsetof(AGearer_C, Gears_loop_Cue) == 0x000290, "Member 'AGearer_C::Gears_loop_Cue' has a wrong offset!");
static_assert(offsetof(AGearer_C, Gears) == 0x000298, "Member 'AGearer_C::Gears' has a wrong offset!");
static_assert(offsetof(AGearer_C, Amountt) == 0x0002A8, "Member 'AGearer_C::Amountt' has a wrong offset!");
static_assert(offsetof(AGearer_C, Locs) == 0x0002B0, "Member 'AGearer_C::Locs' has a wrong offset!");

}

