#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeneratorFuckuper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass generatorFuckuper.generatorFuckuper_C
// 0x0050 (0x0270 - 0x0220)
class AGeneratorFuckuper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               E1;                                                // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               E2;                                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               E3;                                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FridgeLoop1;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ElecStatTran;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Ind;                                               // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FFB[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEelecPole_C*>                   Poles;                                             // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void ExecuteUbergraph_generatorFuckuper(int32 EntryPoint);
	void SendElec();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Upd();
	void SetId();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"generatorFuckuper_C">();
	}
	static class AGeneratorFuckuper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGeneratorFuckuper_C>();
	}
};
static_assert(alignof(AGeneratorFuckuper_C) == 0x000008, "Wrong alignment on AGeneratorFuckuper_C");
static_assert(sizeof(AGeneratorFuckuper_C) == 0x000270, "Wrong size on AGeneratorFuckuper_C");
static_assert(offsetof(AGeneratorFuckuper_C, UberGraphFrame) == 0x000220, "Member 'AGeneratorFuckuper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, E1) == 0x000228, "Member 'AGeneratorFuckuper_C::E1' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, E2) == 0x000230, "Member 'AGeneratorFuckuper_C::E2' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, E3) == 0x000238, "Member 'AGeneratorFuckuper_C::E3' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, FridgeLoop1) == 0x000240, "Member 'AGeneratorFuckuper_C::FridgeLoop1' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, ElecStatTran) == 0x000248, "Member 'AGeneratorFuckuper_C::ElecStatTran' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, DefaultSceneRoot) == 0x000250, "Member 'AGeneratorFuckuper_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, Ind) == 0x000258, "Member 'AGeneratorFuckuper_C::Ind' has a wrong offset!");
static_assert(offsetof(AGeneratorFuckuper_C, Poles) == 0x000260, "Member 'AGeneratorFuckuper_C::Poles' has a wrong offset!");

}

