#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeomOctaLazer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function geomOctaLazer.geomOctaLazer_C.ExecuteUbergraph_geomOctaLazer
// 0x01C0 (0x01C0 - 0x0000)
struct GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPawn_obj;                      // 0x0030(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0064(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer) == 0x000010, "Wrong alignment on GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer");
static_assert(sizeof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer) == 0x0001C0, "Wrong size on GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, EntryPoint) == 0x000000, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, K2Node_MakeArray_Array) == 0x000010, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_obj_statDynPawn_obj) == 0x000030, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_obj_statDynPawn_obj' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000064, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0000EC, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_bBlockingHit) == 0x0000ED, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000EE, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_Time) == 0x0000F0, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_Distance) == 0x0000F4, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_Location) == 0x0000F8, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_ImpactPoint) == 0x000104, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_Normal) == 0x000110, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_ImpactNormal) == 0x00011C, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_SelectVector_ReturnValue) == 0x00016C, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'GeomOctaLazer_C_ExecuteUbergraph_geomOctaLazer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

