#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GluePoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function gluePoint.gluePoint_C.ExecuteUbergraph_gluePoint
// 0x00C0 (0x00C0 - 0x0000)
struct GluePoint_C_ExecuteUbergraph_gluePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGluePoint_C*                           K2Node_DynamicCast_AsGlue_Point;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GluePoint_C_ExecuteUbergraph_gluePoint) == 0x000008, "Wrong alignment on GluePoint_C_ExecuteUbergraph_gluePoint");
static_assert(sizeof(GluePoint_C_ExecuteUbergraph_gluePoint) == 0x0000C0, "Wrong size on GluePoint_C_ExecuteUbergraph_gluePoint");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, EntryPoint) == 0x000000, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_DynamicCast_AsGlue_Point) == 0x0000B0, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_DynamicCast_AsGlue_Point' has a wrong offset!");
static_assert(offsetof(GluePoint_C_ExecuteUbergraph_gluePoint, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'GluePoint_C_ExecuteUbergraph_gluePoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function gluePoint.gluePoint_C.BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'GluePoint_C_BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function gluePoint.gluePoint_C.glue
// 0x00F0 (0x00F0 - 0x0000)
struct GluePoint_C_Glue final
{
public:
	class AGluePoint_C*                           Point;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_GluedB;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0xE];                                       // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_1;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue_1;   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GluePoint_C_Glue) == 0x000010, "Wrong alignment on GluePoint_C_Glue");
static_assert(sizeof(GluePoint_C_Glue) == 0x0000F0, "Wrong size on GluePoint_C_Glue");
static_assert(offsetof(GluePoint_C_Glue, Point) == 0x000000, "Member 'GluePoint_C_Glue::Point' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, Param_GluedB) == 0x000008, "Member 'GluePoint_C_Glue::Param_GluedB' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'GluePoint_C_Glue::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'GluePoint_C_Glue::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'GluePoint_C_Glue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'GluePoint_C_Glue::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_BooleanAND_ReturnValue_1) == 0x000020, "Member 'GluePoint_C_Glue::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_BooleanAND_ReturnValue_2) == 0x000021, "Member 'GluePoint_C_Glue::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'GluePoint_C_Glue::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_InverseTransformLocation_ReturnValue) == 0x000060, "Member 'GluePoint_C_Glue::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000070, "Member 'GluePoint_C_Glue::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000078, "Member 'GluePoint_C_Glue::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, K2Node_DynamicCast_AsPrimitive_Component) == 0x000080, "Member 'GluePoint_C_Glue::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'GluePoint_C_Glue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, K2Node_DynamicCast_AsPrimitive_Component_1) == 0x000090, "Member 'GluePoint_C_Glue::K2Node_DynamicCast_AsPrimitive_Component_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'GluePoint_C_Glue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00009C, "Member 'GluePoint_C_Glue::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_GetTransform_ReturnValue_1) == 0x0000B0, "Member 'GluePoint_C_Glue::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GluePoint_C_Glue, CallFunc_InverseTransformLocation_ReturnValue_1) == 0x0000E0, "Member 'GluePoint_C_Glue::CallFunc_InverseTransformLocation_ReturnValue_1' has a wrong offset!");

}

