#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gost

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass gost.gost_C
// 0x0038 (0x0258 - 0x0220)
class AGost_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Box_Extent;                                        // 0x0238(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Origin;                                            // 0x0244(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimerVisibility;                                   // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimerTeleport;                                     // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void SetVisibility();
	void Teleport();
	void CustomEvent();
	void ExecuteUbergraph_gost(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"gost_C">();
	}
	static class AGost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGost_C>();
	}
};
static_assert(alignof(AGost_C) == 0x000008, "Wrong alignment on AGost_C");
static_assert(sizeof(AGost_C) == 0x000258, "Wrong size on AGost_C");
static_assert(offsetof(AGost_C, UberGraphFrame) == 0x000220, "Member 'AGost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGost_C, Plane) == 0x000228, "Member 'AGost_C::Plane' has a wrong offset!");
static_assert(offsetof(AGost_C, DefaultSceneRoot) == 0x000230, "Member 'AGost_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGost_C, Box_Extent) == 0x000238, "Member 'AGost_C::Box_Extent' has a wrong offset!");
static_assert(offsetof(AGost_C, Origin) == 0x000244, "Member 'AGost_C::Origin' has a wrong offset!");
static_assert(offsetof(AGost_C, TimerVisibility) == 0x000250, "Member 'AGost_C::TimerVisibility' has a wrong offset!");
static_assert(offsetof(AGost_C, TimerTeleport) == 0x000254, "Member 'AGost_C::TimerTeleport' has a wrong offset!");

}

