#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GravitygunComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function gravitygunComponent.gravitygunComponent_C.ExecuteUbergraph_gravitygunComponent
// 0x0700 (0x0700 - 0x0000)
struct GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21CA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hold_NewParam;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21CB[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hold_NewParam_1;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21CC[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21CD[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_trace_OutHit;                             // 0x0170(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21CE[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hold_NewParam_2;                          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21CF[0x1];                                     // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_trace_OutHit_1;                           // 0x0294(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D0[0x2];                                     // 0x031E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue_1;                    // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hold_NewParam_3;                          // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D1[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D2[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue_1;            // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D3[0x3];                                     // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue_2;                    // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue_2;            // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D4[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_gravgun_C*                        K2Node_DynamicCast_AsProp_Gravgun;                 // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D5[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0450(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D6[0x4];                                     // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x04F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D7[0x3];                                     // 0x052D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D8[0x3];                                     // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_3;            // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue_1;         // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x056C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D9[0x3];                                     // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_3;           // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DA[0x4];                                     // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_4;            // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x05E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DB[0x4];                                     // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_4;     // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DC[0x4];                                     // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_5;     // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_8;       // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DD[0xC];                                     // 0x0634(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0640(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_6;     // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0684(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0690(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DE[0x4];                                     // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x06A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x06DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DF[0x4];                                     // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x06F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent) == 0x000010, "Wrong alignment on GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent");
static_assert(sizeof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent) == 0x000700, "Wrong size on GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, EntryPoint) == 0x000000, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_hold_NewParam) == 0x000010, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_hold_NewParam' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetActorForwardVector_ReturnValue) == 0x000020, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_hold_NewParam_1) == 0x000038, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_hold_NewParam_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000040, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000048, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakTransform_Location) == 0x000084, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakTransform_Rotation) == 0x000090, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakTransform_Scale) == 0x00009C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakRotator_Roll) == 0x0000A8, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakRotator_Pitch) == 0x0000AC, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakRotator_Yaw) == 0x0000B0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_MakeRotator_ReturnValue) == 0x0000B4, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, K2Node_Event_DeltaSeconds) == 0x0000F0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetUpVector_ReturnValue) == 0x0000F4, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetRightVector_ReturnValue) == 0x000100, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetCenterOfMass_ReturnValue) == 0x00010C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetMass_ReturnValue) == 0x000118, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetComponentBounds_Origin) == 0x00011C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetComponentBounds_BoxExtent) == 0x000128, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetComponentBounds_SphereRadius) == 0x000134, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_FMax_ReturnValue) == 0x000138, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Add_FloatFloat_ReturnValue) == 0x00013C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000140, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000144, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x000154, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000160, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000164, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_trace_OutHit) == 0x000170, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_trace_OutHit' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001F8, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_bBlockingHit) == 0x000204, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_bInitialOverlap) == 0x000205, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Time) == 0x000208, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Distance) == 0x00020C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Location) == 0x000210, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_ImpactPoint) == 0x00021C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Normal) == 0x000228, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_ImpactNormal) == 0x000234, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitItem) == 0x000260, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_ElementIndex) == 0x000264, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_FaceIndex) == 0x000268, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_TraceStart) == 0x00026C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_TraceEnd) == 0x000278, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000284, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_hold_NewParam_2) == 0x000290, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_hold_NewParam_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000291, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_IsValid_ReturnValue_2) == 0x000292, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_trace_OutHit_1) == 0x000294, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_trace_OutHit_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00031C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00031D, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Time_1) == 0x000320, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Distance_1) == 0x000324, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Location_1) == 0x000328, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000334, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_Normal_1) == 0x000340, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_ImpactNormal_1) == 0x00034C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_PhysMat_1) == 0x000358, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitActor_1) == 0x000360, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitComponent_1) == 0x000368, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitBoneName_1) == 0x000370, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_HitItem_1) == 0x000378, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_ElementIndex_1) == 0x00037C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_FaceIndex_1) == 0x000380, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_TraceStart_1) == 0x000384, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakHitResult_TraceEnd_1) == 0x000390, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x00039C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetMass_ReturnValue_1) == 0x0003A8, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetMass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_SetVectorLength_ReturnValue) == 0x0003AC, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_FClamp_ReturnValue) == 0x0003B8, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_hold_NewParam_3) == 0x0003BC, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_hold_NewParam_3' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0003C0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x0003D0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x0003D8, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_SetVectorLength_ReturnValue_1) == 0x0003E4, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_SetVectorLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0003F0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0003F4, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_FMax_ReturnValue_1) == 0x0003F8, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0003FC, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetMass_ReturnValue_2) == 0x000400, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetMass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000404, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_FClamp_ReturnValue_1) == 0x000408, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00040C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x000410, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_SetVectorLength_ReturnValue_2) == 0x00041C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_SetVectorLength_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_getMainPlayer_AsMain_Player_2) == 0x000428, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000430, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, K2Node_DynamicCast_AsProp_Gravgun) == 0x000438, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::K2Node_DynamicCast_AsProp_Gravgun' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, K2Node_DynamicCast_bSuccess) == 0x000440, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetPlayerCameraManager_ReturnValue_3) == 0x000448, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_GetTransform_ReturnValue_1) == 0x000450, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000480, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakTransform_Location_1) == 0x00048C, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakTransform_Rotation_1) == 0x000498, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_BreakTransform_Scale_1) == 0x0004A4, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0004B0, "Member 'GravitygunComponent_C_ExecuteUbergraph_gravitygunComponent::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
