#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrayUfoSk_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function grayUfoSk_Skeleton_AnimBlueprint.grayUfoSk_Skeleton_AnimBlueprint_C.ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint
// 0x0098 (0x0098 - 0x0000)
struct GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint");
static_assert(sizeof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint) == 0x000098, "Wrong size on GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000018, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x00001C, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_GetForwardVector_ReturnValue) == 0x000020, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_GetUpVector_ReturnValue) == 0x00002C, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x000044, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000050, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_RotateAngleAxis_ReturnValue) == 0x00005C, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Cross_VectorVector_ReturnValue) == 0x000068, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000074, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000080, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x00008C, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");

// Function grayUfoSk_Skeleton_AnimBlueprint.grayUfoSk_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function grayUfoSk_Skeleton_AnimBlueprint.grayUfoSk_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000020, "Wrong size on GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph, InPose) == 0x000000, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'GrayUfoSk_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

