#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrayBoarSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function grayBoarSpawner.grayBoarSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GrayBoarSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GrayBoarSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on GrayBoarSpawner_C_ReceiveTick");
static_assert(sizeof(GrayBoarSpawner_C_ReceiveTick) == 0x000004, "Wrong size on GrayBoarSpawner_C_ReceiveTick");
static_assert(offsetof(GrayBoarSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GrayBoarSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function grayBoarSpawner.grayBoarSpawner_C.ExecuteUbergraph_grayBoarSpawner
// 0x0150 (0x0150 - 0x0000)
struct GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrayboar_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrayboar_C*                            CallFunc_Array_Random_OutItem;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrayboar_C*                            K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner) == 0x000010, "Wrong alignment on GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner");
static_assert(sizeof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner) == 0x000150, "Wrong size on GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, EntryPoint) == 0x000000, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, Temp_int_Variable) == 0x000010, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000018, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_MakeVector_ReturnValue_1) == 0x000030, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_MakeVector_ReturnValue_2) == 0x00003C, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Clamp_ReturnValue) == 0x000050, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000054, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000055, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_MakeVector_ReturnValue_3) == 0x000058, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000064, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000068, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, K2Node_Select_Default) == 0x000070, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000080, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000094, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x0000A0, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0000A8, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B4, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000B8, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000100, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000108, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000110, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000118, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000120, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Array_Random_OutItem) == 0x000128, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Array_Random_OutIndex) == 0x000130, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000134, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000138, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_GetDistanceTo_ReturnValue) == 0x000140, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner, CallFunc_Less_FloatFloat_ReturnValue) == 0x000144, "Member 'GrayBoarSpawner_C_ExecuteUbergraph_grayBoarSpawner::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

