#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrayEventController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass grayEventController.grayEventController_C
// 0x0050 (0x0270 - 0x0220)
class AGrayEventController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Triggerbox;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Spawn2;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Spawn1;                                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AGrayTest_C*>                    Grays;                                             // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AGenerator_C*                           Transformer;                                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_grayEventController(int32 EntryPoint);
	void Deac();
	void TurnedOn();
	void BndEvt__grayEventController_triggerbox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void begin();
	void ReceiveDestroyed();
	void Despawn();
	void Spawn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"grayEventController_C">();
	}
	static class AGrayEventController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrayEventController_C>();
	}
};
static_assert(alignof(AGrayEventController_C) == 0x000008, "Wrong alignment on AGrayEventController_C");
static_assert(sizeof(AGrayEventController_C) == 0x000270, "Wrong size on AGrayEventController_C");
static_assert(offsetof(AGrayEventController_C, UberGraphFrame) == 0x000220, "Member 'AGrayEventController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, Triggerbox) == 0x000228, "Member 'AGrayEventController_C::Triggerbox' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, Audio) == 0x000230, "Member 'AGrayEventController_C::Audio' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, Spawn2) == 0x000238, "Member 'AGrayEventController_C::Spawn2' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, Spawn1) == 0x000240, "Member 'AGrayEventController_C::Spawn1' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, DefaultSceneRoot) == 0x000248, "Member 'AGrayEventController_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, Grays) == 0x000250, "Member 'AGrayEventController_C::Grays' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, Transformer) == 0x000260, "Member 'AGrayEventController_C::Transformer' has a wrong offset!");
static_assert(offsetof(AGrayEventController_C, IsActive) == 0x000268, "Member 'AGrayEventController_C::IsActive' has a wrong offset!");

}

