#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrayUfoSk_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass grayUfoSk_Skeleton_AnimBlueprint.grayUfoSk_Skeleton_AnimBlueprint_C
// 0x03C0 (0x0680 - 0x02C0)
class UGrayUfoSk_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2CA8[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0430(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0538(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0558(0x0108)()
	struct FRotator                               OuterRot;                                          // 0x0660(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA9[0x4];                                     // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Comp;                                              // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Inner;                                             // 0x067C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_grayUfoSk_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_9FAF96ED4B1A78A3301FBB82C67D8A93();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"grayUfoSk_Skeleton_AnimBlueprint_C">();
	}
	static class UGrayUfoSk_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrayUfoSk_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UGrayUfoSk_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UGrayUfoSk_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UGrayUfoSk_Skeleton_AnimBlueprint_C) == 0x000680, "Wrong size on UGrayUfoSk_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x000430, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000538, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000558, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, OuterRot) == 0x000660, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::OuterRot' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, Comp) == 0x000670, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::Comp' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, Time) == 0x000678, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::Time' has a wrong offset!");
static_assert(offsetof(UGrayUfoSk_Skeleton_AnimBlueprint_C, Inner) == 0x00067C, "Member 'UGrayUfoSk_Skeleton_AnimBlueprint_C::Inner' has a wrong offset!");

}

