#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GreenfireChecker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass greenfireChecker.greenfireChecker_C
// 0x0018 (0x0238 - 0x0220)
class AGreenfireChecker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APuddle_C*                              Puddle;                                            // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void OnDestroyed_Event_0(class AActor* DestroyedActor);
	void ExecuteUbergraph_greenfireChecker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"greenfireChecker_C">();
	}
	static class AGreenfireChecker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGreenfireChecker_C>();
	}
};
static_assert(alignof(AGreenfireChecker_C) == 0x000008, "Wrong alignment on AGreenfireChecker_C");
static_assert(sizeof(AGreenfireChecker_C) == 0x000238, "Wrong size on AGreenfireChecker_C");
static_assert(offsetof(AGreenfireChecker_C, UberGraphFrame) == 0x000220, "Member 'AGreenfireChecker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGreenfireChecker_C, DefaultSceneRoot) == 0x000228, "Member 'AGreenfireChecker_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGreenfireChecker_C, Puddle) == 0x000230, "Member 'AGreenfireChecker_C::Puddle' has a wrong offset!");

}

