#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GreenfireChecker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function greenfireChecker.greenfireChecker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GreenfireChecker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GreenfireChecker_C_ReceiveTick) == 0x000004, "Wrong alignment on GreenfireChecker_C_ReceiveTick");
static_assert(sizeof(GreenfireChecker_C_ReceiveTick) == 0x000004, "Wrong size on GreenfireChecker_C_ReceiveTick");
static_assert(offsetof(GreenfireChecker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GreenfireChecker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function greenfireChecker.greenfireChecker_C.OnDestroyed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct GreenfireChecker_C_OnDestroyed_Event_0 final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GreenfireChecker_C_OnDestroyed_Event_0) == 0x000008, "Wrong alignment on GreenfireChecker_C_OnDestroyed_Event_0");
static_assert(sizeof(GreenfireChecker_C_OnDestroyed_Event_0) == 0x000008, "Wrong size on GreenfireChecker_C_OnDestroyed_Event_0");
static_assert(offsetof(GreenfireChecker_C_OnDestroyed_Event_0, DestroyedActor) == 0x000000, "Member 'GreenfireChecker_C_OnDestroyed_Event_0::DestroyedActor' has a wrong offset!");

// Function greenfireChecker.greenfireChecker_C.ExecuteUbergraph_greenfireChecker
// 0x0090 (0x0090 - 0x0000)
struct GreenfireChecker_C_ExecuteUbergraph_greenfireChecker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGreenFireSpawner_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APuddle_C*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker) == 0x000010, "Wrong alignment on GreenfireChecker_C_ExecuteUbergraph_greenfireChecker");
static_assert(sizeof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker) == 0x000090, "Wrong size on GreenfireChecker_C_ExecuteUbergraph_greenfireChecker");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, EntryPoint) == 0x000000, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::EntryPoint' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_GetActorOfClass_ReturnValue) == 0x000020, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, K2Node_CustomEvent_DestroyedActor) == 0x000078, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(GreenfireChecker_C_ExecuteUbergraph_greenfireChecker, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'GreenfireChecker_C_ExecuteUbergraph_greenfireChecker::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

