#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Greenfire

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function greenfire.greenfire_C.getPriceMultiplier
// 0x0004 (0x0004 - 0x0000)
struct Greenfire_C_GetPriceMultiplier final
{
public:
	float                                         PriceMult;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_GetPriceMultiplier) == 0x000004, "Wrong alignment on Greenfire_C_GetPriceMultiplier");
static_assert(sizeof(Greenfire_C_GetPriceMultiplier) == 0x000004, "Wrong size on Greenfire_C_GetPriceMultiplier");
static_assert(offsetof(Greenfire_C_GetPriceMultiplier, PriceMult) == 0x000000, "Member 'Greenfire_C_GetPriceMultiplier::PriceMult' has a wrong offset!");

// Function greenfire.greenfire_C.skipRadial
// 0x0001 (0x0001 - 0x0000)
struct Greenfire_C_SkipRadial final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_SkipRadial) == 0x000001, "Wrong alignment on Greenfire_C_SkipRadial");
static_assert(sizeof(Greenfire_C_SkipRadial) == 0x000001, "Wrong size on Greenfire_C_SkipRadial");
static_assert(offsetof(Greenfire_C_SkipRadial, Skip) == 0x000000, "Member 'Greenfire_C_SkipRadial::Skip' has a wrong offset!");

// Function greenfire.greenfire_C.toolboxFix
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_ToolboxFix final
{
public:
	class AProp_toolbox_C*                        Toolbox;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_ToolboxFix) == 0x000008, "Wrong alignment on Greenfire_C_ToolboxFix");
static_assert(sizeof(Greenfire_C_ToolboxFix) == 0x000010, "Wrong size on Greenfire_C_ToolboxFix");
static_assert(offsetof(Greenfire_C_ToolboxFix, Toolbox) == 0x000000, "Member 'Greenfire_C_ToolboxFix::Toolbox' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ToolboxFix, Return) == 0x000008, "Member 'Greenfire_C_ToolboxFix::Return' has a wrong offset!");

// Function greenfire.greenfire_C.GetKey
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_GetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_GetKey) == 0x000008, "Wrong alignment on Greenfire_C_GetKey");
static_assert(sizeof(Greenfire_C_GetKey) == 0x000010, "Wrong size on Greenfire_C_GetKey");
static_assert(offsetof(Greenfire_C_GetKey, Key) == 0x000000, "Member 'Greenfire_C_GetKey::Key' has a wrong offset!");

// Function greenfire.greenfire_C.canBeUsedHold
// 0x0001 (0x0001 - 0x0000)
struct Greenfire_C_CanBeUsedHold final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_CanBeUsedHold) == 0x000001, "Wrong alignment on Greenfire_C_CanBeUsedHold");
static_assert(sizeof(Greenfire_C_CanBeUsedHold) == 0x000001, "Wrong size on Greenfire_C_CanBeUsedHold");
static_assert(offsetof(Greenfire_C_CanBeUsedHold, Return) == 0x000000, "Member 'Greenfire_C_CanBeUsedHold::Return' has a wrong offset!");

// Function greenfire.greenfire_C.processKeys
// 0x0001 (0x0001 - 0x0000)
struct Greenfire_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_ProcessKeys) == 0x000001, "Wrong alignment on Greenfire_C_ProcessKeys");
static_assert(sizeof(Greenfire_C_ProcessKeys) == 0x000001, "Wrong size on Greenfire_C_ProcessKeys");
static_assert(offsetof(Greenfire_C_ProcessKeys, Return) == 0x000000, "Member 'Greenfire_C_ProcessKeys::Return' has a wrong offset!");

// Function greenfire.greenfire_C.getOnlyKey
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_GetOnlyKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_GetOnlyKey) == 0x000008, "Wrong alignment on Greenfire_C_GetOnlyKey");
static_assert(sizeof(Greenfire_C_GetOnlyKey) == 0x000010, "Wrong size on Greenfire_C_GetOnlyKey");
static_assert(offsetof(Greenfire_C_GetOnlyKey, Key) == 0x000000, "Member 'Greenfire_C_GetOnlyKey::Key' has a wrong offset!");

// Function greenfire.greenfire_C.setPath
// 0x0018 (0x0018 - 0x0000)
struct Greenfire_C_SetPath final
{
public:
	TArray<struct FVector>                        Path;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_SetPath) == 0x000008, "Wrong alignment on Greenfire_C_SetPath");
static_assert(sizeof(Greenfire_C_SetPath) == 0x000018, "Wrong size on Greenfire_C_SetPath");
static_assert(offsetof(Greenfire_C_SetPath, Path) == 0x000000, "Member 'Greenfire_C_SetPath::Path' has a wrong offset!");
static_assert(offsetof(Greenfire_C_SetPath, Return) == 0x000010, "Member 'Greenfire_C_SetPath::Return' has a wrong offset!");

// Function greenfire.greenfire_C.getActionOptions
// 0x0050 (0x0050 - 0x0000)
struct Greenfire_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_GetActionOptions) == 0x000008, "Wrong alignment on Greenfire_C_GetActionOptions");
static_assert(sizeof(Greenfire_C_GetActionOptions) == 0x000050, "Wrong size on Greenfire_C_GetActionOptions");
static_assert(offsetof(Greenfire_C_GetActionOptions, Player) == 0x000000, "Member 'Greenfire_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GetActionOptions, Component) == 0x000008, "Member 'Greenfire_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GetActionOptions, Actor) == 0x000010, "Member 'Greenfire_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GetActionOptions, Options) == 0x000018, "Member 'Greenfire_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Greenfire_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Greenfire_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GetActionOptions, Number) == 0x000048, "Member 'Greenfire_C_GetActionOptions::Number' has a wrong offset!");

// Function greenfire.greenfire_C.gascanFuel
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_GascanFuel final
{
public:
	class AProp_gascan_C*                         Gascan;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fueled;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_GascanFuel) == 0x000008, "Wrong alignment on Greenfire_C_GascanFuel");
static_assert(sizeof(Greenfire_C_GascanFuel) == 0x000010, "Wrong size on Greenfire_C_GascanFuel");
static_assert(offsetof(Greenfire_C_GascanFuel, Gascan) == 0x000000, "Member 'Greenfire_C_GascanFuel::Gascan' has a wrong offset!");
static_assert(offsetof(Greenfire_C_GascanFuel, Fueled) == 0x000008, "Member 'Greenfire_C_GascanFuel::Fueled' has a wrong offset!");

// Function greenfire.greenfire_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Greenfire_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_ImpactDamage) == 0x000008, "Wrong alignment on Greenfire_C_ImpactDamage");
static_assert(sizeof(Greenfire_C_ImpactDamage) == 0x0000A8, "Wrong size on Greenfire_C_ImpactDamage");
static_assert(offsetof(Greenfire_C_ImpactDamage, Damage) == 0x000000, "Member 'Greenfire_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ImpactDamage, Hit) == 0x000004, "Member 'Greenfire_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ImpactDamage, Actor) == 0x000090, "Member 'Greenfire_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ImpactDamage, Impact) == 0x000098, "Member 'Greenfire_C_ImpactDamage::Impact' has a wrong offset!");

// Function greenfire.greenfire_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_EnterWater) == 0x000008, "Wrong alignment on Greenfire_C_EnterWater");
static_assert(sizeof(Greenfire_C_EnterWater) == 0x000008, "Wrong size on Greenfire_C_EnterWater");
static_assert(offsetof(Greenfire_C_EnterWater, Water) == 0x000000, "Member 'Greenfire_C_EnterWater::Water' has a wrong offset!");

// Function greenfire.greenfire_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_LeaveWater) == 0x000008, "Wrong alignment on Greenfire_C_LeaveWater");
static_assert(sizeof(Greenfire_C_LeaveWater) == 0x000008, "Wrong size on Greenfire_C_LeaveWater");
static_assert(offsetof(Greenfire_C_LeaveWater, Water) == 0x000000, "Member 'Greenfire_C_LeaveWater::Water' has a wrong offset!");

// Function greenfire.greenfire_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Greenfire_C_EnterWaterOrigin");
static_assert(sizeof(Greenfire_C_EnterWaterOrigin) == 0x000008, "Wrong size on Greenfire_C_EnterWaterOrigin");
static_assert(offsetof(Greenfire_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Greenfire_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function greenfire.greenfire_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Greenfire_C_LeaveWaterOrigin");
static_assert(sizeof(Greenfire_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Greenfire_C_LeaveWaterOrigin");
static_assert(offsetof(Greenfire_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Greenfire_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function greenfire.greenfire_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Greenfire_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_Virus) == 0x000001, "Wrong alignment on Greenfire_C_Virus");
static_assert(sizeof(Greenfire_C_Virus) == 0x000001, "Wrong size on Greenfire_C_Virus");
static_assert(offsetof(Greenfire_C_Virus, Activate) == 0x000000, "Member 'Greenfire_C_Virus::Activate' has a wrong offset!");

// Function greenfire.greenfire_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Greenfire_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_SetPropProps) == 0x000001, "Wrong alignment on Greenfire_C_SetPropProps");
static_assert(sizeof(Greenfire_C_SetPropProps) == 0x000003, "Wrong size on Greenfire_C_SetPropProps");
static_assert(offsetof(Greenfire_C_SetPropProps, Static) == 0x000000, "Member 'Greenfire_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Greenfire_C_SetPropProps, Frozen) == 0x000001, "Member 'Greenfire_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Greenfire_C_SetPropProps, Active) == 0x000002, "Member 'Greenfire_C_SetPropProps::Active' has a wrong offset!");

// Function greenfire.greenfire_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Greenfire_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_AddDamage) == 0x000008, "Wrong alignment on Greenfire_C_AddDamage");
static_assert(sizeof(Greenfire_C_AddDamage) == 0x0000A8, "Wrong size on Greenfire_C_AddDamage");
static_assert(offsetof(Greenfire_C_AddDamage, Actor) == 0x000000, "Member 'Greenfire_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Greenfire_C_AddDamage, Damage) == 0x000008, "Member 'Greenfire_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Greenfire_C_AddDamage, Hit) == 0x00000C, "Member 'Greenfire_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Greenfire_C_AddDamage, Impact) == 0x000094, "Member 'Greenfire_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Greenfire_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Greenfire_C_AddDamage::SkipSetting' has a wrong offset!");

// Function greenfire.greenfire_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_SetKey) == 0x000008, "Wrong alignment on Greenfire_C_SetKey");
static_assert(sizeof(Greenfire_C_SetKey) == 0x000010, "Wrong size on Greenfire_C_SetKey");
static_assert(offsetof(Greenfire_C_SetKey, Key) == 0x000000, "Member 'Greenfire_C_SetKey::Key' has a wrong offset!");

// Function greenfire.greenfire_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Greenfire_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Greenfire_C_SteppedOn) == 0x000008, "Wrong alignment on Greenfire_C_SteppedOn");
static_assert(sizeof(Greenfire_C_SteppedOn) == 0x000090, "Wrong size on Greenfire_C_SteppedOn");
static_assert(offsetof(Greenfire_C_SteppedOn, Player) == 0x000000, "Member 'Greenfire_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_SteppedOn, Hit) == 0x000008, "Member 'Greenfire_C_SteppedOn::Hit' has a wrong offset!");

// Function greenfire.greenfire_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Greenfire_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_FireDamage) == 0x000004, "Wrong alignment on Greenfire_C_FireDamage");
static_assert(sizeof(Greenfire_C_FireDamage) == 0x000004, "Wrong size on Greenfire_C_FireDamage");
static_assert(offsetof(Greenfire_C_FireDamage, Damage) == 0x000000, "Member 'Greenfire_C_FireDamage::Damage' has a wrong offset!");

// Function greenfire.greenfire_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Greenfire_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_Ignite) == 0x000004, "Wrong alignment on Greenfire_C_Ignite");
static_assert(sizeof(Greenfire_C_Ignite) == 0x000004, "Wrong size on Greenfire_C_Ignite");
static_assert(offsetof(Greenfire_C_Ignite, Fuel) == 0x000000, "Member 'Greenfire_C_Ignite::Fuel' has a wrong offset!");

// Function greenfire.greenfire_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct Greenfire_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Greenfire_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on Greenfire_C_ReceivedPhyiscsDamage");
static_assert(sizeof(Greenfire_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on Greenfire_C_ReceivedPhyiscsDamage");
static_assert(offsetof(Greenfire_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'Greenfire_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'Greenfire_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function greenfire.greenfire_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Greenfire_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Greenfire_C_ActionOptionIndex");
static_assert(sizeof(Greenfire_C_ActionOptionIndex) == 0x000098, "Wrong size on Greenfire_C_ActionOptionIndex");
static_assert(offsetof(Greenfire_C_ActionOptionIndex, Player) == 0x000000, "Member 'Greenfire_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Greenfire_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ActionOptionIndex, Action) == 0x000090, "Member 'Greenfire_C_ActionOptionIndex::Action' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandUse_RMB");
static_assert(sizeof(Greenfire_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Greenfire_C_PlayerHandUse_RMB");
static_assert(offsetof(Greenfire_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandUse_LMB");
static_assert(sizeof(Greenfire_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Greenfire_C_PlayerHandUse_LMB");
static_assert(offsetof(Greenfire_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function greenfire.greenfire_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_Exploded) == 0x000004, "Wrong alignment on Greenfire_C_Exploded");
static_assert(sizeof(Greenfire_C_Exploded) == 0x000010, "Wrong size on Greenfire_C_Exploded");
static_assert(offsetof(Greenfire_C_Exploded, Damage) == 0x000000, "Member 'Greenfire_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Greenfire_C_Exploded, Location) == 0x000004, "Member 'Greenfire_C_Exploded::Location' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandRelease_RMB");
static_assert(sizeof(Greenfire_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Greenfire_C_PlayerHandRelease_RMB");
static_assert(offsetof(Greenfire_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandRelease_LMB");
static_assert(sizeof(Greenfire_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Greenfire_C_PlayerHandRelease_LMB");
static_assert(offsetof(Greenfire_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandMouseWheel");
static_assert(sizeof(Greenfire_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Greenfire_C_PlayerHandMouseWheel");
static_assert(offsetof(Greenfire_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Greenfire_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandMouse");
static_assert(sizeof(Greenfire_C_PlayerHandMouse) == 0x000010, "Wrong size on Greenfire_C_PlayerHandMouse");
static_assert(offsetof(Greenfire_C_PlayerHandMouse, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Greenfire_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function greenfire.greenfire_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Greenfire_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Greenfire_C_PlayerHandAnyKey");
static_assert(sizeof(Greenfire_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Greenfire_C_PlayerHandAnyKey");
static_assert(offsetof(Greenfire_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Greenfire_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'Greenfire_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(Greenfire_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Greenfire_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function greenfire.greenfire_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Greenfire_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_AddTemperature) == 0x000004, "Wrong alignment on Greenfire_C_AddTemperature");
static_assert(sizeof(Greenfire_C_AddTemperature) == 0x000004, "Wrong size on Greenfire_C_AddTemperature");
static_assert(offsetof(Greenfire_C_AddTemperature, Temperature) == 0x000000, "Member 'Greenfire_C_AddTemperature::Temperature' has a wrong offset!");

// Function greenfire.greenfire_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Greenfire_C_AccumulateTemperature");
static_assert(sizeof(Greenfire_C_AccumulateTemperature) == 0x000008, "Wrong size on Greenfire_C_AccumulateTemperature");
static_assert(offsetof(Greenfire_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Greenfire_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Greenfire_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Greenfire_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function greenfire.greenfire_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Greenfire_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_ActionName) == 0x000008, "Wrong alignment on Greenfire_C_ActionName");
static_assert(sizeof(Greenfire_C_ActionName) == 0x0000A0, "Wrong size on Greenfire_C_ActionName");
static_assert(offsetof(Greenfire_C_ActionName, Player) == 0x000000, "Member 'Greenfire_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ActionName, Hit) == 0x000008, "Member 'Greenfire_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ActionName, Param_Name) == 0x000090, "Member 'Greenfire_C_ActionName::Param_Name' has a wrong offset!");

// Function greenfire.greenfire_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Greenfire_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_Stepped) == 0x000004, "Wrong alignment on Greenfire_C_Stepped");
static_assert(sizeof(Greenfire_C_Stepped) == 0x000004, "Wrong size on Greenfire_C_Stepped");
static_assert(offsetof(Greenfire_C_Stepped, Volume) == 0x000000, "Member 'Greenfire_C_Stepped::Volume' has a wrong offset!");

// Function greenfire.greenfire_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_PlayerLookAway) == 0x000008, "Wrong alignment on Greenfire_C_PlayerLookAway");
static_assert(sizeof(Greenfire_C_PlayerLookAway) == 0x000008, "Wrong size on Greenfire_C_PlayerLookAway");
static_assert(offsetof(Greenfire_C_PlayerLookAway, Player) == 0x000000, "Member 'Greenfire_C_PlayerLookAway::Player' has a wrong offset!");

// Function greenfire.greenfire_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Greenfire_C_ReachedByExplosion");
static_assert(sizeof(Greenfire_C_ReachedByExplosion) == 0x000010, "Wrong size on Greenfire_C_ReachedByExplosion");
static_assert(offsetof(Greenfire_C_ReachedByExplosion, Location) == 0x000000, "Member 'Greenfire_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Greenfire_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Greenfire_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function greenfire.greenfire_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Greenfire_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Greenfire_C_Slice) == 0x000001, "Wrong alignment on Greenfire_C_Slice");
static_assert(sizeof(Greenfire_C_Slice) == 0x000001, "Wrong size on Greenfire_C_Slice");
static_assert(offsetof(Greenfire_C_Slice, Clean) == 0x000000, "Member 'Greenfire_C_Slice::Clean' has a wrong offset!");

// Function greenfire.greenfire_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Greenfire_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Greenfire_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Greenfire_C_PlayerUsedOn");
static_assert(sizeof(Greenfire_C_PlayerUsedOn) == 0x000090, "Wrong size on Greenfire_C_PlayerUsedOn");
static_assert(offsetof(Greenfire_C_PlayerUsedOn, Player) == 0x000000, "Member 'Greenfire_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Greenfire_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Greenfire_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function greenfire.greenfire_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_Hooked) == 0x000008, "Wrong alignment on Greenfire_C_Hooked");
static_assert(sizeof(Greenfire_C_Hooked) == 0x000008, "Wrong size on Greenfire_C_Hooked");
static_assert(offsetof(Greenfire_C_Hooked, Hook) == 0x000000, "Member 'Greenfire_C_Hooked::Hook' has a wrong offset!");

// Function greenfire.greenfire_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct Greenfire_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_CleanSponge) == 0x000008, "Wrong alignment on Greenfire_C_CleanSponge");
static_assert(sizeof(Greenfire_C_CleanSponge) == 0x000010, "Wrong size on Greenfire_C_CleanSponge");
static_assert(offsetof(Greenfire_C_CleanSponge, Clean) == 0x000000, "Member 'Greenfire_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(Greenfire_C_CleanSponge, Player) == 0x000008, "Member 'Greenfire_C_CleanSponge::Player' has a wrong offset!");

// Function greenfire.greenfire_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct Greenfire_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_HookTension) == 0x000008, "Wrong alignment on Greenfire_C_HookTension");
static_assert(sizeof(Greenfire_C_HookTension) == 0x000008, "Wrong size on Greenfire_C_HookTension");
static_assert(offsetof(Greenfire_C_HookTension, Hook) == 0x000000, "Member 'Greenfire_C_HookTension::Hook' has a wrong offset!");

// Function greenfire.greenfire_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Greenfire_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Greenfire_C_ReceiveTick) == 0x000004, "Wrong alignment on Greenfire_C_ReceiveTick");
static_assert(sizeof(Greenfire_C_ReceiveTick) == 0x000004, "Wrong size on Greenfire_C_ReceiveTick");
static_assert(offsetof(Greenfire_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Greenfire_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function greenfire.greenfire_C.ExecuteUbergraph_greenfire
// 0x07C0 (0x07C0 - 0x0000)
struct Greenfire_C_ExecuteUbergraph_greenfire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage_5;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0134(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x027C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0310(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x03F8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0428(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x04F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
