#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grock

#include "Basic.hpp"


namespace SDK::Params
{

// Function grock.grock_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Grock_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grock_C_ReceiveTick) == 0x000004, "Wrong alignment on Grock_C_ReceiveTick");
static_assert(sizeof(Grock_C_ReceiveTick) == 0x000004, "Wrong size on Grock_C_ReceiveTick");
static_assert(offsetof(Grock_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Grock_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function grock.grock_C.ExecuteUbergraph_grock
// 0x0010 (0x0010 - 0x0000)
struct Grock_C_ExecuteUbergraph_grock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grock_C_ExecuteUbergraph_grock) == 0x000008, "Wrong alignment on Grock_C_ExecuteUbergraph_grock");
static_assert(sizeof(Grock_C_ExecuteUbergraph_grock) == 0x000010, "Wrong size on Grock_C_ExecuteUbergraph_grock");
static_assert(offsetof(Grock_C_ExecuteUbergraph_grock, EntryPoint) == 0x000000, "Member 'Grock_C_ExecuteUbergraph_grock::EntryPoint' has a wrong offset!");
static_assert(offsetof(Grock_C_ExecuteUbergraph_grock, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Grock_C_ExecuteUbergraph_grock::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Grock_C_ExecuteUbergraph_grock, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'Grock_C_ExecuteUbergraph_grock::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");

}

