#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Grunge_dyn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function grunge_dyn.grunge_dyn_C.ExecuteUbergraph_grunge_dyn
// 0x0548 (0x0548 - 0x0000)
struct Grunge_dyn_C_ExecuteUbergraph_grunge_dyn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x00EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x01A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x0234(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x02C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x03B0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x03E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x04A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn) == 0x000008, "Wrong alignment on Grunge_dyn_C_ExecuteUbergraph_grunge_dyn");
static_assert(sizeof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn) == 0x000548, "Wrong size on Grunge_dyn_C_ExecuteUbergraph_grunge_dyn");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, EntryPoint) == 0x000000, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::EntryPoint' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hook) == 0x000008, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_damage_5) == 0x000010, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hit_5) == 0x000014, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_actor_1) == 0x0000A0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_impact_1) == 0x0000A8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_water_3) == 0x0000B8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_water_2) == 0x0000C0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_water_1) == 0x0000C8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_water) == 0x0000D0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_activate) == 0x0000D8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_static) == 0x0000D9, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_frozen) == 0x0000DA, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_active) == 0x0000DB, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_actor) == 0x0000E0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_damage_4) == 0x0000E8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hit_4) == 0x0000EC, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_impact) == 0x000174, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_skipSetting) == 0x000180, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_key_1) == 0x000188, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_12) == 0x000198, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hit_3) == 0x0001A0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_damage_3) == 0x000228, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_fuel) == 0x00022C, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_damage_2) == 0x000230, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hot) == 0x000234, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_11) == 0x0002C0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hit_2) == 0x0002C8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_action) == 0x000350, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_10) == 0x000358, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_9) == 0x000360, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_damage_1) == 0x000368, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_location_1) == 0x00036C, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_8) == 0x000378, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_7) == 0x000380, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_6) == 0x000388, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_wheelDelta) == 0x000390, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_5) == 0x000398, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_mouse) == 0x0003A0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_4) == 0x0003A8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_key) == 0x0003B0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_pressed) == 0x0003C8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_temperature_1) == 0x0003CC, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_temperature) == 0x0003D0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_speed) == 0x0003D4, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_3) == 0x0003D8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hit_1) == 0x0003E0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_name) == 0x000468, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_volume) == 0x000478, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_2) == 0x000480, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_location) == 0x000488, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_damage) == 0x000494, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_clean_1) == 0x000498, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player_1) == 0x0004A0, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hit) == 0x0004A8, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_hook_1) == 0x000530, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_clean) == 0x000538, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ExecuteUbergraph_grunge_dyn, K2Node_Event_player) == 0x000540, "Member 'Grunge_dyn_C_ExecuteUbergraph_grunge_dyn::K2Node_Event_player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_HookTension) == 0x000008, "Wrong alignment on Grunge_dyn_C_HookTension");
static_assert(sizeof(Grunge_dyn_C_HookTension) == 0x000008, "Wrong size on Grunge_dyn_C_HookTension");
static_assert(offsetof(Grunge_dyn_C_HookTension, Hook) == 0x000000, "Member 'Grunge_dyn_C_HookTension::Hook' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct Grunge_dyn_C_CleanSponge final
{
public:
	float                                         Param_Clean;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_CleanSponge) == 0x000008, "Wrong alignment on Grunge_dyn_C_CleanSponge");
static_assert(sizeof(Grunge_dyn_C_CleanSponge) == 0x000010, "Wrong size on Grunge_dyn_C_CleanSponge");
static_assert(offsetof(Grunge_dyn_C_CleanSponge, Param_Clean) == 0x000000, "Member 'Grunge_dyn_C_CleanSponge::Param_Clean' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_CleanSponge, Player) == 0x000008, "Member 'Grunge_dyn_C_CleanSponge::Player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_Hooked) == 0x000008, "Wrong alignment on Grunge_dyn_C_Hooked");
static_assert(sizeof(Grunge_dyn_C_Hooked) == 0x000008, "Wrong size on Grunge_dyn_C_Hooked");
static_assert(offsetof(Grunge_dyn_C_Hooked, Hook) == 0x000000, "Member 'Grunge_dyn_C_Hooked::Hook' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Grunge_dyn_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Grunge_dyn_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerUsedOn");
static_assert(sizeof(Grunge_dyn_C_PlayerUsedOn) == 0x000090, "Wrong size on Grunge_dyn_C_PlayerUsedOn");
static_assert(offsetof(Grunge_dyn_C_PlayerUsedOn, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Grunge_dyn_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Grunge_dyn_C_Slice final
{
public:
	bool                                          Param_Clean;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Grunge_dyn_C_Slice) == 0x000001, "Wrong alignment on Grunge_dyn_C_Slice");
static_assert(sizeof(Grunge_dyn_C_Slice) == 0x000001, "Wrong size on Grunge_dyn_C_Slice");
static_assert(offsetof(Grunge_dyn_C_Slice, Param_Clean) == 0x000000, "Member 'Grunge_dyn_C_Slice::Param_Clean' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Grunge_dyn_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Grunge_dyn_C_ReachedByExplosion");
static_assert(sizeof(Grunge_dyn_C_ReachedByExplosion) == 0x000010, "Wrong size on Grunge_dyn_C_ReachedByExplosion");
static_assert(offsetof(Grunge_dyn_C_ReachedByExplosion, Location) == 0x000000, "Member 'Grunge_dyn_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Grunge_dyn_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerLookAway) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerLookAway");
static_assert(sizeof(Grunge_dyn_C_PlayerLookAway) == 0x000008, "Wrong size on Grunge_dyn_C_PlayerLookAway");
static_assert(offsetof(Grunge_dyn_C_PlayerLookAway, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerLookAway::Player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Grunge_dyn_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_Stepped) == 0x000004, "Wrong alignment on Grunge_dyn_C_Stepped");
static_assert(sizeof(Grunge_dyn_C_Stepped) == 0x000004, "Wrong size on Grunge_dyn_C_Stepped");
static_assert(offsetof(Grunge_dyn_C_Stepped, Volume) == 0x000000, "Member 'Grunge_dyn_C_Stepped::Volume' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Grunge_dyn_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_ActionName) == 0x000008, "Wrong alignment on Grunge_dyn_C_ActionName");
static_assert(sizeof(Grunge_dyn_C_ActionName) == 0x0000A0, "Wrong size on Grunge_dyn_C_ActionName");
static_assert(offsetof(Grunge_dyn_C_ActionName, Player) == 0x000000, "Member 'Grunge_dyn_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ActionName, Hit) == 0x000008, "Member 'Grunge_dyn_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ActionName, Param_Name) == 0x000090, "Member 'Grunge_dyn_C_ActionName::Param_Name' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Grunge_dyn_C_AccumulateTemperature");
static_assert(sizeof(Grunge_dyn_C_AccumulateTemperature) == 0x000008, "Wrong size on Grunge_dyn_C_AccumulateTemperature");
static_assert(offsetof(Grunge_dyn_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Grunge_dyn_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Grunge_dyn_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Grunge_dyn_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_AddTemperature) == 0x000004, "Wrong alignment on Grunge_dyn_C_AddTemperature");
static_assert(sizeof(Grunge_dyn_C_AddTemperature) == 0x000004, "Wrong size on Grunge_dyn_C_AddTemperature");
static_assert(offsetof(Grunge_dyn_C_AddTemperature, Temperature) == 0x000000, "Member 'Grunge_dyn_C_AddTemperature::Temperature' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Grunge_dyn_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandAnyKey");
static_assert(sizeof(Grunge_dyn_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Grunge_dyn_C_PlayerHandAnyKey");
static_assert(offsetof(Grunge_dyn_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'Grunge_dyn_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Grunge_dyn_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Grunge_dyn_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandMouse");
static_assert(sizeof(Grunge_dyn_C_PlayerHandMouse) == 0x000010, "Wrong size on Grunge_dyn_C_PlayerHandMouse");
static_assert(offsetof(Grunge_dyn_C_PlayerHandMouse, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Grunge_dyn_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Grunge_dyn_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandMouseWheel");
static_assert(sizeof(Grunge_dyn_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Grunge_dyn_C_PlayerHandMouseWheel");
static_assert(offsetof(Grunge_dyn_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Grunge_dyn_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandRelease_LMB");
static_assert(sizeof(Grunge_dyn_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Grunge_dyn_C_PlayerHandRelease_LMB");
static_assert(offsetof(Grunge_dyn_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandRelease_RMB");
static_assert(sizeof(Grunge_dyn_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Grunge_dyn_C_PlayerHandRelease_RMB");
static_assert(offsetof(Grunge_dyn_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Grunge_dyn_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_Exploded) == 0x000004, "Wrong alignment on Grunge_dyn_C_Exploded");
static_assert(sizeof(Grunge_dyn_C_Exploded) == 0x000010, "Wrong size on Grunge_dyn_C_Exploded");
static_assert(offsetof(Grunge_dyn_C_Exploded, Damage) == 0x000000, "Member 'Grunge_dyn_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_Exploded, Location) == 0x000004, "Member 'Grunge_dyn_C_Exploded::Location' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandUse_LMB");
static_assert(sizeof(Grunge_dyn_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Grunge_dyn_C_PlayerHandUse_LMB");
static_assert(offsetof(Grunge_dyn_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Grunge_dyn_C_PlayerHandUse_RMB");
static_assert(sizeof(Grunge_dyn_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Grunge_dyn_C_PlayerHandUse_RMB");
static_assert(offsetof(Grunge_dyn_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Grunge_dyn_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Grunge_dyn_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Grunge_dyn_C_ActionOptionIndex");
static_assert(sizeof(Grunge_dyn_C_ActionOptionIndex) == 0x000098, "Wrong size on Grunge_dyn_C_ActionOptionIndex");
static_assert(offsetof(Grunge_dyn_C_ActionOptionIndex, Player) == 0x000000, "Member 'Grunge_dyn_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Grunge_dyn_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ActionOptionIndex, Action) == 0x000090, "Member 'Grunge_dyn_C_ActionOptionIndex::Action' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct Grunge_dyn_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Grunge_dyn_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on Grunge_dyn_C_ReceivedPhyiscsDamage");
static_assert(sizeof(Grunge_dyn_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on Grunge_dyn_C_ReceivedPhyiscsDamage");
static_assert(offsetof(Grunge_dyn_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'Grunge_dyn_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'Grunge_dyn_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Grunge_dyn_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_Ignite) == 0x000004, "Wrong alignment on Grunge_dyn_C_Ignite");
static_assert(sizeof(Grunge_dyn_C_Ignite) == 0x000004, "Wrong size on Grunge_dyn_C_Ignite");
static_assert(offsetof(Grunge_dyn_C_Ignite, Fuel) == 0x000000, "Member 'Grunge_dyn_C_Ignite::Fuel' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Grunge_dyn_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_FireDamage) == 0x000004, "Wrong alignment on Grunge_dyn_C_FireDamage");
static_assert(sizeof(Grunge_dyn_C_FireDamage) == 0x000004, "Wrong size on Grunge_dyn_C_FireDamage");
static_assert(offsetof(Grunge_dyn_C_FireDamage, Damage) == 0x000000, "Member 'Grunge_dyn_C_FireDamage::Damage' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Grunge_dyn_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Grunge_dyn_C_SteppedOn) == 0x000008, "Wrong alignment on Grunge_dyn_C_SteppedOn");
static_assert(sizeof(Grunge_dyn_C_SteppedOn) == 0x000090, "Wrong size on Grunge_dyn_C_SteppedOn");
static_assert(offsetof(Grunge_dyn_C_SteppedOn, Player) == 0x000000, "Member 'Grunge_dyn_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_SteppedOn, Hit) == 0x000008, "Member 'Grunge_dyn_C_SteppedOn::Hit' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Grunge_dyn_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_SetKey) == 0x000008, "Wrong alignment on Grunge_dyn_C_SetKey");
static_assert(sizeof(Grunge_dyn_C_SetKey) == 0x000010, "Wrong size on Grunge_dyn_C_SetKey");
static_assert(offsetof(Grunge_dyn_C_SetKey, Key) == 0x000000, "Member 'Grunge_dyn_C_SetKey::Key' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Grunge_dyn_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Grunge_dyn_C_AddDamage) == 0x000008, "Wrong alignment on Grunge_dyn_C_AddDamage");
static_assert(sizeof(Grunge_dyn_C_AddDamage) == 0x0000A8, "Wrong size on Grunge_dyn_C_AddDamage");
static_assert(offsetof(Grunge_dyn_C_AddDamage, Actor) == 0x000000, "Member 'Grunge_dyn_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_AddDamage, Damage) == 0x000008, "Member 'Grunge_dyn_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_AddDamage, Hit) == 0x00000C, "Member 'Grunge_dyn_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_AddDamage, Impact) == 0x000094, "Member 'Grunge_dyn_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Grunge_dyn_C_AddDamage::SkipSetting' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Grunge_dyn_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Grunge_dyn_C_SetPropProps) == 0x000001, "Wrong alignment on Grunge_dyn_C_SetPropProps");
static_assert(sizeof(Grunge_dyn_C_SetPropProps) == 0x000003, "Wrong size on Grunge_dyn_C_SetPropProps");
static_assert(offsetof(Grunge_dyn_C_SetPropProps, Static) == 0x000000, "Member 'Grunge_dyn_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_SetPropProps, Frozen) == 0x000001, "Member 'Grunge_dyn_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_SetPropProps, Active) == 0x000002, "Member 'Grunge_dyn_C_SetPropProps::Active' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Grunge_dyn_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Grunge_dyn_C_Virus) == 0x000001, "Wrong alignment on Grunge_dyn_C_Virus");
static_assert(sizeof(Grunge_dyn_C_Virus) == 0x000001, "Wrong size on Grunge_dyn_C_Virus");
static_assert(offsetof(Grunge_dyn_C_Virus, Activate) == 0x000000, "Member 'Grunge_dyn_C_Virus::Activate' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Grunge_dyn_C_LeaveWaterOrigin");
static_assert(sizeof(Grunge_dyn_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Grunge_dyn_C_LeaveWaterOrigin");
static_assert(offsetof(Grunge_dyn_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Grunge_dyn_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Grunge_dyn_C_EnterWaterOrigin");
static_assert(sizeof(Grunge_dyn_C_EnterWaterOrigin) == 0x000008, "Wrong size on Grunge_dyn_C_EnterWaterOrigin");
static_assert(offsetof(Grunge_dyn_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Grunge_dyn_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_LeaveWater) == 0x000008, "Wrong alignment on Grunge_dyn_C_LeaveWater");
static_assert(sizeof(Grunge_dyn_C_LeaveWater) == 0x000008, "Wrong size on Grunge_dyn_C_LeaveWater");
static_assert(offsetof(Grunge_dyn_C_LeaveWater, Water) == 0x000000, "Member 'Grunge_dyn_C_LeaveWater::Water' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Grunge_dyn_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_EnterWater) == 0x000008, "Wrong alignment on Grunge_dyn_C_EnterWater");
static_assert(sizeof(Grunge_dyn_C_EnterWater) == 0x000008, "Wrong size on Grunge_dyn_C_EnterWater");
static_assert(offsetof(Grunge_dyn_C_EnterWater, Water) == 0x000000, "Member 'Grunge_dyn_C_EnterWater::Water' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Grunge_dyn_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_ImpactDamage) == 0x000008, "Wrong alignment on Grunge_dyn_C_ImpactDamage");
static_assert(sizeof(Grunge_dyn_C_ImpactDamage) == 0x0000A8, "Wrong size on Grunge_dyn_C_ImpactDamage");
static_assert(offsetof(Grunge_dyn_C_ImpactDamage, Damage) == 0x000000, "Member 'Grunge_dyn_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ImpactDamage, Hit) == 0x000004, "Member 'Grunge_dyn_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ImpactDamage, Actor) == 0x000090, "Member 'Grunge_dyn_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_ImpactDamage, Impact) == 0x000098, "Member 'Grunge_dyn_C_ImpactDamage::Impact' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.setMat
// 0x0038 (0x0038 - 0x0000)
struct Grunge_dyn_C_SetMat final
{
public:
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Grunge_dyn_C_SetMat) == 0x000008, "Wrong alignment on Grunge_dyn_C_SetMat");
static_assert(sizeof(Grunge_dyn_C_SetMat) == 0x000038, "Wrong size on Grunge_dyn_C_SetMat");
static_assert(offsetof(Grunge_dyn_C_SetMat, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000000, "Member 'Grunge_dyn_C_SetMat::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_SetMat, CallFunc_GetActorScale3D_ReturnValue) == 0x000010, "Member 'Grunge_dyn_C_SetMat::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_SetMat, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x00001C, "Member 'Grunge_dyn_C_SetMat::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Grunge_dyn_C_SetMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'Grunge_dyn_C_SetMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function grunge_dyn.grunge_dyn_C.getActionOptions
// 0x0050 (0x0050 - 0x0000)
struct Grunge_dyn_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
