#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HexahiveSPawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass hexahiveSPawner.hexahiveSPawner_C
// 0x0018 (0x0238 - 0x0220)
class AHexahiveSPawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Size;                                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_hexahiveSPawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Gen(bool Spawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hexahiveSPawner_C">();
	}
	static class AHexahiveSPawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHexahiveSPawner_C>();
	}
};
static_assert(alignof(AHexahiveSPawner_C) == 0x000008, "Wrong alignment on AHexahiveSPawner_C");
static_assert(sizeof(AHexahiveSPawner_C) == 0x000238, "Wrong size on AHexahiveSPawner_C");
static_assert(offsetof(AHexahiveSPawner_C, UberGraphFrame) == 0x000220, "Member 'AHexahiveSPawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHexahiveSPawner_C, DefaultSceneRoot) == 0x000228, "Member 'AHexahiveSPawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHexahiveSPawner_C, Size) == 0x000230, "Member 'AHexahiveSPawner_C::Size' has a wrong offset!");

}

