#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HillRollerSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass hillRollerSpawner.hillRollerSpawner_C
// 0x00A8 (0x02C8 - 0x0220)
class AHillRollerSpawner_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail8;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail7;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Light;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Forward;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Alien;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail5;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail4;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel3;                                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel2;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel1;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail3;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail2;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail1;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Nail;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Base;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_hillRollerSpawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__hillRollerSpawner_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__hillRollerSpawner_Audio_K2Node_ComponentBoundEvent_0_OnAudioFinished__DelegateSignature();
	void Spawn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hillRollerSpawner_C">();
	}
	static class AHillRollerSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHillRollerSpawner_C>();
	}
};
static_assert(alignof(AHillRollerSpawner_C) == 0x000008, "Wrong alignment on AHillRollerSpawner_C");
static_assert(sizeof(AHillRollerSpawner_C) == 0x0002C8, "Wrong size on AHillRollerSpawner_C");
static_assert(offsetof(AHillRollerSpawner_C, UberGraphFrame) == 0x000220, "Member 'AHillRollerSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Box) == 0x000228, "Member 'AHillRollerSpawner_C::Box' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Audio) == 0x000230, "Member 'AHillRollerSpawner_C::Audio' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail8) == 0x000238, "Member 'AHillRollerSpawner_C::Nail8' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail7) == 0x000240, "Member 'AHillRollerSpawner_C::Nail7' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Light) == 0x000248, "Member 'AHillRollerSpawner_C::Light' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Forward) == 0x000250, "Member 'AHillRollerSpawner_C::Forward' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Alien) == 0x000258, "Member 'AHillRollerSpawner_C::Alien' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail5) == 0x000260, "Member 'AHillRollerSpawner_C::Nail5' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail4) == 0x000268, "Member 'AHillRollerSpawner_C::Nail4' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Wheel3) == 0x000270, "Member 'AHillRollerSpawner_C::Wheel3' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Wheel2) == 0x000278, "Member 'AHillRollerSpawner_C::Wheel2' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Wheel1) == 0x000280, "Member 'AHillRollerSpawner_C::Wheel1' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Wheel) == 0x000288, "Member 'AHillRollerSpawner_C::Wheel' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail3) == 0x000290, "Member 'AHillRollerSpawner_C::Nail3' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail2) == 0x000298, "Member 'AHillRollerSpawner_C::Nail2' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail1) == 0x0002A0, "Member 'AHillRollerSpawner_C::Nail1' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Nail) == 0x0002A8, "Member 'AHillRollerSpawner_C::Nail' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Base) == 0x0002B0, "Member 'AHillRollerSpawner_C::Base' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, DefaultSceneRoot) == 0x0002B8, "Member 'AHillRollerSpawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHillRollerSpawner_C, Debug) == 0x0002C0, "Member 'AHillRollerSpawner_C::Debug' has a wrong offset!");

}

