#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoelUfoAttack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass hoelUfoAttack.hoelUfoAttack_C
// 0x0048 (0x0268 - 0x0220)
class AHoelUfoAttack_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Thunder1;                                          // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Thunder;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialForce;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_hoelUfoAttack(int32 EntryPoint);
	void BndEvt__hoelUfoAttack_thunder1_K2Node_ComponentBoundEvent_0_OnAudioFinished__DelegateSignature();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"hoelUfoAttack_C">();
	}
	static class AHoelUfoAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoelUfoAttack_C>();
	}
};
static_assert(alignof(AHoelUfoAttack_C) == 0x000008, "Wrong alignment on AHoelUfoAttack_C");
static_assert(sizeof(AHoelUfoAttack_C) == 0x000268, "Wrong size on AHoelUfoAttack_C");
static_assert(offsetof(AHoelUfoAttack_C, UberGraphFrame) == 0x000220, "Member 'AHoelUfoAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, Thunder1) == 0x000228, "Member 'AHoelUfoAttack_C::Thunder1' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, Thunder) == 0x000230, "Member 'AHoelUfoAttack_C::Thunder' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, RadialForce) == 0x000238, "Member 'AHoelUfoAttack_C::RadialForce' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, ParticleSystem) == 0x000240, "Member 'AHoelUfoAttack_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, DefaultSceneRoot) == 0x000248, "Member 'AHoelUfoAttack_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, Target) == 0x000250, "Member 'AHoelUfoAttack_C::Target' has a wrong offset!");
static_assert(offsetof(AHoelUfoAttack_C, Loc) == 0x000258, "Member 'AHoelUfoAttack_C::Loc' has a wrong offset!");

}

