#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoelUfoAttack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function hoelUfoAttack.hoelUfoAttack_C.ExecuteUbergraph_hoelUfoAttack
// 0x01D8 (0x01D8 - 0x0000)
struct HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0080(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0138(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0148(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack) == 0x000008, "Wrong alignment on HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack");
static_assert(sizeof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack) == 0x0001D8, "Wrong size on HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, EntryPoint) == 0x000000, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_GetComponentBounds_Origin) == 0x000010, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_GetComponentBounds_BoxExtent) == 0x00001C, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_GetComponentBounds_SphereRadius) == 0x000028, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, K2Node_DynamicCast_AsInt_Objects) == 0x000030, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, K2Node_DynamicCast_AsInt_Objects_1) == 0x000048, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000074, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_obj_static_obj) == 0x000080, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_SetVectorLength_ReturnValue) == 0x000090, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000AC, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, Temp_object_Variable) == 0x000138, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000148, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001D0, "Member 'HoelUfoAttack_C_ExecuteUbergraph_hoelUfoAttack::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");

}

