#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoelUfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HoelUfo.HoelUfo_C.ExecuteUbergraph_HoelUfo
// 0x0578 (0x0578 - 0x0000)
struct HoelUfo_C_ExecuteUbergraph_HoelUfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x00D8(0x0010)(ReferenceParm)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_5;       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult_1;  // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_6;       // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0230(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_7;       // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_ReturnValue;            // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x02F8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0314(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x03AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_436[0x2];                                      // 0x0436(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult_2;  // 0x04F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(HoelUfo_C_ExecuteUbergraph_HoelUfo) == 0x000008, "Wrong alignment on HoelUfo_C_ExecuteUbergraph_HoelUfo");
static_assert(sizeof(HoelUfo_C_ExecuteUbergraph_HoelUfo) == 0x000578, "Wrong size on HoelUfo_C_ExecuteUbergraph_HoelUfo");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, EntryPoint) == 0x000000, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomFloat_ReturnValue) == 0x000004, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Ease_ReturnValue) == 0x000008, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, Temp_int_Variable) == 0x000028, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000034, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Array_Get_Item) == 0x000038, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Array_LastIndex_ReturnValue) == 0x000040, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000058, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000064, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_MakeRotator_ReturnValue) == 0x000068, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomUnitVector_ReturnValue) == 0x000074, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_VInterpTo_ReturnValue) == 0x000080, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Normal_ReturnValue) == 0x00009C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0000A8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x0000B0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_FInterpTo_ReturnValue) == 0x0000C4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_obj_static_obj) == 0x0000D8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x0000E8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x0000EC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000F0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_MakeVector_ReturnValue) == 0x0000F4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x000100, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_5) == 0x000188, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00018C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_AddActorWorldOffset_SweepHitResult_1) == 0x000198, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_AddActorWorldOffset_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetForwardVector_ReturnValue) == 0x000220, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_6) == 0x00022C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000230, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0002B8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_GetWorldDeltaSeconds_ReturnValue_7) == 0x0002BC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_GetWorldDeltaSeconds_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002C0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_FloatSpringInterp_ReturnValue) == 0x0002CC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_FloatSpringInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0002D0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0002D4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_MakeVector_ReturnValue_1) == 0x0002D8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_MakeVector_ReturnValue_2) == 0x0002E4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0002F0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, Temp_object_Variable) == 0x0002F8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_RotateAngleAxis_ReturnValue) == 0x000308, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000314, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x00039C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_SetVectorLength_ReturnValue) == 0x0003A0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0003AC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_bBlockingHit) == 0x000434, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_bInitialOverlap) == 0x000435, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_Time) == 0x000438, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_Distance) == 0x00043C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_Location) == 0x000440, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_ImpactPoint) == 0x00044C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_Normal) == 0x000458, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_ImpactNormal) == 0x000464, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_PhysMat) == 0x000470, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_HitActor) == 0x000478, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_HitComponent) == 0x000480, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_HitBoneName) == 0x000488, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_HitItem) == 0x000490, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_ElementIndex) == 0x000494, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_FaceIndex) == 0x000498, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_TraceStart) == 0x00049C, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_BreakHitResult_TraceEnd) == 0x0004A8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0004B4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0004B8, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_SelectFloat_ReturnValue) == 0x0004BC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0004C0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_FClamp_ReturnValue) == 0x0004CC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_VInterpTo_ReturnValue_1) == 0x0004D0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0004DC, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0004E0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_MakeVector_ReturnValue_3) == 0x0004E4, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_ExecuteUbergraph_HoelUfo, CallFunc_K2_AddActorWorldOffset_SweepHitResult_2) == 0x0004F0, "Member 'HoelUfo_C_ExecuteUbergraph_HoelUfo::CallFunc_K2_AddActorWorldOffset_SweepHitResult_2' has a wrong offset!");

// Function HoelUfo.HoelUfo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct HoelUfo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HoelUfo_C_ReceiveTick) == 0x000004, "Wrong alignment on HoelUfo_C_ReceiveTick");
static_assert(sizeof(HoelUfo_C_ReceiveTick) == 0x000004, "Wrong size on HoelUfo_C_ReceiveTick");
static_assert(offsetof(HoelUfo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'HoelUfo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function HoelUfo.HoelUfo_C.gen
// 0x01C0 (0x01C0 - 0x0000)
struct HoelUfo_C_Gen final
{
public:
	struct FVector                                V;                                                 // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         D;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0070(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0108(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HoelUfo_C_Gen) == 0x000010, "Wrong alignment on HoelUfo_C_Gen");
static_assert(sizeof(HoelUfo_C_Gen) == 0x0001C0, "Wrong size on HoelUfo_C_Gen");
static_assert(offsetof(HoelUfo_C_Gen, V) == 0x000000, "Member 'HoelUfo_C_Gen::V' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, D) == 0x00000C, "Member 'HoelUfo_C_Gen::D' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, Temp_int_Variable) == 0x000010, "Member 'HoelUfo_C_Gen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, Temp_struct_Variable) == 0x000020, "Member 'HoelUfo_C_Gen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'HoelUfo_C_Gen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'HoelUfo_C_Gen::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, Temp_int_Variable_1) == 0x000060, "Member 'HoelUfo_C_Gen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, Temp_float_Variable) == 0x000064, "Member 'HoelUfo_C_Gen::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'HoelUfo_C_Gen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, Temp_struct_Variable_1) == 0x000070, "Member 'HoelUfo_C_Gen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_AddComponent_ReturnValue_1) == 0x0000A0, "Member 'HoelUfo_C_Gen::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, Temp_int_Variable_2) == 0x0000A8, "Member 'HoelUfo_C_Gen::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000AC, "Member 'HoelUfo_C_Gen::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000B0, "Member 'HoelUfo_C_Gen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'HoelUfo_C_Gen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'HoelUfo_C_Gen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000BC, "Member 'HoelUfo_C_Gen::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'HoelUfo_C_Gen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'HoelUfo_C_Gen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'HoelUfo_C_Gen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'HoelUfo_C_Gen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_RandomUnitVector_ReturnValue) == 0x0000D4, "Member 'HoelUfo_C_Gen::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Cross_VectorVector_ReturnValue) == 0x0000E0, "Member 'HoelUfo_C_Gen::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Add_ReturnValue_1) == 0x0000EC, "Member 'HoelUfo_C_Gen::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0000F0, "Member 'HoelUfo_C_Gen::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_SetVectorLength_ReturnValue) == 0x0000FC, "Member 'HoelUfo_C_Gen::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000108, "Member 'HoelUfo_C_Gen::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Add_ReturnValue_2) == 0x000190, "Member 'HoelUfo_C_Gen::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Get_Item_1) == 0x000198, "Member 'HoelUfo_C_Gen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Length_ReturnValue_1) == 0x0001A0, "Member 'HoelUfo_C_Gen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A4, "Member 'HoelUfo_C_Gen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001A8, "Member 'HoelUfo_C_Gen::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Add_ReturnValue_3) == 0x0001AC, "Member 'HoelUfo_C_Gen::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Add_ReturnValue_4) == 0x0001B0, "Member 'HoelUfo_C_Gen::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_Array_Add_ReturnValue_5) == 0x0001B4, "Member 'HoelUfo_C_Gen::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_Gen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001B8, "Member 'HoelUfo_C_Gen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function HoelUfo.HoelUfo_C.attackBeam
// 0x00F0 (0x00F0 - 0x0000)
struct HoelUfo_C_AttackBeam final
{
public:
	TArray<class AActor*>                         Arr;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UStaticMeshComponent*                   Comp;                                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	class AHoelUfoAttack_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Random_OutItem;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HoelUfo_C_AttackBeam) == 0x000010, "Wrong alignment on HoelUfo_C_AttackBeam");
static_assert(sizeof(HoelUfo_C_AttackBeam) == 0x0000F0, "Wrong size on HoelUfo_C_AttackBeam");
static_assert(offsetof(HoelUfo_C_AttackBeam, Arr) == 0x000000, "Member 'HoelUfo_C_AttackBeam::Arr' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_AttackBeam, Obj) == 0x000010, "Member 'HoelUfo_C_AttackBeam::Obj' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_AttackBeam, Comp) == 0x000020, "Member 'HoelUfo_C_AttackBeam::Comp' has a wrong offset!");
static_assert(offsetof(HoelUfo_C_AttackBeam, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'HoelUfo_C_AttackBeam::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
