#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoleBottom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function holeBottom.holeBottom_C.ExecuteUbergraph_holeBottom
// 0x0070 (0x0070 - 0x0000)
struct HoleBottom_C_ExecuteUbergraph_holeBottom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_clipboard_paper_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HoleBottom_C_ExecuteUbergraph_holeBottom) == 0x000010, "Wrong alignment on HoleBottom_C_ExecuteUbergraph_holeBottom");
static_assert(sizeof(HoleBottom_C_ExecuteUbergraph_holeBottom) == 0x000070, "Wrong size on HoleBottom_C_ExecuteUbergraph_holeBottom");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, EntryPoint) == 0x000000, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::EntryPoint' has a wrong offset!");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, K2Node_MakeArray_Array) == 0x000008, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, CallFunc_Add_VectorVector_ReturnValue) == 0x000024, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HoleBottom_C_ExecuteUbergraph_holeBottom, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'HoleBottom_C_ExecuteUbergraph_holeBottom::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

