#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hook

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_mVector_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function hook.hook_C.ExecuteUbergraph_hook
// 0x0DA0 (0x0DA0 - 0x0000)
struct Hook_C_ExecuteUbergraph_hook final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3489[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_hook_C*                           CallFunc_drophook_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348A[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x0100(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_348B[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0130(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348C[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_348D[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x01F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0290(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348E[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x0360(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_348F[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x037C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3490[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0398(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3491[0x3];                                     // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x0424(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3492[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0440(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_ignore;                               // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3493[0x5];                                     // 0x04CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor_1;               // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_key_2;                                // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3494[0x3];                                     // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0554(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3495[0x3];                                     // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0584(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x060C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3496[0x3];                                     // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3497[0x4];                                     // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x0630(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x063C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0648(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3498[0x3];                                     // 0x0655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3499[0x4];                                     // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPhysVeh_obj;                   // 0x0668(0x0010)(ReferenceParm)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349A[0x4];                                     // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPhysVeh_obj_1;                 // 0x0680(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349B[0x3];                                     // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0694(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x06B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349C[0x3];                                     // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x06D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x06D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_activate;                             // 0x06D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349D[0x3];                                     // 0x06D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x06D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349E[0x7];                                     // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349F[0x6];                                     // 0x06FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp_1;                       // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A0[0x7];                                     // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_getAttachActorRoot_rootActor;             // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A1[0x6];                                     // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A2[0x7];                                     // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0738(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x07C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x07C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A3[0x2];                                     // 0x07C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_hook_C*                           CallFunc_drophook_ReturnValue_1;                   // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_putObjectInventory2_return;               // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A4[0x7];                                     // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A5[0x4];                                     // 0x07E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x07FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_34A6[0x4];                                     // 0x0884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0890(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x089C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34A7[0x4];                                     // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x08B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x08E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x08F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x08F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A8[0x7];                                     // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0910(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0920(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x092C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0939(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x093A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A9[0x5];                                     // 0x093B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPhys_obj;                      // 0x0940(0x0010)(ReferenceParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AA[0x3];                                     // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_6;    // 0x095C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_7;    // 0x0968(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0974(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x09FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x09FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x09FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AB[0x1];                                     // 0x09FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0A04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0A08(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0A14(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0A20(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0A2C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0A48(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0A60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0A64(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0A70(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34AC[0x4];                                     // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp_2;                       // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AD[0x7];                                     // 0x0A89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_setPropProps_self_CastInput;              // 0x0A90(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AE[0x7];                                     // 0x0AA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0AB0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0B38(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0B44(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0BCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AF[0x3];                                     // 0x0BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0BD0(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_8;    // 0x0BE0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_9;    // 0x0BEC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0BF8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B0[0x3];                                     // 0x0C0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_10;   // 0x0C10(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x0C1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_11;   // 0x0C20(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_2;            // 0x0C2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0C30(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_3;    // 0x0C40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B1[0x3];                                     // 0x0C41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0C44(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0CCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B2[0x3];                                     // 0x0CCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x0CD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0CD4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue_1;            // 0x0CE0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B3[0x4];                                     // 0x0CEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0CF0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0D00(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x0D88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B4[0x3];                                     // 0x0D89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0D8C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hook_C_ExecuteUbergraph_hook) == 0x000010, "Wrong alignment on Hook_C_ExecuteUbergraph_hook");
static_assert(sizeof(Hook_C_ExecuteUbergraph_hook) == 0x000DA0, "Wrong size on Hook_C_ExecuteUbergraph_hook");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, EntryPoint) == 0x000000, "Member 'Hook_C_ExecuteUbergraph_hook::EntryPoint' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_drophook_ReturnValue) == 0x000008, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_drophook_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_14) == 0x000010, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hit_6) == 0x000018, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_damage_3) == 0x0000A0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_fuel) == 0x0000A4, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_13) == 0x0000A8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_12) == 0x0000B0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_damage_2) == 0x0000B8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_location_1) == 0x0000BC, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_11) == 0x0000C8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_10) == 0x0000D0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_9) == 0x0000D8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_wheelDelta) == 0x0000E0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_8) == 0x0000E8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_mouse) == 0x0000F0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_7) == 0x0000F8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_key_1) == 0x000100, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_pressed_1) == 0x000118, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_temperature_1) == 0x00011C, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_temperature) == 0x000120, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_speed) == 0x000124, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_6) == 0x000128, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hit_5) == 0x000130, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_name_1) == 0x0001B8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_volume) == 0x0001C8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_5) == 0x0001D0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_location) == 0x0001D8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_damage_1) == 0x0001E4, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_clean) == 0x0001E8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_4) == 0x0001F0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hit_4) == 0x0001F8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hook) == 0x000280, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_gamemode) == 0x000288, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_settings) == 0x000290, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_key) == 0x000360, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_pressed) == 0x000378, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_color) == 0x00037C, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_3) == 0x000390, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hit_3) == 0x000398, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_kick) == 0x000420, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_name) == 0x000424, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_2) == 0x000430, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_player_1) == 0x000438, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hit_2) == 0x000440, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_ignore) == 0x0004C8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_IsValid_ReturnValue) == 0x0004C9, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_IsValid_ReturnValue_1) == 0x0004CA, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_CustomEvent_DestroyedActor_1) == 0x0004D0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_CustomEvent_DestroyedActor_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_CustomEvent_DestroyedActor) == 0x0004D8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_key_2) == 0x0004E0, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_GetForwardVector_ReturnValue) == 0x0004F0, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0004FC, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000508, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Add_VectorVector_ReturnValue) == 0x000514, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_GetForwardVector_ReturnValue_1) == 0x000520, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00052C, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000538, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000544, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_BooleanAND_ReturnValue) == 0x000550, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000554, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000560, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Vector_Distance_ReturnValue) == 0x00056C, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_DeltaSeconds) == 0x000570, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000574, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_actor_1) == 0x000578, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_damage_4) == 0x000580, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_hit_7) == 0x000584, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_impact_1) == 0x00060C, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_skipSetting) == 0x000618, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_SelectFloat_ReturnValue) == 0x00061C, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_SelectFloat_ReturnValue_1) == 0x000620, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_getMainPlayer_AsMain_Player) == 0x000628, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x000630, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x00063C, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000648, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000654, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_VSize_ReturnValue) == 0x000658, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00065C, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000660, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_obj_statDynPhysVeh_obj) == 0x000668, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_obj_statDynPhysVeh_obj' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_FMax_ReturnValue) == 0x000678, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_obj_statDynPhysVeh_obj_1) == 0x000680, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_obj_statDynPhysVeh_obj_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000690, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_SetVectorLength_ReturnValue) == 0x000694, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_SelectFloat_ReturnValue_2) == 0x0006A0, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_ClampVectorSize_ReturnValue) == 0x0006A4, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_VSize_ReturnValue_1) == 0x0006B0, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0006B4, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0006C0, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0006C4, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_BooleanAND_ReturnValue_1) == 0x0006D0, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_static) == 0x0006D1, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_frozen) == 0x0006D2, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_active) == 0x0006D3, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_Event_activate) == 0x0006D4, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, K2Node_CreateDelegate_OutputDelegate) == 0x0006D8, "Member 'Hook_C_ExecuteUbergraph_hook::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Hook_C_ExecuteUbergraph_hook, CallFunc_IsValid_ReturnValue_2) == 0x0006E8, "Member 'Hook_C_ExecuteUbergraph_hook::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
