#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Igetis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass igetis.igetis_C
// 0x0030 (0x04F0 - 0x04C0)
class AIgetis_C final : public ACharacter
{
public:
	uint8                                         Pad_2A5A[0x8];                                     // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Visited;                                           // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5B[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AKavotiaPatrolController_C*             PatreolController;                                 // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_igetis(int32 EntryPoint);
	void TryDestroyTimer();
	void TimerDestroy();
	void ReceiveBeginPlay();
	void BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void TryDelete();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"igetis_C">();
	}
	static class AIgetis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIgetis_C>();
	}
};
static_assert(alignof(AIgetis_C) == 0x000010, "Wrong alignment on AIgetis_C");
static_assert(sizeof(AIgetis_C) == 0x0004F0, "Wrong size on AIgetis_C");
static_assert(offsetof(AIgetis_C, UberGraphFrame) == 0x0004C0, "Member 'AIgetis_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Sphere) == 0x0004C8, "Member 'AIgetis_C::Sphere' has a wrong offset!");
static_assert(offsetof(AIgetis_C, StaticMesh) == 0x0004D0, "Member 'AIgetis_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Visited) == 0x0004D8, "Member 'AIgetis_C::Visited' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PatreolController) == 0x0004E0, "Member 'AIgetis_C::PatreolController' has a wrong offset!");

}

