#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Igetis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function igetis.igetis_C.ExecuteUbergraph_igetis
// 0x0168 (0x0168 - 0x0000)
struct Igetis_C_ExecuteUbergraph_igetis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A5C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5D[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5E[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0068(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsMain_Player;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5F[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AKavotia_C*                             CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A60[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A61[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue_1;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Igetis_C_ExecuteUbergraph_igetis) == 0x000008, "Wrong alignment on Igetis_C_ExecuteUbergraph_igetis");
static_assert(sizeof(Igetis_C_ExecuteUbergraph_igetis) == 0x000168, "Wrong size on Igetis_C_ExecuteUbergraph_igetis");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, EntryPoint) == 0x000000, "Member 'Igetis_C_ExecuteUbergraph_igetis::EntryPoint' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, Temp_int_Variable) == 0x000004, "Member 'Igetis_C_ExecuteUbergraph_igetis::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000040, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000048, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ComponentBoundEvent_OtherActor) == 0x000050, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ComponentBoundEvent_OtherComp) == 0x000058, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000060, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ComponentBoundEvent_bFromSweep) == 0x000064, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ComponentBoundEvent_SweepResult) == 0x000068, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_GetObjectClass_ReturnValue) == 0x0000F0, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ClassDynamicCast_AsMain_Player) == 0x0000F8, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ClassDynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, K2Node_ClassDynamicCast_bSuccess) == 0x000100, "Member 'Igetis_C_ExecuteUbergraph_igetis::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Array_Get_Item) == 0x000108, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000118, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000120, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00012C, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Vector_Distance2D_ReturnValue) == 0x000138, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00013C, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000140, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000148, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000154, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Vector_Distance2D_ReturnValue_1) == 0x000160, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Vector_Distance2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Igetis_C_ExecuteUbergraph_igetis, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000164, "Member 'Igetis_C_ExecuteUbergraph_igetis::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function igetis.igetis_C.BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A62[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Igetis_C_BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function igetis.igetis_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Igetis_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Igetis_C_ReceiveTick) == 0x000004, "Wrong alignment on Igetis_C_ReceiveTick");
static_assert(sizeof(Igetis_C_ReceiveTick) == 0x000004, "Wrong size on Igetis_C_ReceiveTick");
static_assert(offsetof(Igetis_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Igetis_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function igetis.igetis_C.tryDelete
// 0x0028 (0x0028 - 0x0000)
struct Igetis_C_TryDelete final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A63[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A64[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKavotia_C*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Igetis_C_TryDelete) == 0x000008, "Wrong alignment on Igetis_C_TryDelete");
static_assert(sizeof(Igetis_C_TryDelete) == 0x000028, "Wrong size on Igetis_C_TryDelete");
static_assert(offsetof(Igetis_C_TryDelete, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Igetis_C_TryDelete::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Igetis_C_TryDelete::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Igetis_C_TryDelete::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, CallFunc_WasRecentlyRendered_ReturnValue) == 0x00000C, "Member 'Igetis_C_TryDelete::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Igetis_C_TryDelete::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, CallFunc_Array_Get_Item) == 0x000018, "Member 'Igetis_C_TryDelete::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'Igetis_C_TryDelete::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Igetis_C_TryDelete, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'Igetis_C_TryDelete::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

