#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Igetis

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass igetis.igetis_C
// 0x01D0 (0x03F0 - 0x0220)
class AIgetis_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Inject;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HandSlaps;                                         // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ElecStart;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Elec;                                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Loop;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               beam_p;                                            // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               beam_L;                                            // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               beam_R;                                            // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PivotPut;                                          // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        VelThrow;                                          // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Capsule_L1;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PivotA_L;                                          // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Capsule_R1;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PivotA_R;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Capsule_L;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PivotB_L;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Capsule_R;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PivotB_R;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere1;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Igetis1_animhole7;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_4_a_B5E6EF364C2C276B642D108E4C6ADD94;     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_4__Direction_B5E6EF364C2C276B642D108E4C6ADD94; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_4;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_a_3BBB91EA44240CCA9F70FE95BA6DC308;     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_3BBB91EA44240CCA9F70FE95BA6DC308; // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_a_BEF40F434A12918CC59283939FF3AF13;     // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_BEF40F434A12918CC59283939FF3AF13; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_a_FEB543E043510A59A829709BB8164816;     // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_FEB543E043510A59A829709BB8164816; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_a_6090EA324DA84618232F00B44B3A2CBA;     // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6090EA324DA84618232F00B44B3A2CBA; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Magna_a_214D0F5F485AD43009B7178DD0988803;          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Magna__Direction_214D0F5F485AD43009B7178DD0988803; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Magna;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visited;                                           // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AKavotiaPatrolController_C*             PatreolController;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Anim;                                              // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Magnet_R;                                          // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Init_R;                                            // 0x0360(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Magnet_L;                                          // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0xC];                                      // 0x0394(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Init_L;                                            // 0x03A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PutAlpha;                                          // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Dynmat_beam1;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_beam2;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_beamPut;                                    // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_igetis(int32 EntryPoint);
	void beamPut(bool Condition);
	void beamOn2(bool Condition);
	void beamOn1(bool Condition);
	void Put();
	void Throw();
	void MagnetB();
	void CheckVisible();
	void MagnetA();
	void BndEvt__igetis_Sphere1_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void TryDestroyTimer();
	void TimerDestroy();
	void ReceiveBeginPlay();
	void BndEvt__igetis_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void OnCompleted_1F02E3C54A95B9529AC8DE8ED5E6A6C9(class FName NotifyName);
	void OnBlendOut_1F02E3C54A95B9529AC8DE8ED5E6A6C9(class FName NotifyName);
	void OnInterrupted_1F02E3C54A95B9529AC8DE8ED5E6A6C9(class FName NotifyName);
	void OnNotifyBegin_1F02E3C54A95B9529AC8DE8ED5E6A6C9(class FName NotifyName);
	void OnNotifyEnd_1F02E3C54A95B9529AC8DE8ED5E6A6C9(class FName NotifyName);
	void Timeline_4__UpdateFunc();
	void Timeline_4__FinishedFunc();
	void Timeline_3__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Magna__UpdateFunc();
	void Magna__FinishedFunc();
	void TryDelete();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"igetis_C">();
	}
	static class AIgetis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIgetis_C>();
	}
};
static_assert(alignof(AIgetis_C) == 0x000010, "Wrong alignment on AIgetis_C");
static_assert(sizeof(AIgetis_C) == 0x0003F0, "Wrong size on AIgetis_C");
static_assert(offsetof(AIgetis_C, UberGraphFrame) == 0x000220, "Member 'AIgetis_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Capsule) == 0x000228, "Member 'AIgetis_C::Capsule' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Inject) == 0x000230, "Member 'AIgetis_C::Inject' has a wrong offset!");
static_assert(offsetof(AIgetis_C, HandSlaps) == 0x000238, "Member 'AIgetis_C::HandSlaps' has a wrong offset!");
static_assert(offsetof(AIgetis_C, ElecStart) == 0x000240, "Member 'AIgetis_C::ElecStart' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Elec) == 0x000248, "Member 'AIgetis_C::Elec' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Loop) == 0x000250, "Member 'AIgetis_C::Loop' has a wrong offset!");
static_assert(offsetof(AIgetis_C, beam_p) == 0x000258, "Member 'AIgetis_C::beam_p' has a wrong offset!");
static_assert(offsetof(AIgetis_C, beam_L) == 0x000260, "Member 'AIgetis_C::beam_L' has a wrong offset!");
static_assert(offsetof(AIgetis_C, beam_R) == 0x000268, "Member 'AIgetis_C::beam_R' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PivotPut) == 0x000270, "Member 'AIgetis_C::PivotPut' has a wrong offset!");
static_assert(offsetof(AIgetis_C, VelThrow) == 0x000278, "Member 'AIgetis_C::VelThrow' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Capsule_L1) == 0x000280, "Member 'AIgetis_C::Capsule_L1' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PivotA_L) == 0x000288, "Member 'AIgetis_C::PivotA_L' has a wrong offset!");
static_assert(offsetof(AIgetis_C, StaticMesh) == 0x000290, "Member 'AIgetis_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Capsule_R1) == 0x000298, "Member 'AIgetis_C::Capsule_R1' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PivotA_R) == 0x0002A0, "Member 'AIgetis_C::PivotA_R' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Capsule_L) == 0x0002A8, "Member 'AIgetis_C::Capsule_L' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PivotB_L) == 0x0002B0, "Member 'AIgetis_C::PivotB_L' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Capsule_R) == 0x0002B8, "Member 'AIgetis_C::Capsule_R' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PivotB_R) == 0x0002C0, "Member 'AIgetis_C::PivotB_R' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Sphere1) == 0x0002C8, "Member 'AIgetis_C::Sphere1' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Igetis1_animhole7) == 0x0002D0, "Member 'AIgetis_C::Igetis1_animhole7' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Sphere) == 0x0002D8, "Member 'AIgetis_C::Sphere' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Billboard) == 0x0002E0, "Member 'AIgetis_C::Billboard' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_4_a_B5E6EF364C2C276B642D108E4C6ADD94) == 0x0002E8, "Member 'AIgetis_C::Timeline_4_a_B5E6EF364C2C276B642D108E4C6ADD94' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_4__Direction_B5E6EF364C2C276B642D108E4C6ADD94) == 0x0002EC, "Member 'AIgetis_C::Timeline_4__Direction_B5E6EF364C2C276B642D108E4C6ADD94' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_4) == 0x0002F0, "Member 'AIgetis_C::Timeline_4' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_3_a_3BBB91EA44240CCA9F70FE95BA6DC308) == 0x0002F8, "Member 'AIgetis_C::Timeline_3_a_3BBB91EA44240CCA9F70FE95BA6DC308' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_3__Direction_3BBB91EA44240CCA9F70FE95BA6DC308) == 0x0002FC, "Member 'AIgetis_C::Timeline_3__Direction_3BBB91EA44240CCA9F70FE95BA6DC308' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_3) == 0x000300, "Member 'AIgetis_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_2_a_BEF40F434A12918CC59283939FF3AF13) == 0x000308, "Member 'AIgetis_C::Timeline_2_a_BEF40F434A12918CC59283939FF3AF13' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_2__Direction_BEF40F434A12918CC59283939FF3AF13) == 0x00030C, "Member 'AIgetis_C::Timeline_2__Direction_BEF40F434A12918CC59283939FF3AF13' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_2) == 0x000310, "Member 'AIgetis_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_1_a_FEB543E043510A59A829709BB8164816) == 0x000318, "Member 'AIgetis_C::Timeline_1_a_FEB543E043510A59A829709BB8164816' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_1__Direction_FEB543E043510A59A829709BB8164816) == 0x00031C, "Member 'AIgetis_C::Timeline_1__Direction_FEB543E043510A59A829709BB8164816' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_1) == 0x000320, "Member 'AIgetis_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_0_a_6090EA324DA84618232F00B44B3A2CBA) == 0x000328, "Member 'AIgetis_C::Timeline_0_a_6090EA324DA84618232F00B44B3A2CBA' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_0__Direction_6090EA324DA84618232F00B44B3A2CBA) == 0x00032C, "Member 'AIgetis_C::Timeline_0__Direction_6090EA324DA84618232F00B44B3A2CBA' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Timeline_0) == 0x000330, "Member 'AIgetis_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Magna_a_214D0F5F485AD43009B7178DD0988803) == 0x000338, "Member 'AIgetis_C::Magna_a_214D0F5F485AD43009B7178DD0988803' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Magna__Direction_214D0F5F485AD43009B7178DD0988803) == 0x00033C, "Member 'AIgetis_C::Magna__Direction_214D0F5F485AD43009B7178DD0988803' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Magna) == 0x000340, "Member 'AIgetis_C::Magna' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Visited) == 0x000348, "Member 'AIgetis_C::Visited' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PatreolController) == 0x000350, "Member 'AIgetis_C::PatreolController' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Anim) == 0x000358, "Member 'AIgetis_C::Anim' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Magnet_R) == 0x00035C, "Member 'AIgetis_C::Magnet_R' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Init_R) == 0x000360, "Member 'AIgetis_C::Init_R' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Magnet_L) == 0x000390, "Member 'AIgetis_C::Magnet_L' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Init_L) == 0x0003A0, "Member 'AIgetis_C::Init_L' has a wrong offset!");
static_assert(offsetof(AIgetis_C, PutAlpha) == 0x0003D0, "Member 'AIgetis_C::PutAlpha' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Dynmat_beam1) == 0x0003D8, "Member 'AIgetis_C::Dynmat_beam1' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Dynmat_beam2) == 0x0003E0, "Member 'AIgetis_C::Dynmat_beam2' has a wrong offset!");
static_assert(offsetof(AIgetis_C, Dynmat_beamPut) == 0x0003E8, "Member 'AIgetis_C::Dynmat_beamPut' has a wrong offset!");

}

