#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImpostorPropsMaster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function impostorPropsMaster.impostorPropsMaster_C.ExecuteUbergraph_impostorPropsMaster
// 0x0240 (0x0240 - 0x0000)
struct ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0038(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0068(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_impostor_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster) == 0x000010, "Wrong alignment on ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster");
static_assert(sizeof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster) == 0x000240, "Wrong size on ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, EntryPoint) == 0x000000, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Add_VectorVector_ReturnValue) == 0x000004, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000020, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_obj_static_obj) == 0x000038, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000048, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, Temp_object_Variable) == 0x000058, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000068, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0000F0, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000F4, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_MakeRotator_ReturnValue) == 0x0000F8, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_bBlockingHit) == 0x000104, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_bInitialOverlap) == 0x000105, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_Time) == 0x000108, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_Distance) == 0x00010C, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_Location) == 0x000110, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_ImpactPoint) == 0x00011C, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_Normal) == 0x000128, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_ImpactNormal) == 0x000134, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_PhysMat) == 0x000140, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_HitActor) == 0x000148, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_HitComponent) == 0x000150, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_HitBoneName) == 0x000158, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_ElementIndex) == 0x000164, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_FaceIndex) == 0x000168, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_TraceStart) == 0x00016C, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BreakHitResult_TraceEnd) == 0x000178, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000184, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Dot_VectorVector_ReturnValue) == 0x000188, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Cross_VectorVector_ReturnValue) == 0x00018C, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Abs_ReturnValue) == 0x000198, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_RotateAngleAxis_ReturnValue) == 0x00019C, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001A8, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0001AC, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0001B8, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Array_Random_OutItem) == 0x0001C4, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_Array_Random_OutIndex) == 0x0001CC, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_SelectRotator_ReturnValue) == 0x0001D0, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0001DC, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_MakeTransform_ReturnValue) == 0x0001E0, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000210, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000218, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000224, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_FinishSpawningActor_ReturnValue) == 0x000228, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000230, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x00023C, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster, CallFunc_BooleanAND_ReturnValue) == 0x00023D, "Member 'ImpostorPropsMaster_C_ExecuteUbergraph_impostorPropsMaster::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

