#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImpostorPropsMaster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass impostorPropsMaster.impostorPropsMaster_C
// 0x0030 (0x0250 - 0x0220)
class AImpostorPropsMaster_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0230(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Props;                                             // 0x0240(0x0010)(Edit, BlueprintVisible)

public:
	void ReceiveBeginPlay();
	void Gen();
	void ExecuteUbergraph_impostorPropsMaster(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"impostorPropsMaster_C">();
	}
	static class AImpostorPropsMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AImpostorPropsMaster_C>();
	}
};
static_assert(alignof(AImpostorPropsMaster_C) == 0x000008, "Wrong alignment on AImpostorPropsMaster_C");
static_assert(sizeof(AImpostorPropsMaster_C) == 0x000250, "Wrong size on AImpostorPropsMaster_C");
static_assert(offsetof(AImpostorPropsMaster_C, UberGraphFrame) == 0x000220, "Member 'AImpostorPropsMaster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AImpostorPropsMaster_C, DefaultSceneRoot) == 0x000228, "Member 'AImpostorPropsMaster_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AImpostorPropsMaster_C, Loc) == 0x000230, "Member 'AImpostorPropsMaster_C::Loc' has a wrong offset!");
static_assert(offsetof(AImpostorPropsMaster_C, Props) == 0x000240, "Member 'AImpostorPropsMaster_C::Props' has a wrong offset!");

}

