#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IndoorAmbienceMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass indoorAmbienceMaster.indoorAmbienceMaster_C
// 0x0068 (0x0288 - 0x0220)
class AIndoorAmbienceMaster_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Ambience_night;                                    // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Ambience_morning;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_a_14CE39D6419AF144239869A4BED2A64E;     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_14CE39D6419AF144239869A4BED2A64E; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AIndoorAmbienceVolume_C*>        Volumes;                                           // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FString                                 CurrentRoom;                                       // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AIndoorAmbienceVolume_C*                CurrentVolume;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volume;                                            // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IndoorVol;                                         // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInside;                                          // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_indoorAmbienceMaster(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Activate(bool Param_Activate);
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Calc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"indoorAmbienceMaster_C">();
	}
	static class AIndoorAmbienceMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIndoorAmbienceMaster_C>();
	}
};
static_assert(alignof(AIndoorAmbienceMaster_C) == 0x000008, "Wrong alignment on AIndoorAmbienceMaster_C");
static_assert(sizeof(AIndoorAmbienceMaster_C) == 0x000288, "Wrong size on AIndoorAmbienceMaster_C");
static_assert(offsetof(AIndoorAmbienceMaster_C, UberGraphFrame) == 0x000220, "Member 'AIndoorAmbienceMaster_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Ambience_night) == 0x000228, "Member 'AIndoorAmbienceMaster_C::Ambience_night' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Ambience_morning) == 0x000230, "Member 'AIndoorAmbienceMaster_C::Ambience_morning' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, DefaultSceneRoot) == 0x000238, "Member 'AIndoorAmbienceMaster_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Timeline_0_a_14CE39D6419AF144239869A4BED2A64E) == 0x000240, "Member 'AIndoorAmbienceMaster_C::Timeline_0_a_14CE39D6419AF144239869A4BED2A64E' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Timeline_0__Direction_14CE39D6419AF144239869A4BED2A64E) == 0x000244, "Member 'AIndoorAmbienceMaster_C::Timeline_0__Direction_14CE39D6419AF144239869A4BED2A64E' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Timeline_0) == 0x000248, "Member 'AIndoorAmbienceMaster_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Volumes) == 0x000250, "Member 'AIndoorAmbienceMaster_C::Volumes' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, CurrentRoom) == 0x000260, "Member 'AIndoorAmbienceMaster_C::CurrentRoom' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, CurrentVolume) == 0x000270, "Member 'AIndoorAmbienceMaster_C::CurrentVolume' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, Volume) == 0x000278, "Member 'AIndoorAmbienceMaster_C::Volume' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, IndoorVol) == 0x00027C, "Member 'AIndoorAmbienceMaster_C::IndoorVol' has a wrong offset!");
static_assert(offsetof(AIndoorAmbienceMaster_C, IsInside) == 0x000280, "Member 'AIndoorAmbienceMaster_C::IsInside' has a wrong offset!");

}

