#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IndoorAmbienceMaster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function indoorAmbienceMaster.indoorAmbienceMaster_C.ExecuteUbergraph_indoorAmbienceMaster
// 0x0048 (0x0048 - 0x0000)
struct IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_activate;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AIndoorAmbienceVolume_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF3[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF4[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster) == 0x000008, "Wrong alignment on IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster");
static_assert(sizeof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster) == 0x000048, "Wrong size on IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, EntryPoint) == 0x000000, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, K2Node_CustomEvent_activate) == 0x000008, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::K2Node_CustomEvent_activate' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000028, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_FMax_ReturnValue) == 0x000034, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_FMax_ReturnValue_1) == 0x000040, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000044, "Member 'IndoorAmbienceMaster_C_ExecuteUbergraph_indoorAmbienceMaster::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function indoorAmbienceMaster.indoorAmbienceMaster_C.Activate
// 0x0001 (0x0001 - 0x0000)
struct IndoorAmbienceMaster_C_Activate final
{
public:
	bool                                          Param_Activate;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IndoorAmbienceMaster_C_Activate) == 0x000001, "Wrong alignment on IndoorAmbienceMaster_C_Activate");
static_assert(sizeof(IndoorAmbienceMaster_C_Activate) == 0x000001, "Wrong size on IndoorAmbienceMaster_C_Activate");
static_assert(offsetof(IndoorAmbienceMaster_C_Activate, Param_Activate) == 0x000000, "Member 'IndoorAmbienceMaster_C_Activate::Param_Activate' has a wrong offset!");

// Function indoorAmbienceMaster.indoorAmbienceMaster_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct IndoorAmbienceMaster_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndoorAmbienceMaster_C_ReceiveTick) == 0x000004, "Wrong alignment on IndoorAmbienceMaster_C_ReceiveTick");
static_assert(sizeof(IndoorAmbienceMaster_C_ReceiveTick) == 0x000004, "Wrong size on IndoorAmbienceMaster_C_ReceiveTick");
static_assert(offsetof(IndoorAmbienceMaster_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'IndoorAmbienceMaster_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function indoorAmbienceMaster.indoorAmbienceMaster_C.calc
// 0x0080 (0x0080 - 0x0000)
struct IndoorAmbienceMaster_C_Calc final
{
public:
	bool                                          Outside;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF6[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FF7[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIndoorAmbienceVolume_C*                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FF8[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IndoorAmbienceMaster_C_Calc) == 0x000010, "Wrong alignment on IndoorAmbienceMaster_C_Calc");
static_assert(sizeof(IndoorAmbienceMaster_C_Calc) == 0x000080, "Wrong size on IndoorAmbienceMaster_C_Calc");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, Outside) == 0x000000, "Member 'IndoorAmbienceMaster_C_Calc::Outside' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'IndoorAmbienceMaster_C_Calc::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'IndoorAmbienceMaster_C_Calc::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000010, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_Array_Get_Item) == 0x000030, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00003D, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndoorAmbienceMaster_C_Calc, CallFunc_IsPointInBoxWithTransform_ReturnValue) == 0x000070, "Member 'IndoorAmbienceMaster_C_Calc::CallFunc_IsPointInBoxWithTransform_ReturnValue' has a wrong offset!");

}

