#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Insomniac_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass insomniac_Skeleton_AnimBlueprint.insomniac_Skeleton_AnimBlueprint_C
// 0x0880 (0x0B40 - 0x02C0)
class UInsomniac_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_F66[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x02F8(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03E0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x0400(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05B0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x05D0(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0780(0x0048)()
	uint8                                         Pad_F67[0x8];                                      // 0x07C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x07D0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0980(0x01B0)()
	struct FVector                                Look;                                              // 0x0B30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Walk;                                              // 0x0B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_insomniac_Skeleton_AnimBlueprint(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_insomniac_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_2F5AB3A44E091C6FF18F7FBC6E95F4D5();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"insomniac_Skeleton_AnimBlueprint_C">();
	}
	static class UInsomniac_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInsomniac_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UInsomniac_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UInsomniac_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UInsomniac_Skeleton_AnimBlueprint_C) == 0x000B40, "Wrong size on UInsomniac_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x0002F8, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0003E0, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_3) == 0x000400, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005B0, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_2) == 0x0005D0, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000780, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x0007D0, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000980, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, Look) == 0x000B30, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::Look' has a wrong offset!");
static_assert(offsetof(UInsomniac_Skeleton_AnimBlueprint_C, Walk) == 0x000B3C, "Member 'UInsomniac_Skeleton_AnimBlueprint_C::Walk' has a wrong offset!");

}

