#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Int_wire

#include "Basic.hpp"


namespace SDK::Params
{

// Function int_wire.int_wire_C.wirePass
// 0x0008 (0x0008 - 0x0000)
struct Int_wire_C_WirePass final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Int_wire_C_WirePass) == 0x000008, "Wrong alignment on Int_wire_C_WirePass");
static_assert(sizeof(Int_wire_C_WirePass) == 0x000008, "Wrong size on Int_wire_C_WirePass");
static_assert(offsetof(Int_wire_C_WirePass, Wire) == 0x000000, "Member 'Int_wire_C_WirePass::Wire' has a wrong offset!");

// Function int_wire.int_wire_C.wireConnected
// 0x0010 (0x0010 - 0x0000)
struct Int_wire_C_WireConnected final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Side;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Int_wire_C_WireConnected) == 0x000008, "Wrong alignment on Int_wire_C_WireConnected");
static_assert(sizeof(Int_wire_C_WireConnected) == 0x000010, "Wrong size on Int_wire_C_WireConnected");
static_assert(offsetof(Int_wire_C_WireConnected, Wire) == 0x000000, "Member 'Int_wire_C_WireConnected::Wire' has a wrong offset!");
static_assert(offsetof(Int_wire_C_WireConnected, Side) == 0x000008, "Member 'Int_wire_C_WireConnected::Side' has a wrong offset!");

// Function int_wire.int_wire_C.wireDisconnected
// 0x0010 (0x0010 - 0x0000)
struct Int_wire_C_WireDisconnected final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Side;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Int_wire_C_WireDisconnected) == 0x000008, "Wrong alignment on Int_wire_C_WireDisconnected");
static_assert(sizeof(Int_wire_C_WireDisconnected) == 0x000010, "Wrong size on Int_wire_C_WireDisconnected");
static_assert(offsetof(Int_wire_C_WireDisconnected, Wire) == 0x000000, "Member 'Int_wire_C_WireDisconnected::Wire' has a wrong offset!");
static_assert(offsetof(Int_wire_C_WireDisconnected, Side) == 0x000008, "Member 'Int_wire_C_WireDisconnected::Side' has a wrong offset!");

}

