#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JellyfishPath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function jellyfishPath.jellyfishPath_C.ExecuteUbergraph_jellyfishPath
// 0x0210 (0x0210 - 0x0000)
struct JellyfishPath_C_ExecuteUbergraph_jellyfishPath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindDirectionClosestToWorldLocation_ReturnValue; // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindDirectionClosestToWorldLocation_ReturnValue_1; // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0114(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AJellyfish_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AJellyfish_C*                           CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath) == 0x000010, "Wrong alignment on JellyfishPath_C_ExecuteUbergraph_jellyfishPath");
static_assert(sizeof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath) == 0x000210, "Wrong size on JellyfishPath_C_ExecuteUbergraph_jellyfishPath");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, EntryPoint) == 0x000000, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::EntryPoint' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, Temp_int_Variable) == 0x000004, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, Temp_int_Variable_1) == 0x00001C, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_FindDirectionClosestToWorldLocation_ReturnValue) == 0x000020, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_FindDirectionClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x000034, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000040, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000C8, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000CC, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000D8, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000DC, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000E8, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000EC, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_FindDirectionClosestToWorldLocation_ReturnValue_1) == 0x0000F0, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_FindDirectionClosestToWorldLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000FC, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_GetVectorArrayAverage_ReturnValue) == 0x000108, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_GetVectorArrayAverage_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000114, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00019C, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_MakeTransform_ReturnValue) == 0x0001B0, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0001E0, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001E8, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001F0, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Array_Add_ReturnValue) == 0x0001F8, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Array_Get_Item) == 0x000200, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JellyfishPath_C_ExecuteUbergraph_jellyfishPath, CallFunc_Less_IntInt_ReturnValue) == 0x00020C, "Member 'JellyfishPath_C_ExecuteUbergraph_jellyfishPath::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function jellyfishPath.jellyfishPath_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct JellyfishPath_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JellyfishPath_C_ReceiveTick) == 0x000004, "Wrong alignment on JellyfishPath_C_ReceiveTick");
static_assert(sizeof(JellyfishPath_C_ReceiveTick) == 0x000004, "Wrong size on JellyfishPath_C_ReceiveTick");
static_assert(offsetof(JellyfishPath_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'JellyfishPath_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

