#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Kavotia

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function kavotia.kavotia_C.ExecuteUbergraph_kavotia
// 0x0A00 (0x0A00 - 0x0000)
struct Kavotia_C_ExecuteUbergraph_kavotia final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_4;                              // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A68[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A69[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A6A[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0188(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable_2;                               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6B[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x01B8(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6C[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2A6D[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6E[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A6F[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0368(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A70[0x3];                                     // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A71[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0450(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A72[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0480(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A73[0x4];                                     // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A74[0x7];                                     // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0548(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A75[0x7];                                     // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKavotia_Skeleton_AnimBlueprint_C*      K2Node_DynamicCast_AsKavotia_Skeleton_Anim_Blueprint; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A76[0x3];                                     // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x05F4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A77[0x3];                                     // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A78[0x3];                                     // 0x060D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x061C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A79[0x3];                                     // 0x061D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0620(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A7A[0x7];                                     // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_sensePawns_OutputPin;                     // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A7B[0xF];                                     // 0x0641(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0650(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0680(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x068C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0698(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7C[0x4];                                     // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x06B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x06C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x06D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A7D[0x3];                                     // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x06E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A7E[0x4];                                     // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x06F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0700(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x070C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A7F[0x3];                                     // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x071C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0728(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A80[0xC];                                     // 0x0734(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0740(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKavotiaShot_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0780(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_walkLoc_RandomLocation;                   // 0x0790(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x079C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A81[0x4];                                     // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x07B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A82[0x2];                                     // 0x07C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A83[0x4];                                     // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x07E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x07E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A84[0x5];                                     // 0x07EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A85[0x3];                                     // 0x07F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0808(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A86[0x2];                                     // 0x0812(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_5;        // 0x0820(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A87[0x3];                                     // 0x082D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0834(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A88[0x3];                                     // 0x0835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0838(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0844(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x08CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x08CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A89[0x2];                                     // 0x08CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8A[0x4];                                     // 0x08D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x08E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x096C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x097A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x097B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8B[0x3];                                     // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8C[0x4];                                     // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKavotia_C*                             CallFunc_Array_Get_Item;                           // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x099C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A8D[0x3];                                     // 0x099D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x09A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8E[0x4];                                     // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj_1;                        // 0x09B0(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x09C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A8F[0x3];                                     // 0x09D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A90[0x7];                                     // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x09F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Kavotia_C_ExecuteUbergraph_kavotia) == 0x000010, "Wrong alignment on Kavotia_C_ExecuteUbergraph_kavotia");
static_assert(sizeof(Kavotia_C_ExecuteUbergraph_kavotia) == 0x000A00, "Wrong size on Kavotia_C_ExecuteUbergraph_kavotia");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, EntryPoint) == 0x000000, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::EntryPoint' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_9) == 0x000010, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_8) == 0x000028, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_7) == 0x000040, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_6) == 0x000058, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_5) == 0x000070, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_name_Variable) == 0x000088, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_int_Variable) == 0x000090, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_name_Variable_1) == 0x000094, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_name_Variable_2) == 0x00009C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_name_Variable_3) == 0x0000A4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000AC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_4) == 0x0000BC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_3) == 0x0000C4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000CC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_2) == 0x0000DC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName_1) == 0x0000F4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000FC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_NotifyName) == 0x00010C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_9) == 0x000114, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_name_Variable_4) == 0x000124, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_10) == 0x00012C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_MovementResult_1) == 0x00013C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_MovementResult) == 0x00013D, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_11) == 0x000140, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_byte_Variable) == 0x000150, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_12) == 0x000154, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_int_Variable_1) == 0x000164, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_13) == 0x00016C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000180, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_object_Variable) == 0x000188, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_int_Variable_2) == 0x000198, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_14) == 0x00019C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001AC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_MovementResult_2) == 0x0001B0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_int_Variable_3) == 0x0001B4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_object_Variable_1) == 0x0001B8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CreateDelegate_OutputDelegate_15) == 0x0001C8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_CustomEvent_MovementResult_3) == 0x0001D8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_int_Loop_Counter_Variable) == 0x0001DC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, Temp_int_Array_Index_Variable) == 0x0001E4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_damage_4) == 0x0001E8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_hit_5) == 0x0001EC, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_actor_1) == 0x000278, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_impact_1) == 0x000280, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_water_3) == 0x000290, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_water_2) == 0x000298, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_water_1) == 0x0002A0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_water) == 0x0002A8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_activate) == 0x0002B0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_static) == 0x0002B1, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_frozen) == 0x0002B2, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_active) == 0x0002B3, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_key_1) == 0x0002B8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_11) == 0x0002C8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_hit_4) == 0x0002D0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_damage_3) == 0x000358, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_fuel) == 0x00035C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_10) == 0x000360, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_hit_3) == 0x000368, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_index) == 0x0003F0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_action) == 0x0003F4, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_9) == 0x0003F8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_8) == 0x000400, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_damage_2) == 0x000408, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_location_1) == 0x00040C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_7) == 0x000418, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_6) == 0x000420, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_5) == 0x000428, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_wheelDelta) == 0x000430, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_4) == 0x000438, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_mouse) == 0x000440, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_3) == 0x000448, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_key) == 0x000450, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_pressed) == 0x000468, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_temperature_1) == 0x00046C, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_temperature) == 0x000470, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_speed) == 0x000474, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_2) == 0x000478, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_hit_2) == 0x000480, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_name) == 0x000508, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_volume) == 0x000518, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player_1) == 0x000520, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_location) == 0x000528, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_damage_1) == 0x000534, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_clean) == 0x000538, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_player) == 0x000540, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_hit_1) == 0x000548, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, K2Node_Event_hook) == 0x0005D0, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Kavotia_C_ExecuteUbergraph_kavotia, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0005D8, "Member 'Kavotia_C_ExecuteUbergraph_kavotia::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
