#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KavotiaPatrolController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass kavotiaPatrolController.kavotiaPatrolController_C
// 0x0058 (0x0278 - 0x0220)
class AKavotiaPatrolController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere2;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere1;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         I;                                                 // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD7[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AIgetis_C*                              Igetis;                                            // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AKavotia_C*>                     Kavotias;                                          // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AEvent_bottomHoleController_C*          EventObject;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_kavotiaPatrolController(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"kavotiaPatrolController_C">();
	}
	static class AKavotiaPatrolController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKavotiaPatrolController_C>();
	}
};
static_assert(alignof(AKavotiaPatrolController_C) == 0x000008, "Wrong alignment on AKavotiaPatrolController_C");
static_assert(sizeof(AKavotiaPatrolController_C) == 0x000278, "Wrong size on AKavotiaPatrolController_C");
static_assert(offsetof(AKavotiaPatrolController_C, UberGraphFrame) == 0x000220, "Member 'AKavotiaPatrolController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, Sphere2) == 0x000228, "Member 'AKavotiaPatrolController_C::Sphere2' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, Sphere1) == 0x000230, "Member 'AKavotiaPatrolController_C::Sphere1' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, Sphere) == 0x000238, "Member 'AKavotiaPatrolController_C::Sphere' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, Billboard) == 0x000240, "Member 'AKavotiaPatrolController_C::Billboard' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, DefaultSceneRoot) == 0x000248, "Member 'AKavotiaPatrolController_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, I) == 0x000250, "Member 'AKavotiaPatrolController_C::I' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, Igetis) == 0x000258, "Member 'AKavotiaPatrolController_C::Igetis' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, Kavotias) == 0x000260, "Member 'AKavotiaPatrolController_C::Kavotias' has a wrong offset!");
static_assert(offsetof(AKavotiaPatrolController_C, EventObject) == 0x000270, "Member 'AKavotiaPatrolController_C::EventObject' has a wrong offset!");

}

