#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfusPossessor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function kerfusPossessor.kerfusPossessor_C.ExecuteUbergraph_kerfusPossessor
// 0x00E0 (0x00E0 - 0x0000)
struct KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AP_kerfus_C*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1719[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP_kerfus_C*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171A[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP_kerfus_C*                            CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171B[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171D[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor) == 0x000010, "Wrong alignment on KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor");
static_assert(sizeof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor) == 0x0000E0, "Wrong size on KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, EntryPoint) == 0x000000, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::EntryPoint' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Array_Get_Item) == 0x000020, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_RotateAngleAxis_ReturnValue) == 0x000028, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000038, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000044, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Array_LastIndex_ReturnValue) == 0x000048, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, K2Node_LowEntry_LocalVariable_Value__Object) == 0x00004C, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000058, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Add_VectorVector_ReturnValue) == 0x00005C, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x0000B0, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, K2Node_Event_DeltaSeconds) == 0x0000B4, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000B8, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000C0, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000C8, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D1, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Less_IntInt_ReturnValue) == 0x0000D2, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_BooleanOR_ReturnValue) == 0x0000D3, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_BooleanAND_ReturnValue) == 0x0000D4, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'KerfusPossessor_C_ExecuteUbergraph_kerfusPossessor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function kerfusPossessor.kerfusPossessor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct KerfusPossessor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfusPossessor_C_ReceiveTick) == 0x000004, "Wrong alignment on KerfusPossessor_C_ReceiveTick");
static_assert(sizeof(KerfusPossessor_C_ReceiveTick) == 0x000004, "Wrong size on KerfusPossessor_C_ReceiveTick");
static_assert(offsetof(KerfusPossessor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'KerfusPossessor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

