#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmegaV1_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function kerfurOmegaV1_Skeleton_AnimBlueprint.kerfurOmegaV1_Skeleton_AnimBlueprint_C.ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint
// 0x0410 (0x0410 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2892[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0008(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2893[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2894[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0078(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2895[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2896[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj_1;                        // 0x0248(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0258(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2897[0x1];                                     // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2898[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2899[0x2];                                     // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289A[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_3;                  // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint) == 0x000410, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_obj_statDyn_obj) == 0x000008, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_VSize_ReturnValue) == 0x000020, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000024, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000034, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x00003C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000040, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue_1) == 0x000044, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000048, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, Temp_object_Variable) == 0x000060, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000070, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, Temp_object_Variable_1) == 0x000078, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000088, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_X) == 0x000094, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Y) == 0x000098, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Z) == 0x00009C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsCharacter) == 0x0000A0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetMovementComponent_ReturnValue) == 0x0000B0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetController_ReturnValue) == 0x0000B8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000C0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_X_1) == 0x0000CC, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Y_1) == 0x0000D0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Z_1) == 0x0000D4, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000D8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E4, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetSocketLocation_ReturnValue) == 0x0000FC, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000108, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_MakeVector_ReturnValue) == 0x000114, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_MakeVector_ReturnValue_1) == 0x000120, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00012C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000138, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_FMin_ReturnValue) == 0x000144, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000148, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00014C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_MakeVector_ReturnValue_2) == 0x000150, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_VInterpTo_ReturnValue) == 0x00015C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000168, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000174, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000180, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x00018C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetSocketLocation_ReturnValue_3) == 0x000190, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x00019C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0001A0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0001AC, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001B8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000240, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_obj_statDyn_obj_1) == 0x000248, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_obj_statDyn_obj_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000258, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x0002E0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_bBlockingHit) == 0x0002E1, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002E2, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Time) == 0x0002E4, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Distance) == 0x0002E8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Location) == 0x0002EC, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_ImpactPoint) == 0x0002F8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Normal) == 0x000304, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_ImpactNormal) == 0x000310, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_PhysMat) == 0x000320, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitActor) == 0x000328, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitComponent) == 0x000330, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitBoneName) == 0x000338, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitItem) == 0x000340, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_ElementIndex) == 0x000344, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_FaceIndex) == 0x000348, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_TraceStart) == 0x00034C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_TraceEnd) == 0x000358, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_X_2) == 0x000364, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Y_2) == 0x000368, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Z_2) == 0x00036C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000370, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000371, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Time_1) == 0x000374, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Distance_1) == 0x000378, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Location_1) == 0x00037C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000388, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_Normal_1) == 0x000394, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0003A0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_PhysMat_1) == 0x0003B0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitActor_1) == 0x0003B8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitComponent_1) == 0x0003C0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitBoneName_1) == 0x0003C8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_HitItem_1) == 0x0003D0, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_ElementIndex_1) == 0x0003D4, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_FaceIndex_1) == 0x0003D8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_TraceStart_1) == 0x0003DC, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakHitResult_TraceEnd_1) == 0x0003E8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0003F4, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_X_3) == 0x0003F8, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Y_3) == 0x0003FC, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_BreakVector_Z_3) == 0x000400, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue_2) == 0x000404, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000408, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue_3) == 0x00040C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");

// Function kerfurOmegaV1_Skeleton_AnimBlueprint.kerfurOmegaV1_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function kerfurOmegaV1_Skeleton_AnimBlueprint.kerfurOmegaV1_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

