#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmegaV1_Skeleton_AnimBlueprint2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass kerfurOmegaV1_Skeleton_AnimBlueprint2.kerfurOmegaV1_Skeleton_AnimBlueprint2_C
// 0x0C00 (0x0EC0 - 0x02C0)
class UKerfurOmegaV1_Skeleton_AnimBlueprint2_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0378(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0398(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x04C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x05C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x06D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x07D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x08E0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x09E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0AF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0BF8(0x0108)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0D00(0x01B0)()
	bool                                          LookSide;                                          // 0x0EB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_EB1[0x3];                                      // 0x0EB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAt;                                            // 0x0EB4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	struct FRotator Randrot(float Max);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_274153E94C2C2E4CE5E26AA51E20CFBD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_B86D53F54258AB4C7D2DE9BDC599B8A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_CE2B7C55445329FABBD7F79E53520254();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_CD72FE1B4E3B091ACB5248807FC1BFE0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_35D497DC4F3DDBEF80793B88F3B85585();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_A390FF314E7B65A2EF1F3CB31F35287D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_FC49E0AB4E05E83A44F243937B99033D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_D5FD0B724496DBB5AAD102AA425ABA50();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2_AnimGraphNode_ModifyBone_C5F7E7A844C8221F1E3B4BB4507AD9AD();
	void ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"kerfurOmegaV1_Skeleton_AnimBlueprint2_C">();
	}
	static class UKerfurOmegaV1_Skeleton_AnimBlueprint2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKerfurOmegaV1_Skeleton_AnimBlueprint2_C>();
	}
};
static_assert(alignof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C) == 0x000010, "Wrong alignment on UKerfurOmegaV1_Skeleton_AnimBlueprint2_C");
static_assert(sizeof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C) == 0x000EC0, "Wrong size on UKerfurOmegaV1_Skeleton_AnimBlueprint2_C");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, UberGraphFrame) == 0x0002C0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_LocalToComponentSpace) == 0x000378, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_8) == 0x000398, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004A0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_7) == 0x0004C0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_6) == 0x0005C8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_5) == 0x0006D0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_4) == 0x0007D8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_3) == 0x0008E0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_2) == 0x0009E8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone_1) == 0x000AF0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_ModifyBone) == 0x000BF8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, AnimGraphNode_LookAt) == 0x000D00, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, LookSide) == 0x000EB0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::LookSide' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint2_C, LookAt) == 0x000EB4, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint2_C::LookAt' has a wrong offset!");

}

