#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmega_col

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mVector_structs.hpp"


namespace SDK::Params
{

// Function kerfurOmega_col.kerfurOmega_col_C.ExecuteUbergraph_kerfurOmega_col
// 0x0004 (0x0004 - 0x0000)
struct KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col) == 0x000004, "Wrong alignment on KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col");
static_assert(sizeof(KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col) == 0x000004, "Wrong size on KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col");
static_assert(offsetof(KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col, EntryPoint) == 0x000000, "Member 'KerfurOmega_col_C_ExecuteUbergraph_kerfurOmega_col::EntryPoint' has a wrong offset!");

// Function kerfurOmega_col.kerfurOmega_col_C.SetStyle
// 0x0038 (0x0038 - 0x0000)
struct KerfurOmega_col_C_SetStyle final
{
public:
	bool                                          Contrcut;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmega_col_C_SetStyle) == 0x000008, "Wrong alignment on KerfurOmega_col_C_SetStyle");
static_assert(sizeof(KerfurOmega_col_C_SetStyle) == 0x000038, "Wrong size on KerfurOmega_col_C_SetStyle");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, Contrcut) == 0x000000, "Member 'KerfurOmega_col_C_SetStyle::Contrcut' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'KerfurOmega_col_C_SetStyle::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, CallFunc_BreakVector_X) == 0x000010, "Member 'KerfurOmega_col_C_SetStyle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, CallFunc_BreakVector_Y) == 0x000014, "Member 'KerfurOmega_col_C_SetStyle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, CallFunc_BreakVector_Z) == 0x000018, "Member 'KerfurOmega_col_C_SetStyle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, CallFunc_HSVToRGB_ReturnValue) == 0x00001C, "Member 'KerfurOmega_col_C_SetStyle::CallFunc_HSVToRGB_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_SetStyle, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x00002C, "Member 'KerfurOmega_col_C_SetStyle::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");

// Function kerfurOmega_col.kerfurOmega_col_C.dropKerfurProp
// 0x0040 (0x0040 - 0x0000)
struct KerfurOmega_col_C_DropKerfurProp final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_kerfurOmega_col_C*                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmega_col_C_DropKerfurProp) == 0x000010, "Wrong alignment on KerfurOmega_col_C_DropKerfurProp");
static_assert(sizeof(KerfurOmega_col_C_DropKerfurProp) == 0x000040, "Wrong size on KerfurOmega_col_C_DropKerfurProp");
static_assert(offsetof(KerfurOmega_col_C_DropKerfurProp, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'KerfurOmega_col_C_DropKerfurProp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_DropKerfurProp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'KerfurOmega_col_C_DropKerfurProp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_DropKerfurProp, CallFunc_FinishSpawningActor_ReturnValue) == 0x000038, "Member 'KerfurOmega_col_C_DropKerfurProp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function kerfurOmega_col.kerfurOmega_col_C.getData
// 0x0270 (0x0270 - 0x0000)
struct KerfurOmega_col_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mVector                        K2Node_MakeStruct_struct_mVector;                  // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mVector>                K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmega_col_C_GetData) == 0x000010, "Wrong alignment on KerfurOmega_col_C_GetData");
static_assert(sizeof(KerfurOmega_col_C_GetData) == 0x000270, "Wrong size on KerfurOmega_col_C_GetData");
static_assert(offsetof(KerfurOmega_col_C_GetData, Data) == 0x000000, "Member 'KerfurOmega_col_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'KerfurOmega_col_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'KerfurOmega_col_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_GetData, K2Node_MakeStruct_struct_mVector) == 0x000190, "Member 'KerfurOmega_col_C_GetData::K2Node_MakeStruct_struct_mVector' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'KerfurOmega_col_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'KerfurOmega_col_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function kerfurOmega_col.kerfurOmega_col_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct KerfurOmega_col_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mVector                        CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfurOmega_col_C_LoadData) == 0x000010, "Wrong alignment on KerfurOmega_col_C_LoadData");
static_assert(sizeof(KerfurOmega_col_C_LoadData) == 0x0000F0, "Wrong size on KerfurOmega_col_C_LoadData");
static_assert(offsetof(KerfurOmega_col_C_LoadData, Data) == 0x000000, "Member 'KerfurOmega_col_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_LoadData, Return) == 0x0000C0, "Member 'KerfurOmega_col_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'KerfurOmega_col_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'KerfurOmega_col_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KerfurOmega_col_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'KerfurOmega_col_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

}

