#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfusFace

#include "Basic.hpp"


namespace SDK::Params
{

// Function kerfusFace.kerfusFace_C.ExecuteUbergraph_kerfusFace
// 0x0010 (0x0010 - 0x0000)
struct KerfusFace_C_ExecuteUbergraph_kerfusFace final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_gen_dynmat;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfusFace_C_ExecuteUbergraph_kerfusFace) == 0x000008, "Wrong alignment on KerfusFace_C_ExecuteUbergraph_kerfusFace");
static_assert(sizeof(KerfusFace_C_ExecuteUbergraph_kerfusFace) == 0x000010, "Wrong size on KerfusFace_C_ExecuteUbergraph_kerfusFace");
static_assert(offsetof(KerfusFace_C_ExecuteUbergraph_kerfusFace, EntryPoint) == 0x000000, "Member 'KerfusFace_C_ExecuteUbergraph_kerfusFace::EntryPoint' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_ExecuteUbergraph_kerfusFace, CallFunc_gen_dynmat) == 0x000008, "Member 'KerfusFace_C_ExecuteUbergraph_kerfusFace::CallFunc_gen_dynmat' has a wrong offset!");

// Function kerfusFace.kerfusFace_C.gen
// 0x0040 (0x0040 - 0x0000)
struct KerfusFace_C_Gen final
{
public:
	class UMaterialInstanceDynamic*               Param_Dynmat;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KerfusFace_C_Gen) == 0x000008, "Wrong alignment on KerfusFace_C_Gen");
static_assert(sizeof(KerfusFace_C_Gen) == 0x000040, "Wrong size on KerfusFace_C_Gen");
static_assert(offsetof(KerfusFace_C_Gen, Param_Dynmat) == 0x000000, "Member 'KerfusFace_C_Gen::Param_Dynmat' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, Temp_int_Variable) == 0x000008, "Member 'KerfusFace_C_Gen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, Temp_object_Variable) == 0x000010, "Member 'KerfusFace_C_Gen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, Temp_object_Variable_1) == 0x000018, "Member 'KerfusFace_C_Gen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, Temp_object_Variable_2) == 0x000020, "Member 'KerfusFace_C_Gen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, K2Node_Select_Default) == 0x000028, "Member 'KerfusFace_C_Gen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000030, "Member 'KerfusFace_C_Gen::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfusFace_C_Gen, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'KerfusFace_C_Gen::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

