#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmegaV1_Skeleton_AnimBlueprint2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function kerfurOmegaV1_Skeleton_AnimBlueprint2.kerfurOmegaV1_Skeleton_AnimBlueprint2_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph) == 0x000008, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph) == 0x000010, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function kerfurOmegaV1_Skeleton_AnimBlueprint2.kerfurOmegaV1_Skeleton_AnimBlueprint2_C.randrot
// 0x002C (0x002C - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot final
{
public:
	float                                         Max;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot) == 0x000004, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot) == 0x00002C, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, Max) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::Max' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, ReturnValue) == 0x000004, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00001C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_Randrot::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function kerfurOmegaV1_Skeleton_AnimBlueprint2.kerfurOmegaV1_Skeleton_AnimBlueprint2_C.ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2
// 0x0080 (0x0080 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_randRot_ReturnValue;                      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_randRot_ReturnValue_1;                    // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_2;                    // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_3;                    // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_4;                    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_5;                    // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_6;                    // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_7;                    // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_8;                    // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2) == 0x000004, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2) == 0x000080, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, EntryPoint) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::EntryPoint' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_RandomFloat_ReturnValue) == 0x000004, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_Ease_ReturnValue) == 0x000008, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00000C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue) == 0x000010, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_1) == 0x000020, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_2) == 0x00002C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_3) == 0x000038, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_4) == 0x000044, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_5) == 0x000050, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_6) == 0x00005C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_7) == 0x000068, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2, CallFunc_randRot_ReturnValue_8) == 0x000074, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint2_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint2::CallFunc_randRot_ReturnValue_8' has a wrong offset!");

}

