#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmegaV1_Skeleton_AnimBlueprint1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass kerfurOmegaV1_Skeleton_AnimBlueprint1.kerfurOmegaV1_Skeleton_AnimBlueprint1_C
// 0x0940 (0x0C00 - 0x02C0)
class UKerfurOmegaV1_Skeleton_AnimBlueprint1_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0378(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0398(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04A0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x04C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x05C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x06D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x07D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x08E0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x09E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0AF0(0x0108)()
	bool                                          LookSide;                                          // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_84E1E7B54409A06908966BA5165E6874();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_B876763F4596AA82E0301380C67BF9A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_1605D2084F26F9F9C95E37A649258A65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_47E0F0034C609BF7C4C45390F778F2B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_81CB01484A80492D9890758AB7F90E21();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_AFCBED434818B2643729DD9F658D39F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_24D4041746D03EC783C1538CC09714FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1_AnimGraphNode_ModifyBone_6A5C71CD416E8B4543E151979DC21A15();
	struct FRotator Randrot(float Max);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"kerfurOmegaV1_Skeleton_AnimBlueprint1_C">();
	}
	static class UKerfurOmegaV1_Skeleton_AnimBlueprint1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKerfurOmegaV1_Skeleton_AnimBlueprint1_C>();
	}
};
static_assert(alignof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C) == 0x000010, "Wrong alignment on UKerfurOmegaV1_Skeleton_AnimBlueprint1_C");
static_assert(sizeof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C) == 0x000C00, "Wrong size on UKerfurOmegaV1_Skeleton_AnimBlueprint1_C");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, UberGraphFrame) == 0x0002C0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_LocalToComponentSpace) == 0x000378, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_7) == 0x000398, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004A0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_6) == 0x0004C0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_5) == 0x0005C8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_4) == 0x0006D0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_3) == 0x0007D8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_2) == 0x0008E0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone_1) == 0x0009E8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, AnimGraphNode_ModifyBone) == 0x000AF0, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UKerfurOmegaV1_Skeleton_AnimBlueprint1_C, LookSide) == 0x000BF8, "Member 'UKerfurOmegaV1_Skeleton_AnimBlueprint1_C::LookSide' has a wrong offset!");

}

