#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmega_alien

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function kerfurOmega_alien.kerfurOmega_alien_C.SetStyle
// 0x0001 (0x0001 - 0x0000)
struct KerfurOmega_alien_C_SetStyle final
{
public:
	bool                                          Contrcut;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KerfurOmega_alien_C_SetStyle) == 0x000001, "Wrong alignment on KerfurOmega_alien_C_SetStyle");
static_assert(sizeof(KerfurOmega_alien_C_SetStyle) == 0x000001, "Wrong size on KerfurOmega_alien_C_SetStyle");
static_assert(offsetof(KerfurOmega_alien_C_SetStyle, Contrcut) == 0x000000, "Member 'KerfurOmega_alien_C_SetStyle::Contrcut' has a wrong offset!");

// Function kerfurOmega_alien.kerfurOmega_alien_C.dropKerfurProp
// 0x0050 (0x0050 - 0x0000)
struct KerfurOmega_alien_C_DropKerfurProp final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_kerfurOmega_alien_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_kerfurOmega_C*                    K2Node_DynamicCast_AsProp_Kerfur_Omega;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KerfurOmega_alien_C_DropKerfurProp) == 0x000010, "Wrong alignment on KerfurOmega_alien_C_DropKerfurProp");
static_assert(sizeof(KerfurOmega_alien_C_DropKerfurProp) == 0x000050, "Wrong size on KerfurOmega_alien_C_DropKerfurProp");
static_assert(offsetof(KerfurOmega_alien_C_DropKerfurProp, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'KerfurOmega_alien_C_DropKerfurProp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_alien_C_DropKerfurProp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'KerfurOmega_alien_C_DropKerfurProp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_alien_C_DropKerfurProp, CallFunc_FinishSpawningActor_ReturnValue) == 0x000038, "Member 'KerfurOmega_alien_C_DropKerfurProp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmega_alien_C_DropKerfurProp, K2Node_DynamicCast_AsProp_Kerfur_Omega) == 0x000040, "Member 'KerfurOmega_alien_C_DropKerfurProp::K2Node_DynamicCast_AsProp_Kerfur_Omega' has a wrong offset!");
static_assert(offsetof(KerfurOmega_alien_C_DropKerfurProp, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'KerfurOmega_alien_C_DropKerfurProp::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

