#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KerfurOmegaV1_Skeleton_AnimBlueprint1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function kerfurOmegaV1_Skeleton_AnimBlueprint1.kerfurOmegaV1_Skeleton_AnimBlueprint1_C.ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1
// 0x00A0 (0x00A0 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue;                      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_1;                    // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_2;                    // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_3;                    // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_2;            // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_3;            // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_4;                    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_5;                    // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_6;                    // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_randRot_ReturnValue_7;                    // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1) == 0x000004, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1) == 0x0000A0, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, EntryPoint) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::EntryPoint' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_SelectRotator_ReturnValue) == 0x000004, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue) == 0x000010, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_1) == 0x00001C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_ComposeRotators_ReturnValue) == 0x000028, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_ComposeRotators_ReturnValue_1) == 0x000034, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_2) == 0x000040, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_3) == 0x00004C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_ComposeRotators_ReturnValue_2) == 0x000058, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_ComposeRotators_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_ComposeRotators_ReturnValue_3) == 0x000064, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_ComposeRotators_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_4) == 0x000070, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_5) == 0x00007C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_6) == 0x000088, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1, CallFunc_randRot_ReturnValue_7) == 0x000094, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_ExecuteUbergraph_kerfurOmegaV1_Skeleton_AnimBlueprint1::CallFunc_randRot_ReturnValue_7' has a wrong offset!");

// Function kerfurOmegaV1_Skeleton_AnimBlueprint1.kerfurOmegaV1_Skeleton_AnimBlueprint1_C.randrot
// 0x002C (0x002C - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot final
{
public:
	float                                         Max;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot) == 0x000004, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot) == 0x00002C, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, Max) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::Max' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, ReturnValue) == 0x000004, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00001C, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_Randrot::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function kerfurOmegaV1_Skeleton_AnimBlueprint1.kerfurOmegaV1_Skeleton_AnimBlueprint1_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph) == 0x000008, "Wrong alignment on KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph");
static_assert(sizeof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph) == 0x000010, "Wrong size on KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph");
static_assert(offsetof(KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'KerfurOmegaV1_Skeleton_AnimBlueprint1_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

