#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillerWispAnim1_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function killerWispAnim1_Skeleton_AnimBlueprint.killerWispAnim1_Skeleton_AnimBlueprint_C.ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint
// 0x0004 (0x0004 - 0x0000)
struct KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint");
static_assert(sizeof(KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint) == 0x000004, "Wrong size on KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint");
static_assert(offsetof(KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'KillerWispAnim1_Skeleton_AnimBlueprint_C_ExecuteUbergraph_killerWispAnim1_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");

// Function killerWispAnim1_Skeleton_AnimBlueprint.killerWispAnim1_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'KillerWispAnim1_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

