#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Killerwisp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass killerwisp.killerwisp_C
// 0x0190 (0x0650 - 0x04C0)
class AKillerwisp_C final : public ACharacter
{
public:
	uint8                                         Pad_2507[0x8];                                     // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Eff_L;                                             // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_R;                                             // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadarPointComponent_C*                 RadarPoint;                                        // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Gl1;                                               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Gl2;                                               // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Gl3;                                               // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Dd;                                                // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               beam2_L;                                           // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               beam1_R;                                           // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               beam3_B;                                           // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        L2;                                                // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        L5;                                                // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        L4;                                                // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        L3;                                                // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        L1;                                                // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionComponent*                 AIPerception;                                      // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Leg_L;                                             // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ARM_L;                                             // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Leg_R;                                             // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ARM_R;                                             // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Sb_1;                                              // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Sb_2;                                              // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    Sb_3;                                              // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    beamend_3_D;                                       // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    beamend_2_L;                                       // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    beamend_1_R;                                       // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Center;                                            // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Ssens_a_A2D6199444429C39EE561C840501680B;          // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Ssens__Direction_A2D6199444429C39EE561C840501680B; // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2508[0x3];                                     // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Ssens;                                             // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_8D1677464B505243AE98468269142831;              // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_8D1677464B505243AE98468269142831;     // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2509[0x3];                                     // 0x05CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TryGrab;                                           // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250A[0x7];                                     // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_bloodGib_C*                       G1;                                                // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       G2;                                                // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       G3;                                                // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       G4;                                                // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Grab;                                              // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250B[0x7];                                     // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillerWispAnim1_Skeleton_AnimBlueprint_C* Anim;                                              // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Target;                                            // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Killed;                                            // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Gathered;                                          // 0x0619(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250C[0x6];                                     // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APiramidTest_C*                         Piram;                                             // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                One323123122131321322;                             // 0x0628(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rendered;                                          // 0x0634(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayerDamaged;                                     // 0x0635(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250D[0x2];                                     // 0x0636(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APiramid2_C*                            Piram2;                                            // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_killerwisp(int32 EntryPoint);
	void MoveToTarg();
	void UpdateSense();
	void BndEvt__killerwisp_AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionInfoUpdatedDelegate__DelegateSignature(const struct FActorPerceptionUpdateInfo& UpdateInfo);
	void ReleasePlayer();
	void Wqeeqeww();
	void ReceiveTick(float DeltaSeconds);
	void Capture();
	void ReceiveDestroyed();
	void BndEvt__killerwisp_AIPerception_K2Node_ComponentBoundEvent_6_PerceptionUpdatedDelegate__DelegateSignature(const TArray<class AActor*>& UpdatedActors);
	void BndEvt__killerwisp_AIPerception_K2Node_ComponentBoundEvent_2_ActorPerceptionUpdatedDelegate__DelegateSignature(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void Walk();
	void Stretch(bool Forward);
	void ReceiveBeginPlay();
	void OnCompleted_D920F109479EA9C2B43293A8547D1BCE(class FName NotifyName);
	void OnBlendOut_D920F109479EA9C2B43293A8547D1BCE(class FName NotifyName);
	void OnInterrupted_D920F109479EA9C2B43293A8547D1BCE(class FName NotifyName);
	void OnNotifyBegin_D920F109479EA9C2B43293A8547D1BCE(class FName NotifyName);
	void OnNotifyEnd_D920F109479EA9C2B43293A8547D1BCE(class FName NotifyName);
	void OnCompleted_2BC8533948B40C45CCA30A8A1AA29791(class FName NotifyName);
	void OnBlendOut_2BC8533948B40C45CCA30A8A1AA29791(class FName NotifyName);
	void OnInterrupted_2BC8533948B40C45CCA30A8A1AA29791(class FName NotifyName);
	void OnNotifyBegin_2BC8533948B40C45CCA30A8A1AA29791(class FName NotifyName);
	void OnNotifyEnd_2BC8533948B40C45CCA30A8A1AA29791(class FName NotifyName);
	void OnSuccess_ED6C8D0A480A590842070B8D5FED324F(EPathFollowingResult MovementResult);
	void OnFail_ED6C8D0A480A590842070B8D5FED324F(EPathFollowingResult MovementResult);
	void OnSuccess_F9173B124B99F8965CCE0BAD5D6E6488(EPathFollowingResult MovementResult);
	void OnFail_F9173B124B99F8965CCE0BAD5D6E6488(EPathFollowingResult MovementResult);
	void OnCompleted_3621BC3D4D928A7F549D9B84E8756B55(class FName NotifyName);
	void OnBlendOut_3621BC3D4D928A7F549D9B84E8756B55(class FName NotifyName);
	void OnInterrupted_3621BC3D4D928A7F549D9B84E8756B55(class FName NotifyName);
	void OnNotifyBegin_3621BC3D4D928A7F549D9B84E8756B55(class FName NotifyName);
	void OnNotifyEnd_3621BC3D4D928A7F549D9B84E8756B55(class FName NotifyName);
	void OnSuccess_8F96843848D18C8955C1FE8DF9577D6D(EPathFollowingResult MovementResult);
	void OnFail_8F96843848D18C8955C1FE8DF9577D6D(EPathFollowingResult MovementResult);
	void Ssens__UpdateFunc();
	void Ssens__FinishedFunc();
	void A__UpdateFunc();
	void A__FinishedFunc();
	void UserConstructionScript();
	void beamsEnds();
	void LookAt();
	bool CanReach();
	void Gather(class APiramidTest_C* Param_Piram, class APiramid2_C* Param_Piram2);
	void ScanForActors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"killerwisp_C">();
	}
	static class AKillerwisp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKillerwisp_C>();
	}
};
static_assert(alignof(AKillerwisp_C) == 0x000010, "Wrong alignment on AKillerwisp_C");
static_assert(sizeof(AKillerwisp_C) == 0x000650, "Wrong size on AKillerwisp_C");
static_assert(offsetof(AKillerwisp_C, UberGraphFrame) == 0x0004C0, "Member 'AKillerwisp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Eff_L) == 0x0004C8, "Member 'AKillerwisp_C::Eff_L' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Eff_R) == 0x0004D0, "Member 'AKillerwisp_C::Eff_R' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, RadarPoint) == 0x0004D8, "Member 'AKillerwisp_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Gl1) == 0x0004E0, "Member 'AKillerwisp_C::Gl1' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Gl2) == 0x0004E8, "Member 'AKillerwisp_C::Gl2' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Gl3) == 0x0004F0, "Member 'AKillerwisp_C::Gl3' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Dd) == 0x0004F8, "Member 'AKillerwisp_C::Dd' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Sphere) == 0x000500, "Member 'AKillerwisp_C::Sphere' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, beam2_L) == 0x000508, "Member 'AKillerwisp_C::beam2_L' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, beam1_R) == 0x000510, "Member 'AKillerwisp_C::beam1_R' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, beam3_B) == 0x000518, "Member 'AKillerwisp_C::beam3_B' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, L2) == 0x000520, "Member 'AKillerwisp_C::L2' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, L5) == 0x000528, "Member 'AKillerwisp_C::L5' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, L4) == 0x000530, "Member 'AKillerwisp_C::L4' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, L3) == 0x000538, "Member 'AKillerwisp_C::L3' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, L1) == 0x000540, "Member 'AKillerwisp_C::L1' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, AIPerception) == 0x000548, "Member 'AKillerwisp_C::AIPerception' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Leg_L) == 0x000550, "Member 'AKillerwisp_C::Leg_L' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, ARM_L) == 0x000558, "Member 'AKillerwisp_C::ARM_L' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Leg_R) == 0x000560, "Member 'AKillerwisp_C::Leg_R' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, ARM_R) == 0x000568, "Member 'AKillerwisp_C::ARM_R' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, SpringArm) == 0x000570, "Member 'AKillerwisp_C::SpringArm' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Sb_1) == 0x000578, "Member 'AKillerwisp_C::Sb_1' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Sb_2) == 0x000580, "Member 'AKillerwisp_C::Sb_2' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Sb_3) == 0x000588, "Member 'AKillerwisp_C::Sb_3' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, beamend_3_D) == 0x000590, "Member 'AKillerwisp_C::beamend_3_D' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, beamend_2_L) == 0x000598, "Member 'AKillerwisp_C::beamend_2_L' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, beamend_1_R) == 0x0005A0, "Member 'AKillerwisp_C::beamend_1_R' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Center) == 0x0005A8, "Member 'AKillerwisp_C::Center' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, PointLight) == 0x0005B0, "Member 'AKillerwisp_C::PointLight' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Ssens_a_A2D6199444429C39EE561C840501680B) == 0x0005B8, "Member 'AKillerwisp_C::Ssens_a_A2D6199444429C39EE561C840501680B' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Ssens__Direction_A2D6199444429C39EE561C840501680B) == 0x0005BC, "Member 'AKillerwisp_C::Ssens__Direction_A2D6199444429C39EE561C840501680B' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Ssens) == 0x0005C0, "Member 'AKillerwisp_C::Ssens' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, A_a_8D1677464B505243AE98468269142831) == 0x0005C8, "Member 'AKillerwisp_C::A_a_8D1677464B505243AE98468269142831' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, A__Direction_8D1677464B505243AE98468269142831) == 0x0005CC, "Member 'AKillerwisp_C::A__Direction_8D1677464B505243AE98468269142831' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, A) == 0x0005D0, "Member 'AKillerwisp_C::A' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, TryGrab) == 0x0005D8, "Member 'AKillerwisp_C::TryGrab' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, G1) == 0x0005E0, "Member 'AKillerwisp_C::G1' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, G2) == 0x0005E8, "Member 'AKillerwisp_C::G2' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, G3) == 0x0005F0, "Member 'AKillerwisp_C::G3' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, G4) == 0x0005F8, "Member 'AKillerwisp_C::G4' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Grab) == 0x000600, "Member 'AKillerwisp_C::Grab' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Anim) == 0x000608, "Member 'AKillerwisp_C::Anim' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Target) == 0x000610, "Member 'AKillerwisp_C::Target' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Killed) == 0x000618, "Member 'AKillerwisp_C::Killed' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Gathered) == 0x000619, "Member 'AKillerwisp_C::Gathered' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Piram) == 0x000620, "Member 'AKillerwisp_C::Piram' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, One323123122131321322) == 0x000628, "Member 'AKillerwisp_C::One323123122131321322' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Rendered) == 0x000634, "Member 'AKillerwisp_C::Rendered' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, PlayerDamaged) == 0x000635, "Member 'AKillerwisp_C::PlayerDamaged' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Obj) == 0x000638, "Member 'AKillerwisp_C::Obj' has a wrong offset!");
static_assert(offsetof(AKillerwisp_C, Piram2) == 0x000648, "Member 'AKillerwisp_C::Piram2' has a wrong offset!");

}

