#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Killerwisp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function killerwisp.killerwisp_C.ExecuteUbergraph_killerwisp
// 0x0920 (0x0920 - 0x0000)
struct Killerwisp_C_ExecuteUbergraph_killerwisp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_250E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_250F[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2510[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2511[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2512[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2513[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2514[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0100(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0110(0x0010)(ConstParm, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2515[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x01DC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x01EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x01F4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x020C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_2;                              // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2516[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0238(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2517[0x8];                                     // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0250(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x02A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2518[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x02C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2519[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x032C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251A[0x3];                                     // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x03BC(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_5;               // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251B[0x3];                                     // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x03D0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x03E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_251C[0xC];                                     // 0x03F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0400(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_leg_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_arm_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_arm_C*                   CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_leg_C*                   CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251D[0x4];                                     // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251E[0x4];                                     // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_3;         // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x04CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0554(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251F[0x7];                                     // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKillerWispAnim1_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsKiller_Wisp_Anim_1_Skeleton_Anim_Blueprint; // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_forward;                        // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2520[0x1];                                     // 0x058B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2521[0x3];                                     // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Actor;                  // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_ComponentBoundEvent_Stimulus;               // 0x05A8(0x003C)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2522[0x3];                                     // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2523[0x4];                                     // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2524[0x3];                                     // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_canReach_ReturnValue;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_canReach_ReturnValue_1;                   // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2525[0x2];                                     // 0x0602(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2526[0x4];                                     // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0620(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0630(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2527[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2528[0x7];                                     // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2529[0x3];                                     // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0669(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252A[0x6];                                     // 0x066A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_ComponentBoundEvent_UpdatedActors;          // 0x0670(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_pawn_obj;                             // 0x0680(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0692(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0693(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0695(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0696(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252B[0x1];                                     // 0x0697(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252C[0x4];                                     // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252D[0x2];                                     // 0x06B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x06B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x06C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252E[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252F[0x3];                                     // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2530[0x3];                                     // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2531[0x7];                                     // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable_2;                              // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2532[0x7];                                     // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_4;         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2533[0x3];                                     // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0722(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2534[0x5];                                     // 0x0723(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_5;         // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x0731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2535[0x2];                                     // 0x0732(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_1;              // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2536[0x2];                                     // 0x073A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_6;         // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2537[0x7];                                     // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_3;            // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_4;               // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2538[0x7];                                     // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2539[0x3];                                     // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorPerceptionUpdateInfo             K2Node_ComponentBoundEvent_UpdateInfo;             // 0x077C(0x0048)(ConstParm, NoDestructor)
	uint8                                         Pad_253A[0x4];                                     // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_2;          // 0x07C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_2;        // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253B[0x3];                                     // 0x07D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x07DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x07E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x07F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253C[0x2];                                     // 0x07F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_2;    // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253D[0x7];                                     // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_4;            // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0810(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x081C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x0828(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0838(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0844(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0850(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253E[0x4];                                     // 0x085C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKerfurOmega_C*                         K2Node_DynamicCast_AsKerfur_Omega;                 // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253F[0x3];                                     // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x086C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2540[0x4];                                     // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2541[0x7];                                     // 0x0901(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_addDamage_self_CastInput;                 // 0x0908(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Killerwisp_C_ExecuteUbergraph_killerwisp) == 0x000010, "Wrong alignment on Killerwisp_C_ExecuteUbergraph_killerwisp");
static_assert(sizeof(Killerwisp_C_ExecuteUbergraph_killerwisp) == 0x000920, "Wrong size on Killerwisp_C_ExecuteUbergraph_killerwisp");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, EntryPoint) == 0x000000, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakVector_X) == 0x000010, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakVector_Y) == 0x000014, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakVector_Z) == 0x000018, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_Less_FloatFloat_ReturnValue) == 0x00001C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_13) == 0x000020, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_12) == 0x000038, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_11) == 0x000050, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_10) == 0x000068, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_name_Variable) == 0x000080, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_VLerp_ReturnValue) == 0x000088, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_3) == 0x000094, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_4) == 0x000098, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_2) == 0x0000A8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000AC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_byte_Variable) == 0x0000BC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000C0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_VLerp_ReturnValue_1) == 0x0000C4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_1) == 0x0000D0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000D4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult) == 0x0000E4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_byte_Variable_1) == 0x0000F8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_object_Variable) == 0x000100, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_object_Variable_1) == 0x000110, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_9) == 0x000120, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_8) == 0x000128, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_8) == 0x000138, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_9) == 0x000140, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_7) == 0x000150, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_10) == 0x000158, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_6) == 0x000168, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_11) == 0x000170, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_5) == 0x000180, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_12) == 0x000188, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_name_Variable_1) == 0x000198, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_SwitchName_CmpSuccess) == 0x0001A0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_4) == 0x0001A4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_13) == 0x0001AC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_3) == 0x0001BC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_14) == 0x0001C4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_2) == 0x0001D4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_15) == 0x0001DC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_1) == 0x0001EC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_16) == 0x0001F4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName) == 0x000204, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_17) == 0x00020C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_name_Variable_2) == 0x00021C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_18) == 0x000224, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000238, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000240, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_GetTransform_ReturnValue) == 0x000250, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Location) == 0x000280, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Rotation) == 0x00028C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Scale) == 0x000298, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_NotifyName_14) == 0x0002A4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002AC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_getMainPlayer_AsMain_Player) == 0x0002B0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0002C0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Location_1) == 0x0002F0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Rotation_1) == 0x0002FC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_BreakTransform_Scale_1) == 0x000308, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000318, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_VInterpTo_ReturnValue) == 0x000320, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00032C, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0003B4, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_int_Array_Index_Variable) == 0x0003B8, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CreateDelegate_OutputDelegate_19) == 0x0003BC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, K2Node_CustomEvent_MovementResult_5) == 0x0003CC, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::K2Node_CustomEvent_MovementResult_5' has a wrong offset!");
static_assert(offsetof(Killerwisp_C_ExecuteUbergraph_killerwisp, Temp_object_Variable_2) == 0x0003D0, "Member 'Killerwisp_C_ExecuteUbergraph_killerwisp::Temp_object_Variable_2' has a wrong offset!");
