#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Kocker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass kocker.kocker_C
// 0x0020 (0x0240 - 0x0220)
class AKocker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         I;                                                 // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_kocker(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__ventCrawler_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Knock();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"kocker_C">();
	}
	static class AKocker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKocker_C>();
	}
};
static_assert(alignof(AKocker_C) == 0x000008, "Wrong alignment on AKocker_C");
static_assert(sizeof(AKocker_C) == 0x000240, "Wrong size on AKocker_C");
static_assert(offsetof(AKocker_C, UberGraphFrame) == 0x000220, "Member 'AKocker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AKocker_C, Box) == 0x000228, "Member 'AKocker_C::Box' has a wrong offset!");
static_assert(offsetof(AKocker_C, DefaultSceneRoot) == 0x000230, "Member 'AKocker_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AKocker_C, I) == 0x000238, "Member 'AKocker_C::I' has a wrong offset!");

}

