#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ladder

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function ladder.ladder_C.ExecuteUbergraph_ladder
// 0x08F0 (0x08F0 - 0x0000)
struct Ladder_C_ExecuteUbergraph_ladder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_seLoc_ReturnValue;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A8[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A9[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AA[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33AB[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33AC[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x027C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AD[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0298(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0328(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_color;                                // 0x03F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AE[0x4];                                     // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x0420(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33AF[0x2];                                     // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B0[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x046C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_33B1[0x4];                                     // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0500(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B2[0x4];                                     // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0518(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B3[0x3];                                     // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B4[0x3];                                     // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x05B8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_seLoc_ReturnValue_1;                      // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B5[0x3];                                     // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_seLoc_ReturnValue_2;                      // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B6[0x3];                                     // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B7[0x3];                                     // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_2;                                // 0x05E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0604(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x068C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x069A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x069B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x06AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x06AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x06AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B8[0x3];                                     // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B9[0x7];                                     // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x06C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x06D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0764(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33BA[0x3];                                     // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_getKeybindFromName_bind;                  // 0x0768(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BB[0x2];                                     // 0x0782(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0784(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x080C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BC[0x3];                                     // 0x080D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALadder_C*                              CallFunc_useLadder_ladder1;                        // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0818(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0824(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClosestPointOnLineSeqment_ReturnValue;    // 0x0834(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BD[0x7];                                     // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_getKeybindFromName_bind_1;                // 0x0848(0x0018)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_getKeybindFromName_bind_2;                // 0x0860(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0879(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BE[0x6];                                     // 0x087A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BF[0x7];                                     // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0890(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_CapsuleOverlapActors_OutActors;           // 0x08A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_CapsuleOverlapActors_ReturnValue;         // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33C0[0x7];                                     // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_getKeybindFromName_bind_3;                // 0x08B8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x08D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33C1[0x2];                                     // 0x08D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x08D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33C2[0x3];                                     // 0x08DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x08E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ExecuteUbergraph_ladder) == 0x000008, "Wrong alignment on Ladder_C_ExecuteUbergraph_ladder");
static_assert(sizeof(Ladder_C_ExecuteUbergraph_ladder) == 0x0008F0, "Wrong size on Ladder_C_ExecuteUbergraph_ladder");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, EntryPoint) == 0x000000, "Member 'Ladder_C_ExecuteUbergraph_ladder::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_seLoc_ReturnValue) == 0x000004, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_seLoc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_13) == 0x000008, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_12) == 0x000010, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_2) == 0x000018, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_location_1) == 0x00001C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_11) == 0x000028, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_10) == 0x000030, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_9) == 0x000038, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_wheelDelta) == 0x000040, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_8) == 0x000048, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_mouse) == 0x000050, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_7) == 0x000058, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_key_1) == 0x000060, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_pressed_1) == 0x000078, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_temperature_1) == 0x00007C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_temperature) == 0x000080, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_speed) == 0x000084, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_6) == 0x000088, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_5) == 0x000090, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_name_1) == 0x000118, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_volume) == 0x000128, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_5) == 0x000130, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_location) == 0x000138, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_1) == 0x000144, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_clean) == 0x000148, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_4) == 0x000150, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_4) == 0x000158, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hook) == 0x0001E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_3) == 0x0001E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_3) == 0x0001F0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_kick) == 0x000278, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_name) == 0x00027C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_2) == 0x000288, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_1) == 0x000290, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_2) == 0x000298, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_gamemode) == 0x000320, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_settings) == 0x000328, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_color) == 0x0003F4, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000404, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000410, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_key) == 0x000420, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_pressed) == 0x000438, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_RemoveItem_ReturnValue) == 0x000439, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_Add_ReturnValue) == 0x00043C, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_fuel) == 0x000440, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_3) == 0x000444, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_DeltaSeconds) == 0x000448, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water_2) == 0x000450, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water_1) == 0x000458, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water) == 0x000460, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage) == 0x000468, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_1) == 0x00046C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_actor) == 0x0004F8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_impact) == 0x000500, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_14) == 0x000510, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_6) == 0x000518, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_IsValid_ReturnValue) == 0x0005A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0005A4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0005B0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_LastIndex_ReturnValue) == 0x0005B4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_Get_Item) == 0x0005B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_seLoc_ReturnValue_1) == 0x0005D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_seLoc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0005D4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_seLoc_ReturnValue_2) == 0x0005D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_seLoc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0005DC, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0005E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0005E4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_key_2) == 0x0005E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_actor_1) == 0x0005F8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_4) == 0x000600, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_7) == 0x000604, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_impact_1) == 0x00068C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_skipSetting) == 0x000698, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_static) == 0x000699, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_frozen) == 0x00069A, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_active) == 0x00069B, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Vector_Distance_ReturnValue) == 0x00069C, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0006A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0006A4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_FClamp_ReturnValue) == 0x0006A8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0006AC, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0006AD, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0006AE, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Less_FloatFloat_ReturnValue) == 0x0006AF, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_BooleanAND_ReturnValue) == 0x0006B0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0006B4, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_activate) == 0x0006B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Conv_BoolToString_ReturnValue) == 0x0006C0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player) == 0x0006D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit) == 0x0006D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_index) == 0x000760, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_action) == 0x000764, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind) == 0x000768, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000780, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_IsValid_ReturnValue_1) == 0x000781, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000784, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00080C, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_useLadder_ladder1) == 0x000810, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_useLadder_ladder1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000818, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000824, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Vector_Distance_ReturnValue_1) == 0x000830, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_ClosestPointOnLineSeqment_ReturnValue) == 0x000834, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_ClosestPointOnLineSeqment_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000840, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind_1) == 0x000848, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind_2) == 0x000860, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000878, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000879, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water_3) == 0x000880, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_BooleanOR_ReturnValue) == 0x000888, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, Temp_object_Variable) == 0x000890, "Member 'Ladder_C_ExecuteUbergraph_ladder::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_CapsuleOverlapActors_OutActors) == 0x0008A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_CapsuleOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_CapsuleOverlapActors_ReturnValue) == 0x0008B0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_CapsuleOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind_3) == 0x0008B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_BooleanOR_ReturnValue_1) == 0x0008D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x0008D1, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_SelectFloat_ReturnValue) == 0x0008D4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0008D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_IsValid_ReturnValue_2) == 0x0008DC, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0008E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x0008E4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_FClamp_ReturnValue_1) == 0x0008E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function ladder.ladder_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Ladder_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Ladder_C_ActionOptionIndex");
static_assert(sizeof(Ladder_C_ActionOptionIndex) == 0x000098, "Wrong size on Ladder_C_ActionOptionIndex");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Param_Player) == 0x000000, "Member 'Ladder_C_ActionOptionIndex::Param_Player' has a wrong offset!");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Ladder_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Ladder_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Action) == 0x000094, "Member 'Ladder_C_ActionOptionIndex::Action' has a wrong offset!");

// Function ladder.ladder_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Ladder_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_33C3[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ImpactDamage) == 0x000008, "Wrong alignment on Ladder_C_ImpactDamage");
static_assert(sizeof(Ladder_C_ImpactDamage) == 0x0000A8, "Wrong size on Ladder_C_ImpactDamage");
static_assert(offsetof(Ladder_C_ImpactDamage, Damage) == 0x000000, "Member 'Ladder_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Ladder_C_ImpactDamage, Hit) == 0x000004, "Member 'Ladder_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Ladder_C_ImpactDamage, Actor) == 0x000090, "Member 'Ladder_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Ladder_C_ImpactDamage, Impact) == 0x000098, "Member 'Ladder_C_ImpactDamage::Impact' has a wrong offset!");

// Function ladder.ladder_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_EnterWater) == 0x000008, "Wrong alignment on Ladder_C_EnterWater");
static_assert(sizeof(Ladder_C_EnterWater) == 0x000008, "Wrong size on Ladder_C_EnterWater");
static_assert(offsetof(Ladder_C_EnterWater, Water) == 0x000000, "Member 'Ladder_C_EnterWater::Water' has a wrong offset!");

// Function ladder.ladder_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_LeaveWater) == 0x000008, "Wrong alignment on Ladder_C_LeaveWater");
static_assert(sizeof(Ladder_C_LeaveWater) == 0x000008, "Wrong size on Ladder_C_LeaveWater");
static_assert(offsetof(Ladder_C_LeaveWater, Water) == 0x000000, "Member 'Ladder_C_LeaveWater::Water' has a wrong offset!");

// Function ladder.ladder_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Ladder_C_EnterWaterOrigin");
static_assert(sizeof(Ladder_C_EnterWaterOrigin) == 0x000008, "Wrong size on Ladder_C_EnterWaterOrigin");
static_assert(offsetof(Ladder_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Ladder_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function ladder.ladder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ladder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ReceiveTick) == 0x000004, "Wrong alignment on Ladder_C_ReceiveTick");
static_assert(sizeof(Ladder_C_ReceiveTick) == 0x000004, "Wrong size on Ladder_C_ReceiveTick");
static_assert(offsetof(Ladder_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ladder_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ladder.ladder_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Ladder_C_AnyKey final
{
public:
	struct FKey                                   Param_Key;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ladder_C_AnyKey) == 0x000008, "Wrong alignment on Ladder_C_AnyKey");
static_assert(sizeof(Ladder_C_AnyKey) == 0x000020, "Wrong size on Ladder_C_AnyKey");
static_assert(offsetof(Ladder_C_AnyKey, Param_Key) == 0x000000, "Member 'Ladder_C_AnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(Ladder_C_AnyKey, Pressed) == 0x000018, "Member 'Ladder_C_AnyKey::Pressed' has a wrong offset!");

// Function ladder.ladder_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Ladder_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ApplyColor) == 0x000004, "Wrong alignment on Ladder_C_ApplyColor");
static_assert(sizeof(Ladder_C_ApplyColor) == 0x000010, "Wrong size on Ladder_C_ApplyColor");
static_assert(offsetof(Ladder_C_ApplyColor, Color) == 0x000000, "Member 'Ladder_C_ApplyColor::Color' has a wrong offset!");

// Function ladder.ladder_C.settingsApplied
// 0x00CC (0x00CC - 0x0000)
struct Ladder_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00CC)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_SettingsApplied) == 0x000004, "Wrong alignment on Ladder_C_SettingsApplied");
static_assert(sizeof(Ladder_C_SettingsApplied) == 0x0000CC, "Wrong size on Ladder_C_SettingsApplied");
static_assert(offsetof(Ladder_C_SettingsApplied, Settings) == 0x000000, "Member 'Ladder_C_SettingsApplied::Settings' has a wrong offset!");

// Function ladder.ladder_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_StuffUpgraded) == 0x000008, "Wrong alignment on Ladder_C_StuffUpgraded");
static_assert(sizeof(Ladder_C_StuffUpgraded) == 0x000008, "Wrong size on Ladder_C_StuffUpgraded");
static_assert(offsetof(Ladder_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Ladder_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function ladder.ladder_C.damageByPlayer
// 0x0090 (0x0090 - 0x0000)
struct Ladder_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
