#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ladder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function ladder.ladder_C.ExecuteUbergraph_ladder
// 0x09F0 (0x09F0 - 0x0000)
struct Ladder_C_ExecuteUbergraph_ladder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_seLoc_ReturnValue;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage_4;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x00F0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0120(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0298(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x0324(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0340(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_1;                             // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x03F0(0x00F0)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_color;                                // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x0520(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53A[0x2];                                      // 0x053A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x056C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0618(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x3];                                      // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x06B8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_seLoc_ReturnValue_1;                      // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1[0x3];                                      // 0x06D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_seLoc_ReturnValue_2;                      // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x06E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E5[0x3];                                      // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_2;                                // 0x06E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0704(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x078C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x079A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x079B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x07AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x07AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x07AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x07AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x07B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x07C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x07D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_getKeybindFromName_bind;                  // 0x0868(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0881(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_882[0x2];                                      // 0x0882(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0884(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x090C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90D[0x3];                                      // 0x090D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALadder_C*                              CallFunc_useLadder_ladder1;                        // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0918(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0924(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClosestPointOnLineSeqment_ReturnValue;    // 0x0934(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_getKeybindFromName_bind_1;                // 0x0948(0x0018)(HasGetValueTypeHash)
	struct FKey                                   CallFunc_getKeybindFromName_bind_2;                // 0x0960(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97A[0x6];                                      // 0x097A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0990(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_CapsuleOverlapActors_OutActors;           // 0x09A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_CapsuleOverlapActors_ReturnValue;         // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B1[0x7];                                      // 0x09B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_getKeybindFromName_bind_3;                // 0x09B8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x09D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D2[0x2];                                      // 0x09D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9DD[0x3];                                      // 0x09DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ExecuteUbergraph_ladder) == 0x000008, "Wrong alignment on Ladder_C_ExecuteUbergraph_ladder");
static_assert(sizeof(Ladder_C_ExecuteUbergraph_ladder) == 0x0009F0, "Wrong size on Ladder_C_ExecuteUbergraph_ladder");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, EntryPoint) == 0x000000, "Member 'Ladder_C_ExecuteUbergraph_ladder::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_seLoc_ReturnValue) == 0x000004, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_seLoc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_4) == 0x000008, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hot) == 0x00000C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_17) == 0x000098, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_16) == 0x0000A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_3) == 0x0000A8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_location_1) == 0x0000AC, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_15) == 0x0000B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_14) == 0x0000C0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_13) == 0x0000C8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_wheelDelta) == 0x0000D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_12) == 0x0000D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_mouse) == 0x0000E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_11) == 0x0000E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_key_1) == 0x0000F0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_pressed_1) == 0x000108, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_temperature_1) == 0x00010C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_temperature) == 0x000110, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_speed) == 0x000114, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_10) == 0x000118, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_5) == 0x000120, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_name_1) == 0x0001A8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_volume) == 0x0001B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_9) == 0x0001C0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_location) == 0x0001C8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_2) == 0x0001D4, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_clean_1) == 0x0001D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_8) == 0x0001E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_4) == 0x0001E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hook_1) == 0x000270, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_clean) == 0x000278, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_7) == 0x000280, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hook) == 0x000288, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_6) == 0x000290, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_3) == 0x000298, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_kick) == 0x000320, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_name) == 0x000324, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_5) == 0x000330, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_4) == 0x000338, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_2) == 0x000340, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_1) == 0x0003C8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_3) == 0x0003D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_2) == 0x0003D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_1) == 0x0003E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_gamemode) == 0x0003E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_settings) == 0x0003F0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_color) == 0x0004E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_picker) == 0x0004F0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_texture) == 0x0004F8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_index) == 0x000500, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000504, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000510, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_key) == 0x000520, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_pressed) == 0x000538, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_RemoveItem_ReturnValue) == 0x000539, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_Add_ReturnValue) == 0x00053C, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_fuel) == 0x000540, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_5) == 0x000544, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_DeltaSeconds) == 0x000548, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water_2) == 0x000550, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water_1) == 0x000558, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water) == 0x000560, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage) == 0x000568, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_1) == 0x00056C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_actor) == 0x0005F8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_impact) == 0x000600, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player_18) == 0x000610, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_6) == 0x000618, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_IsValid_ReturnValue) == 0x0006A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0006A4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0006B0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_LastIndex_ReturnValue) == 0x0006B4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Array_Get_Item) == 0x0006B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_seLoc_ReturnValue_1) == 0x0006D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_seLoc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0006D4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_seLoc_ReturnValue_2) == 0x0006D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_seLoc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0006DC, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0006E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0006E4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_key_2) == 0x0006E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_actor_1) == 0x0006F8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_damage_6) == 0x000700, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit_7) == 0x000704, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_impact_1) == 0x00078C, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_skipSetting) == 0x000798, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_static) == 0x000799, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_frozen) == 0x00079A, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_active) == 0x00079B, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Vector_Distance_ReturnValue) == 0x00079C, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0007A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0007A4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_FClamp_ReturnValue) == 0x0007A8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0007AC, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0007AD, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0007AE, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Less_FloatFloat_ReturnValue) == 0x0007AF, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_BooleanAND_ReturnValue) == 0x0007B0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0007B4, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_activate) == 0x0007B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Conv_BoolToString_ReturnValue) == 0x0007C0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_player) == 0x0007D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_hit) == 0x0007D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_action) == 0x000860, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind) == 0x000868, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000880, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_IsValid_ReturnValue_1) == 0x000881, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000884, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00090C, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_useLadder_ladder1) == 0x000910, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_useLadder_ladder1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000918, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000924, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Vector_Distance_ReturnValue_1) == 0x000930, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_ClosestPointOnLineSeqment_ReturnValue) == 0x000934, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_ClosestPointOnLineSeqment_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000940, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind_1) == 0x000948, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind_2) == 0x000960, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000978, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000979, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, K2Node_Event_water_3) == 0x000980, "Member 'Ladder_C_ExecuteUbergraph_ladder::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_BooleanOR_ReturnValue) == 0x000988, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, Temp_object_Variable) == 0x000990, "Member 'Ladder_C_ExecuteUbergraph_ladder::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_CapsuleOverlapActors_OutActors) == 0x0009A0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_CapsuleOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_CapsuleOverlapActors_ReturnValue) == 0x0009B0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_CapsuleOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_getKeybindFromName_bind_3) == 0x0009B8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_getKeybindFromName_bind_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_BooleanOR_ReturnValue_1) == 0x0009D0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x0009D1, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_SelectFloat_ReturnValue) == 0x0009D4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0009D8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_IsValid_ReturnValue_2) == 0x0009DC, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0009E0, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x0009E4, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Ladder_C_ExecuteUbergraph_ladder, CallFunc_FClamp_ReturnValue_1) == 0x0009E8, "Member 'Ladder_C_ExecuteUbergraph_ladder::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function ladder.ladder_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Ladder_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Ladder_C_ActionOptionIndex");
static_assert(sizeof(Ladder_C_ActionOptionIndex) == 0x000098, "Wrong size on Ladder_C_ActionOptionIndex");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Param_Player) == 0x000000, "Member 'Ladder_C_ActionOptionIndex::Param_Player' has a wrong offset!");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Ladder_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Ladder_C_ActionOptionIndex, Action) == 0x000090, "Member 'Ladder_C_ActionOptionIndex::Action' has a wrong offset!");

// Function ladder.ladder_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Ladder_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_ImpactDamage) == 0x000008, "Wrong alignment on Ladder_C_ImpactDamage");
static_assert(sizeof(Ladder_C_ImpactDamage) == 0x0000A8, "Wrong size on Ladder_C_ImpactDamage");
static_assert(offsetof(Ladder_C_ImpactDamage, Damage) == 0x000000, "Member 'Ladder_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Ladder_C_ImpactDamage, Hit) == 0x000004, "Member 'Ladder_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Ladder_C_ImpactDamage, Actor) == 0x000090, "Member 'Ladder_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Ladder_C_ImpactDamage, Impact) == 0x000098, "Member 'Ladder_C_ImpactDamage::Impact' has a wrong offset!");

// Function ladder.ladder_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_EnterWater) == 0x000008, "Wrong alignment on Ladder_C_EnterWater");
static_assert(sizeof(Ladder_C_EnterWater) == 0x000008, "Wrong size on Ladder_C_EnterWater");
static_assert(offsetof(Ladder_C_EnterWater, Water) == 0x000000, "Member 'Ladder_C_EnterWater::Water' has a wrong offset!");

// Function ladder.ladder_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_LeaveWater) == 0x000008, "Wrong alignment on Ladder_C_LeaveWater");
static_assert(sizeof(Ladder_C_LeaveWater) == 0x000008, "Wrong size on Ladder_C_LeaveWater");
static_assert(offsetof(Ladder_C_LeaveWater, Water) == 0x000000, "Member 'Ladder_C_LeaveWater::Water' has a wrong offset!");

// Function ladder.ladder_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Ladder_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ladder_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Ladder_C_EnterWaterOrigin");
static_assert(sizeof(Ladder_C_EnterWaterOrigin) == 0x000008, "Wrong size on Ladder_C_EnterWaterOrigin");
