#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Laptop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function laptop.laptop_C.ExecuteUbergraph_laptop
// 0x0818 (0x0818 - 0x0000)
struct Laptop_C_ExecuteUbergraph_laptop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0108(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0138(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0200(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x02B0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x02CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_kick;                                 // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0310(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x03C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_1;                              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0470(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_key;                                  // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x051C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x05D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0678(0x00F0)(HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0769(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x076A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x076B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76C[0x4];                                      // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0778(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0801(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_802[0x6];                                      // 0x0802(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Laptop_C_ExecuteUbergraph_laptop) == 0x000008, "Wrong alignment on Laptop_C_ExecuteUbergraph_laptop");
static_assert(sizeof(Laptop_C_ExecuteUbergraph_laptop) == 0x000818, "Wrong size on Laptop_C_ExecuteUbergraph_laptop");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, EntryPoint) == 0x000000, "Member 'Laptop_C_ExecuteUbergraph_laptop::EntryPoint' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, Temp_byte_Variable) == 0x000004, "Member 'Laptop_C_ExecuteUbergraph_laptop::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, Temp_byte_Variable_1) == 0x000005, "Member 'Laptop_C_ExecuteUbergraph_laptop::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, Temp_bool_Variable) == 0x000006, "Member 'Laptop_C_ExecuteUbergraph_laptop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, Temp_object_Variable) == 0x000008, "Member 'Laptop_C_ExecuteUbergraph_laptop::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, Temp_object_Variable_1) == 0x000010, "Member 'Laptop_C_ExecuteUbergraph_laptop::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage_6) == 0x000018, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_fuel) == 0x00001C, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage_5) == 0x000020, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hot) == 0x000024, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_18) == 0x0000B0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_17) == 0x0000B8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage_4) == 0x0000C0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_location_1) == 0x0000C4, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_16) == 0x0000D0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_15) == 0x0000D8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_14) == 0x0000E0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_wheelDelta) == 0x0000E8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_13) == 0x0000F0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_mouse) == 0x0000F8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_12) == 0x000100, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_key_2) == 0x000108, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_pressed_1) == 0x000120, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_temperature_1) == 0x000124, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_temperature) == 0x000128, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_speed) == 0x00012C, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_11) == 0x000130, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_7) == 0x000138, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_name_1) == 0x0001C0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_volume) == 0x0001D0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_10) == 0x0001D8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_location) == 0x0001E0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage_3) == 0x0001EC, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_clean_1) == 0x0001F0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_9) == 0x0001F8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_6) == 0x000200, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hook_1) == 0x000288, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_clean) == 0x000290, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_8) == 0x000298, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hook) == 0x0002A0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_gamemode) == 0x0002A8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_key_1) == 0x0002B0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_pressed) == 0x0002C8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_color) == 0x0002CC, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_picker) == 0x0002E0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_texture) == 0x0002E8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_index) == 0x0002F0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_kick) == 0x0002F4, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_name) == 0x0002F8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_7) == 0x000300, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_6) == 0x000308, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_5) == 0x000310, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage_2) == 0x000398, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_5) == 0x0003A0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_4) == 0x0003A8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_3) == 0x0003B0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0003B8, "Member 'Laptop_C_ExecuteUbergraph_laptop::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_2) == 0x0003C0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_4) == 0x0003C8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, Temp_bool_Variable_1) == 0x000450, "Member 'Laptop_C_ExecuteUbergraph_laptop::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_water_3) == 0x000458, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_water_2) == 0x000460, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player_1) == 0x000468, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_3) == 0x000470, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, CallFunc_GetPlayerController_ReturnValue) == 0x0004F8, "Member 'Laptop_C_ExecuteUbergraph_laptop::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_key) == 0x000500, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_actor_1) == 0x000510, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage_1) == 0x000518, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_2) == 0x00051C, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_impact_1) == 0x0005A4, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_skipSetting) == 0x0005B0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_water_1) == 0x0005B8, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_water) == 0x0005C0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, CallFunc_GetPlayerController_ReturnValue_1) == 0x0005C8, "Member 'Laptop_C_ExecuteUbergraph_laptop::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_damage) == 0x0005D0, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit_1) == 0x0005D4, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_actor) == 0x000660, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_impact) == 0x000668, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_settings) == 0x000678, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_static) == 0x000768, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_frozen) == 0x000769, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_active) == 0x00076A, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Select_Default) == 0x00076B, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_player) == 0x000770, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_hit) == 0x000778, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_action) == 0x000800, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_SwitchEnum_CmpSuccess) == 0x000801, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Select_Default_1) == 0x000808, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, K2Node_Event_activate) == 0x000810, "Member 'Laptop_C_ExecuteUbergraph_laptop::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Laptop_C_ExecuteUbergraph_laptop, CallFunc_Not_PreBool_ReturnValue) == 0x000811, "Member 'Laptop_C_ExecuteUbergraph_laptop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function laptop.laptop_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Laptop_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Laptop_C_Virus) == 0x000001, "Wrong alignment on Laptop_C_Virus");
static_assert(sizeof(Laptop_C_Virus) == 0x000001, "Wrong size on Laptop_C_Virus");
static_assert(offsetof(Laptop_C_Virus, Activate) == 0x000000, "Member 'Laptop_C_Virus::Activate' has a wrong offset!");

// Function laptop.laptop_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Laptop_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Laptop_C_ActionOptionIndex");
static_assert(sizeof(Laptop_C_ActionOptionIndex) == 0x000098, "Wrong size on Laptop_C_ActionOptionIndex");
static_assert(offsetof(Laptop_C_ActionOptionIndex, Player) == 0x000000, "Member 'Laptop_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Laptop_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Laptop_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Laptop_C_ActionOptionIndex, Action) == 0x000090, "Member 'Laptop_C_ActionOptionIndex::Action' has a wrong offset!");

// Function laptop.laptop_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Laptop_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Laptop_C_SetPropProps) == 0x000001, "Wrong alignment on Laptop_C_SetPropProps");
static_assert(sizeof(Laptop_C_SetPropProps) == 0x000003, "Wrong size on Laptop_C_SetPropProps");
static_assert(offsetof(Laptop_C_SetPropProps, Static) == 0x000000, "Member 'Laptop_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Laptop_C_SetPropProps, Frozen) == 0x000001, "Member 'Laptop_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Laptop_C_SetPropProps, Active) == 0x000002, "Member 'Laptop_C_SetPropProps::Active' has a wrong offset!");

// Function laptop.laptop_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct Laptop_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_SettingsApplied) == 0x000008, "Wrong alignment on Laptop_C_SettingsApplied");
static_assert(sizeof(Laptop_C_SettingsApplied) == 0x0000F0, "Wrong size on Laptop_C_SettingsApplied");
static_assert(offsetof(Laptop_C_SettingsApplied, Settings) == 0x000000, "Member 'Laptop_C_SettingsApplied::Settings' has a wrong offset!");

// Function laptop.laptop_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Laptop_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_ImpactDamage) == 0x000008, "Wrong alignment on Laptop_C_ImpactDamage");
static_assert(sizeof(Laptop_C_ImpactDamage) == 0x0000A8, "Wrong size on Laptop_C_ImpactDamage");
static_assert(offsetof(Laptop_C_ImpactDamage, Damage) == 0x000000, "Member 'Laptop_C_ImpactDamage::Damage' has a wrong offset!");
static_assert(offsetof(Laptop_C_ImpactDamage, Hit) == 0x000004, "Member 'Laptop_C_ImpactDamage::Hit' has a wrong offset!");
static_assert(offsetof(Laptop_C_ImpactDamage, Actor) == 0x000090, "Member 'Laptop_C_ImpactDamage::Actor' has a wrong offset!");
static_assert(offsetof(Laptop_C_ImpactDamage, Impact) == 0x000098, "Member 'Laptop_C_ImpactDamage::Impact' has a wrong offset!");

// Function laptop.laptop_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_EnterWater) == 0x000008, "Wrong alignment on Laptop_C_EnterWater");
static_assert(sizeof(Laptop_C_EnterWater) == 0x000008, "Wrong size on Laptop_C_EnterWater");
static_assert(offsetof(Laptop_C_EnterWater, Water) == 0x000000, "Member 'Laptop_C_EnterWater::Water' has a wrong offset!");

// Function laptop.laptop_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_LeaveWater) == 0x000008, "Wrong alignment on Laptop_C_LeaveWater");
static_assert(sizeof(Laptop_C_LeaveWater) == 0x000008, "Wrong size on Laptop_C_LeaveWater");
static_assert(offsetof(Laptop_C_LeaveWater, Water) == 0x000000, "Member 'Laptop_C_LeaveWater::Water' has a wrong offset!");

// Function laptop.laptop_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Laptop_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Laptop_C_AddDamage) == 0x000008, "Wrong alignment on Laptop_C_AddDamage");
static_assert(sizeof(Laptop_C_AddDamage) == 0x0000A8, "Wrong size on Laptop_C_AddDamage");
static_assert(offsetof(Laptop_C_AddDamage, Actor) == 0x000000, "Member 'Laptop_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Laptop_C_AddDamage, Damage) == 0x000008, "Member 'Laptop_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Laptop_C_AddDamage, Hit) == 0x00000C, "Member 'Laptop_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Laptop_C_AddDamage, Impact) == 0x000094, "Member 'Laptop_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Laptop_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Laptop_C_AddDamage::SkipSetting' has a wrong offset!");

// Function laptop.laptop_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Laptop_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_SetKey) == 0x000008, "Wrong alignment on Laptop_C_SetKey");
static_assert(sizeof(Laptop_C_SetKey) == 0x000010, "Wrong size on Laptop_C_SetKey");
static_assert(offsetof(Laptop_C_SetKey, Key) == 0x000000, "Member 'Laptop_C_SetKey::Key' has a wrong offset!");

// Function laptop.laptop_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Laptop_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Laptop_C_SteppedOn) == 0x000008, "Wrong alignment on Laptop_C_SteppedOn");
static_assert(sizeof(Laptop_C_SteppedOn) == 0x000090, "Wrong size on Laptop_C_SteppedOn");
static_assert(offsetof(Laptop_C_SteppedOn, Player) == 0x000000, "Member 'Laptop_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Laptop_C_SteppedOn, Hit) == 0x000008, "Member 'Laptop_C_SteppedOn::Hit' has a wrong offset!");

// Function laptop.laptop_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on Laptop_C_EnterWaterOrigin");
static_assert(sizeof(Laptop_C_EnterWaterOrigin) == 0x000008, "Wrong size on Laptop_C_EnterWaterOrigin");
static_assert(offsetof(Laptop_C_EnterWaterOrigin, Water) == 0x000000, "Member 'Laptop_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function laptop.laptop_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Laptop_C_LeaveWaterOrigin");
static_assert(sizeof(Laptop_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Laptop_C_LeaveWaterOrigin");
static_assert(offsetof(Laptop_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Laptop_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function laptop.laptop_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Laptop_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Laptop_C_Player_use) == 0x000008, "Wrong alignment on Laptop_C_Player_use");
static_assert(sizeof(Laptop_C_Player_use) == 0x000090, "Wrong size on Laptop_C_Player_use");
static_assert(offsetof(Laptop_C_Player_use, Player) == 0x000000, "Member 'Laptop_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Laptop_C_Player_use, Hit) == 0x000008, "Member 'Laptop_C_Player_use::Hit' has a wrong offset!");

// Function laptop.laptop_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_PlayerR) == 0x000008, "Wrong alignment on Laptop_C_PlayerR");
static_assert(sizeof(Laptop_C_PlayerR) == 0x000008, "Wrong size on Laptop_C_PlayerR");
static_assert(offsetof(Laptop_C_PlayerR, Player) == 0x000000, "Member 'Laptop_C_PlayerR::Player' has a wrong offset!");

// Function laptop.laptop_C.playerHold
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_PlayerHold final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_PlayerHold) == 0x000008, "Wrong alignment on Laptop_C_PlayerHold");
static_assert(sizeof(Laptop_C_PlayerHold) == 0x000008, "Wrong size on Laptop_C_PlayerHold");
static_assert(offsetof(Laptop_C_PlayerHold, Player) == 0x000000, "Member 'Laptop_C_PlayerHold::Player' has a wrong offset!");

// Function laptop.laptop_C.playerUnequip
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_PlayerUnequip final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_PlayerUnequip) == 0x000008, "Wrong alignment on Laptop_C_PlayerUnequip");
static_assert(sizeof(Laptop_C_PlayerUnequip) == 0x000008, "Wrong size on Laptop_C_PlayerUnequip");
static_assert(offsetof(Laptop_C_PlayerUnequip, Player) == 0x000000, "Member 'Laptop_C_PlayerUnequip::Player' has a wrong offset!");

// Function laptop.laptop_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct Laptop_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_DamageByPlayer) == 0x000008, "Wrong alignment on Laptop_C_DamageByPlayer");
static_assert(sizeof(Laptop_C_DamageByPlayer) == 0x000098, "Wrong size on Laptop_C_DamageByPlayer");
static_assert(offsetof(Laptop_C_DamageByPlayer, Player) == 0x000000, "Member 'Laptop_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Laptop_C_DamageByPlayer, Hit) == 0x000008, "Member 'Laptop_C_DamageByPlayer::Hit' has a wrong offset!");
static_assert(offsetof(Laptop_C_DamageByPlayer, Damage) == 0x000090, "Member 'Laptop_C_DamageByPlayer::Damage' has a wrong offset!");

// Function laptop.laptop_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_Thrown) == 0x000008, "Wrong alignment on Laptop_C_Thrown");
static_assert(sizeof(Laptop_C_Thrown) == 0x000008, "Wrong size on Laptop_C_Thrown");
static_assert(offsetof(Laptop_C_Thrown, Player) == 0x000000, "Member 'Laptop_C_Thrown::Player' has a wrong offset!");

// Function laptop.laptop_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_SendName) == 0x000004, "Wrong alignment on Laptop_C_SendName");
static_assert(sizeof(Laptop_C_SendName) == 0x000008, "Wrong size on Laptop_C_SendName");
static_assert(offsetof(Laptop_C_SendName, Param_Name) == 0x000000, "Member 'Laptop_C_SendName::Param_Name' has a wrong offset!");

// Function laptop.laptop_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct Laptop_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Laptop_C_Kicked) == 0x000001, "Wrong alignment on Laptop_C_Kicked");
static_assert(sizeof(Laptop_C_Kicked) == 0x000001, "Wrong size on Laptop_C_Kicked");
static_assert(offsetof(Laptop_C_Kicked, Kick) == 0x000000, "Member 'Laptop_C_Kicked::Kick' has a wrong offset!");

// Function laptop.laptop_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct Laptop_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_TexturePickerApply) == 0x000008, "Wrong alignment on Laptop_C_TexturePickerApply");
static_assert(sizeof(Laptop_C_TexturePickerApply) == 0x000018, "Wrong size on Laptop_C_TexturePickerApply");
static_assert(offsetof(Laptop_C_TexturePickerApply, Picker) == 0x000000, "Member 'Laptop_C_TexturePickerApply::Picker' has a wrong offset!");
static_assert(offsetof(Laptop_C_TexturePickerApply, Texture) == 0x000008, "Member 'Laptop_C_TexturePickerApply::Texture' has a wrong offset!");
static_assert(offsetof(Laptop_C_TexturePickerApply, Param_Index) == 0x000010, "Member 'Laptop_C_TexturePickerApply::Param_Index' has a wrong offset!");

// Function laptop.laptop_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Laptop_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_ApplyColor) == 0x000004, "Wrong alignment on Laptop_C_ApplyColor");
static_assert(sizeof(Laptop_C_ApplyColor) == 0x000010, "Wrong size on Laptop_C_ApplyColor");
static_assert(offsetof(Laptop_C_ApplyColor, Color) == 0x000000, "Member 'Laptop_C_ApplyColor::Color' has a wrong offset!");

// Function laptop.laptop_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Laptop_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Laptop_C_AnyKey) == 0x000008, "Wrong alignment on Laptop_C_AnyKey");
static_assert(sizeof(Laptop_C_AnyKey) == 0x000020, "Wrong size on Laptop_C_AnyKey");
static_assert(offsetof(Laptop_C_AnyKey, Key) == 0x000000, "Member 'Laptop_C_AnyKey::Key' has a wrong offset!");
static_assert(offsetof(Laptop_C_AnyKey, Pressed) == 0x000018, "Member 'Laptop_C_AnyKey::Pressed' has a wrong offset!");

// Function laptop.laptop_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_StuffUpgraded) == 0x000008, "Wrong alignment on Laptop_C_StuffUpgraded");
static_assert(sizeof(Laptop_C_StuffUpgraded) == 0x000008, "Wrong size on Laptop_C_StuffUpgraded");
static_assert(offsetof(Laptop_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Laptop_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function laptop.laptop_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct Laptop_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_HookTension) == 0x000008, "Wrong alignment on Laptop_C_HookTension");
static_assert(sizeof(Laptop_C_HookTension) == 0x000008, "Wrong size on Laptop_C_HookTension");
static_assert(offsetof(Laptop_C_HookTension, Hook) == 0x000000, "Member 'Laptop_C_HookTension::Hook' has a wrong offset!");

// Function laptop.laptop_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct Laptop_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Laptop_C_CleanSponge) == 0x000008, "Wrong alignment on Laptop_C_CleanSponge");
static_assert(sizeof(Laptop_C_CleanSponge) == 0x000010, "Wrong size on Laptop_C_CleanSponge");
static_assert(offsetof(Laptop_C_CleanSponge, Clean) == 0x000000, "Member 'Laptop_C_CleanSponge::Clean' has a wrong offset!");
