#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lib

#include "Basic.hpp"

#include "Struct_store_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_picturesDim_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_scientistSpecialResponse_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_physSound_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_characterResponse_v21_structs.hpp"
#include "Struct_signal_data1_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_keybind_structs.hpp"
#include "Struct_spaceObject_structs.hpp"
#include "Struct_signalDataDynamic_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_propDynamic_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "Enum_signalResponse_structs.hpp"
#include "Struct_SignalEmailResponse_structs.hpp"
#include "Enum_emailChars_structs.hpp"
#include "Struct_characterEmailProfile_structs.hpp"
#include "Enum_action_structs.hpp"
#include "Struct_object_structs.hpp"
#include "Struct_task_structs.hpp"
#include "Enum_difficulty_structs.hpp"
#include "Struct_email_structs.hpp"
#include "Enum_notifyType_structs.hpp"
#include "Enum_controllerType_structs.hpp"


namespace SDK::Params
{

// Function lib.lib_C.physSound
// 0x00B8 (0x00B8 - 0x0000)
struct Lib_C_PhysSound final
{
public:
	class UPhysicalMaterial*                      PhysMat;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      Data;                                              // 0x0018(0x0040)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_physSound                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lib_C_PhysSound) == 0x000008, "Wrong alignment on Lib_C_PhysSound");
static_assert(sizeof(Lib_C_PhysSound) == 0x0000B8, "Wrong size on Lib_C_PhysSound");
static_assert(offsetof(Lib_C_PhysSound, PhysMat) == 0x000000, "Member 'Lib_C_PhysSound::PhysMat' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, __WorldContext) == 0x000008, "Member 'Lib_C_PhysSound::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, Return) == 0x000010, "Member 'Lib_C_PhysSound::Return' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, Data) == 0x000018, "Member 'Lib_C_PhysSound::Data' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'Lib_C_PhysSound::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, CallFunc_Conv_StringToName_ReturnValue) == 0x000068, "Member 'Lib_C_PhysSound::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'Lib_C_PhysSound::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Lib_C_PhysSound, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'Lib_C_PhysSound::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function lib.lib_C.getMainGamemode
// 0x0028 (0x0028 - 0x0000)
struct Lib_C_GetMainGamemode final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        AsMain_Gamemode;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_DynamicCast_AsMain_Gamemode;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lib_C_GetMainGamemode) == 0x000008, "Wrong alignment on Lib_C_GetMainGamemode");
static_assert(sizeof(Lib_C_GetMainGamemode) == 0x000028, "Wrong size on Lib_C_GetMainGamemode");
static_assert(offsetof(Lib_C_GetMainGamemode, __WorldContext) == 0x000000, "Member 'Lib_C_GetMainGamemode::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainGamemode, AsMain_Gamemode) == 0x000008, "Member 'Lib_C_GetMainGamemode::AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainGamemode, CallFunc_GetGameMode_ReturnValue) == 0x000010, "Member 'Lib_C_GetMainGamemode::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainGamemode, K2Node_DynamicCast_AsMain_Gamemode) == 0x000018, "Member 'Lib_C_GetMainGamemode::K2Node_DynamicCast_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainGamemode, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Lib_C_GetMainGamemode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function lib.lib_C.getMainPlayer
// 0x0028 (0x0028 - 0x0000)
struct Lib_C_GetMainPlayer final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          AsMain_Player;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lib_C_GetMainPlayer) == 0x000008, "Wrong alignment on Lib_C_GetMainPlayer");
static_assert(sizeof(Lib_C_GetMainPlayer) == 0x000028, "Wrong size on Lib_C_GetMainPlayer");
static_assert(offsetof(Lib_C_GetMainPlayer, __WorldContext) == 0x000000, "Member 'Lib_C_GetMainPlayer::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainPlayer, AsMain_Player) == 0x000008, "Member 'Lib_C_GetMainPlayer::AsMain_Player' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainPlayer, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'Lib_C_GetMainPlayer::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainPlayer, K2Node_DynamicCast_AsMain_Player) == 0x000018, "Member 'Lib_C_GetMainPlayer::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Lib_C_GetMainPlayer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Lib_C_GetMainPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function lib.lib_C.setSettings_d
// 0x0008 (0x0008 - 0x0000)
struct Lib_C_SetSettings_d final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_SetSettings_d) == 0x000008, "Wrong alignment on Lib_C_SetSettings_d");
static_assert(sizeof(Lib_C_SetSettings_d) == 0x000008, "Wrong size on Lib_C_SetSettings_d");
static_assert(offsetof(Lib_C_SetSettings_d, __WorldContext) == 0x000000, "Member 'Lib_C_SetSettings_d::__WorldContext' has a wrong offset!");

// Function lib.lib_C.4dir
// 0x0080 (0x0080 - 0x0000)
struct Lib_C_Fourdir final
{
public:
	struct FVector                                In;                                                // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return;                                            // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                A;                                                 // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                B;                                                 // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_Fourdir) == 0x000008, "Wrong alignment on Lib_C_Fourdir");
static_assert(sizeof(Lib_C_Fourdir) == 0x000080, "Wrong size on Lib_C_Fourdir");
static_assert(offsetof(Lib_C_Fourdir, In) == 0x000000, "Member 'Lib_C_Fourdir::In' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, __WorldContext) == 0x000010, "Member 'Lib_C_Fourdir::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, Return) == 0x000018, "Member 'Lib_C_Fourdir::Return' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, A) == 0x000024, "Member 'Lib_C_Fourdir::A' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, B) == 0x000030, "Member 'Lib_C_Fourdir::B' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_BreakVector_X) == 0x00003C, "Member 'Lib_C_Fourdir::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_BreakVector_Y) == 0x000040, "Member 'Lib_C_Fourdir::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_BreakVector_Z) == 0x000044, "Member 'Lib_C_Fourdir::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_Abs_ReturnValue) == 0x000048, "Member 'Lib_C_Fourdir::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_Vector_SnappedToGrid_ReturnValue) == 0x00004C, "Member 'Lib_C_Fourdir::CallFunc_Vector_SnappedToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_Abs_ReturnValue_1) == 0x000058, "Member 'Lib_C_Fourdir::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_BreakVector_X_1) == 0x00005C, "Member 'Lib_C_Fourdir::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_BreakVector_Y_1) == 0x000060, "Member 'Lib_C_Fourdir::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_BreakVector_Z_1) == 0x000064, "Member 'Lib_C_Fourdir::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'Lib_C_Fourdir::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_SelectFloat_ReturnValue) == 0x00006C, "Member 'Lib_C_Fourdir::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_SelectFloat_ReturnValue_1) == 0x000070, "Member 'Lib_C_Fourdir::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_C_Fourdir, CallFunc_MakeVector_ReturnValue) == 0x000074, "Member 'Lib_C_Fourdir::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function lib.lib_C.getSatelliteName
// 0x00D8 (0x00D8 - 0x0000)
struct Lib_C_GetSatelliteName final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TechName;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Normal;                                            // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   Classic;                                           // 0x0038(0x0018)(Parm, OutParm)
	TArray<class FString>                         T;                                                 // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           B;                                                 // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           A;                                                 // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x00B0(0x0018)()
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_GetSatelliteName) == 0x000008, "Wrong alignment on Lib_C_GetSatelliteName");
static_assert(sizeof(Lib_C_GetSatelliteName) == 0x0000D8, "Wrong size on Lib_C_GetSatelliteName");
static_assert(offsetof(Lib_C_GetSatelliteName, Param_Index) == 0x000000, "Member 'Lib_C_GetSatelliteName::Param_Index' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, __WorldContext) == 0x000008, "Member 'Lib_C_GetSatelliteName::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, TechName) == 0x000010, "Member 'Lib_C_GetSatelliteName::TechName' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, Normal) == 0x000020, "Member 'Lib_C_GetSatelliteName::Normal' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, Classic) == 0x000038, "Member 'Lib_C_GetSatelliteName::Classic' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, T) == 0x000050, "Member 'Lib_C_GetSatelliteName::T' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, B) == 0x000060, "Member 'Lib_C_GetSatelliteName::B' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, A) == 0x000070, "Member 'Lib_C_GetSatelliteName::A' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, K2Node_MakeArray_Array) == 0x000080, "Member 'Lib_C_GetSatelliteName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, K2Node_MakeArray_Array_1) == 0x000090, "Member 'Lib_C_GetSatelliteName::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, K2Node_MakeArray_Array_2) == 0x0000A0, "Member 'Lib_C_GetSatelliteName::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'Lib_C_GetSatelliteName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lib_C_GetSatelliteName, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'Lib_C_GetSatelliteName::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function lib.lib_C.randObject_all
// 0x0048 (0x0048 - 0x0000)
struct Lib_C_RandObject_all final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Return;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Names;                                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_RandObject_all) == 0x000008, "Wrong alignment on Lib_C_RandObject_all");
static_assert(sizeof(Lib_C_RandObject_all) == 0x000048, "Wrong size on Lib_C_RandObject_all");
static_assert(offsetof(Lib_C_RandObject_all, __WorldContext) == 0x000000, "Member 'Lib_C_RandObject_all::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, Return) == 0x000008, "Member 'Lib_C_RandObject_all::Return' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, Names) == 0x000010, "Member 'Lib_C_RandObject_all::Names' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, K2Node_MakeArray_Array) == 0x000020, "Member 'Lib_C_RandObject_all::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000030, "Member 'Lib_C_RandObject_all::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, CallFunc_Array_LastIndex_ReturnValue) == 0x000038, "Member 'Lib_C_RandObject_all::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00003C, "Member 'Lib_C_RandObject_all::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_all, CallFunc_Array_Get_Item) == 0x000040, "Member 'Lib_C_RandObject_all::CallFunc_Array_Get_Item' has a wrong offset!");

// Function lib.lib_C.getNRT
// 0x0148 (0x0148 - 0x0000)
struct Lib_C_GetNRT final
{
public:
	const class USoundBase*                       Key;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConstantQNRT*                          NewParam;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Ae;                                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Path;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Nrt_name;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Param_Name;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Nrtt;                                              // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USoundBase*, class UConstantQNRT*> A;                                                 // 0x0060(0x0050)(Edit, BlueprintVisible)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UConstantQNRT*                          CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USoundBase*, class UConstantQNRT*> K2Node_MakeVariable_MakeVariableOutput;            // 0x00F8(0x0050)()
};
static_assert(alignof(Lib_C_GetNRT) == 0x000008, "Wrong alignment on Lib_C_GetNRT");
static_assert(sizeof(Lib_C_GetNRT) == 0x000148, "Wrong size on Lib_C_GetNRT");
static_assert(offsetof(Lib_C_GetNRT, Key) == 0x000000, "Member 'Lib_C_GetNRT::Key' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, __WorldContext) == 0x000008, "Member 'Lib_C_GetNRT::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, NewParam) == 0x000010, "Member 'Lib_C_GetNRT::NewParam' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, Ae) == 0x000018, "Member 'Lib_C_GetNRT::Ae' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, Path) == 0x000028, "Member 'Lib_C_GetNRT::Path' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, Nrt_name) == 0x000038, "Member 'Lib_C_GetNRT::Nrt_name' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, Param_Name) == 0x000048, "Member 'Lib_C_GetNRT::Param_Name' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, Nrtt) == 0x000058, "Member 'Lib_C_GetNRT::Nrtt' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, A) == 0x000060, "Member 'Lib_C_GetNRT::A' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000B0, "Member 'Lib_C_GetNRT::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000B8, "Member 'Lib_C_GetNRT::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_Array_Find_ReturnValue) == 0x0000C0, "Member 'Lib_C_GetNRT::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_GetDisplayName_ReturnValue) == 0x0000C8, "Member 'Lib_C_GetNRT::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'Lib_C_GetNRT::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_GetDisplayName_ReturnValue_1) == 0x0000E0, "Member 'Lib_C_GetNRT::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'Lib_C_GetNRT::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetNRT, K2Node_MakeVariable_MakeVariableOutput) == 0x0000F8, "Member 'Lib_C_GetNRT::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");

// Function lib.lib_C.setButtonOffset
// 0x00C0 (0x00C0 - 0x0000)
struct Lib_C_SetButtonOffset final
{
public:
	class USceneComponent*                        Comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Lib_C_SetButtonOffset) == 0x000008, "Wrong alignment on Lib_C_SetButtonOffset");
static_assert(sizeof(Lib_C_SetButtonOffset) == 0x0000C0, "Wrong size on Lib_C_SetButtonOffset");
static_assert(offsetof(Lib_C_SetButtonOffset, Comp) == 0x000000, "Member 'Lib_C_SetButtonOffset::Comp' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, Z) == 0x000008, "Member 'Lib_C_SetButtonOffset::Z' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, __WorldContext) == 0x000010, "Member 'Lib_C_SetButtonOffset::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Lib_C_SetButtonOffset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, CallFunc_BreakVector_X) == 0x00001C, "Member 'Lib_C_SetButtonOffset::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, CallFunc_BreakVector_Y) == 0x000020, "Member 'Lib_C_SetButtonOffset::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, CallFunc_BreakVector_Z) == 0x000024, "Member 'Lib_C_SetButtonOffset::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'Lib_C_SetButtonOffset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_SetButtonOffset, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000034, "Member 'Lib_C_SetButtonOffset::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function lib.lib_C.AddPoints
// 0x0060 (0x0060 - 0x0000)
struct Lib_C_AddPoints final
{
public:
	int32                                         Add;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_VictoryIntPlusEquals_IntOut;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_VictoryIntPlusEquals_IntOut_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_VictoryIntPlusEquals_IntOut_2;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
};
static_assert(alignof(Lib_C_AddPoints) == 0x000008, "Wrong alignment on Lib_C_AddPoints");
static_assert(sizeof(Lib_C_AddPoints) == 0x000060, "Wrong size on Lib_C_AddPoints");
static_assert(offsetof(Lib_C_AddPoints, Add) == 0x000000, "Member 'Lib_C_AddPoints::Add' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, __WorldContext) == 0x000008, "Member 'Lib_C_AddPoints::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'Lib_C_AddPoints::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_getMainSave_save_main) == 0x000018, "Member 'Lib_C_AddPoints::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000020, "Member 'Lib_C_AddPoints::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_VictoryIntPlusEquals_IntOut) == 0x000028, "Member 'Lib_C_AddPoints::CallFunc_VictoryIntPlusEquals_IntOut' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000030, "Member 'Lib_C_AddPoints::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_Abs_Int_ReturnValue) == 0x000038, "Member 'Lib_C_AddPoints::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_VictoryIntPlusEquals_IntOut_1) == 0x00003C, "Member 'Lib_C_AddPoints::CallFunc_VictoryIntPlusEquals_IntOut_1' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_VictoryIntPlusEquals_IntOut_2) == 0x000040, "Member 'Lib_C_AddPoints::CallFunc_VictoryIntPlusEquals_IntOut_2' has a wrong offset!");
static_assert(offsetof(Lib_C_AddPoints, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'Lib_C_AddPoints::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function lib.lib_C.getPoints
// 0x0018 (0x0018 - 0x0000)
struct Lib_C_GetPoints final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Points;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_GetPoints) == 0x000008, "Wrong alignment on Lib_C_GetPoints");
static_assert(sizeof(Lib_C_GetPoints) == 0x000018, "Wrong size on Lib_C_GetPoints");
static_assert(offsetof(Lib_C_GetPoints, __WorldContext) == 0x000000, "Member 'Lib_C_GetPoints::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_GetPoints, Points) == 0x000008, "Member 'Lib_C_GetPoints::Points' has a wrong offset!");
static_assert(offsetof(Lib_C_GetPoints, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'Lib_C_GetPoints::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

// Function lib.lib_C.countServerEff
// 0x0068 (0x0068 - 0x0000)
struct Lib_C_CountServerEff final
{
public:
	TArray<class AServerBox_C*>                   Servers;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Type;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eff;                                               // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Typ;                                               // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Working;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Amount;                                            // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AServerBox_C*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_CountServerEff) == 0x000008, "Wrong alignment on Lib_C_CountServerEff");
static_assert(sizeof(Lib_C_CountServerEff) == 0x000068, "Wrong size on Lib_C_CountServerEff");
static_assert(offsetof(Lib_C_CountServerEff, Servers) == 0x000000, "Member 'Lib_C_CountServerEff::Servers' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Type) == 0x000010, "Member 'Lib_C_CountServerEff::Type' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, __WorldContext) == 0x000018, "Member 'Lib_C_CountServerEff::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Eff) == 0x000020, "Member 'Lib_C_CountServerEff::Eff' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Typ) == 0x000024, "Member 'Lib_C_CountServerEff::Typ' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Working) == 0x000028, "Member 'Lib_C_CountServerEff::Working' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Amount) == 0x00002C, "Member 'Lib_C_CountServerEff::Amount' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Temp_float_Variable) == 0x000030, "Member 'Lib_C_CountServerEff::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'Lib_C_CountServerEff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'Lib_C_CountServerEff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'Lib_C_CountServerEff::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'Lib_C_CountServerEff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Temp_int_Array_Index_Variable) == 0x000044, "Member 'Lib_C_CountServerEff::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Array_Get_Item) == 0x000048, "Member 'Lib_C_CountServerEff::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'Lib_C_CountServerEff::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, Temp_float_Variable_1) == 0x000054, "Member 'Lib_C_CountServerEff::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'Lib_C_CountServerEff::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'Lib_C_CountServerEff::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_CountServerEff, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000060, "Member 'Lib_C_CountServerEff::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function lib.lib_C.getServerTypes
// 0x0068 (0x0068 - 0x0000)
struct Lib_C_GetServerTypes final
{
public:
	TArray<class AServerBox_C*>                   Servers;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Type;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AServerBox_C*>                   Eff;                                               // 0x0020(0x0010)(Parm, OutParm)
	TArray<class AServerBox_C*>                   Ss;                                                // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Typ;                                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AServerBox_C*                           CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lib_C_GetServerTypes) == 0x000008, "Wrong alignment on Lib_C_GetServerTypes");
static_assert(sizeof(Lib_C_GetServerTypes) == 0x000068, "Wrong size on Lib_C_GetServerTypes");
static_assert(offsetof(Lib_C_GetServerTypes, Servers) == 0x000000, "Member 'Lib_C_GetServerTypes::Servers' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, Type) == 0x000010, "Member 'Lib_C_GetServerTypes::Type' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, __WorldContext) == 0x000018, "Member 'Lib_C_GetServerTypes::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, Eff) == 0x000020, "Member 'Lib_C_GetServerTypes::Eff' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, Ss) == 0x000030, "Member 'Lib_C_GetServerTypes::Ss' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, Typ) == 0x000040, "Member 'Lib_C_GetServerTypes::Typ' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'Lib_C_GetServerTypes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, Temp_int_Array_Index_Variable) == 0x000048, "Member 'Lib_C_GetServerTypes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'Lib_C_GetServerTypes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, CallFunc_Array_Get_Item) == 0x000050, "Member 'Lib_C_GetServerTypes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'Lib_C_GetServerTypes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'Lib_C_GetServerTypes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'Lib_C_GetServerTypes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_GetServerTypes, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'Lib_C_GetServerTypes::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function lib.lib_C.randObject_acc
// 0x0040 (0x0040 - 0x0000)
struct Lib_C_RandObject_acc final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Return;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Names;                                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lib_C_RandObject_acc) == 0x000008, "Wrong alignment on Lib_C_RandObject_acc");
static_assert(sizeof(Lib_C_RandObject_acc) == 0x000040, "Wrong size on Lib_C_RandObject_acc");
static_assert(offsetof(Lib_C_RandObject_acc, __WorldContext) == 0x000000, "Member 'Lib_C_RandObject_acc::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_acc, Return) == 0x000008, "Member 'Lib_C_RandObject_acc::Return' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_acc, Names) == 0x000010, "Member 'Lib_C_RandObject_acc::Names' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_acc, K2Node_MakeArray_Array) == 0x000020, "Member 'Lib_C_RandObject_acc::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_acc, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'Lib_C_RandObject_acc::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_acc, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000034, "Member 'Lib_C_RandObject_acc::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lib_C_RandObject_acc, CallFunc_Array_Get_Item) == 0x000038, "Member 'Lib_C_RandObject_acc::CallFunc_Array_Get_Item' has a wrong offset!");

// Function lib.lib_C.weightedRandom
// 0x0078 (0x0078 - 0x0000)
struct Lib_C_WeightedRandom final
{
public:
	TArray<float>                                 Weights;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rand;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sum;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 A;                                                 // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lib_C_WeightedRandom) == 0x000008, "Wrong alignment on Lib_C_WeightedRandom");
