#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lib_obj

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function lib_obj.lib_obj_C.obj_static
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_static final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_static) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_static");
static_assert(sizeof(Lib_obj_C_Obj_static) == 0x000038, "Wrong size on Lib_obj_C_Obj_static");
static_assert(offsetof(Lib_obj_C_Obj_static, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_static::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_static, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_static::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_static, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_static::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_static, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_static::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_statDyn
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_statDyn final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_statDyn) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_statDyn");
static_assert(sizeof(Lib_obj_C_Obj_statDyn) == 0x000038, "Wrong size on Lib_obj_C_Obj_statDyn");
static_assert(offsetof(Lib_obj_C_Obj_statDyn, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_statDyn::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDyn, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_statDyn::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDyn, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_statDyn::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDyn, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_statDyn::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_statDynPhys
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_statDynPhys final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_statDynPhys) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_statDynPhys");
static_assert(sizeof(Lib_obj_C_Obj_statDynPhys) == 0x000038, "Wrong size on Lib_obj_C_Obj_statDynPhys");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhys, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_statDynPhys::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhys, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_statDynPhys::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhys, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_statDynPhys::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhys, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_statDynPhys::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_trigger
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_trigger final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_trigger) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_trigger");
static_assert(sizeof(Lib_obj_C_Obj_trigger) == 0x000038, "Wrong size on Lib_obj_C_Obj_trigger");
static_assert(offsetof(Lib_obj_C_Obj_trigger, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_trigger::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_trigger, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_trigger::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_trigger, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_trigger::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_trigger, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_trigger::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_triggerStat
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_triggerStat final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_triggerStat) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_triggerStat");
static_assert(sizeof(Lib_obj_C_Obj_triggerStat) == 0x000038, "Wrong size on Lib_obj_C_Obj_triggerStat");
static_assert(offsetof(Lib_obj_C_Obj_triggerStat, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_triggerStat::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_triggerStat, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_triggerStat::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_triggerStat, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_triggerStat::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_triggerStat, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_triggerStat::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_statDynPhysVeh
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_statDynPhysVeh final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_statDynPhysVeh) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_statDynPhysVeh");
static_assert(sizeof(Lib_obj_C_Obj_statDynPhysVeh) == 0x000038, "Wrong size on Lib_obj_C_Obj_statDynPhysVeh");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhysVeh, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_statDynPhysVeh::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhysVeh, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_statDynPhysVeh::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhysVeh, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_statDynPhysVeh::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_statDynPhysVeh, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_statDynPhysVeh::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_dynPhys
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_dynPhys final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_dynPhys) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_dynPhys");
static_assert(sizeof(Lib_obj_C_Obj_dynPhys) == 0x000038, "Wrong size on Lib_obj_C_Obj_dynPhys");
static_assert(offsetof(Lib_obj_C_Obj_dynPhys, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_dynPhys::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_dynPhys, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_dynPhys::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_dynPhys, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_dynPhys::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_dynPhys, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_dynPhys::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_phys
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_phys final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_phys) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_phys");
static_assert(sizeof(Lib_obj_C_Obj_phys) == 0x000038, "Wrong size on Lib_obj_C_Obj_phys");
static_assert(offsetof(Lib_obj_C_Obj_phys, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_phys::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_phys, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_phys::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_phys, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_phys::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_phys, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_phys::K2Node_MakeArray_Array' has a wrong offset!");

// Function lib_obj.lib_obj_C.obj_pawn
// 0x0038 (0x0038 - 0x0000)
struct Lib_obj_C_Obj_pawn final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0008(0x0010)(Parm, OutParm)
	TArray<EObjectTypeQuery>                      Objs;                                              // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(Lib_obj_C_Obj_pawn) == 0x000008, "Wrong alignment on Lib_obj_C_Obj_pawn");
static_assert(sizeof(Lib_obj_C_Obj_pawn) == 0x000038, "Wrong size on Lib_obj_C_Obj_pawn");
static_assert(offsetof(Lib_obj_C_Obj_pawn, __WorldContext) == 0x000000, "Member 'Lib_obj_C_Obj_pawn::__WorldContext' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_pawn, Obj) == 0x000008, "Member 'Lib_obj_C_Obj_pawn::Obj' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_pawn, Objs) == 0x000018, "Member 'Lib_obj_C_Obj_pawn::Objs' has a wrong offset!");
static_assert(offsetof(Lib_obj_C_Obj_pawn, K2Node_MakeArray_Array) == 0x000028, "Member 'Lib_obj_C_Obj_pawn::K2Node_MakeArray_Array' has a wrong offset!");

}

