#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lightswitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass lightswitch.lightswitch_C
// 0x0020 (0x02A8 - 0x0288)
class ALightswitch_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Lightswitch_C;                      // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          A;                                                 // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FFC[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerBase_C*                         Trigger;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_lightswitch(int32 EntryPoint);
	void Use();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, int32 Param_Index, Enum_interactionActions Action);
	void UpdateStrAgl();
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void Thrown(class AMainPlayer_C* Player);
	void broken_fire();
	void broken();
	void SendName(class FName Param_Name);
	void Kicked(bool Kick);
	void Player_use(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void DriveDetached();
	void IsButtonUsed(bool* Failed);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace);
	void NoRespawn(bool Param_NoRespawn, bool* Return);
	void CanPickup(bool* Return);
	void AsProp(class AProp_C** Return);
	void CanBePutInContainer(bool* Return);
	void UserConstructionScript();
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"lightswitch_C">();
	}
	static class ALightswitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALightswitch_C>();
	}
};
static_assert(alignof(ALightswitch_C) == 0x000008, "Wrong alignment on ALightswitch_C");
static_assert(sizeof(ALightswitch_C) == 0x0002A8, "Wrong size on ALightswitch_C");
static_assert(offsetof(ALightswitch_C, UberGraphFrame_Lightswitch_C) == 0x000288, "Member 'ALightswitch_C::UberGraphFrame_Lightswitch_C' has a wrong offset!");
static_assert(offsetof(ALightswitch_C, Cube) == 0x000290, "Member 'ALightswitch_C::Cube' has a wrong offset!");
static_assert(offsetof(ALightswitch_C, A) == 0x000298, "Member 'ALightswitch_C::A' has a wrong offset!");
static_assert(offsetof(ALightswitch_C, Trigger) == 0x0002A0, "Member 'ALightswitch_C::Trigger' has a wrong offset!");

}

