#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LockerCorpse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass lockerCorpse.lockerCorpse_C
// 0x00C8 (0x02E8 - 0x0220)
class ALockerCorpse_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Gib20;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib19;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib18;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib17;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib16;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib15;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib14;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib13;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib12;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib11;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib10;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib9;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib8;                                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib7;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib6;                                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib5;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib4;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib3;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib2;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib1;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Gib21;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_lockerCorpse(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"lockerCorpse_C">();
	}
	static class ALockerCorpse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALockerCorpse_C>();
	}
};
static_assert(alignof(ALockerCorpse_C) == 0x000008, "Wrong alignment on ALockerCorpse_C");
static_assert(sizeof(ALockerCorpse_C) == 0x0002E8, "Wrong size on ALockerCorpse_C");
static_assert(offsetof(ALockerCorpse_C, UberGraphFrame) == 0x000220, "Member 'ALockerCorpse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib20) == 0x000228, "Member 'ALockerCorpse_C::Gib20' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib19) == 0x000230, "Member 'ALockerCorpse_C::Gib19' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib18) == 0x000238, "Member 'ALockerCorpse_C::Gib18' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib17) == 0x000240, "Member 'ALockerCorpse_C::Gib17' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib16) == 0x000248, "Member 'ALockerCorpse_C::Gib16' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib15) == 0x000250, "Member 'ALockerCorpse_C::Gib15' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib14) == 0x000258, "Member 'ALockerCorpse_C::Gib14' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib13) == 0x000260, "Member 'ALockerCorpse_C::Gib13' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib12) == 0x000268, "Member 'ALockerCorpse_C::Gib12' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib11) == 0x000270, "Member 'ALockerCorpse_C::Gib11' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib10) == 0x000278, "Member 'ALockerCorpse_C::Gib10' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib9) == 0x000280, "Member 'ALockerCorpse_C::Gib9' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib8) == 0x000288, "Member 'ALockerCorpse_C::Gib8' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib7) == 0x000290, "Member 'ALockerCorpse_C::Gib7' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib6) == 0x000298, "Member 'ALockerCorpse_C::Gib6' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib5) == 0x0002A0, "Member 'ALockerCorpse_C::Gib5' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib4) == 0x0002A8, "Member 'ALockerCorpse_C::Gib4' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib3) == 0x0002B0, "Member 'ALockerCorpse_C::Gib3' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib2) == 0x0002B8, "Member 'ALockerCorpse_C::Gib2' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib1) == 0x0002C0, "Member 'ALockerCorpse_C::Gib1' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib) == 0x0002C8, "Member 'ALockerCorpse_C::Gib' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Gib21) == 0x0002D0, "Member 'ALockerCorpse_C::Gib21' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, Audio) == 0x0002D8, "Member 'ALockerCorpse_C::Audio' has a wrong offset!");
static_assert(offsetof(ALockerCorpse_C, DefaultSceneRoot) == 0x0002E0, "Member 'ALockerCorpse_C::DefaultSceneRoot' has a wrong offset!");

}

