#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MadnessCombatMaster

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function madnessCombatMaster.madnessCombatMaster_C.ExecuteUbergraph_madnessCombatMaster
// 0x00A0 (0x00A0 - 0x0000)
struct MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_madnessCombat_C*                   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
static_assert(alignof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster) == 0x000008, "Wrong alignment on MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster");
static_assert(sizeof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster) == 0x0000A0, "Wrong size on MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, EntryPoint) == 0x000000, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::EntryPoint' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, Temp_int_Variable) == 0x000004, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_GetTimeAlive_ReturnValue) == 0x000010, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Create_ReturnValue) == 0x000018, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000028, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Percent_FloatFloat_ReturnValue) == 0x00002C, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, K2Node_MakeArray_Array) == 0x000078, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster, CallFunc_Format_ReturnValue) == 0x000088, "Member 'MadnessCombatMaster_C_ExecuteUbergraph_madnessCombatMaster::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function madnessCombatMaster.madnessCombatMaster_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MadnessCombatMaster_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MadnessCombatMaster_C_ReceiveTick) == 0x000004, "Wrong alignment on MadnessCombatMaster_C_ReceiveTick");
static_assert(sizeof(MadnessCombatMaster_C_ReceiveTick) == 0x000004, "Wrong size on MadnessCombatMaster_C_ReceiveTick");
static_assert(offsetof(MadnessCombatMaster_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MadnessCombatMaster_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function madnessCombatMaster.madnessCombatMaster_C.spawnGrunt
// 0x0070 (0x0070 - 0x0000)
struct MadnessCombatMaster_C_SpawnGrunt final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_grunt_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MadnessCombatMaster_C_SpawnGrunt) == 0x000010, "Wrong alignment on MadnessCombatMaster_C_SpawnGrunt");
static_assert(sizeof(MadnessCombatMaster_C_SpawnGrunt) == 0x000070, "Wrong size on MadnessCombatMaster_C_SpawnGrunt");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000014, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000020, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MadnessCombatMaster_C_SpawnGrunt, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'MadnessCombatMaster_C_SpawnGrunt::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

