#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarsStruct_build_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function marsStruct_build_Skeleton_AnimBlueprint.marsStruct_build_Skeleton_AnimBlueprint_C.ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint
// 0x00B0 (0x00B0 - 0x0000)
struct MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint");
static_assert(sizeof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint) == 0x0000B0, "Wrong size on MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000014, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Normal_ReturnValue) == 0x000020, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00002C, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_RotateAngleAxis_ReturnValue) == 0x000038, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Dot_VectorVector_ReturnValue) == 0x000044, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_FClamp_ReturnValue) == 0x000048, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00004C, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000050, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00005C, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Normal_ReturnValue_1) == 0x000060, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00006C, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000084, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000090, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_FClamp_ReturnValue_1) == 0x000094, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000098, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00009C, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue_1) == 0x0000A0, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x0000AC, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");

// Function marsStruct_build_Skeleton_AnimBlueprint.marsStruct_build_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function marsStruct_build_Skeleton_AnimBlueprint.marsStruct_build_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'MarsStruct_build_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

