#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarsStruct_build_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass marsStruct_build_Skeleton_AnimBlueprint.marsStruct_build_Skeleton_AnimBlueprint_C
// 0x0630 (0x08F0 - 0x02C0)
class UMarsStruct_build_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2568[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02F8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0318(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0420(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0440(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0548(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0610(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0690(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x06D8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0830(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0858(0x0028)()
	struct FRotator                               Rot_in;                                            // 0x0880(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Origin;                                            // 0x088C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_out;                                           // 0x0898(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                LookAt;                                            // 0x08A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rest;                                              // 0x08B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vec_right;                                         // 0x08C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vec_up;                                            // 0x08CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle_Z;                                           // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle_Y;                                           // 0x08DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vec_forward;                                       // 0x08E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_ADECC9764F99C99C098F479D9BB33E1B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_marsStruct_build_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_4B56065B45DBF3D9BF9EE3BB3A017F26();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"marsStruct_build_Skeleton_AnimBlueprint_C">();
	}
	static class UMarsStruct_build_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarsStruct_build_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UMarsStruct_build_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UMarsStruct_build_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UMarsStruct_build_Skeleton_AnimBlueprint_C) == 0x0008F0, "Wrong size on UMarsStruct_build_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0002F8, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x000318, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000420, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000440, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_TwoWayBlend) == 0x000548, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000610, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000690, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0006D8, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x000830, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000858, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Rot_in) == 0x000880, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Rot_in' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Origin) == 0x00088C, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Origin' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Rot_out) == 0x000898, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Rot_out' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, LookAt) == 0x0008A4, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::LookAt' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Alpha) == 0x0008B0, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Alpha' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Rest) == 0x0008B4, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Rest' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Vec_right) == 0x0008C0, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Vec_right' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Vec_up) == 0x0008CC, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Vec_up' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Angle_Z) == 0x0008D8, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Angle_Z' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Angle_Y) == 0x0008DC, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Angle_Y' has a wrong offset!");
static_assert(offsetof(UMarsStruct_build_Skeleton_AnimBlueprint_C, Vec_forward) == 0x0008E0, "Member 'UMarsStruct_build_Skeleton_AnimBlueprint_C::Vec_forward' has a wrong offset!");

}

