#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function menu.menu_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Menu_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_C_ReceiveTick) == 0x000004, "Wrong alignment on Menu_C_ReceiveTick");
static_assert(sizeof(Menu_C_ReceiveTick) == 0x000004, "Wrong size on Menu_C_ReceiveTick");
static_assert(offsetof(Menu_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Menu_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function menu.menu_C.ExecuteUbergraph_menu
// 0x0060 (0x0060 - 0x0000)
struct Menu_C_ExecuteUbergraph_menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_2;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1B[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetProjectSavedDirectory_ReturnValue;     // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_C_ExecuteUbergraph_menu) == 0x000008, "Wrong alignment on Menu_C_ExecuteUbergraph_menu");
static_assert(sizeof(Menu_C_ExecuteUbergraph_menu) == 0x000060, "Wrong size on Menu_C_ExecuteUbergraph_menu");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, EntryPoint) == 0x000000, "Member 'Menu_C_ExecuteUbergraph_menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_DegSin_ReturnValue) == 0x00000C, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_DegSin_ReturnValue_1) == 0x000010, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_DegSin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000018, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Lerp_ReturnValue) == 0x00001C, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Lerp_ReturnValue_1) == 0x000020, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000024, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_DegSin_ReturnValue_2) == 0x000028, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_DegSin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00002C, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_Lerp_ReturnValue_2) == 0x000030, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'Menu_C_ExecuteUbergraph_menu::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000044, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000048, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_C_ExecuteUbergraph_menu, CallFunc_GetProjectSavedDirectory_ReturnValue) == 0x000050, "Member 'Menu_C_ExecuteUbergraph_menu::CallFunc_GetProjectSavedDirectory_ReturnValue' has a wrong offset!");

}

