#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass menu.menu_C
// 0x0018 (0x0240 - 0x0228)
class AMenu_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Tick;                                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1A[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CameraActor_1_ExecuteUbergraph_menu_RefProperty;   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_menu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"menu_C">();
	}
	static class AMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMenu_C>();
	}
};
static_assert(alignof(AMenu_C) == 0x000008, "Wrong alignment on AMenu_C");
static_assert(sizeof(AMenu_C) == 0x000240, "Wrong size on AMenu_C");
static_assert(offsetof(AMenu_C, UberGraphFrame) == 0x000228, "Member 'AMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMenu_C, Tick) == 0x000230, "Member 'AMenu_C::Tick' has a wrong offset!");
static_assert(offsetof(AMenu_C, CameraActor_1_ExecuteUbergraph_menu_RefProperty) == 0x000238, "Member 'AMenu_C::CameraActor_1_ExecuteUbergraph_menu_RefProperty' has a wrong offset!");

}

