#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mg_invaders

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function mg_invaders.mg_invaders_C.beepBoop__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Mg_invaders_C_beepBoop__DelegateSignature final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volume;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_beepBoop__DelegateSignature) == 0x000008, "Wrong alignment on Mg_invaders_C_beepBoop__DelegateSignature");
static_assert(sizeof(Mg_invaders_C_beepBoop__DelegateSignature) == 0x000010, "Wrong size on Mg_invaders_C_beepBoop__DelegateSignature");
static_assert(offsetof(Mg_invaders_C_beepBoop__DelegateSignature, Sound) == 0x000000, "Member 'Mg_invaders_C_beepBoop__DelegateSignature::Sound' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_beepBoop__DelegateSignature, Volume) == 0x000008, "Member 'Mg_invaders_C_beepBoop__DelegateSignature::Volume' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_beepBoop__DelegateSignature, Pitch) == 0x00000C, "Member 'Mg_invaders_C_beepBoop__DelegateSignature::Pitch' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.ExecuteUbergraph_mg_invaders
// 0x0108 (0x0108 - 0x0000)
struct Mg_invaders_C_ExecuteUbergraph_mg_invaders final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0008(0x0018)(HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUi_arcade_invaders_C*                  K2Node_DynamicCast_AsUi_Arcade_Invaders;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0048(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x0060(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x0098(0x0018)(HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_Array_Get_Item;                           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_1;                     // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_ExecuteUbergraph_mg_invaders) == 0x000008, "Wrong alignment on Mg_invaders_C_ExecuteUbergraph_mg_invaders");
static_assert(sizeof(Mg_invaders_C_ExecuteUbergraph_mg_invaders) == 0x000108, "Wrong size on Mg_invaders_C_ExecuteUbergraph_mg_invaders");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, EntryPoint) == 0x000000, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_InputKeyEvent_Key) == 0x000008, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000020, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_DynamicCast_AsUi_Arcade_Invaders) == 0x000028, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_DynamicCast_AsUi_Arcade_Invaders' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000038, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000040, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_InputKeyEvent_Key_1) == 0x000048, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_InputKeyEvent_Key_2) == 0x000060, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Clamp_ReturnValue) == 0x000080, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Clamp_ReturnValue_1) == 0x000084, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x000088, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x000090, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_InputKeyEvent_Key_3) == 0x000098, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_MakeStruct_IntVector) == 0x0000B0, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_MakeStruct_IntVector' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Array_AddUnique_ReturnValue) == 0x0000BC, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Array_LastIndex_ReturnValue) == 0x0000C0, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000C4, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D8, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000DC, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, K2Node_MakeStruct_IntVector_1) == 0x0000E0, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::K2Node_MakeStruct_IntVector_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0000EC, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000F8, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_ExecuteUbergraph_mg_invaders, CallFunc_Array_Add_ReturnValue) == 0x000100, "Member 'Mg_invaders_C_ExecuteUbergraph_mg_invaders::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Mg_invaders_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_ReceiveTick) == 0x000004, "Wrong alignment on Mg_invaders_C_ReceiveTick");
static_assert(sizeof(Mg_invaders_C_ReceiveTick) == 0x000004, "Wrong size on Mg_invaders_C_ReceiveTick");
static_assert(offsetof(Mg_invaders_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Mg_invaders_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.InpActEvt_Up_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0");
static_assert(sizeof(Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0");
static_assert(offsetof(Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'Mg_invaders_C_InpActEvt_Up_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.InpActEvt_Left_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1");
static_assert(sizeof(Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1");
static_assert(offsetof(Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'Mg_invaders_C_InpActEvt_Left_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.InpActEvt_Right_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2");
static_assert(sizeof(Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2");
static_assert(offsetof(Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'Mg_invaders_C_InpActEvt_Right_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.InpActEvt_Enter_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3");
static_assert(sizeof(Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3");
static_assert(offsetof(Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'Mg_invaders_C_InpActEvt_Enter_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.gen
// 0x0070 (0x0070 - 0x0000)
struct Mg_invaders_C_Gen final
{
public:
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateInstanceTransform_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mg_invaders_C_Gen) == 0x000010, "Wrong alignment on Mg_invaders_C_Gen");
static_assert(sizeof(Mg_invaders_C_Gen) == 0x000070, "Wrong size on Mg_invaders_C_Gen");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_Multiply_IntInt_ReturnValue) == 0x000000, "Member 'Mg_invaders_C_Gen::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'Mg_invaders_C_Gen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000008, "Member 'Mg_invaders_C_Gen::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'Mg_invaders_C_Gen::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000018, "Member 'Mg_invaders_C_Gen::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Mg_invaders_C_Gen::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Gen, CallFunc_UpdateInstanceTransform_ReturnValue) == 0x000060, "Member 'Mg_invaders_C_Gen::CallFunc_UpdateInstanceTransform_ReturnValue' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.Init
// 0x0100 (0x0100 - 0x0000)
struct Mg_invaders_C_Init final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_Init) == 0x000010, "Wrong alignment on Mg_invaders_C_Init");
static_assert(sizeof(Mg_invaders_C_Init) == 0x000100, "Wrong size on Mg_invaders_C_Init");
static_assert(offsetof(Mg_invaders_C_Init, Temp_int_Variable) == 0x000000, "Member 'Mg_invaders_C_Init::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'Mg_invaders_C_Init::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Mg_invaders_C_Init::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Mg_invaders_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Mg_invaders_C_Init::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, Temp_int_Variable_1) == 0x000040, "Member 'Mg_invaders_C_Init::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'Mg_invaders_C_Init::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Multiply_IntInt_ReturnValue) == 0x000050, "Member 'Mg_invaders_C_Init::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000054, "Member 'Mg_invaders_C_Init::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000058, "Member 'Mg_invaders_C_Init::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'Mg_invaders_C_Init::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000060, "Member 'Mg_invaders_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, Temp_int_Variable_2) == 0x000068, "Member 'Mg_invaders_C_Init::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'Mg_invaders_C_Init::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000070, "Member 'Mg_invaders_C_Init::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Add_IntInt_ReturnValue_3) == 0x000074, "Member 'Mg_invaders_C_Init::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'Mg_invaders_C_Init::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00007C, "Member 'Mg_invaders_C_Init::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, Temp_int_Variable_3) == 0x000080, "Member 'Mg_invaders_C_Init::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, K2Node_MakeStruct_IntVector) == 0x000084, "Member 'Mg_invaders_C_Init::K2Node_MakeStruct_IntVector' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Array_Add_ReturnValue_1) == 0x000090, "Member 'Mg_invaders_C_Init::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000094, "Member 'Mg_invaders_C_Init::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Add_IntInt_ReturnValue_4) == 0x000098, "Member 'Mg_invaders_C_Init::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Array_Add_ReturnValue_2) == 0x00009C, "Member 'Mg_invaders_C_Init::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000A0, "Member 'Mg_invaders_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_MakeTransform_ReturnValue_1) == 0x0000B0, "Member 'Mg_invaders_C_Init::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_AddComponent_ReturnValue_1) == 0x0000E0, "Member 'Mg_invaders_C_Init::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Array_Add_ReturnValue_3) == 0x0000E8, "Member 'Mg_invaders_C_Init::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x0000EC, "Member 'Mg_invaders_C_Init::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Init, CallFunc_Array_Add_ReturnValue_4) == 0x0000F0, "Member 'Mg_invaders_C_Init::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.move
// 0x00A8 (0x00A8 - 0x0000)
struct Mg_invaders_C_Move final
{
public:
	TArray<struct FIntVector>                     buf;                                               // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FIntVector                             A;                                                 // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             CallFunc_Array_Get_Item_1;                         // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_Array_Get_Item_2;                         // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mg_invaders_C_Move) == 0x000008, "Wrong alignment on Mg_invaders_C_Move");
static_assert(sizeof(Mg_invaders_C_Move) == 0x0000A8, "Wrong size on Mg_invaders_C_Move");
static_assert(offsetof(Mg_invaders_C_Move, buf) == 0x000000, "Member 'Mg_invaders_C_Move::buf' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, A) == 0x000010, "Member 'Mg_invaders_C_Move::A' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, Temp_int_Variable) == 0x00001C, "Member 'Mg_invaders_C_Move::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, Temp_int_Variable_1) == 0x000020, "Member 'Mg_invaders_C_Move::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Mg_invaders_C_Move::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'Mg_invaders_C_Move::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Mg_invaders_C_Move::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'Mg_invaders_C_Move::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Add_IntInt_ReturnValue_2) == 0x000034, "Member 'Mg_invaders_C_Move::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'Mg_invaders_C_Move::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00003C, "Member 'Mg_invaders_C_Move::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Get_Item) == 0x000040, "Member 'Mg_invaders_C_Move::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'Mg_invaders_C_Move::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'Mg_invaders_C_Move::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'Mg_invaders_C_Move::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'Mg_invaders_C_Move::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Add_IntInt_ReturnValue_3) == 0x000060, "Member 'Mg_invaders_C_Move::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Get_Item_2) == 0x000064, "Member 'Mg_invaders_C_Move::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'Mg_invaders_C_Move::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'Mg_invaders_C_Move::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'Mg_invaders_C_Move::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Less_IntInt_ReturnValue_2) == 0x00007C, "Member 'Mg_invaders_C_Move::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Add_IntInt_ReturnValue_4) == 0x000080, "Member 'Mg_invaders_C_Move::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_SelectInt_ReturnValue) == 0x000084, "Member 'Mg_invaders_C_Move::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000088, "Member 'Mg_invaders_C_Move::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Add_IntInt_ReturnValue_5) == 0x00008C, "Member 'Mg_invaders_C_Move::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'Mg_invaders_C_Move::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000098, "Member 'Mg_invaders_C_Move::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000099, "Member 'Mg_invaders_C_Move::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00009A, "Member 'Mg_invaders_C_Move::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Array_Length_ReturnValue_3) == 0x00009C, "Member 'Mg_invaders_C_Move::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000A0, "Member 'Mg_invaders_C_Move::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mg_invaders_C_Move, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'Mg_invaders_C_Move::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.Play
// 0x000C (0x000C - 0x0000)
struct Mg_invaders_C_Play final
{
public:
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mg_invaders_C_Play) == 0x000004, "Wrong alignment on Mg_invaders_C_Play");
static_assert(sizeof(Mg_invaders_C_Play) == 0x00000C, "Wrong size on Mg_invaders_C_Play");
static_assert(offsetof(Mg_invaders_C_Play, K2Node_MakeStruct_IntVector) == 0x000000, "Member 'Mg_invaders_C_Play::K2Node_MakeStruct_IntVector' has a wrong offset!");

// Function mg_invaders.mg_invaders_C.bullets
// 0x0144 (0x0144 - 0x0000)
struct Mg_invaders_C_bullets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_VictoryIntPlusEquals_IntOut;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector;                       // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_1;                     // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             K2Node_MakeStruct_IntVector_2;                     // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_Array_Get_Item;                           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             K2Node_MakeStruct_IntVector_3;                     // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_4;                     // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_5;                     // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_MakeStruct_IntVector_6;                     // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             CallFunc_Array_Get_Item_1;                         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             K2Node_MakeStruct_IntVector_7;                     // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             K2Node_MakeStruct_IntVector_8;                     // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_Select_Default;                             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_Array_Get_Item_2;                         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
