#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MushroomSpore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function mushroomSpore.mushroomSpore_C.ExecuteUbergraph_mushroomSpore
// 0x01A0 (0x01A0 - 0x0000)
struct MushroomSpore_C_ExecuteUbergraph_mushroomSpore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x002C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrowingPlant_shroom_7_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore) == 0x000010, "Wrong alignment on MushroomSpore_C_ExecuteUbergraph_mushroomSpore");
static_assert(sizeof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore) == 0x0001A0, "Wrong size on MushroomSpore_C_ExecuteUbergraph_mushroomSpore");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, EntryPoint) == 0x000000, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::EntryPoint' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, K2Node_ComponentBoundEvent_Hit) == 0x00002C, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, K2Node_MakeArray_Array) == 0x0000B8, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C8, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C9, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_Time) == 0x0000CC, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_Distance) == 0x0000D0, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_Location) == 0x0000D4, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E0, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_Normal) == 0x0000EC, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F8, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_HitItem) == 0x000128, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_ElementIndex) == 0x00012C, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_FaceIndex) == 0x000130, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_TraceStart) == 0x000134, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BreakHitResult_TraceEnd) == 0x000140, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_Array_Contains_ReturnValue) == 0x000180, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000188, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_ExecuteUbergraph_mushroomSpore, CallFunc_FinishSpawningActor_ReturnValue) == 0x000190, "Member 'MushroomSpore_C_ExecuteUbergraph_mushroomSpore::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function mushroomSpore.mushroomSpore_C.BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000024, "Member 'MushroomSpore_C_BndEvt__mushroomSpore_Sphere_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

}

