#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MushroomSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function mushroomSpawner.mushroomSpawner_C.ExecuteUbergraph_mushroomSpawner
// 0x0250 (0x0250 - 0x0000)
struct MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_8;                              // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_9;                              // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_10;                             // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_11;                             // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x00E4(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0110(0x0080)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default_1;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return_1;                          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_mushroom_C*                  K2Node_DynamicCast_AsProp_Food_Mushroom;           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner) == 0x000010, "Wrong alignment on MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner");
static_assert(sizeof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner) == 0x000250, "Wrong size on MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, EntryPoint) == 0x000000, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable) == 0x000004, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_1) == 0x00000C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_2) == 0x000014, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_3) == 0x00001C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_4) == 0x000024, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_5) == 0x00002C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_6) == 0x000034, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_7) == 0x00003C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_8) == 0x000044, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_8' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_9) == 0x00004C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_9' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_10) == 0x000054, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_10' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_name_Variable_11) == 0x00005C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_name_Variable_11' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_int_Variable) == 0x000074, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_int_Variable_1) == 0x000080, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000084, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_int_Variable_2) == 0x00008C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_int_Variable_3) == 0x000090, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_int_Variable_4) == 0x000094, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, Temp_int_Variable_5) == 0x000098, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00009C, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_WasRecentlyRendered_ReturnValue) == 0x0000A4, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_Select_Default) == 0x0000A8, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_propToObject_ReturnValue) == 0x0000E0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_propToObject_foodData) == 0x0000E4, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_propToObject_object) == 0x000100, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_propToObject_isFood) == 0x000108, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_propToObject_propData) == 0x000110, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000190, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000198, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001A0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_IsValidClass_ReturnValue) == 0x0001A8, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001B0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_AsInt_Player) == 0x0001B8, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0001D0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_asProp_return) == 0x0001D8, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_Conv_NameToString_ReturnValue) == 0x0001E0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001F0, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_Select_Default_1) == 0x0001F8, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_AsInt_Player_1) == 0x000200, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_AsInt_Player_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_asProp_return_1) == 0x000218, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_asProp_return_1' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000220, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_AsInt_Objects) == 0x000228, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_bSuccess_2) == 0x000238, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_AsProp_Food_Mushroom) == 0x000240, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_AsProp_Food_Mushroom' has a wrong offset!");
static_assert(offsetof(MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner, K2Node_DynamicCast_bSuccess_3) == 0x000248, "Member 'MushroomSpawner_C_ExecuteUbergraph_mushroomSpawner::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

