#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MushroomSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mushroomSpawner.mushroomSpawner_C
// 0x0020 (0x0240 - 0x0220)
class AMushroomSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Ren;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseRendered;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_mushroomSpawner(int32 EntryPoint);
	void Spawn();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"mushroomSpawner_C">();
	}
	static class AMushroomSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMushroomSpawner_C>();
	}
};
static_assert(alignof(AMushroomSpawner_C) == 0x000008, "Wrong alignment on AMushroomSpawner_C");
static_assert(sizeof(AMushroomSpawner_C) == 0x000240, "Wrong size on AMushroomSpawner_C");
static_assert(offsetof(AMushroomSpawner_C, UberGraphFrame) == 0x000220, "Member 'AMushroomSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMushroomSpawner_C, Ren) == 0x000228, "Member 'AMushroomSpawner_C::Ren' has a wrong offset!");
static_assert(offsetof(AMushroomSpawner_C, Type) == 0x000230, "Member 'AMushroomSpawner_C::Type' has a wrong offset!");
static_assert(offsetof(AMushroomSpawner_C, Timer) == 0x000234, "Member 'AMushroomSpawner_C::Timer' has a wrong offset!");
static_assert(offsetof(AMushroomSpawner_C, UseRendered) == 0x000238, "Member 'AMushroomSpawner_C::UseRendered' has a wrong offset!");

}

