#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NavModifierBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass navModifierBox.navModifierBox_C
// 0x0028 (0x0248 - 0x0220)
class ANavModifierBox_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNavModifierComponent*                  NavModifier;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UNavArea>                   Class_NavModifierBox_C;                            // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_navModifierBox(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"navModifierBox_C">();
	}
	static class ANavModifierBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANavModifierBox_C>();
	}
};
static_assert(alignof(ANavModifierBox_C) == 0x000008, "Wrong alignment on ANavModifierBox_C");
static_assert(sizeof(ANavModifierBox_C) == 0x000248, "Wrong size on ANavModifierBox_C");
static_assert(offsetof(ANavModifierBox_C, UberGraphFrame) == 0x000220, "Member 'ANavModifierBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANavModifierBox_C, NavModifier) == 0x000228, "Member 'ANavModifierBox_C::NavModifier' has a wrong offset!");
static_assert(offsetof(ANavModifierBox_C, Box) == 0x000230, "Member 'ANavModifierBox_C::Box' has a wrong offset!");
static_assert(offsetof(ANavModifierBox_C, DefaultSceneRoot) == 0x000238, "Member 'ANavModifierBox_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ANavModifierBox_C, Class_NavModifierBox_C) == 0x000240, "Member 'ANavModifierBox_C::Class_NavModifierBox_C' has a wrong offset!");

}

