#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint3

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint3.NewBlueprint3_C
// 0x0018 (0x0238 - 0x0220)
class ANewBlueprint3_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPnormal_C*                             Pnormal;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewBlueprint3_C">();
	}
	static class ANewBlueprint3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANewBlueprint3_C>();
	}
};
static_assert(alignof(ANewBlueprint3_C) == 0x000008, "Wrong alignment on ANewBlueprint3_C");
static_assert(sizeof(ANewBlueprint3_C) == 0x000238, "Wrong size on ANewBlueprint3_C");
static_assert(offsetof(ANewBlueprint3_C, StaticMesh) == 0x000220, "Member 'ANewBlueprint3_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ANewBlueprint3_C, Pnormal) == 0x000228, "Member 'ANewBlueprint3_C::Pnormal' has a wrong offset!");
static_assert(offsetof(ANewBlueprint3_C, DefaultSceneRoot) == 0x000230, "Member 'ANewBlueprint3_C::DefaultSceneRoot' has a wrong offset!");

}

