#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint1.NewBlueprint1_C.Spawn
// 0x00D0 (0x00D0 - 0x0000)
struct NewBlueprint1_C_Spawn final
{
public:
	TArray<class FName>                           Ns;                                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class NewBlueprint::ANewBlueprint_C*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0078(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint1_C_Spawn) == 0x000010, "Wrong alignment on NewBlueprint1_C_Spawn");
static_assert(sizeof(NewBlueprint1_C_Spawn) == 0x0000D0, "Wrong size on NewBlueprint1_C_Spawn");
static_assert(offsetof(NewBlueprint1_C_Spawn, Ns) == 0x000000, "Member 'NewBlueprint1_C_Spawn::Ns' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, K2Node_MakeArray_Array) == 0x000010, "Member 'NewBlueprint1_C_Spawn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, Temp_int_Array_Index_Variable) == 0x000020, "Member 'NewBlueprint1_C_Spawn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'NewBlueprint1_C_Spawn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'NewBlueprint1_C_Spawn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'NewBlueprint1_C_Spawn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000060, "Member 'NewBlueprint1_C_Spawn::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'NewBlueprint1_C_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'NewBlueprint1_C_Spawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000078, "Member 'NewBlueprint1_C_Spawn::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'NewBlueprint1_C_Spawn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Array_Get_Item) == 0x000090, "Member 'NewBlueprint1_C_Spawn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'NewBlueprint1_C_Spawn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, K2Node_DynamicCast_AsInt_Player) == 0x0000A0, "Member 'NewBlueprint1_C_Spawn::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'NewBlueprint1_C_Spawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_asProp_return) == 0x0000B8, "Member 'NewBlueprint1_C_Spawn::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Array_Contains_ReturnValue) == 0x0000C0, "Member 'NewBlueprint1_C_Spawn::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_Spawn, CallFunc_Array_Find_ReturnValue) == 0x0000C4, "Member 'NewBlueprint1_C_Spawn::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function NewBlueprint1.NewBlueprint1_C.ExecuteUbergraph_NewBlueprint1
// 0x0060 (0x0060 - 0x0000)
struct NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1) == 0x000008, "Wrong alignment on NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1");
static_assert(sizeof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1) == 0x000060, "Wrong size on NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, EntryPoint) == 0x000000, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000004, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000020, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000028, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000040, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_BooleanOR_ReturnValue) == 0x00004A, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000050, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'NewBlueprint1_C_ExecuteUbergraph_NewBlueprint1::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

