#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint.NewBlueprint_C
// 0x0080 (0x02A0 - 0x0220)
class ANewBlueprint_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewVar_0;                                          // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          NewVar_1;                                          // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2074[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Files;                                             // 0x0250(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Names;                                             // 0x0260(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Paths;                                             // 0x0270(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Strings;                                           // 0x0280(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Keys;                                              // 0x0290(0x0010)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewBlueprint_C">();
	}
	static class ANewBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANewBlueprint_C>();
	}
};
static_assert(alignof(ANewBlueprint_C) == 0x000008, "Wrong alignment on ANewBlueprint_C");
static_assert(sizeof(ANewBlueprint_C) == 0x0002A0, "Wrong size on ANewBlueprint_C");
static_assert(offsetof(ANewBlueprint_C, DefaultSceneRoot) == 0x000220, "Member 'ANewBlueprint_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, String) == 0x000228, "Member 'ANewBlueprint_C::String' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, NewVar_0) == 0x000238, "Member 'ANewBlueprint_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, NewVar_1) == 0x000248, "Member 'ANewBlueprint_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, Files) == 0x000250, "Member 'ANewBlueprint_C::Files' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, Names) == 0x000260, "Member 'ANewBlueprint_C::Names' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, Paths) == 0x000270, "Member 'ANewBlueprint_C::Paths' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, Strings) == 0x000280, "Member 'ANewBlueprint_C::Strings' has a wrong offset!");
static_assert(offsetof(ANewBlueprint_C, Keys) == 0x000290, "Member 'ANewBlueprint_C::Keys' has a wrong offset!");

}

