#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint44

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint44.NewBlueprint44_C
// 0x0040 (0x0500 - 0x04C0)
class ANewBlueprint44_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow1;                                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewVar_1;                                          // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NewBlueprint44(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewBlueprint44_C">();
	}
	static class ANewBlueprint44_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANewBlueprint44_C>();
	}
};
static_assert(alignof(ANewBlueprint44_C) == 0x000010, "Wrong alignment on ANewBlueprint44_C");
static_assert(sizeof(ANewBlueprint44_C) == 0x000500, "Wrong size on ANewBlueprint44_C");
static_assert(offsetof(ANewBlueprint44_C, UberGraphFrame) == 0x0004C0, "Member 'ANewBlueprint44_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, Arrow1) == 0x0004C8, "Member 'ANewBlueprint44_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, Audio) == 0x0004D0, "Member 'ANewBlueprint44_C::Audio' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, StaticMesh1) == 0x0004D8, "Member 'ANewBlueprint44_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, StaticMesh) == 0x0004E0, "Member 'ANewBlueprint44_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, Billboard) == 0x0004E8, "Member 'ANewBlueprint44_C::Billboard' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, NewVar_0) == 0x0004F0, "Member 'ANewBlueprint44_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ANewBlueprint44_C, NewVar_1) == 0x0004F4, "Member 'ANewBlueprint44_C::NewVar_1' has a wrong offset!");

}

