#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint5

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint5.NewBlueprint5_C
// 0x0040 (0x0260 - 0x0220)
class ANewBlueprint5_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProceduralMeshComponent*               ProceduralMesh;                                    // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Vs;                                                // 0x0238(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Ts;                                                // 0x0248(0x0010)(Edit, BlueprintVisible)
	float                                         Ime;                                               // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_NewBlueprint5(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewBlueprint5_C">();
	}
	static class ANewBlueprint5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANewBlueprint5_C>();
	}
};
static_assert(alignof(ANewBlueprint5_C) == 0x000008, "Wrong alignment on ANewBlueprint5_C");
static_assert(sizeof(ANewBlueprint5_C) == 0x000260, "Wrong size on ANewBlueprint5_C");
static_assert(offsetof(ANewBlueprint5_C, UberGraphFrame) == 0x000220, "Member 'ANewBlueprint5_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANewBlueprint5_C, ProceduralMesh) == 0x000228, "Member 'ANewBlueprint5_C::ProceduralMesh' has a wrong offset!");
static_assert(offsetof(ANewBlueprint5_C, DefaultSceneRoot) == 0x000230, "Member 'ANewBlueprint5_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ANewBlueprint5_C, Vs) == 0x000238, "Member 'ANewBlueprint5_C::Vs' has a wrong offset!");
static_assert(offsetof(ANewBlueprint5_C, Ts) == 0x000248, "Member 'ANewBlueprint5_C::Ts' has a wrong offset!");
static_assert(offsetof(ANewBlueprint5_C, Ime) == 0x000258, "Member 'ANewBlueprint5_C::Ime' has a wrong offset!");
static_assert(offsetof(ANewBlueprint5_C, NewVar_0) == 0x00025C, "Member 'ANewBlueprint5_C::NewVar_0' has a wrong offset!");

}

