#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint2_0

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint2.NewBlueprint2_C.push
// 0x0240 (0x0240 - 0x0000)
struct NewBlueprint2_C_Push final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0028(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleForObjects_OutHit;      // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleForObjects_ReturnValue; // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CrossProduct2D_ReturnValue;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewBlueprint2_C_Push) == 0x000008, "Wrong alignment on NewBlueprint2_C_Push");
static_assert(sizeof(NewBlueprint2_C_Push) == 0x000240, "Wrong size on NewBlueprint2_C_Push");
static_assert(offsetof(NewBlueprint2_C_Push, Temp_object_Variable) == 0x000000, "Member 'NewBlueprint2_C_Push::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Normal_ReturnValue) == 0x000010, "Member 'NewBlueprint2_C_Push::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x00001C, "Member 'NewBlueprint2_C_Push::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_obj_statDyn_obj) == 0x000028, "Member 'NewBlueprint2_C_Push::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'NewBlueprint2_C_Push::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_CapsuleTraceSingleForObjects_OutHit) == 0x000044, "Member 'NewBlueprint2_C_Push::CallFunc_CapsuleTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_CapsuleTraceSingleForObjects_ReturnValue) == 0x0000CC, "Member 'NewBlueprint2_C_Push::CallFunc_CapsuleTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_bBlockingHit) == 0x0000CD, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000CE, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_Time) == 0x0000D0, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_Distance) == 0x0000D4, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_Location) == 0x0000D8, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E4, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_Normal) == 0x0000F0, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_ImpactNormal) == 0x0000FC, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_HitItem) == 0x000128, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_ElementIndex) == 0x00012C, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_FaceIndex) == 0x000130, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_TraceStart) == 0x000134, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_BreakHitResult_TraceEnd) == 0x000140, "Member 'NewBlueprint2_C_Push::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x00014C, "Member 'NewBlueprint2_C_Push::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Dot_VectorVector_ReturnValue) == 0x000158, "Member 'NewBlueprint2_C_Push::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00015C, "Member 'NewBlueprint2_C_Push::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000160, "Member 'NewBlueprint2_C_Push::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_CrossProduct2D_ReturnValue) == 0x000168, "Member 'NewBlueprint2_C_Push::CallFunc_CrossProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Cross_VectorVector_ReturnValue) == 0x00016C, "Member 'NewBlueprint2_C_Push::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_SignOfFloat_ReturnValue) == 0x000178, "Member 'NewBlueprint2_C_Push::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00017C, "Member 'NewBlueprint2_C_Push::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000188, "Member 'NewBlueprint2_C_Push::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Add_VectorVector_ReturnValue) == 0x00018C, "Member 'NewBlueprint2_C_Push::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000198, "Member 'NewBlueprint2_C_Push::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001A4, "Member 'NewBlueprint2_C_Push::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001B0, "Member 'NewBlueprint2_C_Push::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_Push, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000238, "Member 'NewBlueprint2_C_Push::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function NewBlueprint2.NewBlueprint2_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct NewBlueprint2_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint2_C_UserConstructionScript) == 0x000004, "Wrong alignment on NewBlueprint2_C_UserConstructionScript");
static_assert(sizeof(NewBlueprint2_C_UserConstructionScript) == 0x00000C, "Wrong size on NewBlueprint2_C_UserConstructionScript");
static_assert(offsetof(NewBlueprint2_C_UserConstructionScript, CallFunc_GetActorForwardVector_ReturnValue) == 0x000000, "Member 'NewBlueprint2_C_UserConstructionScript::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");

// Function NewBlueprint2.NewBlueprint2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NewBlueprint2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint2_C_ReceiveTick) == 0x000004, "Wrong alignment on NewBlueprint2_C_ReceiveTick");
static_assert(sizeof(NewBlueprint2_C_ReceiveTick) == 0x000004, "Wrong size on NewBlueprint2_C_ReceiveTick");
static_assert(offsetof(NewBlueprint2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NewBlueprint2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NewBlueprint2.NewBlueprint2_C.ExecuteUbergraph_NewBlueprint2
// 0x02D8 (0x02D8 - 0x0000)
struct NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FProcMeshTangent>               Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_2;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_3;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_4;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_5;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector>                        Temp_struct_Variable_6;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BytesToStringUtf8_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BytesToStringUtf8_ReturnValue_1;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0140(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_StringToVector_OutConvertedVector;   // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_StringToVector_OutIsValid;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_1;             // 0x0178(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2) == 0x000008, "Wrong alignment on NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2");
static_assert(sizeof(NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2) == 0x0002D8, "Wrong size on NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2");
static_assert(offsetof(NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2, EntryPoint) == 0x000000, "Member 'NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2, Temp_bool_Variable) == 0x000004, "Member 'NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2, Temp_struct_Variable) == 0x000008, "Member 'NewBlueprint2_C_ExecuteUbergraph_NewBlueprint2::Temp_struct_Variable' has a wrong offset!");
