#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint15

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint15.NewBlueprint15_C.Min
// 0x000C (0x000C - 0x0000)
struct NewBlueprint15_C_Min final
{
public:
	struct FIntVector                             Time;                                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint15_C_Min) == 0x000004, "Wrong alignment on NewBlueprint15_C_Min");
static_assert(sizeof(NewBlueprint15_C_Min) == 0x00000C, "Wrong size on NewBlueprint15_C_Min");
static_assert(offsetof(NewBlueprint15_C_Min, Time) == 0x000000, "Member 'NewBlueprint15_C_Min::Time' has a wrong offset!");

// Function NewBlueprint15.NewBlueprint15_C.ExecuteUbergraph_NewBlueprint15
// 0x0030 (0x0030 - 0x0000)
struct NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             K2Node_CustomEvent_time;                           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FIntVector& Time)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15) == 0x000008, "Wrong alignment on NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15");
static_assert(sizeof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15) == 0x000030, "Wrong size on NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, EntryPoint) == 0x000000, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, K2Node_CustomEvent_time) == 0x000004, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::K2Node_CustomEvent_time' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, CallFunc_BooleanOR_ReturnValue) == 0x000025, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000028, "Member 'NewBlueprint15_C_ExecuteUbergraph_NewBlueprint15::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

}

