#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint5

#include "Basic.hpp"

#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint5.NewBlueprint5_C.ExecuteUbergraph_NewBlueprint5
// 0x0280 (0x0280 - 0x0000)
struct NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0028(0x0010)(ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5) == 0x000008, "Wrong alignment on NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5");
static_assert(sizeof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5) == 0x000280, "Wrong size on NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, EntryPoint) == 0x000000, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000010, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_obj_static_obj) == 0x000028, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000038, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00004C, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_FindLookAtRotation_ReturnValue) == 0x000058, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_FClamp_ReturnValue) == 0x000064, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakRotator_Roll) == 0x000068, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakRotator_Pitch) == 0x00006C, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakRotator_Yaw) == 0x000070, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_Lerp_ReturnValue) == 0x000074, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_MakeRotator_ReturnValue) == 0x000078, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_Lerp_ReturnValue_1) == 0x000084, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000088, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00008C, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00009C, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000A0, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000AC, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000BC, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, Temp_object_Variable) == 0x0000C8, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000D8, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000160, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_bBlockingHit) == 0x000161, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_bInitialOverlap) == 0x000162, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_Location) == 0x00016C, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_Normal) == 0x000184, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_PhysMat) == 0x0001A0, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_HitActor) == 0x0001A8, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_HitBoneName) == 0x0001B8, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_ElementIndex) == 0x0001C4, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_TraceStart) == 0x0001CC, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_SelectVector_ReturnValue) == 0x0001E4, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001F0, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000278, "Member 'NewBlueprint5_C_ExecuteUbergraph_NewBlueprint5::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function NewBlueprint5.NewBlueprint5_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NewBlueprint5_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint5_C_ReceiveTick) == 0x000004, "Wrong alignment on NewBlueprint5_C_ReceiveTick");
static_assert(sizeof(NewBlueprint5_C_ReceiveTick) == 0x000004, "Wrong size on NewBlueprint5_C_ReceiveTick");
static_assert(offsetof(NewBlueprint5_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NewBlueprint5_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NewBlueprint5.NewBlueprint5_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct NewBlueprint5_C_UserConstructionScript final
{
public:
	TArray<struct FProcMeshTangent>               Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable_1;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_2;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_3;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_4;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_5;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector>                        Temp_struct_Variable_6;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(NewBlueprint5_C_UserConstructionScript) == 0x000008, "Wrong alignment on NewBlueprint5_C_UserConstructionScript");
static_assert(sizeof(NewBlueprint5_C_UserConstructionScript) == 0x000070, "Wrong size on NewBlueprint5_C_UserConstructionScript");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000010, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable_2) == 0x000020, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable_3) == 0x000030, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable_4) == 0x000040, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable_5) == 0x000050, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(NewBlueprint5_C_UserConstructionScript, Temp_struct_Variable_6) == 0x000060, "Member 'NewBlueprint5_C_UserConstructionScript::Temp_struct_Variable_6' has a wrong offset!");

}

