#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint8

#include "Basic.hpp"

#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint8.NewBlueprint8_C.gen
// 0x0070 (0x0070 - 0x0000)
struct NewBlueprint8_C_Gen final
{
public:
	TArray<struct FProcMeshTangent>               Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable_1;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_2;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_3;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_4;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_5;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector>                        Temp_struct_Variable_6;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(NewBlueprint8_C_Gen) == 0x000008, "Wrong alignment on NewBlueprint8_C_Gen");
static_assert(sizeof(NewBlueprint8_C_Gen) == 0x000070, "Wrong size on NewBlueprint8_C_Gen");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable) == 0x000000, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable_1) == 0x000010, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable_2) == 0x000020, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable_3) == 0x000030, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable_4) == 0x000040, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable_5) == 0x000050, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_Gen, Temp_struct_Variable_6) == 0x000060, "Member 'NewBlueprint8_C_Gen::Temp_struct_Variable_6' has a wrong offset!");

// Function NewBlueprint8.NewBlueprint8_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NewBlueprint8_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint8_C_ReceiveTick) == 0x000004, "Wrong alignment on NewBlueprint8_C_ReceiveTick");
static_assert(sizeof(NewBlueprint8_C_ReceiveTick) == 0x000004, "Wrong size on NewBlueprint8_C_ReceiveTick");
static_assert(offsetof(NewBlueprint8_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NewBlueprint8_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NewBlueprint8.NewBlueprint8_C.ExecuteUbergraph_NewBlueprint8
// 0x0298 (0x0298 - 0x0000)
struct NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0008(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x020C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8) == 0x000008, "Wrong alignment on NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8");
static_assert(sizeof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8) == 0x000298, "Wrong size on NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, EntryPoint) == 0x000000, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_obj_static_obj) == 0x000008, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000018, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000030, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000040, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_GetActorForwardVector_ReturnValue) == 0x000054, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00006C, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000078, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Normal_ReturnValue) == 0x000084, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000090, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00009C, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Normal_ReturnValue_1) == 0x0000A8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakRotator_Roll) == 0x0000B4, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakRotator_Pitch) == 0x0000B8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakRotator_Yaw) == 0x0000BC, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000C0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_MakeRotator_ReturnValue) == 0x0000C4, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_DegAcos_ReturnValue) == 0x0000D0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000D4, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000DC, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, Temp_object_Variable) == 0x0000E0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0000F0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000F8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000180, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_GetFOVAngle_ReturnValue) == 0x000184, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000189, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BooleanOR_ReturnValue) == 0x00018A, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_bBlockingHit) == 0x00018B, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_bInitialOverlap) == 0x00018C, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_Time) == 0x000190, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_Distance) == 0x000194, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_Location) == 0x000198, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A4, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_Normal) == 0x0001B0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_ImpactNormal) == 0x0001BC, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_HitActor) == 0x0001D0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_HitComponent) == 0x0001D8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_HitBoneName) == 0x0001E0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_ElementIndex) == 0x0001EC, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_FaceIndex) == 0x0001F0, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_TraceStart) == 0x0001F4, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_BreakHitResult_TraceEnd) == 0x000200, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00020C, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000294, "Member 'NewBlueprint8_C_ExecuteUbergraph_NewBlueprint8::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

