#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint7_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint7.NewBlueprint7_C
// 0x0028 (0x0248 - 0x0220)
class NewBlueprint7_0::ANewBlueprint7_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UKerfurOmegaV1_Skeleton_AnimBlueprint2_C* Anim;                                              // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_camera_cursed_C*                  Cam;                                               // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0240(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void NewFunction_0();
	void UserConstructionScript();
	void CustomEvent_0();
	void ReceiveBeginPlay();
	void CustomEvent();
	void ExecuteUbergraph_NewBlueprint7(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass NewBlueprint7.NewBlueprint7_C", true, "NewBlueprint7_C">();
	}
	static class NewBlueprint7_0::ANewBlueprint7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<NewBlueprint7_0::ANewBlueprint7_C>();
	}
};
static_assert(alignof(NewBlueprint7_0::ANewBlueprint7_C) == 0x000008, "Wrong alignment on NewBlueprint7_0::ANewBlueprint7_C");
static_assert(sizeof(NewBlueprint7_0::ANewBlueprint7_C) == 0x000248, "Wrong size on NewBlueprint7_0::ANewBlueprint7_C");
static_assert(offsetof(NewBlueprint7_0::ANewBlueprint7_C, UberGraphFrame) == 0x000220, "Member 'NewBlueprint7_0::ANewBlueprint7_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(NewBlueprint7_0::ANewBlueprint7_C, SkeletalMesh) == 0x000228, "Member 'NewBlueprint7_0::ANewBlueprint7_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(NewBlueprint7_0::ANewBlueprint7_C, Anim) == 0x000230, "Member 'NewBlueprint7_0::ANewBlueprint7_C::Anim' has a wrong offset!");
static_assert(offsetof(NewBlueprint7_0::ANewBlueprint7_C, Cam) == 0x000238, "Member 'NewBlueprint7_0::ANewBlueprint7_C::Cam' has a wrong offset!");
static_assert(offsetof(NewBlueprint7_0::ANewBlueprint7_C, Timer) == 0x000240, "Member 'NewBlueprint7_0::ANewBlueprint7_C::Timer' has a wrong offset!");

}

