#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint16

#include "Basic.hpp"

#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint16.NewBlueprint16_C.ExecuteUbergraph_NewBlueprint16
// 0x0228 (0x0228 - 0x0000)
struct NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_choosePoint_RandomLocation;               // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_choosePoint_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x015C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x01E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E7[0x1];                                      // 0x01E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OutOverlappingComponents; // 0x01F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16) == 0x000008, "Wrong alignment on NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16");
static_assert(sizeof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16) == 0x000228, "Wrong size on NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, EntryPoint) == 0x000000, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, Temp_byte_Variable) == 0x000005, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, Temp_int_Variable) == 0x000008, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CustomEvent_MovementResult_1) == 0x000020, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CustomEvent_MovementResult) == 0x000021, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, Temp_byte_Variable_1) == 0x000034, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_choosePoint_RandomLocation) == 0x000054, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_choosePoint_RandomLocation' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_choosePoint_ReturnValue) == 0x000060, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_choosePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000070, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000F8, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000FC, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00010C, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CustomEvent_MovementResult_2) == 0x000118, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x00011C, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x000128, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000130, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000140, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000158, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000159, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x00015C, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0001E4, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_BooleanOR_ReturnValue) == 0x0001E5, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_CustomEvent_MovementResult_3) == 0x0001E6, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_GetPlayerPawn_ReturnValue) == 0x0001E8, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, K2Node_Event_DeltaSeconds) == 0x0001F0, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_GetOverlappingComponents_OutOverlappingComponents) == 0x0001F8, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_GetOverlappingComponents_OutOverlappingComponents' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Array_Get_Item) == 0x000208, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Less_IntInt_ReturnValue) == 0x000214, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000215, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_CreateMoveToProxyObject_ReturnValue_1) == 0x000218, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_CreateMoveToProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16, CallFunc_IsValid_ReturnValue_2) == 0x000220, "Member 'NewBlueprint16_C_ExecuteUbergraph_NewBlueprint16::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NewBlueprint16_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_ReceiveTick) == 0x000004, "Wrong alignment on NewBlueprint16_C_ReceiveTick");
static_assert(sizeof(NewBlueprint16_C_ReceiveTick) == 0x000004, "Wrong size on NewBlueprint16_C_ReceiveTick");
static_assert(offsetof(NewBlueprint16_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'NewBlueprint16_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72
// 0x0001 (0x0001 - 0x0000)
struct NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72) == 0x000001, "Wrong alignment on NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72");
static_assert(sizeof(NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72) == 0x000001, "Wrong size on NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72");
static_assert(offsetof(NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72, MovementResult) == 0x000000, "Member 'NewBlueprint16_C_OnSuccess_9201A7154775CCD2493A8AA9AF4A5C72::MovementResult' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.OnFail_9201A7154775CCD2493A8AA9AF4A5C72
// 0x0001 (0x0001 - 0x0000)
struct NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72) == 0x000001, "Wrong alignment on NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72");
static_assert(sizeof(NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72) == 0x000001, "Wrong size on NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72");
static_assert(offsetof(NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72, MovementResult) == 0x000000, "Member 'NewBlueprint16_C_OnFail_9201A7154775CCD2493A8AA9AF4A5C72::MovementResult' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.OnSuccess_D46D188C4EA32985928C2E9FD98232C4
// 0x0001 (0x0001 - 0x0000)
struct NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4) == 0x000001, "Wrong alignment on NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4");
static_assert(sizeof(NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4) == 0x000001, "Wrong size on NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4");
static_assert(offsetof(NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4, MovementResult) == 0x000000, "Member 'NewBlueprint16_C_OnSuccess_D46D188C4EA32985928C2E9FD98232C4::MovementResult' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.OnFail_D46D188C4EA32985928C2E9FD98232C4
// 0x0001 (0x0001 - 0x0000)
struct NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4) == 0x000001, "Wrong alignment on NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4");
static_assert(sizeof(NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4) == 0x000001, "Wrong size on NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4");
static_assert(offsetof(NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4, MovementResult) == 0x000000, "Member 'NewBlueprint16_C_OnFail_D46D188C4EA32985928C2E9FD98232C4::MovementResult' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.choosePoint
// 0x01B0 (0x01B0 - 0x0000)
struct NewBlueprint16_C_ChoosePoint final
{
public:
	struct FVector                                RandomLocation;                                    // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0058(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_ChoosePoint) == 0x000008, "Wrong alignment on NewBlueprint16_C_ChoosePoint");
static_assert(sizeof(NewBlueprint16_C_ChoosePoint) == 0x0001B0, "Wrong size on NewBlueprint16_C_ChoosePoint");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, RandomLocation) == 0x000000, "Member 'NewBlueprint16_C_ChoosePoint::RandomLocation' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, ReturnValue) == 0x00000C, "Member 'NewBlueprint16_C_ChoosePoint::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, Temp_object_Variable) == 0x000020, "Member 'NewBlueprint16_C_ChoosePoint::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Percent_IntInt_ReturnValue) == 0x000030, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Percent_IntInt_ReturnValue_1) == 0x00003C, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, Temp_int_Variable) == 0x00004C, "Member 'NewBlueprint16_C_ChoosePoint::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000050, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_RandomFloatInRange_ReturnValue) == 0x000054, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_obj_static_obj) == 0x000058, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_MakeVector_ReturnValue_1) == 0x000068, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_MakeVector_ReturnValue_2) == 0x000074, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_SelectVector_ReturnValue) == 0x000080, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000098, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000120, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_bBlockingHit) == 0x000121, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_bInitialOverlap) == 0x000122, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_Location) == 0x00012C, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_ImpactPoint) == 0x000138, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_Normal) == 0x000144, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_ImpactNormal) == 0x000150, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_HitItem) == 0x000180, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_ElementIndex) == 0x000184, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_FaceIndex) == 0x000188, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_TraceStart) == 0x00018C, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_BreakHitResult_TraceEnd) == 0x000198, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_ChoosePoint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001A4, "Member 'NewBlueprint16_C_ChoosePoint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function NewBlueprint16.NewBlueprint16_C.gen
// 0x0068 (0x0068 - 0x0000)
struct NewBlueprint16_C_Gen final
{
public:
	TArray<struct FProcMeshTangent>               Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FLinearColor>                   Temp_struct_Variable_1;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_2;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_3;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FVector2D>                      Temp_struct_Variable_4;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class UTexture2D*                             CallFunc_BytesToImage_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint16_C_Gen) == 0x000008, "Wrong alignment on NewBlueprint16_C_Gen");
static_assert(sizeof(NewBlueprint16_C_Gen) == 0x000068, "Wrong size on NewBlueprint16_C_Gen");
static_assert(offsetof(NewBlueprint16_C_Gen, Temp_struct_Variable) == 0x000000, "Member 'NewBlueprint16_C_Gen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_Gen, Temp_struct_Variable_1) == 0x000010, "Member 'NewBlueprint16_C_Gen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_Gen, Temp_struct_Variable_2) == 0x000020, "Member 'NewBlueprint16_C_Gen::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint16_C_Gen, Temp_struct_Variable_3) == 0x000030, "Member 'NewBlueprint16_C_Gen::Temp_struct_Variable_3' has a wrong offset!");
