#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint18

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint18.NewBlueprint18_C
// 0x0028 (0x0248 - 0x0220)
class ANewBlueprint18_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_NewBlueprint18(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewBlueprint18_C">();
	}
	static class ANewBlueprint18_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANewBlueprint18_C>();
	}
};
static_assert(alignof(ANewBlueprint18_C) == 0x000008, "Wrong alignment on ANewBlueprint18_C");
static_assert(sizeof(ANewBlueprint18_C) == 0x000248, "Wrong size on ANewBlueprint18_C");
static_assert(offsetof(ANewBlueprint18_C, UberGraphFrame) == 0x000220, "Member 'ANewBlueprint18_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANewBlueprint18_C, StaticMesh1) == 0x000228, "Member 'ANewBlueprint18_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ANewBlueprint18_C, StaticMesh) == 0x000230, "Member 'ANewBlueprint18_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ANewBlueprint18_C, DefaultSceneRoot) == 0x000238, "Member 'ANewBlueprint18_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ANewBlueprint18_C, NewVar_0) == 0x000240, "Member 'ANewBlueprint18_C::NewVar_0' has a wrong offset!");

}

