#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint3_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint3.NewBlueprint3_C
// 0x01F0 (0x0410 - 0x0220)
class NewBlueprint3_0::ANewBlueprint3_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Wall;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal47;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal46;                                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal45;                                           // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal44;                                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal43;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal42;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal41;                                           // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal40;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal39;                                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal38;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal37;                                           // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal36;                                           // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal35;                                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal34;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal33;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal32;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal31;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal30;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal29;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal28;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal27;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal26;                                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal25;                                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal24;                                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal23;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal22;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal21;                                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal20;                                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal19;                                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal18;                                           // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal17;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal16;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal15;                                           // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal14;                                           // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal13;                                           // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal12;                                           // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal11;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal10;                                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal9;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal8;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal7;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal6;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal5;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal4;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal3;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube6;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube5;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube4;                                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall8;                                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Wall10;                                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall11;                                            // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall12;                                            // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wall13;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube3;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard2;                                        // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Bounds;                                            // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_NewBlueprint3(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass NewBlueprint3.NewBlueprint3_C", true, "NewBlueprint3_C">();
	}
	static class NewBlueprint3_0::ANewBlueprint3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<NewBlueprint3_0::ANewBlueprint3_C>();
	}
};
static_assert(alignof(NewBlueprint3_0::ANewBlueprint3_C) == 0x000008, "Wrong alignment on NewBlueprint3_0::ANewBlueprint3_C");
static_assert(sizeof(NewBlueprint3_0::ANewBlueprint3_C) == 0x000410, "Wrong size on NewBlueprint3_0::ANewBlueprint3_C");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, UberGraphFrame) == 0x000220, "Member 'NewBlueprint3_0::ANewBlueprint3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Wall) == 0x000228, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Wall' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal47) == 0x000230, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal47' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal46) == 0x000238, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal46' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal45) == 0x000240, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal45' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal44) == 0x000248, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal44' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal43) == 0x000250, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal43' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal42) == 0x000258, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal42' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal41) == 0x000260, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal41' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal40) == 0x000268, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal40' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal39) == 0x000270, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal39' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal38) == 0x000278, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal38' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal37) == 0x000280, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal37' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal36) == 0x000288, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal36' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal35) == 0x000290, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal35' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, StaticMesh) == 0x000298, "Member 'NewBlueprint3_0::ANewBlueprint3_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal34) == 0x0002A0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal34' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal33) == 0x0002A8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal33' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal32) == 0x0002B0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal32' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal31) == 0x0002B8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal31' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal30) == 0x0002C0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal30' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal29) == 0x0002C8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal29' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal28) == 0x0002D0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal28' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal27) == 0x0002D8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal27' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal26) == 0x0002E0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal26' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal25) == 0x0002E8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal25' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal24) == 0x0002F0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal24' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal23) == 0x0002F8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal23' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal22) == 0x000300, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal22' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal21) == 0x000308, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal21' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal20) == 0x000310, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal20' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal19) == 0x000318, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal19' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal18) == 0x000320, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal18' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal17) == 0x000328, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal17' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal16) == 0x000330, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal16' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal15) == 0x000338, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal15' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal14) == 0x000340, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal14' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal13) == 0x000348, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal13' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal12) == 0x000350, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal12' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal11) == 0x000358, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal11' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal10) == 0x000360, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal10' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal9) == 0x000368, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal9' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal8) == 0x000370, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal8' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal7) == 0x000378, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal7' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal6) == 0x000380, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal6' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal5) == 0x000388, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal5' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal4) == 0x000390, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal4' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal3) == 0x000398, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal3' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Decal) == 0x0003A0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Decal' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Cube6) == 0x0003A8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Cube6' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Cube5) == 0x0003B0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Cube5' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Cube4) == 0x0003B8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Cube4' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Wall8) == 0x0003C0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Wall8' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Wall10) == 0x0003C8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Wall10' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Wall11) == 0x0003D0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Wall11' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Wall12) == 0x0003D8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Wall12' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Wall13) == 0x0003E0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Wall13' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Cube3) == 0x0003E8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Cube3' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Billboard2) == 0x0003F0, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Billboard2' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, Bounds) == 0x0003F8, "Member 'NewBlueprint3_0::ANewBlueprint3_C::Bounds' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, DefaultSceneRoot) == 0x000400, "Member 'NewBlueprint3_0::ANewBlueprint3_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(NewBlueprint3_0::ANewBlueprint3_C, NewVar_0) == 0x000408, "Member 'NewBlueprint3_0::ANewBlueprint3_C::NewVar_0' has a wrong offset!");

}

