#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint_0

#include "Basic.hpp"


namespace SDK::Params
{

// Function NewBlueprint.NewBlueprint_C.UserConstructionScript
// 0x0140 (0x0140 - 0x0000)
struct NewBlueprint_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_StringToBytesUtf8_ReturnValue;            // 0x0020(0x0010)(ReferenceParm)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_JoyFileIO_GetFiles_Files;                 // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_JoyFileIO_GetFiles_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LoadStringFromFile_Result;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadStringFromFile_ReturnValue;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_StringToBytesUtf8_ReturnValue_1;          // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_HMAC_ReturnValue;                         // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BytesToBase64_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveStringToFile_ReturnValue;             // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewBlueprint_C_UserConstructionScript) == 0x000008, "Wrong alignment on NewBlueprint_C_UserConstructionScript");
static_assert(sizeof(NewBlueprint_C_UserConstructionScript) == 0x000140, "Wrong size on NewBlueprint_C_UserConstructionScript");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_MakeLiteralString_ReturnValue) == 0x000000, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_StringToBytesUtf8_ReturnValue) == 0x000020, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_StringToBytesUtf8_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_MakeLiteralString_ReturnValue_1) == 0x000030, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_MakeLiteralString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_JoyFileIO_GetFiles_Files) == 0x000058, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_JoyFileIO_GetFiles_Files' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_JoyFileIO_GetFiles_ReturnValue) == 0x000068, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_JoyFileIO_GetFiles_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'NewBlueprint_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000070, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_RightChop_ReturnValue) == 0x000090, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_LoadStringFromFile_Result) == 0x0000A0, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_LoadStringFromFile_Result' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_LoadStringFromFile_ReturnValue) == 0x0000B0, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_LoadStringFromFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_ParseIntoArray_ReturnValue) == 0x0000C8, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x0000F0, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_StringToBytesUtf8_ReturnValue_1) == 0x0000F8, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_StringToBytesUtf8_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_2) == 0x000108, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_HMAC_ReturnValue) == 0x000110, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_HMAC_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_BytesToBase64_ReturnValue) == 0x000120, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_BytesToBase64_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000130, "Member 'NewBlueprint_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_SaveStringToFile_ReturnValue) == 0x000134, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_SaveStringToFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000135, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewBlueprint_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_3) == 0x00013C, "Member 'NewBlueprint_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

}

