#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NewBlueprint4.NewBlueprint4_C
// 0x0040 (0x0500 - 0x04C0)
class NewBlueprint4::ANewBlueprint4_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow1;                                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewVar_1;                                          // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NewBlueprint4(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void OnSuccess_8B1A0E784DE0D27CFC29FCA7A7C21F47(EPathFollowingResult MovementResult);
	void OnFail_8B1A0E784DE0D27CFC29FCA7A7C21F47(EPathFollowingResult MovementResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass NewBlueprint4.NewBlueprint4_C", true, "NewBlueprint4_C">();
	}
	static class NewBlueprint4::ANewBlueprint4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<NewBlueprint4::ANewBlueprint4_C>();
	}
};
static_assert(alignof(NewBlueprint4::ANewBlueprint4_C) == 0x000010, "Wrong alignment on NewBlueprint4::ANewBlueprint4_C");
static_assert(sizeof(NewBlueprint4::ANewBlueprint4_C) == 0x000500, "Wrong size on NewBlueprint4::ANewBlueprint4_C");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, UberGraphFrame) == 0x0004C0, "Member 'NewBlueprint4::ANewBlueprint4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, Arrow1) == 0x0004C8, "Member 'NewBlueprint4::ANewBlueprint4_C::Arrow1' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, Audio) == 0x0004D0, "Member 'NewBlueprint4::ANewBlueprint4_C::Audio' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, StaticMesh1) == 0x0004D8, "Member 'NewBlueprint4::ANewBlueprint4_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, StaticMesh) == 0x0004E0, "Member 'NewBlueprint4::ANewBlueprint4_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, Billboard) == 0x0004E8, "Member 'NewBlueprint4::ANewBlueprint4_C::Billboard' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, NewVar_0) == 0x0004F0, "Member 'NewBlueprint4::ANewBlueprint4_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(NewBlueprint4::ANewBlueprint4_C, NewVar_1) == 0x0004F4, "Member 'NewBlueprint4::ANewBlueprint4_C::NewVar_1' has a wrong offset!");

}

