#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewWidgetBlueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function NewWidgetBlueprint.NewWidgetBlueprint_C.ExecuteUbergraph_NewWidgetBlueprint
// 0x0040 (0x0040 - 0x0000)
struct NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint) == 0x000008, "Wrong alignment on NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint");
static_assert(sizeof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint) == 0x000040, "Wrong size on NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, EntryPoint) == 0x000000, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000010, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000014, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000020, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000024, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2) == 0x000028, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloat_ReturnValue) == 0x00002C, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_RandomFloat_ReturnValue_1) == 0x000030, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_Ease_ReturnValue) == 0x000034, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint, CallFunc_Ease_ReturnValue_1) == 0x000038, "Member 'NewWidgetBlueprint_C_ExecuteUbergraph_NewWidgetBlueprint::CallFunc_Ease_ReturnValue_1' has a wrong offset!");

}

