#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Obelisk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function obelisk.obelisk_C.ExecuteUbergraph_obelisk
// 0x0440 (0x0440 - 0x0000)
struct Obelisk_C_ExecuteUbergraph_obelisk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF0[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF1[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF2[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF3[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x016C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF4[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0290(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF5[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x02F0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x03B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Obelisk_C_ExecuteUbergraph_obelisk) == 0x000010, "Wrong alignment on Obelisk_C_ExecuteUbergraph_obelisk");
static_assert(sizeof(Obelisk_C_ExecuteUbergraph_obelisk) == 0x000440, "Wrong size on Obelisk_C_ExecuteUbergraph_obelisk");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, EntryPoint) == 0x000000, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::EntryPoint' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_name_Variable) == 0x000004, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_VLerp_ReturnValue) == 0x00000C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_int_Variable) == 0x000018, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_bool_Has_Been_Initd_Variable) == 0x000024, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_int_Variable_1) == 0x000028, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakRotator_Roll) == 0x000044, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakRotator_Pitch) == 0x000048, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BreakRotator_Yaw) == 0x00004C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeRotator_ReturnValue) == 0x000050, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00005C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000E4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x00016C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001F4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000200, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomUnitVector_ReturnValue) == 0x00020C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000218, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000224, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomUnitVector_ReturnValue_1) == 0x000230, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue) == 0x00023C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue) == 0x000248, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00024C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeVector_ReturnValue) == 0x000250, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00025C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, Temp_bool_IsClosed_Variable) == 0x000268, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00026C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000278, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00027C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000280, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeVector_ReturnValue_1) == 0x000284, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_MakeTransform_ReturnValue) == 0x000290, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002C0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002C8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002D0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OtherActor) == 0x0002D8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OtherComp) == 0x0002E0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0002E8, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_bFromSweep) == 0x0002EC, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, K2Node_ComponentBoundEvent_SweepResult) == 0x0002F0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_getMainPlayer_AsMain_Player) == 0x000378, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000380, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x00038C, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000398, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_SetVectorLength_ReturnValue) == 0x0003A4, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_ExecuteUbergraph_obelisk, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0003B0, "Member 'Obelisk_C_ExecuteUbergraph_obelisk::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");

// Function obelisk.obelisk_C.BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF6[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function obelisk.obelisk_C.UserConstructionScript
// 0x00AC (0x00AC - 0x0000)
struct Obelisk_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Obelisk_C_UserConstructionScript) == 0x000004, "Wrong alignment on Obelisk_C_UserConstructionScript");
static_assert(sizeof(Obelisk_C_UserConstructionScript) == 0x0000AC, "Wrong size on Obelisk_C_UserConstructionScript");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'Obelisk_C_UserConstructionScript::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_BreakRotator_Roll) == 0x00000C, "Member 'Obelisk_C_UserConstructionScript::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_BreakRotator_Pitch) == 0x000010, "Member 'Obelisk_C_UserConstructionScript::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_BreakRotator_Yaw) == 0x000014, "Member 'Obelisk_C_UserConstructionScript::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Obelisk_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Obelisk_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000024, "Member 'Obelisk_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function obelisk.obelisk_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Obelisk_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF7[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Obelisk_C_LoadData) == 0x000010, "Wrong alignment on Obelisk_C_LoadData");
static_assert(sizeof(Obelisk_C_LoadData) == 0x0000E0, "Wrong size on Obelisk_C_LoadData");
static_assert(offsetof(Obelisk_C_LoadData, Data) == 0x000000, "Member 'Obelisk_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Obelisk_C_LoadData, Return) == 0x0000C0, "Member 'Obelisk_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Obelisk_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Obelisk_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Obelisk_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Obelisk_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Obelisk_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Obelisk_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function obelisk.obelisk_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Obelisk_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Obelisk_C_GetData) == 0x000010, "Wrong alignment on Obelisk_C_GetData");
static_assert(sizeof(Obelisk_C_GetData) == 0x000270, "Wrong size on Obelisk_C_GetData");
static_assert(offsetof(Obelisk_C_GetData, Data) == 0x000000, "Member 'Obelisk_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Obelisk_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Obelisk_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Obelisk_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Obelisk_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Obelisk_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Obelisk_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Obelisk_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Obelisk_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
