#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Obelisk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass obelisk.obelisk_C
// 0x00A0 (0x02E8 - 0x0248)
class AObelisk_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Obelisk_C;                          // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComp_radarPoint_C*                     RadarPoint;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Walk;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Obelisk_loop;                                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Obelisk_on;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialForceComponent*                  RadialForce;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_obeliskLand;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    PropLoc;                                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Obelisk_land;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Obelisk_fall;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Obelisk_enter;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_C998E1C741F26E46558BD89743B5C0AC;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_C998E1C741F26E46558BD89743B5C0AC;     // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fallen;                                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Pulledout;                                         // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_obelisk(int32 EntryPoint);
	void BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void A__en__EventFunc();
	void A__preland__EventFunc();
	void A__UpdateFunc();
	void A__FinishedFunc();
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"obelisk_C">();
	}
	static class AObelisk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AObelisk_C>();
	}
};
static_assert(alignof(AObelisk_C) == 0x000008, "Wrong alignment on AObelisk_C");
static_assert(sizeof(AObelisk_C) == 0x0002E8, "Wrong size on AObelisk_C");
static_assert(offsetof(AObelisk_C, UberGraphFrame_Obelisk_C) == 0x000248, "Member 'AObelisk_C::UberGraphFrame_Obelisk_C' has a wrong offset!");
static_assert(offsetof(AObelisk_C, RadarPoint) == 0x000250, "Member 'AObelisk_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(AObelisk_C, ParticleSystem) == 0x000258, "Member 'AObelisk_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Walk) == 0x000260, "Member 'AObelisk_C::Walk' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Obelisk_loop) == 0x000268, "Member 'AObelisk_C::Obelisk_loop' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Obelisk_on) == 0x000270, "Member 'AObelisk_C::Obelisk_on' has a wrong offset!");
static_assert(offsetof(AObelisk_C, RadialForce) == 0x000278, "Member 'AObelisk_C::RadialForce' has a wrong offset!");
static_assert(offsetof(AObelisk_C, StaticMesh2) == 0x000280, "Member 'AObelisk_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Eff_obeliskLand) == 0x000288, "Member 'AObelisk_C::Eff_obeliskLand' has a wrong offset!");
static_assert(offsetof(AObelisk_C, PropLoc) == 0x000290, "Member 'AObelisk_C::PropLoc' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Obelisk_land) == 0x000298, "Member 'AObelisk_C::Obelisk_land' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Obelisk_fall) == 0x0002A0, "Member 'AObelisk_C::Obelisk_fall' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Obelisk_enter) == 0x0002A8, "Member 'AObelisk_C::Obelisk_enter' has a wrong offset!");
static_assert(offsetof(AObelisk_C, PointLight) == 0x0002B0, "Member 'AObelisk_C::PointLight' has a wrong offset!");
static_assert(offsetof(AObelisk_C, StaticMesh1) == 0x0002B8, "Member 'AObelisk_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Billboard) == 0x0002C0, "Member 'AObelisk_C::Billboard' has a wrong offset!");
static_assert(offsetof(AObelisk_C, StaticMesh) == 0x0002C8, "Member 'AObelisk_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AObelisk_C, A_a_C998E1C741F26E46558BD89743B5C0AC) == 0x0002D0, "Member 'AObelisk_C::A_a_C998E1C741F26E46558BD89743B5C0AC' has a wrong offset!");
static_assert(offsetof(AObelisk_C, A__Direction_C998E1C741F26E46558BD89743B5C0AC) == 0x0002D4, "Member 'AObelisk_C::A__Direction_C998E1C741F26E46558BD89743B5C0AC' has a wrong offset!");
static_assert(offsetof(AObelisk_C, A) == 0x0002D8, "Member 'AObelisk_C::A' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Fallen) == 0x0002E0, "Member 'AObelisk_C::Fallen' has a wrong offset!");
static_assert(offsetof(AObelisk_C, Pulledout) == 0x0002E1, "Member 'AObelisk_C::Pulledout' has a wrong offset!");

}

