#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectRenderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_spaceObject_structs.hpp"


namespace SDK::Params
{

// Function objectRenderer.objectRenderer_C.ExecuteUbergraph_objectRenderer
// 0x03CC (0x03CC - 0x0000)
struct ObjectRenderer_C_ExecuteUbergraph_objectRenderer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue_1;      // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddWorldRotation_SweepHitResult;       // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue_2;      // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue_3;      // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_2;     // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_1;                     // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0340(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer) == 0x000004, "Wrong alignment on ObjectRenderer_C_ExecuteUbergraph_objectRenderer");
static_assert(sizeof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer) == 0x0003CC, "Wrong size on ObjectRenderer_C_ExecuteUbergraph_objectRenderer");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, EntryPoint) == 0x000000, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000008, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_GetPI_ReturnValue) == 0x00000C, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x000020, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_RotatorFloat_ReturnValue_1) == 0x00002C, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_RotatorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000038, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_K2_AddWorldRotation_SweepHitResult) == 0x0000C0, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_K2_AddWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_RotatorFloat_ReturnValue_2) == 0x000148, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_RotatorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_RotatorFloat_ReturnValue_3) == 0x000154, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_RotatorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x000160, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_K2_AddLocalRotation_SweepHitResult_2) == 0x0001E8, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_K2_AddLocalRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_GetTimeAlive_ReturnValue) == 0x000270, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000274, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000278, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_DegSin_ReturnValue) == 0x00027C, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_DegSin_ReturnValue_1) == 0x000280, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_DegSin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Lerp_ReturnValue) == 0x000284, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Lerp_ReturnValue_1) == 0x000288, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Lerp_ReturnValue_2) == 0x00028C, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_MakeVector_ReturnValue) == 0x000290, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00029C, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002A0, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_DegCos_ReturnValue) == 0x000328, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, K2Node_Event_DeltaSeconds) == 0x00032C, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_Lerp_ReturnValue_3) == 0x000330, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_MakeRotator_ReturnValue_1) == 0x000334, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000340, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_ExecuteUbergraph_objectRenderer, CallFunc_IsValid_ReturnValue) == 0x0003C8, "Member 'ObjectRenderer_C_ExecuteUbergraph_objectRenderer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function objectRenderer.objectRenderer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ObjectRenderer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectRenderer_C_ReceiveTick) == 0x000004, "Wrong alignment on ObjectRenderer_C_ReceiveTick");
static_assert(sizeof(ObjectRenderer_C_ReceiveTick) == 0x000004, "Wrong size on ObjectRenderer_C_ReceiveTick");
static_assert(offsetof(ObjectRenderer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ObjectRenderer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function objectRenderer.objectRenderer_C.Init
// 0x0238 (0x0238 - 0x0000)
struct ObjectRenderer_C_Init final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_spaceObject                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x008C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0104(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectRenderer_C_Init) == 0x000008, "Wrong alignment on ObjectRenderer_C_Init");
static_assert(sizeof(ObjectRenderer_C_Init) == 0x000238, "Wrong size on ObjectRenderer_C_Init");
static_assert(offsetof(ObjectRenderer_C_Init, RowName) == 0x000000, "Member 'ObjectRenderer_C_Init::RowName' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'ObjectRenderer_C_Init::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'ObjectRenderer_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue) == 0x000074, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000078, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_MakeVector_ReturnValue) == 0x00007C, "Member 'ObjectRenderer_C_Init::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000088, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00008C, "Member 'ObjectRenderer_C_Init::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00009C, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_MakeVector_ReturnValue_1) == 0x0000A0, "Member 'ObjectRenderer_C_Init::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x0000AC, "Member 'ObjectRenderer_C_Init::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0000BC, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x0000C0, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x0000C4, "Member 'ObjectRenderer_C_Init::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_MakeVector_ReturnValue_2) == 0x0000C8, "Member 'ObjectRenderer_C_Init::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000D4, "Member 'ObjectRenderer_C_Init::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_Conv_VectorToLinearColor_ReturnValue_2) == 0x0000E0, "Member 'ObjectRenderer_C_Init::CallFunc_Conv_VectorToLinearColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_BreakRotator_Roll) == 0x0000F0, "Member 'ObjectRenderer_C_Init::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_BreakRotator_Pitch) == 0x0000F4, "Member 'ObjectRenderer_C_Init::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_BreakRotator_Yaw) == 0x0000F8, "Member 'ObjectRenderer_C_Init::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000FC, "Member 'ObjectRenderer_C_Init::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000100, "Member 'ObjectRenderer_C_Init::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000104, "Member 'ObjectRenderer_C_Init::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_MakeRotator_ReturnValue) == 0x00018C, "Member 'ObjectRenderer_C_Init::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000198, "Member 'ObjectRenderer_C_Init::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_GetMaterial_ReturnValue) == 0x000220, "Member 'ObjectRenderer_C_Init::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_SetStaticMesh_ReturnValue) == 0x000228, "Member 'ObjectRenderer_C_Init::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000230, "Member 'ObjectRenderer_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function objectRenderer.objectRenderer_C.requestImage
// 0x0010 (0x0010 - 0x0000)
struct ObjectRenderer_C_RequestImage final
{
public:
	class UTextureRenderTarget2D*                 TextureTarget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Param_Rt;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectRenderer_C_RequestImage) == 0x000008, "Wrong alignment on ObjectRenderer_C_RequestImage");
static_assert(sizeof(ObjectRenderer_C_RequestImage) == 0x000010, "Wrong size on ObjectRenderer_C_RequestImage");
static_assert(offsetof(ObjectRenderer_C_RequestImage, TextureTarget) == 0x000000, "Member 'ObjectRenderer_C_RequestImage::TextureTarget' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_RequestImage, Param_Rt) == 0x000008, "Member 'ObjectRenderer_C_RequestImage::Param_Rt' has a wrong offset!");

// Function objectRenderer.objectRenderer_C.begin
// 0x0330 (0x0330 - 0x0000)
struct ObjectRenderer_C_begin final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_1;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_2;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AProp_argm_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_1;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_3;               // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0180(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0xC];                                      // 0x01D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0210(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x029C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_findSignalCam_found;                      // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASignalCam_C*                           CallFunc_findSignalCam_camera;                     // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectRenderer_C_begin) == 0x000010, "Wrong alignment on ObjectRenderer_C_begin");
static_assert(sizeof(ObjectRenderer_C_begin) == 0x000330, "Wrong size on ObjectRenderer_C_begin");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ObjectRenderer_C_begin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_AsInt_Ttrigger) == 0x000008, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'ObjectRenderer_C_begin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_IsValid_ReturnValue_2) == 0x00001A, "Member 'ObjectRenderer_C_begin::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_AsInt_Ttrigger_1) == 0x000020, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_AsInt_Ttrigger_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_IsValid_ReturnValue_3) == 0x000031, "Member 'ObjectRenderer_C_begin::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000038, "Member 'ObjectRenderer_C_begin::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_getObjectFromKey_Output) == 0x000040, "Member 'ObjectRenderer_C_begin::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000048, "Member 'ObjectRenderer_C_begin::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_AsInt_Ttrigger_2) == 0x000050, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_AsInt_Ttrigger_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'ObjectRenderer_C_begin::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_IsValid_ReturnValue_4) == 0x000070, "Member 'ObjectRenderer_C_begin::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'ObjectRenderer_C_begin::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'ObjectRenderer_C_begin::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'ObjectRenderer_C_begin::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x0000B8, "Member 'ObjectRenderer_C_begin::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_FinishSpawningActor_ReturnValue) == 0x000140, "Member 'ObjectRenderer_C_begin::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000148, "Member 'ObjectRenderer_C_begin::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_getObjectFromKey_Output_1) == 0x000150, "Member 'ObjectRenderer_C_begin::CallFunc_getObjectFromKey_Output_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_IsValid_ReturnValue_5) == 0x000158, "Member 'ObjectRenderer_C_begin::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_AsInt_Ttrigger_3) == 0x000160, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_AsInt_Ttrigger_3' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_DynamicCast_bSuccess_3) == 0x000170, "Member 'ObjectRenderer_C_begin::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_GetTransform_ReturnValue) == 0x000180, "Member 'ObjectRenderer_C_begin::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_BreakTransform_Location) == 0x0001B0, "Member 'ObjectRenderer_C_begin::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_BreakTransform_Rotation) == 0x0001BC, "Member 'ObjectRenderer_C_begin::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_BreakTransform_Scale) == 0x0001C8, "Member 'ObjectRenderer_C_begin::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_MakeTransform_ReturnValue_1) == 0x0001E0, "Member 'ObjectRenderer_C_begin::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000210, "Member 'ObjectRenderer_C_begin::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, K2Node_SwitchName_CmpSuccess) == 0x000298, "Member 'ObjectRenderer_C_begin::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x00029C, "Member 'ObjectRenderer_C_begin::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_findSignalCam_found) == 0x000324, "Member 'ObjectRenderer_C_begin::CallFunc_findSignalCam_found' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_begin, CallFunc_findSignalCam_camera) == 0x000328, "Member 'ObjectRenderer_C_begin::CallFunc_findSignalCam_camera' has a wrong offset!");

// Function objectRenderer.objectRenderer_C.setRT
// 0x0090 (0x0090 - 0x0000)
struct ObjectRenderer_C_SetRT final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Divide_IntPointInt_ReturnValue;           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Divide_IntPointInt_ReturnValue_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_IntPointToVector2D_ReturnValue;      // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Divide_IntPointInt_ReturnValue_2;         // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_IntPointToVector2D_ReturnValue_1;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Conv_Vector2DToIntPoint_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_Select_Default;                             // 0x0080(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectRenderer_C_SetRT) == 0x000008, "Wrong alignment on ObjectRenderer_C_SetRT");
static_assert(sizeof(ObjectRenderer_C_SetRT) == 0x000090, "Wrong size on ObjectRenderer_C_SetRT");
static_assert(offsetof(ObjectRenderer_C_SetRT, Temp_bool_Variable) == 0x000000, "Member 'ObjectRenderer_C_SetRT::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'ObjectRenderer_C_SetRT::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ObjectRenderer_C_SetRT::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, K2Node_MakeStruct_IntPoint) == 0x000014, "Member 'ObjectRenderer_C_SetRT::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Divide_IntPointInt_ReturnValue) == 0x00001C, "Member 'ObjectRenderer_C_SetRT::CallFunc_Divide_IntPointInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'ObjectRenderer_C_SetRT::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Divide_IntPointInt_ReturnValue_1) == 0x000028, "Member 'ObjectRenderer_C_SetRT::CallFunc_Divide_IntPointInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'ObjectRenderer_C_SetRT::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Conv_IntPointToVector2D_ReturnValue) == 0x000034, "Member 'ObjectRenderer_C_SetRT::CallFunc_Conv_IntPointToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'ObjectRenderer_C_SetRT::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_BreakVector2D_X) == 0x000040, "Member 'ObjectRenderer_C_SetRT::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'ObjectRenderer_C_SetRT::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'ObjectRenderer_C_SetRT::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Divide_IntPointInt_ReturnValue_2) == 0x00004C, "Member 'ObjectRenderer_C_SetRT::CallFunc_Divide_IntPointInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000054, "Member 'ObjectRenderer_C_SetRT::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Conv_IntPointToVector2D_ReturnValue_1) == 0x000058, "Member 'ObjectRenderer_C_SetRT::CallFunc_Conv_IntPointToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_BreakVector2D_X_1) == 0x000060, "Member 'ObjectRenderer_C_SetRT::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_BreakVector2D_Y_1) == 0x000064, "Member 'ObjectRenderer_C_SetRT::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Lerp_ReturnValue_1) == 0x000068, "Member 'ObjectRenderer_C_SetRT::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Lerp_ReturnValue_2) == 0x00006C, "Member 'ObjectRenderer_C_SetRT::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_MakeVector2D_ReturnValue) == 0x000070, "Member 'ObjectRenderer_C_SetRT::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_Conv_Vector2DToIntPoint_ReturnValue) == 0x000078, "Member 'ObjectRenderer_C_SetRT::CallFunc_Conv_Vector2DToIntPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, K2Node_Select_Default) == 0x000080, "Member 'ObjectRenderer_C_SetRT::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_SetRT, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000088, "Member 'ObjectRenderer_C_SetRT::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");

// Function objectRenderer.objectRenderer_C.findSignalCam
// 0x0050 (0x0050 - 0x0000)
struct ObjectRenderer_C_FindSignalCam final
{
public:
	class FName                                   Signal;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASignalCam_C*                           Camera;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASignalCam_C*                           C;                                                 // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASignalCam_C*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectRenderer_C_FindSignalCam) == 0x000008, "Wrong alignment on ObjectRenderer_C_FindSignalCam");
static_assert(sizeof(ObjectRenderer_C_FindSignalCam) == 0x000050, "Wrong size on ObjectRenderer_C_FindSignalCam");
static_assert(offsetof(ObjectRenderer_C_FindSignalCam, Signal) == 0x000000, "Member 'ObjectRenderer_C_FindSignalCam::Signal' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_FindSignalCam, Found) == 0x000008, "Member 'ObjectRenderer_C_FindSignalCam::Found' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_FindSignalCam, Camera) == 0x000010, "Member 'ObjectRenderer_C_FindSignalCam::Camera' has a wrong offset!");
static_assert(offsetof(ObjectRenderer_C_FindSignalCam, C) == 0x000018, "Member 'ObjectRenderer_C_FindSignalCam::C' has a wrong offset!");
