#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_coords_tutor2

#include "Basic.hpp"

#include "Panel_coords_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass panel_coords_tutor2.panel_coords_tutor2_C
// 0x0020 (0x02B8 - 0x0298)
class APanel_coords_tutor2_C final : public APanel_coords_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Panel_coords_tutor2_C;              // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATriggerBase_C*                         Speak1;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Speak2;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Open;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_panel_coords_tutor2(int32 EntryPoint);
	void Speak();
	void Dishs();
	void PressedPanel();
	void GamemodeBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"panel_coords_tutor2_C">();
	}
	static class APanel_coords_tutor2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APanel_coords_tutor2_C>();
	}
};
static_assert(alignof(APanel_coords_tutor2_C) == 0x000008, "Wrong alignment on APanel_coords_tutor2_C");
static_assert(sizeof(APanel_coords_tutor2_C) == 0x0002B8, "Wrong size on APanel_coords_tutor2_C");
static_assert(offsetof(APanel_coords_tutor2_C, UberGraphFrame_Panel_coords_tutor2_C) == 0x000298, "Member 'APanel_coords_tutor2_C::UberGraphFrame_Panel_coords_tutor2_C' has a wrong offset!");
static_assert(offsetof(APanel_coords_tutor2_C, Speak1) == 0x0002A0, "Member 'APanel_coords_tutor2_C::Speak1' has a wrong offset!");
static_assert(offsetof(APanel_coords_tutor2_C, Speak2) == 0x0002A8, "Member 'APanel_coords_tutor2_C::Speak2' has a wrong offset!");
static_assert(offsetof(APanel_coords_tutor2_C, Open) == 0x0002B0, "Member 'APanel_coords_tutor2_C::Open' has a wrong offset!");

}

