#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_computer

#include "Basic.hpp"

#include "PanelBase_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass panel_computer.panel_computer_C
// 0x0088 (0x02F8 - 0x0270)
class APanel_computer_C : public APanelBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Panel_computer_C;                   // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          button_maxLevel;                                   // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Prog;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Done;                                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   buttonMesh;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Deny;                                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_stop;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_start;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_upload;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DrivePort;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    buttonsRoot;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AProp_drive_C*                          Drive;                                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecentlyDetached;                                // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3097[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Comp;                                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Press_upload;                                      // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Press_start;                                       // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Press_stop;                                        // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3098[0x5];                                     // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_decoder_C*                         Widget;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          buttonNotUsed;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IgnoreServers;                                     // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_panel_computer(int32 EntryPoint);
	void Dest(class AActor* DestroyedActor);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__drivePort_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__drivePort_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void buttonsVisibility();
	void DriveUsed();
	void YellowPress1();
	void GreenPress();
	void DriveDetached();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, int32 Param_Index, Enum_interactionActions Action);
	void StuffUpgraded(class AMainGamemode_C* GameMode);
	void GamemodeBeginPlay();
	void IsButtonUsed(bool* Failed);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace);
	void DreamInv(TArray<struct FStruct_save>& Invv, class ADreamBase_C** Base);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"panel_computer_C">();
	}
	static class APanel_computer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APanel_computer_C>();
	}
};
static_assert(alignof(APanel_computer_C) == 0x000008, "Wrong alignment on APanel_computer_C");
static_assert(sizeof(APanel_computer_C) == 0x0002F8, "Wrong size on APanel_computer_C");
static_assert(offsetof(APanel_computer_C, UberGraphFrame_Panel_computer_C) == 0x000270, "Member 'APanel_computer_C::UberGraphFrame_Panel_computer_C' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, button_maxLevel) == 0x000278, "Member 'APanel_computer_C::button_maxLevel' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Prog) == 0x000280, "Member 'APanel_computer_C::Prog' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Done) == 0x000288, "Member 'APanel_computer_C::Done' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, buttonMesh) == 0x000290, "Member 'APanel_computer_C::buttonMesh' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Deny) == 0x000298, "Member 'APanel_computer_C::Deny' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, button_stop) == 0x0002A0, "Member 'APanel_computer_C::button_stop' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, button_start) == 0x0002A8, "Member 'APanel_computer_C::button_start' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, button_upload) == 0x0002B0, "Member 'APanel_computer_C::button_upload' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, DrivePort) == 0x0002B8, "Member 'APanel_computer_C::DrivePort' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, buttonsRoot) == 0x0002C0, "Member 'APanel_computer_C::buttonsRoot' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Drive) == 0x0002C8, "Member 'APanel_computer_C::Drive' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, IsRecentlyDetached) == 0x0002D0, "Member 'APanel_computer_C::IsRecentlyDetached' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Comp) == 0x0002D8, "Member 'APanel_computer_C::Comp' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Press_upload) == 0x0002E0, "Member 'APanel_computer_C::Press_upload' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Press_start) == 0x0002E1, "Member 'APanel_computer_C::Press_start' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Press_stop) == 0x0002E2, "Member 'APanel_computer_C::Press_stop' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, Widget) == 0x0002E8, "Member 'APanel_computer_C::Widget' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, buttonNotUsed) == 0x0002F0, "Member 'APanel_computer_C::buttonNotUsed' has a wrong offset!");
static_assert(offsetof(APanel_computer_C, IgnoreServers) == 0x0002F1, "Member 'APanel_computer_C::IgnoreServers' has a wrong offset!");

}

