#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_download

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Struct_byteImage_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_signalDataDynamic_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function panel_download.panel_download_C.ExecuteUbergraph_panel_download
// 0x0580 (0x0580 - 0x0000)
struct Panel_download_C_ExecuteUbergraph_panel_download final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATardis_C*                              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_TextureRenderTarget2DToBytes_ByteArray;   // 0x00C0(0x0010)(ReferenceParm)
	struct FStruct_byteImage                      K2Node_MakeStruct_struct_byteImage;                // 0x00D0(0x0010)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_5;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APanelBase_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0128(0x0010)(ReferenceParm)
	TArray<class APanelBase_C*>                   K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0138(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_6;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APanelBase_C*                           CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APanelBase_C*                           CallFunc_Array_Get_Item_1;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_7;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AServerBox_C*>                   K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x01B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AServerBox_C*                           CallFunc_Array_Get_Item_2;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AServerBox_C*                           CallFunc_Array_Get_Item_3;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_8;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_9;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_saveSignal_succ;                          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_virus_self_CastInput;                     // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_10;       // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_11;       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_getSigObj_Value;                          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_12;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signalDataDynamic              CallFunc_setSignalID_OutputPin;                    // 0x02A0(0x0070)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_saveSignal_succ_1;                        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0320(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0358(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AShitDuende_C*                          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_13;       // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_1;                // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_1;               // 0x04A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADish_C*                                CallFunc_Array_Get_Item_4;                         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_14;       // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_2;                // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_2;               // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x051C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_15;       // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_3;                // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_3;               // 0x0540(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_download_C_ExecuteUbergraph_panel_download) == 0x000010, "Wrong alignment on Panel_download_C_ExecuteUbergraph_panel_download");
static_assert(sizeof(Panel_download_C_ExecuteUbergraph_panel_download) == 0x000580, "Wrong size on Panel_download_C_ExecuteUbergraph_panel_download");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, EntryPoint) == 0x000000, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::EntryPoint' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_int_Variable) == 0x000004, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_int_Variable_1) == 0x000058, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_int_Variable_2) == 0x000064, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000068, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_bool_Variable) == 0x000070, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_object_Variable) == 0x000078, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000080, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000089, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Not_PreBool_ReturnValue_1) == 0x00008A, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00008B, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00008C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x00008D, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000090, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000098, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000A0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_TextureRenderTarget2DToBytes_ByteArray) == 0x0000C0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_TextureRenderTarget2DToBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_MakeStruct_struct_byteImage) == 0x0000D0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_MakeStruct_struct_byteImage' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_Event_DeltaSeconds) == 0x0000E0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x0000E8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000F0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x0000F8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Add_IntInt_ReturnValue_3) == 0x000104, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x000108, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Percent_IntInt_ReturnValue) == 0x00010C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Add_IntInt_ReturnValue_4) == 0x000114, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000118, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_SwitchName_CmpSuccess) == 0x000119, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_5) == 0x000120, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_5' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_GetAllActorsOfClass_OutActors) == 0x000128, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000138, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_6) == 0x000148, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_6' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Get_Item) == 0x000158, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Length_ReturnValue_1) == 0x000160, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_AsInt_Objects) == 0x000168, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Less_IntInt_ReturnValue) == 0x000179, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_object_Variable_1) == 0x000180, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_int_Variable_3) == 0x000188, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Add_IntInt_ReturnValue_5) == 0x00018C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Get_Item_1) == 0x000190, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_AsInt_Objects_1) == 0x000198, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A9, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_7) == 0x0001B0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_7' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0001B8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Length_ReturnValue_2) == 0x0001C8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Get_Item_2) == 0x0001D0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001D8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Get_Item_3) == 0x0001E0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_bool_Variable_1) == 0x0001E8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_AsInt_Ttrigger) == 0x0001F0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_Select_Default) == 0x000208, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_RandomFloat_ReturnValue) == 0x000210, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_8) == 0x000218, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_8' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_9) == 0x000220, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_9' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_saveSignal_succ) == 0x000228, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_saveSignal_succ' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_virus_self_CastInput) == 0x000230, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_virus_self_CastInput' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_10) == 0x000240, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_10' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_11) == 0x000248, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_11' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getSaveSlot_saveSlot) == 0x000250, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getSigObj_Value) == 0x000258, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getSigObj_Value' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Conv_IntToString_ReturnValue) == 0x000260, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Greater_IntInt_ReturnValue) == 0x000270, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000278, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000288, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_12) == 0x000298, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_12' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_setSignalID_OutputPin) == 0x0002A0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_setSignalID_OutputPin' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getObjectFromKey_Output) == 0x000310, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_saveSignal_succ_1) == 0x000318, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_saveSignal_succ_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_IsValid_ReturnValue) == 0x000319, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_GetTransform_ReturnValue) == 0x000320, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_Event_player) == 0x000350, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_Event_hit) == 0x000358, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_Event_action) == 0x0003E0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003E8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_SwitchEnum_CmpSuccess) == 0x0003F0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0003F8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_bBlockingHit) == 0x000400, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_bInitialOverlap) == 0x000401, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_Time) == 0x000404, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_Distance) == 0x000408, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_Location) == 0x00040C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_ImpactPoint) == 0x000418, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_Normal) == 0x000424, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_ImpactNormal) == 0x000430, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_PhysMat) == 0x000440, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_HitActor) == 0x000448, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_HitComponent) == 0x000450, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_HitBoneName) == 0x000458, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_HitItem) == 0x000460, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_ElementIndex) == 0x000464, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_FaceIndex) == 0x000468, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_TraceStart) == 0x00046C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_BreakHitResult_TraceEnd) == 0x000478, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_object_Variable_2) == 0x000488, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_13) == 0x000490, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_13' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getObjectFromKey_Output_1) == 0x000498, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getObjectFromKey_Output_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_int_Array_Index_Variable) == 0x0004A0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_AsInt_Ttrigger_1) == 0x0004A8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_AsInt_Ttrigger_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_bSuccess_3) == 0x0004B8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_Array_Get_Item_4) == 0x0004C0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_IsValid_ReturnValue_1) == 0x0004C8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_CreateDelegate_OutputDelegate) == 0x0004CC, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_14) == 0x0004E0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_14' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, Temp_object_Variable_3) == 0x0004E8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getObjectFromKey_Output_2) == 0x0004F0, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getObjectFromKey_Output_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_AsInt_Ttrigger_2) == 0x0004F8, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_AsInt_Ttrigger_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_bSuccess_4) == 0x000508, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_Select_Default_1) == 0x000510, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_IsValid_ReturnValue_2) == 0x000518, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_CreateDelegate_OutputDelegate_1) == 0x00051C, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getMainGamemode_AsMain_Gamemode_15) == 0x000530, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getMainGamemode_AsMain_Gamemode_15' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, CallFunc_getObjectFromKey_Output_3) == 0x000538, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::CallFunc_getObjectFromKey_Output_3' has a wrong offset!");
static_assert(offsetof(Panel_download_C_ExecuteUbergraph_panel_download, K2Node_DynamicCast_AsInt_Ttrigger_3) == 0x000540, "Member 'Panel_download_C_ExecuteUbergraph_panel_download::K2Node_DynamicCast_AsInt_Ttrigger_3' has a wrong offset!");
