#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_SATconsole

#include "Basic.hpp"

#include "PanelBase_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass panel_SATconsole.panel_SATconsole_C
// 0x0058 (0x02C8 - 0x0270)
class APanel_SATconsole_C : public APanelBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Panel_SATconsole_C;                 // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Cen;                                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ServerDown;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       UpdName;                                           // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    buttonsRoot;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Stand;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUmg_console_C*                         Widget;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ControlObject;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADish_C*                                Control_asDish;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Root;                                              // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_panel_SATconsole(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__updName_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void SetAsDish(class AActor* Param_ControlObject);
	void Cal_100();
	void Alert(class AServerBox_C* Server);
	void Con();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, int32 Param_Index, Enum_interactionActions Action);
	void GamemodeBeginPlay();
	void IsButtonUsed(bool* Failed);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace);
	void DreamInv(TArray<struct FStruct_save>& Invv, class ADreamBase_C** Base);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"panel_SATconsole_C">();
	}
	static class APanel_SATconsole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APanel_SATconsole_C>();
	}
};
static_assert(alignof(APanel_SATconsole_C) == 0x000008, "Wrong alignment on APanel_SATconsole_C");
static_assert(sizeof(APanel_SATconsole_C) == 0x0002C8, "Wrong size on APanel_SATconsole_C");
static_assert(offsetof(APanel_SATconsole_C, UberGraphFrame_Panel_SATconsole_C) == 0x000270, "Member 'APanel_SATconsole_C::UberGraphFrame_Panel_SATconsole_C' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, Cen) == 0x000278, "Member 'APanel_SATconsole_C::Cen' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, ServerDown) == 0x000280, "Member 'APanel_SATconsole_C::ServerDown' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, UpdName) == 0x000288, "Member 'APanel_SATconsole_C::UpdName' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, Box) == 0x000290, "Member 'APanel_SATconsole_C::Box' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, buttonsRoot) == 0x000298, "Member 'APanel_SATconsole_C::buttonsRoot' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, Stand) == 0x0002A0, "Member 'APanel_SATconsole_C::Stand' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, Widget) == 0x0002A8, "Member 'APanel_SATconsole_C::Widget' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, ControlObject) == 0x0002B0, "Member 'APanel_SATconsole_C::ControlObject' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, Control_asDish) == 0x0002B8, "Member 'APanel_SATconsole_C::Control_asDish' has a wrong offset!");
static_assert(offsetof(APanel_SATconsole_C, Root) == 0x0002C0, "Member 'APanel_SATconsole_C::Root' has a wrong offset!");

}

