#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_download_tutorial3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Panel_download_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass panel_download_tutorial3.panel_download_tutorial3_C
// 0x0020 (0x0340 - 0x0320)
class APanel_download_tutorial3_C final : public APanel_download_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Panel_download_tutorial3_C;         // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATriggerBase_C*                         Trigger_completedPolar;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Trigger_completedFreq;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Trigger_download;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_panel_download_tutorial3(int32 EntryPoint);
	void Downloaded();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void SetActiveTrigger(class AActor* SentFrom, bool Active);
	void CordUnplugged(class ACord_C* Cord, class ACordSocket_C* Socket);
	void CordPlugged(class ACord_C* Cord, class ACordSocket_C* Socket);
	void Set_ignoreSave_trigger(bool NewParam);
	void IgnoreSave_trigger(bool* Ignore);
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void GetTriggerData(struct FStruct_triggerSave* Data);
	void GamemodeBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"panel_download_tutorial3_C">();
	}
	static class APanel_download_tutorial3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APanel_download_tutorial3_C>();
	}
};
static_assert(alignof(APanel_download_tutorial3_C) == 0x000008, "Wrong alignment on APanel_download_tutorial3_C");
static_assert(sizeof(APanel_download_tutorial3_C) == 0x000340, "Wrong size on APanel_download_tutorial3_C");
static_assert(offsetof(APanel_download_tutorial3_C, UberGraphFrame_Panel_download_tutorial3_C) == 0x000320, "Member 'APanel_download_tutorial3_C::UberGraphFrame_Panel_download_tutorial3_C' has a wrong offset!");
static_assert(offsetof(APanel_download_tutorial3_C, Trigger_completedPolar) == 0x000328, "Member 'APanel_download_tutorial3_C::Trigger_completedPolar' has a wrong offset!");
static_assert(offsetof(APanel_download_tutorial3_C, Trigger_completedFreq) == 0x000330, "Member 'APanel_download_tutorial3_C::Trigger_completedFreq' has a wrong offset!");
static_assert(offsetof(APanel_download_tutorial3_C, Trigger_download) == 0x000338, "Member 'APanel_download_tutorial3_C::Trigger_download' has a wrong offset!");

}

