#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_download

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PanelBase_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass panel_download.panel_download_C
// 0x00B0 (0x0320 - 0x0270)
class APanel_download_C : public APanelBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Panel_download_C;                   // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Eff_ff;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_pf;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_pdir_toggle;                                // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        beep_yes;                                          // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        beep_no;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        blip;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_delSig;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_saveSig;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_FF_spdAdd_5;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_PF_spdAdd_1;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_PF_spdAdd_15;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_PF_spdAdd_5;                                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_FF_spdAdd_1;                                // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_FF_spdAdd_15;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_FF_toggle;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          button_PF_toggle;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    buttonsRoot;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUmg_signalDownload_C*                  Widget;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Press_PFspd_1;                                     // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Press_PFspd_5;                                     // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Press_PFspd_15;                                    // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Comp;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Press_save;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Press_del;                                         // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IgnoreServers;                                     // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_panel_download(int32 EntryPoint);
	void Autosave();
	void ReceiveTick(float DeltaSeconds);
	void Event_scrollDown();
	void ScrollUp();
	void ScrollDown();
	void buttonsVisibility();
	void AddParams(float Mult);
	void Downloaded();
	void Toggled_P();
	void Toggled_F();
	void ReceiveBeginPlay();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, Enum_interactionActions Action);
	void GamemodeBeginPlay();
	void IsButtonUsed(bool* Failed);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);
	void DreamInv(TArray<struct FStruct_save>& Invv, class ADreamBase_C** Base);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"panel_download_C">();
	}
	static class APanel_download_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APanel_download_C>();
	}
};
static_assert(alignof(APanel_download_C) == 0x000008, "Wrong alignment on APanel_download_C");
static_assert(sizeof(APanel_download_C) == 0x000320, "Wrong size on APanel_download_C");
static_assert(offsetof(APanel_download_C, UberGraphFrame_Panel_download_C) == 0x000270, "Member 'APanel_download_C::UberGraphFrame_Panel_download_C' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Eff_ff) == 0x000278, "Member 'APanel_download_C::Eff_ff' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Eff_pf) == 0x000280, "Member 'APanel_download_C::Eff_pf' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_pdir_toggle) == 0x000288, "Member 'APanel_download_C::button_pdir_toggle' has a wrong offset!");
static_assert(offsetof(APanel_download_C, beep_yes) == 0x000290, "Member 'APanel_download_C::beep_yes' has a wrong offset!");
static_assert(offsetof(APanel_download_C, beep_no) == 0x000298, "Member 'APanel_download_C::beep_no' has a wrong offset!");
static_assert(offsetof(APanel_download_C, blip) == 0x0002A0, "Member 'APanel_download_C::blip' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_delSig) == 0x0002A8, "Member 'APanel_download_C::button_delSig' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_saveSig) == 0x0002B0, "Member 'APanel_download_C::button_saveSig' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_FF_spdAdd_5) == 0x0002B8, "Member 'APanel_download_C::button_FF_spdAdd_5' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_PF_spdAdd_1) == 0x0002C0, "Member 'APanel_download_C::button_PF_spdAdd_1' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_PF_spdAdd_15) == 0x0002C8, "Member 'APanel_download_C::button_PF_spdAdd_15' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_PF_spdAdd_5) == 0x0002D0, "Member 'APanel_download_C::button_PF_spdAdd_5' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_FF_spdAdd_1) == 0x0002D8, "Member 'APanel_download_C::button_FF_spdAdd_1' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_FF_spdAdd_15) == 0x0002E0, "Member 'APanel_download_C::button_FF_spdAdd_15' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_FF_toggle) == 0x0002E8, "Member 'APanel_download_C::button_FF_toggle' has a wrong offset!");
static_assert(offsetof(APanel_download_C, button_PF_toggle) == 0x0002F0, "Member 'APanel_download_C::button_PF_toggle' has a wrong offset!");
static_assert(offsetof(APanel_download_C, buttonsRoot) == 0x0002F8, "Member 'APanel_download_C::buttonsRoot' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Widget) == 0x000300, "Member 'APanel_download_C::Widget' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Press_PFspd_1) == 0x000308, "Member 'APanel_download_C::Press_PFspd_1' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Press_PFspd_5) == 0x000309, "Member 'APanel_download_C::Press_PFspd_5' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Press_PFspd_15) == 0x00030A, "Member 'APanel_download_C::Press_PFspd_15' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Comp) == 0x000310, "Member 'APanel_download_C::Comp' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Press_save) == 0x000318, "Member 'APanel_download_C::Press_save' has a wrong offset!");
static_assert(offsetof(APanel_download_C, Press_del) == 0x000319, "Member 'APanel_download_C::Press_del' has a wrong offset!");
static_assert(offsetof(APanel_download_C, IgnoreServers) == 0x00031A, "Member 'APanel_download_C::IgnoreServers' has a wrong offset!");

}

