#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Panel_coords_tutor2

#include "Basic.hpp"


namespace SDK::Params
{

// Function panel_coords_tutor2.panel_coords_tutor2_C.ExecuteUbergraph_panel_coords_tutor2
// 0x0060 (0x0060 - 0x0000)
struct Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3110[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3111[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3112[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_1;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2) == 0x000008, "Wrong alignment on Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2");
static_assert(sizeof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2) == 0x000060, "Wrong size on Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, EntryPoint) == 0x000000, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, CallFunc_runTrigger_self_CastInput) == 0x000008, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::CallFunc_runTrigger_self_CastInput' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000018, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, K2Node_DynamicCast_AsInt_Ttrigger) == 0x000020, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, K2Node_DynamicCast_AsInt_Ttrigger_1) == 0x000048, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::K2Node_DynamicCast_AsInt_Ttrigger_1' has a wrong offset!");
static_assert(offsetof(Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'Panel_coords_tutor2_C_ExecuteUbergraph_panel_coords_tutor2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

