#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PanelBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function panelBase.panelBase_C.ExecuteUbergraph_panelBase
// 0x07C8 (0x07C8 - 0x0000)
struct PanelBase_C_ExecuteUbergraph_panelBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_307E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0028(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_307F[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3080[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3081[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x012C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3082[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0278(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3083[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3084[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0360(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3085[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0390(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3086[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3087[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0458(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x04F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3088[0x3];                                     // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x057C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3089[0x4];                                     // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0598(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_activate;                             // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_308A[0x7];                                     // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0640(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0714(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x079C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x07B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PanelBase_C_ExecuteUbergraph_panelBase) == 0x000008, "Wrong alignment on PanelBase_C_ExecuteUbergraph_panelBase");
static_assert(sizeof(PanelBase_C_ExecuteUbergraph_panelBase) == 0x0007C8, "Wrong size on PanelBase_C_ExecuteUbergraph_panelBase");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, EntryPoint) == 0x000000, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_gamemode) == 0x000018, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_key_2) == 0x000028, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_pressed_1) == 0x000040, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_color) == 0x000044, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_damage_4) == 0x000054, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_7) == 0x000058, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_actor_1) == 0x0000E0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_impact_1) == 0x0000E8, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_water_3) == 0x0000F8, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_water_2) == 0x000100, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_water_1) == 0x000108, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_water) == 0x000110, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_static) == 0x000118, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_frozen) == 0x000119, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_active) == 0x00011A, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_actor) == 0x000120, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_damage_3) == 0x000128, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_6) == 0x00012C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_impact) == 0x0001B4, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_skipSetting) == 0x0001C0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_key_1) == 0x0001C8, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_14) == 0x0001D8, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_5) == 0x0001E0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_damage_2) == 0x000268, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_fuel) == 0x00026C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_13) == 0x000270, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_4) == 0x000278, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_index) == 0x000300, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_action) == 0x000304, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_12) == 0x000308, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_11) == 0x000310, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_damage_1) == 0x000318, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_location_1) == 0x00031C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_10) == 0x000328, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_9) == 0x000330, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_8) == 0x000338, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_wheelDelta) == 0x000340, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_7) == 0x000348, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_mouse) == 0x000350, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_6) == 0x000358, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_key) == 0x000360, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_pressed) == 0x000378, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_temperature_1) == 0x00037C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_temperature) == 0x000380, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_speed) == 0x000384, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_5) == 0x000388, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_3) == 0x000390, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_name_1) == 0x000418, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_volume) == 0x000428, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_4) == 0x000430, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_location) == 0x000438, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_damage) == 0x000444, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_clean) == 0x000448, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_3) == 0x000450, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_2) == 0x000458, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hook) == 0x0004E0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_2) == 0x0004E8, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit_1) == 0x0004F0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_kick) == 0x000578, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_name) == 0x00057C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player_1) == 0x000588, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_player) == 0x000590, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_hit) == 0x000598, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_activate) == 0x000620, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000628, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000630, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_RandomFloatInRange_ReturnValue) == 0x000638, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00063C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, K2Node_Event_settings) == 0x000640, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00070C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000710, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000714, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00079C, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0007A8, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0007B0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_Vector_Distance_ReturnValue) == 0x0007BC, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ExecuteUbergraph_panelBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0007C0, "Member 'PanelBase_C_ExecuteUbergraph_panelBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function panelBase.panelBase_C.settingsApplied
// 0x00CC (0x00CC - 0x0000)
struct PanelBase_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00CC)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_SettingsApplied) == 0x000004, "Wrong alignment on PanelBase_C_SettingsApplied");
static_assert(sizeof(PanelBase_C_SettingsApplied) == 0x0000CC, "Wrong size on PanelBase_C_SettingsApplied");
static_assert(offsetof(PanelBase_C_SettingsApplied, Settings) == 0x000000, "Member 'PanelBase_C_SettingsApplied::Settings' has a wrong offset!");

// Function panelBase.panelBase_C.virus
// 0x0001 (0x0001 - 0x0000)
struct PanelBase_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PanelBase_C_Virus) == 0x000001, "Wrong alignment on PanelBase_C_Virus");
static_assert(sizeof(PanelBase_C_Virus) == 0x000001, "Wrong size on PanelBase_C_Virus");
static_assert(offsetof(PanelBase_C_Virus, Activate) == 0x000000, "Member 'PanelBase_C_Virus::Activate' has a wrong offset!");

// Function panelBase.panelBase_C.damageByPlayer
// 0x0090 (0x0090 - 0x0000)
struct PanelBase_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PanelBase_C_DamageByPlayer) == 0x000008, "Wrong alignment on PanelBase_C_DamageByPlayer");
static_assert(sizeof(PanelBase_C_DamageByPlayer) == 0x000090, "Wrong size on PanelBase_C_DamageByPlayer");
static_assert(offsetof(PanelBase_C_DamageByPlayer, Player) == 0x000000, "Member 'PanelBase_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_DamageByPlayer, Hit) == 0x000008, "Member 'PanelBase_C_DamageByPlayer::Hit' has a wrong offset!");

// Function panelBase.panelBase_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_Thrown) == 0x000008, "Wrong alignment on PanelBase_C_Thrown");
static_assert(sizeof(PanelBase_C_Thrown) == 0x000008, "Wrong size on PanelBase_C_Thrown");
static_assert(offsetof(PanelBase_C_Thrown, Player) == 0x000000, "Member 'PanelBase_C_Thrown::Player' has a wrong offset!");

// Function panelBase.panelBase_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_SendName) == 0x000004, "Wrong alignment on PanelBase_C_SendName");
static_assert(sizeof(PanelBase_C_SendName) == 0x000008, "Wrong size on PanelBase_C_SendName");
static_assert(offsetof(PanelBase_C_SendName, Param_Name) == 0x000000, "Member 'PanelBase_C_SendName::Param_Name' has a wrong offset!");

// Function panelBase.panelBase_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct PanelBase_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PanelBase_C_Kicked) == 0x000001, "Wrong alignment on PanelBase_C_Kicked");
static_assert(sizeof(PanelBase_C_Kicked) == 0x000001, "Wrong size on PanelBase_C_Kicked");
static_assert(offsetof(PanelBase_C_Kicked, Kick) == 0x000000, "Member 'PanelBase_C_Kicked::Kick' has a wrong offset!");

// Function panelBase.panelBase_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct PanelBase_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PanelBase_C_Player_use) == 0x000008, "Wrong alignment on PanelBase_C_Player_use");
static_assert(sizeof(PanelBase_C_Player_use) == 0x000090, "Wrong size on PanelBase_C_Player_use");
static_assert(offsetof(PanelBase_C_Player_use, Player) == 0x000000, "Member 'PanelBase_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_Player_use, Hit) == 0x000008, "Member 'PanelBase_C_Player_use::Hit' has a wrong offset!");

// Function panelBase.panelBase_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_Hooked) == 0x000008, "Wrong alignment on PanelBase_C_Hooked");
static_assert(sizeof(PanelBase_C_Hooked) == 0x000008, "Wrong size on PanelBase_C_Hooked");
static_assert(offsetof(PanelBase_C_Hooked, Hook) == 0x000000, "Member 'PanelBase_C_Hooked::Hook' has a wrong offset!");

// Function panelBase.panelBase_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct PanelBase_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PanelBase_C_PlayerUsedOn) == 0x000008, "Wrong alignment on PanelBase_C_PlayerUsedOn");
static_assert(sizeof(PanelBase_C_PlayerUsedOn) == 0x000090, "Wrong size on PanelBase_C_PlayerUsedOn");
static_assert(offsetof(PanelBase_C_PlayerUsedOn, Player) == 0x000000, "Member 'PanelBase_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_PlayerUsedOn, Hit) == 0x000008, "Member 'PanelBase_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function panelBase.panelBase_C.slice
// 0x0001 (0x0001 - 0x0000)
struct PanelBase_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PanelBase_C_Slice) == 0x000001, "Wrong alignment on PanelBase_C_Slice");
static_assert(sizeof(PanelBase_C_Slice) == 0x000001, "Wrong size on PanelBase_C_Slice");
static_assert(offsetof(PanelBase_C_Slice, Clean) == 0x000000, "Member 'PanelBase_C_Slice::Clean' has a wrong offset!");

// Function panelBase.panelBase_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct PanelBase_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_ReachedByExplosion) == 0x000004, "Wrong alignment on PanelBase_C_ReachedByExplosion");
static_assert(sizeof(PanelBase_C_ReachedByExplosion) == 0x000010, "Wrong size on PanelBase_C_ReachedByExplosion");
static_assert(offsetof(PanelBase_C_ReachedByExplosion, Location) == 0x000000, "Member 'PanelBase_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'PanelBase_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function panelBase.panelBase_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerLookAway) == 0x000008, "Wrong alignment on PanelBase_C_PlayerLookAway");
static_assert(sizeof(PanelBase_C_PlayerLookAway) == 0x000008, "Wrong size on PanelBase_C_PlayerLookAway");
static_assert(offsetof(PanelBase_C_PlayerLookAway, Player) == 0x000000, "Member 'PanelBase_C_PlayerLookAway::Player' has a wrong offset!");

// Function panelBase.panelBase_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct PanelBase_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_Stepped) == 0x000004, "Wrong alignment on PanelBase_C_Stepped");
static_assert(sizeof(PanelBase_C_Stepped) == 0x000004, "Wrong size on PanelBase_C_Stepped");
static_assert(offsetof(PanelBase_C_Stepped, Volume) == 0x000000, "Member 'PanelBase_C_Stepped::Volume' has a wrong offset!");

// Function panelBase.panelBase_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct PanelBase_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_ActionName) == 0x000008, "Wrong alignment on PanelBase_C_ActionName");
static_assert(sizeof(PanelBase_C_ActionName) == 0x0000A0, "Wrong size on PanelBase_C_ActionName");
static_assert(offsetof(PanelBase_C_ActionName, Player) == 0x000000, "Member 'PanelBase_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ActionName, Hit) == 0x000008, "Member 'PanelBase_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ActionName, Param_Name) == 0x000090, "Member 'PanelBase_C_ActionName::Param_Name' has a wrong offset!");

// Function panelBase.panelBase_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_AccumulateTemperature) == 0x000004, "Wrong alignment on PanelBase_C_AccumulateTemperature");
static_assert(sizeof(PanelBase_C_AccumulateTemperature) == 0x000008, "Wrong size on PanelBase_C_AccumulateTemperature");
static_assert(offsetof(PanelBase_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'PanelBase_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(PanelBase_C_AccumulateTemperature, Speed) == 0x000004, "Member 'PanelBase_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function panelBase.panelBase_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct PanelBase_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_AddTemperature) == 0x000004, "Wrong alignment on PanelBase_C_AddTemperature");
static_assert(sizeof(PanelBase_C_AddTemperature) == 0x000004, "Wrong size on PanelBase_C_AddTemperature");
static_assert(offsetof(PanelBase_C_AddTemperature, Temperature) == 0x000000, "Member 'PanelBase_C_AddTemperature::Temperature' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct PanelBase_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Param_Key;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PanelBase_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandAnyKey");
static_assert(sizeof(PanelBase_C_PlayerHandAnyKey) == 0x000028, "Wrong size on PanelBase_C_PlayerHandAnyKey");
static_assert(offsetof(PanelBase_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_PlayerHandAnyKey, Param_Key) == 0x000008, "Member 'PanelBase_C_PlayerHandAnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(PanelBase_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'PanelBase_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct PanelBase_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerHandMouse) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandMouse");
static_assert(sizeof(PanelBase_C_PlayerHandMouse) == 0x000010, "Wrong size on PanelBase_C_PlayerHandMouse");
static_assert(offsetof(PanelBase_C_PlayerHandMouse, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'PanelBase_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct PanelBase_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandMouseWheel");
static_assert(sizeof(PanelBase_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on PanelBase_C_PlayerHandMouseWheel");
static_assert(offsetof(PanelBase_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'PanelBase_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandRelease_LMB");
static_assert(sizeof(PanelBase_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on PanelBase_C_PlayerHandRelease_LMB");
static_assert(offsetof(PanelBase_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandRelease_RMB");
static_assert(sizeof(PanelBase_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on PanelBase_C_PlayerHandRelease_RMB");
static_assert(offsetof(PanelBase_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function panelBase.panelBase_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct PanelBase_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_Exploded) == 0x000004, "Wrong alignment on PanelBase_C_Exploded");
static_assert(sizeof(PanelBase_C_Exploded) == 0x000010, "Wrong size on PanelBase_C_Exploded");
static_assert(offsetof(PanelBase_C_Exploded, Damage) == 0x000000, "Member 'PanelBase_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(PanelBase_C_Exploded, Location) == 0x000004, "Member 'PanelBase_C_Exploded::Location' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandUse_LMB");
static_assert(sizeof(PanelBase_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on PanelBase_C_PlayerHandUse_LMB");
static_assert(offsetof(PanelBase_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function panelBase.panelBase_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct PanelBase_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on PanelBase_C_PlayerHandUse_RMB");
static_assert(sizeof(PanelBase_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on PanelBase_C_PlayerHandUse_RMB");
static_assert(offsetof(PanelBase_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'PanelBase_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function panelBase.panelBase_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct PanelBase_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_ActionOptionIndex) == 0x000008, "Wrong alignment on PanelBase_C_ActionOptionIndex");
static_assert(sizeof(PanelBase_C_ActionOptionIndex) == 0x000098, "Wrong size on PanelBase_C_ActionOptionIndex");
static_assert(offsetof(PanelBase_C_ActionOptionIndex, Player) == 0x000000, "Member 'PanelBase_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ActionOptionIndex, Hit) == 0x000008, "Member 'PanelBase_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'PanelBase_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(PanelBase_C_ActionOptionIndex, Action) == 0x000094, "Member 'PanelBase_C_ActionOptionIndex::Action' has a wrong offset!");

// Function panelBase.panelBase_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct PanelBase_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_Ignite) == 0x000004, "Wrong alignment on PanelBase_C_Ignite");
static_assert(sizeof(PanelBase_C_Ignite) == 0x000004, "Wrong size on PanelBase_C_Ignite");
static_assert(offsetof(PanelBase_C_Ignite, Fuel) == 0x000000, "Member 'PanelBase_C_Ignite::Fuel' has a wrong offset!");

// Function panelBase.panelBase_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct PanelBase_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_FireDamage) == 0x000004, "Wrong alignment on PanelBase_C_FireDamage");
static_assert(sizeof(PanelBase_C_FireDamage) == 0x000004, "Wrong size on PanelBase_C_FireDamage");
static_assert(offsetof(PanelBase_C_FireDamage, Damage) == 0x000000, "Member 'PanelBase_C_FireDamage::Damage' has a wrong offset!");

// Function panelBase.panelBase_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct PanelBase_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PanelBase_C_SteppedOn) == 0x000008, "Wrong alignment on PanelBase_C_SteppedOn");
static_assert(sizeof(PanelBase_C_SteppedOn) == 0x000090, "Wrong size on PanelBase_C_SteppedOn");
static_assert(offsetof(PanelBase_C_SteppedOn, Player) == 0x000000, "Member 'PanelBase_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(PanelBase_C_SteppedOn, Hit) == 0x000008, "Member 'PanelBase_C_SteppedOn::Hit' has a wrong offset!");

// Function panelBase.panelBase_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct PanelBase_C_SetKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PanelBase_C_SetKey) == 0x000008, "Wrong alignment on PanelBase_C_SetKey");
static_assert(sizeof(PanelBase_C_SetKey) == 0x000010, "Wrong size on PanelBase_C_SetKey");
static_assert(offsetof(PanelBase_C_SetKey, Param_Key) == 0x000000, "Member 'PanelBase_C_SetKey::Param_Key' has a wrong offset!");

// Function panelBase.panelBase_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct PanelBase_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
