#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PasswordLock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function passwordLock.passwordLock_C.ExecuteUbergraph_passwordLock
// 0x03C0 (0x03C0 - 0x0000)
struct PasswordLock_C_ExecuteUbergraph_passwordLock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FKey& Key, bool Pressed)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active_calc;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_downl;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_coords;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_play;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_light;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_name;                                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_kick;                                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0200(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_9;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_10;        // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_11;        // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x02D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_key;                            // 0x0328(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_pressed;                        // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0348(0x0018)()
	class USoundBase*                             K2Node_Select_Default_2;                           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_4;         // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RegexReplace_ReturnValue;                 // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_num;                            // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Active_calc, bool Active_downl, bool Active_coords, bool Active_play, bool Active_light)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_ExecuteUbergraph_passwordLock) == 0x000008, "Wrong alignment on PasswordLock_C_ExecuteUbergraph_passwordLock");
static_assert(sizeof(PasswordLock_C_ExecuteUbergraph_passwordLock) == 0x0003C0, "Wrong size on PasswordLock_C_ExecuteUbergraph_passwordLock");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, EntryPoint) == 0x000000, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::EntryPoint' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_object_Variable) == 0x000008, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_object_Variable_1) == 0x000010, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_bool_Variable) == 0x000018, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_bool_Variable_1) == 0x000019, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_bool_Variable_2) == 0x00001A, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_object_Variable_2) == 0x000020, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_object_Variable_3) == 0x000028, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_Len_ReturnValue) == 0x000030, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Select_Default) == 0x000038, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue) == 0x000054, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000058, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00005C, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000060, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_7) == 0x000068, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000070, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_active_calc) == 0x000078, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_active_calc' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_active_downl) == 0x000079, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_active_downl' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_active_coords) == 0x00007A, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_active_coords' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_active_play) == 0x00007B, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_active_play' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_active_light) == 0x00007C, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_active_light' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_6) == 0x000080, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_hit_2) == 0x000088, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_damage) == 0x000110, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_5) == 0x000118, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_active) == 0x000120, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_active' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_4) == 0x000128, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_name) == 0x000130, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Select_Default_1) == 0x000138, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000140, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_kick) == 0x000148, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_3) == 0x000150, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_hit_1) == 0x000158, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_2) == 0x0001E0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_owner) == 0x0001E8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_index) == 0x0001F0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player_1) == 0x0001F8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_hit) == 0x000200, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_action) == 0x000288, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000290, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000298, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x00029C, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x0002A0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x0002A4, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x0002A8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0002B0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_9) == 0x0002B8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_10) == 0x0002BC, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RandomFloatInRange_ReturnValue_11) == 0x0002C0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RandomFloatInRange_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0002C8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_MakeArray_Array) == 0x0002D0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0002E0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_Conv_IntToString_ReturnValue) == 0x0002E8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_Concat_StrStr_ReturnValue) == 0x0002F8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000308, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x000310, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_BooleanOR_ReturnValue) == 0x000318, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_getMainPlayer_AsMain_Player) == 0x000320, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_key) == 0x000328, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_key' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_pressed) == 0x000340, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_pressed' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, Temp_bool_Variable_3) == 0x000341, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000348, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Select_Default_2) == 0x000360, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_Conv_TextToString_ReturnValue) == 0x000368, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_SpawnSoundAttached_ReturnValue_4) == 0x000378, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_SpawnSoundAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_RegexReplace_ReturnValue) == 0x000380, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_RegexReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_Event_player) == 0x000390, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000398, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000399, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_Conv_StringToInt_ReturnValue) == 0x00039C, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_IsNumeric_ReturnValue) == 0x0003A0, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CustomEvent_num) == 0x0003A4, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CustomEvent_num' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003A8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_ExecuteUbergraph_passwordLock, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x0003B8, "Member 'PasswordLock_C_ExecuteUbergraph_passwordLock::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");

// Function passwordLock.passwordLock_C.inputNumber
// 0x0004 (0x0004 - 0x0000)
struct PasswordLock_C_InputNumber final
{
public:
	int32                                         Param_Num;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_InputNumber) == 0x000004, "Wrong alignment on PasswordLock_C_InputNumber");
static_assert(sizeof(PasswordLock_C_InputNumber) == 0x000004, "Wrong size on PasswordLock_C_InputNumber");
static_assert(offsetof(PasswordLock_C_InputNumber, Param_Num) == 0x000000, "Member 'PasswordLock_C_InputNumber::Param_Num' has a wrong offset!");

// Function passwordLock.passwordLock_C.playerAnykey
// 0x0020 (0x0020 - 0x0000)
struct PasswordLock_C_PlayerAnykey final
{
public:
	struct FKey                                   Param_Key;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_PlayerAnykey) == 0x000008, "Wrong alignment on PasswordLock_C_PlayerAnykey");
static_assert(sizeof(PasswordLock_C_PlayerAnykey) == 0x000020, "Wrong size on PasswordLock_C_PlayerAnykey");
static_assert(offsetof(PasswordLock_C_PlayerAnykey, Param_Key) == 0x000000, "Member 'PasswordLock_C_PlayerAnykey::Param_Key' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_PlayerAnykey, Pressed) == 0x000018, "Member 'PasswordLock_C_PlayerAnykey::Pressed' has a wrong offset!");

// Function passwordLock.passwordLock_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct PasswordLock_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_PlayerR) == 0x000008, "Wrong alignment on PasswordLock_C_PlayerR");
static_assert(sizeof(PasswordLock_C_PlayerR) == 0x000008, "Wrong size on PasswordLock_C_PlayerR");
static_assert(offsetof(PasswordLock_C_PlayerR, Player) == 0x000000, "Member 'PasswordLock_C_PlayerR::Player' has a wrong offset!");

// Function passwordLock.passwordLock_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct PasswordLock_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PasswordLock_C_Player_use) == 0x000008, "Wrong alignment on PasswordLock_C_Player_use");
static_assert(sizeof(PasswordLock_C_Player_use) == 0x000090, "Wrong size on PasswordLock_C_Player_use");
static_assert(offsetof(PasswordLock_C_Player_use, Player) == 0x000000, "Member 'PasswordLock_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Player_use, Hit) == 0x000008, "Member 'PasswordLock_C_Player_use::Hit' has a wrong offset!");

// Function passwordLock.passwordLock_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct PasswordLock_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_Kicked) == 0x000001, "Wrong alignment on PasswordLock_C_Kicked");
static_assert(sizeof(PasswordLock_C_Kicked) == 0x000001, "Wrong size on PasswordLock_C_Kicked");
static_assert(offsetof(PasswordLock_C_Kicked, Kick) == 0x000000, "Member 'PasswordLock_C_Kicked::Kick' has a wrong offset!");

// Function passwordLock.passwordLock_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct PasswordLock_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_SendName) == 0x000004, "Wrong alignment on PasswordLock_C_SendName");
static_assert(sizeof(PasswordLock_C_SendName) == 0x000008, "Wrong size on PasswordLock_C_SendName");
static_assert(offsetof(PasswordLock_C_SendName, Param_Name) == 0x000000, "Member 'PasswordLock_C_SendName::Param_Name' has a wrong offset!");

// Function passwordLock.passwordLock_C.playerHold
// 0x0008 (0x0008 - 0x0000)
struct PasswordLock_C_PlayerHold final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_PlayerHold) == 0x000008, "Wrong alignment on PasswordLock_C_PlayerHold");
static_assert(sizeof(PasswordLock_C_PlayerHold) == 0x000008, "Wrong size on PasswordLock_C_PlayerHold");
static_assert(offsetof(PasswordLock_C_PlayerHold, Player) == 0x000000, "Member 'PasswordLock_C_PlayerHold::Player' has a wrong offset!");

// Function passwordLock.passwordLock_C.Open
// 0x0001 (0x0001 - 0x0000)
struct PasswordLock_C_Open final
{
public:
	bool                                          Param_Active;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_Open) == 0x000001, "Wrong alignment on PasswordLock_C_Open");
static_assert(sizeof(PasswordLock_C_Open) == 0x000001, "Wrong size on PasswordLock_C_Open");
static_assert(offsetof(PasswordLock_C_Open, Param_Active) == 0x000000, "Member 'PasswordLock_C_Open::Param_Active' has a wrong offset!");

// Function passwordLock.passwordLock_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct PasswordLock_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_Thrown) == 0x000008, "Wrong alignment on PasswordLock_C_Thrown");
static_assert(sizeof(PasswordLock_C_Thrown) == 0x000008, "Wrong size on PasswordLock_C_Thrown");
static_assert(offsetof(PasswordLock_C_Thrown, Player) == 0x000000, "Member 'PasswordLock_C_Thrown::Player' has a wrong offset!");

// Function passwordLock.passwordLock_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct PasswordLock_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_DamageByPlayer) == 0x000008, "Wrong alignment on PasswordLock_C_DamageByPlayer");
static_assert(sizeof(PasswordLock_C_DamageByPlayer) == 0x000098, "Wrong size on PasswordLock_C_DamageByPlayer");
static_assert(offsetof(PasswordLock_C_DamageByPlayer, Player) == 0x000000, "Member 'PasswordLock_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_DamageByPlayer, Hit) == 0x000008, "Member 'PasswordLock_C_DamageByPlayer::Hit' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_DamageByPlayer, Damage) == 0x000090, "Member 'PasswordLock_C_DamageByPlayer::Damage' has a wrong offset!");

// Function passwordLock.passwordLock_C.powerChanged
// 0x0005 (0x0005 - 0x0000)
struct PasswordLock_C_PowerChanged final
{
public:
	bool                                          Active_calc;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_downl;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_coords;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_play;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_light;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_PowerChanged) == 0x000001, "Wrong alignment on PasswordLock_C_PowerChanged");
static_assert(sizeof(PasswordLock_C_PowerChanged) == 0x000005, "Wrong size on PasswordLock_C_PowerChanged");
static_assert(offsetof(PasswordLock_C_PowerChanged, Active_calc) == 0x000000, "Member 'PasswordLock_C_PowerChanged::Active_calc' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_PowerChanged, Active_downl) == 0x000001, "Member 'PasswordLock_C_PowerChanged::Active_downl' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_PowerChanged, Active_coords) == 0x000002, "Member 'PasswordLock_C_PowerChanged::Active_coords' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_PowerChanged, Active_play) == 0x000003, "Member 'PasswordLock_C_PowerChanged::Active_play' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_PowerChanged, Active_light) == 0x000004, "Member 'PasswordLock_C_PowerChanged::Active_light' has a wrong offset!");

// Function passwordLock.passwordLock_C.playerUnequip
// 0x0008 (0x0008 - 0x0000)
struct PasswordLock_C_PlayerUnequip final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_PlayerUnequip) == 0x000008, "Wrong alignment on PasswordLock_C_PlayerUnequip");
static_assert(sizeof(PasswordLock_C_PlayerUnequip) == 0x000008, "Wrong size on PasswordLock_C_PlayerUnequip");
static_assert(offsetof(PasswordLock_C_PlayerUnequip, Player) == 0x000000, "Member 'PasswordLock_C_PlayerUnequip::Player' has a wrong offset!");

// Function passwordLock.passwordLock_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct PasswordLock_C_SetActive final
{
public:
	bool                                          IsPairCall;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_SetActive) == 0x000001, "Wrong alignment on PasswordLock_C_SetActive");
static_assert(sizeof(PasswordLock_C_SetActive) == 0x000001, "Wrong size on PasswordLock_C_SetActive");
static_assert(offsetof(PasswordLock_C_SetActive, IsPairCall) == 0x000000, "Member 'PasswordLock_C_SetActive::IsPairCall' has a wrong offset!");

// Function passwordLock.passwordLock_C.beep
// 0x0008 (0x0008 - 0x0000)
struct PasswordLock_C_beep final
{
public:
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_beep) == 0x000008, "Wrong alignment on PasswordLock_C_beep");
static_assert(sizeof(PasswordLock_C_beep) == 0x000008, "Wrong size on PasswordLock_C_beep");
static_assert(offsetof(PasswordLock_C_beep, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000000, "Member 'PasswordLock_C_beep::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function passwordLock.passwordLock_C.upd
// 0x0058 (0x0058 - 0x0000)
struct PasswordLock_C_Upd final
{
public:
	class UParticleSystem*                        Eff;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasswordLock_C_Upd) == 0x000008, "Wrong alignment on PasswordLock_C_Upd");
static_assert(sizeof(PasswordLock_C_Upd) == 0x000058, "Wrong size on PasswordLock_C_Upd");
static_assert(offsetof(PasswordLock_C_Upd, Eff) == 0x000000, "Member 'PasswordLock_C_Upd::Eff' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, Temp_bool_Variable) == 0x000008, "Member 'PasswordLock_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, Temp_object_Variable) == 0x000010, "Member 'PasswordLock_C_Upd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, Temp_object_Variable_1) == 0x000018, "Member 'PasswordLock_C_Upd::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, Temp_bool_Variable_1) == 0x000020, "Member 'PasswordLock_C_Upd::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, Temp_object_Variable_2) == 0x000028, "Member 'PasswordLock_C_Upd::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, CallFunc_Len_ReturnValue) == 0x000030, "Member 'PasswordLock_C_Upd::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'PasswordLock_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, CallFunc_Conv_StringToInt_ReturnValue) == 0x000038, "Member 'PasswordLock_C_Upd::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00003C, "Member 'PasswordLock_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'PasswordLock_C_Upd::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, K2Node_Select_Default) == 0x000048, "Member 'PasswordLock_C_Upd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PasswordLock_C_Upd, K2Node_Select_Default_1) == 0x000050, "Member 'PasswordLock_C_Upd::K2Node_Select_Default_1' has a wrong offset!");

// Function passwordLock.passwordLock_C.isButtonUsed
// 0x0001 (0x0001 - 0x0000)
struct PasswordLock_C_IsButtonUsed final
{
public:
	bool                                          Failed;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasswordLock_C_IsButtonUsed) == 0x000001, "Wrong alignment on PasswordLock_C_IsButtonUsed");
static_assert(sizeof(PasswordLock_C_IsButtonUsed) == 0x000001, "Wrong size on PasswordLock_C_IsButtonUsed");
static_assert(offsetof(PasswordLock_C_IsButtonUsed, Failed) == 0x000000, "Member 'PasswordLock_C_IsButtonUsed::Failed' has a wrong offset!");

// Function passwordLock.passwordLock_C.lookAt
// 0x0238 (0x0238 - 0x0000)
struct PasswordLock_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0168(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0198(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
