#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiramidSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_triggerSave_structs.hpp"


namespace SDK::Params
{

// Function piramidSpawner.piramidSpawner_C.ExecuteUbergraph_piramidSpawner
// 0x0130 (0x0130 - 0x0000)
struct PiramidSpawner_C_ExecuteUbergraph_piramidSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewParam;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APiramid2_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKillerwisp_C*                          CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner) == 0x000010, "Wrong alignment on PiramidSpawner_C_ExecuteUbergraph_piramidSpawner");
static_assert(sizeof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner) == 0x000130, "Wrong size on PiramidSpawner_C_ExecuteUbergraph_piramidSpawner");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, EntryPoint) == 0x000000, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, Temp_int_Variable) == 0x000004, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_NewParam) == 0x000010, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_cord_1) == 0x000018, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_socket_1) == 0x000020, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_cord) == 0x000028, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_socket) == 0x000030, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_sentFrom) == 0x000038, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_active) == 0x000040, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_owner) == 0x000048, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, K2Node_Event_index) == 0x000050, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000A0, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A8, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000C8, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_MakeTransform_ReturnValue_1) == 0x0000E0, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000110, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000118, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000120, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_ExecuteUbergraph_piramidSpawner, CallFunc_getObjectFromKey_Output) == 0x000128, "Member 'PiramidSpawner_C_ExecuteUbergraph_piramidSpawner::CallFunc_getObjectFromKey_Output' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct PiramidSpawner_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiramidSpawner_C_RunTrigger) == 0x000008, "Wrong alignment on PiramidSpawner_C_RunTrigger");
static_assert(sizeof(PiramidSpawner_C_RunTrigger) == 0x000010, "Wrong size on PiramidSpawner_C_RunTrigger");
static_assert(offsetof(PiramidSpawner_C_RunTrigger, Param_Owner) == 0x000000, "Member 'PiramidSpawner_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_RunTrigger, Param_Index) == 0x000008, "Member 'PiramidSpawner_C_RunTrigger::Param_Index' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.setActiveTrigger
// 0x0010 (0x0010 - 0x0000)
struct PiramidSpawner_C_SetActiveTrigger final
{
public:
	class AActor*                                 SentFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PiramidSpawner_C_SetActiveTrigger) == 0x000008, "Wrong alignment on PiramidSpawner_C_SetActiveTrigger");
static_assert(sizeof(PiramidSpawner_C_SetActiveTrigger) == 0x000010, "Wrong size on PiramidSpawner_C_SetActiveTrigger");
static_assert(offsetof(PiramidSpawner_C_SetActiveTrigger, SentFrom) == 0x000000, "Member 'PiramidSpawner_C_SetActiveTrigger::SentFrom' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_SetActiveTrigger, Active) == 0x000008, "Member 'PiramidSpawner_C_SetActiveTrigger::Active' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.cordUnplugged
// 0x0010 (0x0010 - 0x0000)
struct PiramidSpawner_C_CordUnplugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiramidSpawner_C_CordUnplugged) == 0x000008, "Wrong alignment on PiramidSpawner_C_CordUnplugged");
static_assert(sizeof(PiramidSpawner_C_CordUnplugged) == 0x000010, "Wrong size on PiramidSpawner_C_CordUnplugged");
static_assert(offsetof(PiramidSpawner_C_CordUnplugged, Cord) == 0x000000, "Member 'PiramidSpawner_C_CordUnplugged::Cord' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_CordUnplugged, Socket) == 0x000008, "Member 'PiramidSpawner_C_CordUnplugged::Socket' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.cordPlugged
// 0x0010 (0x0010 - 0x0000)
struct PiramidSpawner_C_CordPlugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PiramidSpawner_C_CordPlugged) == 0x000008, "Wrong alignment on PiramidSpawner_C_CordPlugged");
static_assert(sizeof(PiramidSpawner_C_CordPlugged) == 0x000010, "Wrong size on PiramidSpawner_C_CordPlugged");
static_assert(offsetof(PiramidSpawner_C_CordPlugged, Cord) == 0x000000, "Member 'PiramidSpawner_C_CordPlugged::Cord' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_CordPlugged, Socket) == 0x000008, "Member 'PiramidSpawner_C_CordPlugged::Socket' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.set_ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct PiramidSpawner_C_Set_ignoreSave_trigger final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PiramidSpawner_C_Set_ignoreSave_trigger) == 0x000001, "Wrong alignment on PiramidSpawner_C_Set_ignoreSave_trigger");
static_assert(sizeof(PiramidSpawner_C_Set_ignoreSave_trigger) == 0x000001, "Wrong size on PiramidSpawner_C_Set_ignoreSave_trigger");
static_assert(offsetof(PiramidSpawner_C_Set_ignoreSave_trigger, NewParam) == 0x000000, "Member 'PiramidSpawner_C_Set_ignoreSave_trigger::NewParam' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct PiramidSpawner_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PiramidSpawner_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on PiramidSpawner_C_IgnoreSave_trigger");
static_assert(sizeof(PiramidSpawner_C_IgnoreSave_trigger) == 0x000001, "Wrong size on PiramidSpawner_C_IgnoreSave_trigger");
static_assert(offsetof(PiramidSpawner_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'PiramidSpawner_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.loadTriggerData
// 0x0100 (0x0100 - 0x0000)
struct PiramidSpawner_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PiramidSpawner_C_LoadTriggerData) == 0x000010, "Wrong alignment on PiramidSpawner_C_LoadTriggerData");
static_assert(sizeof(PiramidSpawner_C_LoadTriggerData) == 0x000100, "Wrong size on PiramidSpawner_C_LoadTriggerData");
static_assert(offsetof(PiramidSpawner_C_LoadTriggerData, Data) == 0x000000, "Member 'PiramidSpawner_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(PiramidSpawner_C_LoadTriggerData, Return) == 0x0000F0, "Member 'PiramidSpawner_C_LoadTriggerData::Return' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.getTriggerData
// 0x00F0 (0x00F0 - 0x0000)
struct PiramidSpawner_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(PiramidSpawner_C_GetTriggerData) == 0x000010, "Wrong alignment on PiramidSpawner_C_GetTriggerData");
static_assert(sizeof(PiramidSpawner_C_GetTriggerData) == 0x0000F0, "Wrong size on PiramidSpawner_C_GetTriggerData");
static_assert(offsetof(PiramidSpawner_C_GetTriggerData, Data) == 0x000000, "Member 'PiramidSpawner_C_GetTriggerData::Data' has a wrong offset!");

// Function piramidSpawner.piramidSpawner_C.gatherDataFromKeyT
// 0x0001 (0x0001 - 0x0000)
struct PiramidSpawner_C_GatherDataFromKeyT final
{
public:
	bool                                          Gather;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PiramidSpawner_C_GatherDataFromKeyT) == 0x000001, "Wrong alignment on PiramidSpawner_C_GatherDataFromKeyT");
static_assert(sizeof(PiramidSpawner_C_GatherDataFromKeyT) == 0x000001, "Wrong size on PiramidSpawner_C_GatherDataFromKeyT");
static_assert(offsetof(PiramidSpawner_C_GatherDataFromKeyT, Gather) == 0x000000, "Member 'PiramidSpawner_C_GatherDataFromKeyT::Gather' has a wrong offset!");

}

