#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Piramid2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function piramid2.piramid2_C.ExecuteUbergraph_piramid2
// 0x07E0 (0x07E0 - 0x0000)
struct Piramid2_C_ExecuteUbergraph_piramid2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0108(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPiramid_sk_prot_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsPiramid_Sk_Prot_Skeleton_Anim_Blueprint; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_forward;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_walkSpotFunc_ReturnValue;                 // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_walkSpotFunc_ReturnValue_1;               // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0240(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AKillerwisp_C*                          CallFunc_scanWisps_AsKillerwisp;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0300(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x1];                                      // 0x03BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_4;    // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0410(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0498(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_isInside_ReturnValue;                     // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_5;    // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInstancedFoliageActor*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_progressAdvancement_finished;             // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_progressAdvancement_name;                 // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x05D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x05DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x05E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_2;            // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0604(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68D[0x3];                                      // 0x068D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_3;                          // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A2[0x2];                                      // 0x06A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x070C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0718(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0724(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0748(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0754(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Piramid2_C_ExecuteUbergraph_piramid2) == 0x000008, "Wrong alignment on Piramid2_C_ExecuteUbergraph_piramid2");
static_assert(sizeof(Piramid2_C_ExecuteUbergraph_piramid2) == 0x0007E0, "Wrong size on Piramid2_C_ExecuteUbergraph_piramid2");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, EntryPoint) == 0x000000, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000030, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000050, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CustomEvent_NotifyName_4) == 0x000058, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CustomEvent_NotifyName_3) == 0x000070, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CustomEvent_NotifyName_2) == 0x000088, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_5) == 0x000090, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CustomEvent_NotifyName_1) == 0x0000A0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CustomEvent_NotifyName) == 0x0000B8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, Temp_name_Variable) == 0x0000D0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_SwitchName_CmpSuccess) == 0x0000DC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_SwitchEnum_CmpSuccess) == 0x0000DD, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0000E0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Ease_ReturnValue) == 0x0000E4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x0000F8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_Event_DeltaSeconds) == 0x000100, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_obj_static_obj) == 0x000108, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CreateDelegate_OutputDelegate_9) == 0x000130, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000140, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x000148, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000150, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_X) == 0x00015C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Y) == 0x000160, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Z) == 0x000164, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetAnimInstance_ReturnValue) == 0x000168, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_DynamicCast_AsPiramid_Sk_Prot_Skeleton_Anim_Blueprint) == 0x000170, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_DynamicCast_AsPiramid_Sk_Prot_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00017C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000188, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000194, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetForwardVector_ReturnValue) == 0x000198, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001A4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_CustomEvent_forward) == 0x0001A8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_CustomEvent_forward' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001A9, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001AC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001B8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x0001C4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0001C8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Lerp_ReturnValue) == 0x0001D4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0001D8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_walkSpotFunc_ReturnValue) == 0x0001E4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_walkSpotFunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001F0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0001FC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_walkSpotFunc_ReturnValue_1) == 0x000208, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_walkSpotFunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Vector_Distance_ReturnValue) == 0x000214, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000218, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000224, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_FindLookAtRotation_ReturnValue) == 0x000228, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_RInterpTo_ReturnValue) == 0x000234, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000240, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0002C8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0002D4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_scanWisps_AsKillerwisp) == 0x0002D8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_scanWisps_AsKillerwisp' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002E0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002E4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002F0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_1) == 0x0002FC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000300, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000388, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_RandomFloatInRange_ReturnValue) == 0x00038C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_RotateAngleAxis_ReturnValue) == 0x000390, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_2) == 0x00039C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0003A0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0003B0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, K2Node_SwitchEnum_CmpSuccess_1) == 0x0003B8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_3) == 0x0003B9, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_4) == 0x0003BA, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0003BC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0003C8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_5) == 0x0003D4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0003D8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentLocation_ReturnValue_4) == 0x0003E4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x0003F0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x0003F4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_VInterpTo_ReturnValue) == 0x0003F8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_VInterpTo_ReturnValue_1) == 0x000404, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000410, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000498, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_isInside_ReturnValue) == 0x000520, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_isInside_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetPlayerPawn_ReturnValue) == 0x000528, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000530, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_6) == 0x00053C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000540, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000548, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_K2_GetComponentLocation_ReturnValue_5) == 0x00054C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_K2_GetComponentLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_IsValid_ReturnValue_7) == 0x000558, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000560, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000568, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetActorOfClass_ReturnValue) == 0x000570, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Array_Add_ReturnValue) == 0x000578, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000580, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Array_Add_ReturnValue_1) == 0x000588, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_progressAdvancement_finished) == 0x00058C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_progressAdvancement_finished' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_progressAdvancement_name) == 0x000590, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_progressAdvancement_name' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetActorScale3D_ReturnValue) == 0x000598, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetActorScale3D_ReturnValue_1) == 0x0005A4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_X_1) == 0x0005B0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Y_1) == 0x0005B4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Z_1) == 0x0005B8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_X_2) == 0x0005BC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Y_2) == 0x0005C0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Z_2) == 0x0005C4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0005C8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0005CC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_MakeVector_ReturnValue) == 0x0005D0, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_MakeVector_ReturnValue_1) == 0x0005DC, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0005E8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0005F4, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_GetActorScale3D_ReturnValue_2) == 0x0005F8, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_GetActorScale3D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000604, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x00068C, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_X_3) == 0x000690, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Piramid2_C_ExecuteUbergraph_piramid2, CallFunc_BreakVector_Y_3) == 0x000694, "Member 'Piramid2_C_ExecuteUbergraph_piramid2::CallFunc_BreakVector_Y_3' has a wrong offset!");
