#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Portal_phys

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function portal_phys.portal_phys_C.dreamInv
// 0x0018 (0x0018 - 0x0000)
struct Portal_phys_C_DreamInv final
{
public:
	TArray<struct FStruct_save>                   Invv;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ADreamBase_C*                           Base;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_DreamInv) == 0x000008, "Wrong alignment on Portal_phys_C_DreamInv");
static_assert(sizeof(Portal_phys_C_DreamInv) == 0x000018, "Wrong size on Portal_phys_C_DreamInv");
static_assert(offsetof(Portal_phys_C_DreamInv, Invv) == 0x000000, "Member 'Portal_phys_C_DreamInv::Invv' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_DreamInv, Base) == 0x000010, "Member 'Portal_phys_C_DreamInv::Base' has a wrong offset!");

// Function portal_phys.portal_phys_C.getPriceMultiplier
// 0x0004 (0x0004 - 0x0000)
struct Portal_phys_C_GetPriceMultiplier final
{
public:
	float                                         PriceMult;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_GetPriceMultiplier) == 0x000004, "Wrong alignment on Portal_phys_C_GetPriceMultiplier");
static_assert(sizeof(Portal_phys_C_GetPriceMultiplier) == 0x000004, "Wrong size on Portal_phys_C_GetPriceMultiplier");
static_assert(offsetof(Portal_phys_C_GetPriceMultiplier, PriceMult) == 0x000000, "Member 'Portal_phys_C_GetPriceMultiplier::PriceMult' has a wrong offset!");

// Function portal_phys.portal_phys_C.skipRadial
// 0x0001 (0x0001 - 0x0000)
struct Portal_phys_C_SkipRadial final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_SkipRadial) == 0x000001, "Wrong alignment on Portal_phys_C_SkipRadial");
static_assert(sizeof(Portal_phys_C_SkipRadial) == 0x000001, "Wrong size on Portal_phys_C_SkipRadial");
static_assert(offsetof(Portal_phys_C_SkipRadial, Skip) == 0x000000, "Member 'Portal_phys_C_SkipRadial::Skip' has a wrong offset!");

// Function portal_phys.portal_phys_C.gascanFuel
// 0x0010 (0x0010 - 0x0000)
struct Portal_phys_C_GascanFuel final
{
public:
	class AProp_gascan_C*                         Gascan;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fueled;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_GascanFuel) == 0x000008, "Wrong alignment on Portal_phys_C_GascanFuel");
static_assert(sizeof(Portal_phys_C_GascanFuel) == 0x000010, "Wrong size on Portal_phys_C_GascanFuel");
static_assert(offsetof(Portal_phys_C_GascanFuel, Gascan) == 0x000000, "Member 'Portal_phys_C_GascanFuel::Gascan' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GascanFuel, Fueled) == 0x000008, "Member 'Portal_phys_C_GascanFuel::Fueled' has a wrong offset!");

// Function portal_phys.portal_phys_C.toolboxFix
// 0x0010 (0x0010 - 0x0000)
struct Portal_phys_C_ToolboxFix final
{
public:
	class AProp_toolbox_C*                        Toolbox;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_ToolboxFix) == 0x000008, "Wrong alignment on Portal_phys_C_ToolboxFix");
static_assert(sizeof(Portal_phys_C_ToolboxFix) == 0x000010, "Wrong size on Portal_phys_C_ToolboxFix");
static_assert(offsetof(Portal_phys_C_ToolboxFix, Toolbox) == 0x000000, "Member 'Portal_phys_C_ToolboxFix::Toolbox' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_ToolboxFix, Return) == 0x000008, "Member 'Portal_phys_C_ToolboxFix::Return' has a wrong offset!");

// Function portal_phys.portal_phys_C.GetKey
// 0x0048 (0x0048 - 0x0000)
struct Portal_phys_C_GetKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x0018(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BytesToBase64Url_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_GetKey) == 0x000008, "Wrong alignment on Portal_phys_C_GetKey");
static_assert(sizeof(Portal_phys_C_GetKey) == 0x000048, "Wrong size on Portal_phys_C_GetKey");
static_assert(offsetof(Portal_phys_C_GetKey, Param_Key) == 0x000000, "Member 'Portal_phys_C_GetKey::Param_Key' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'Portal_phys_C_GetKey::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_GenerateRandomBytes_ByteArray) == 0x000018, "Member 'Portal_phys_C_GetKey::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_BytesToBase64Url_ReturnValue) == 0x000028, "Member 'Portal_phys_C_GetKey::CallFunc_BytesToBase64Url_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'Portal_phys_C_GetKey::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_Array_Add_ReturnValue_1) == 0x00003C, "Member 'Portal_phys_C_GetKey::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_Array_Find_ReturnValue) == 0x000040, "Member 'Portal_phys_C_GetKey::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'Portal_phys_C_GetKey::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetKey, CallFunc_IsEmpty_ReturnValue) == 0x000045, "Member 'Portal_phys_C_GetKey::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function portal_phys.portal_phys_C.canBeUsedHold
// 0x0001 (0x0001 - 0x0000)
struct Portal_phys_C_CanBeUsedHold final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_CanBeUsedHold) == 0x000001, "Wrong alignment on Portal_phys_C_CanBeUsedHold");
static_assert(sizeof(Portal_phys_C_CanBeUsedHold) == 0x000001, "Wrong size on Portal_phys_C_CanBeUsedHold");
static_assert(offsetof(Portal_phys_C_CanBeUsedHold, Return) == 0x000000, "Member 'Portal_phys_C_CanBeUsedHold::Return' has a wrong offset!");

// Function portal_phys.portal_phys_C.processKeys
// 0x0030 (0x0030 - 0x0000)
struct Portal_phys_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APortal_phys_C*                         K2Node_DynamicCast_AsPortal_Phys;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_ProcessKeys) == 0x000008, "Wrong alignment on Portal_phys_C_ProcessKeys");
static_assert(sizeof(Portal_phys_C_ProcessKeys) == 0x000030, "Wrong size on Portal_phys_C_ProcessKeys");
static_assert(offsetof(Portal_phys_C_ProcessKeys, Return) == 0x000000, "Member 'Portal_phys_C_ProcessKeys::Return' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_ProcessKeys, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Portal_phys_C_ProcessKeys::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_ProcessKeys, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'Portal_phys_C_ProcessKeys::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_ProcessKeys, CallFunc_getObjectFromKey_Output) == 0x000018, "Member 'Portal_phys_C_ProcessKeys::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_ProcessKeys, K2Node_DynamicCast_AsPortal_Phys) == 0x000020, "Member 'Portal_phys_C_ProcessKeys::K2Node_DynamicCast_AsPortal_Phys' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_ProcessKeys, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Portal_phys_C_ProcessKeys::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function portal_phys.portal_phys_C.getOnlyKey
// 0x0010 (0x0010 - 0x0000)
struct Portal_phys_C_GetOnlyKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_GetOnlyKey) == 0x000008, "Wrong alignment on Portal_phys_C_GetOnlyKey");
static_assert(sizeof(Portal_phys_C_GetOnlyKey) == 0x000010, "Wrong size on Portal_phys_C_GetOnlyKey");
static_assert(offsetof(Portal_phys_C_GetOnlyKey, Param_Key) == 0x000000, "Member 'Portal_phys_C_GetOnlyKey::Param_Key' has a wrong offset!");

// Function portal_phys.portal_phys_C.setPath
// 0x0018 (0x0018 - 0x0000)
struct Portal_phys_C_SetPath final
{
public:
	TArray<struct FVector>                        Path;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_SetPath) == 0x000008, "Wrong alignment on Portal_phys_C_SetPath");
static_assert(sizeof(Portal_phys_C_SetPath) == 0x000018, "Wrong size on Portal_phys_C_SetPath");
static_assert(offsetof(Portal_phys_C_SetPath, Path) == 0x000000, "Member 'Portal_phys_C_SetPath::Path' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_SetPath, Return) == 0x000010, "Member 'Portal_phys_C_SetPath::Return' has a wrong offset!");

// Function portal_phys.portal_phys_C.getActionOptions
// 0x0050 (0x0050 - 0x0000)
struct Portal_phys_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_GetActionOptions) == 0x000008, "Wrong alignment on Portal_phys_C_GetActionOptions");
static_assert(sizeof(Portal_phys_C_GetActionOptions) == 0x000050, "Wrong size on Portal_phys_C_GetActionOptions");
static_assert(offsetof(Portal_phys_C_GetActionOptions, Player) == 0x000000, "Member 'Portal_phys_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetActionOptions, Component) == 0x000008, "Member 'Portal_phys_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetActionOptions, Actor) == 0x000010, "Member 'Portal_phys_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetActionOptions, Options) == 0x000018, "Member 'Portal_phys_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Portal_phys_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Portal_phys_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetActionOptions, Number) == 0x000048, "Member 'Portal_phys_C_GetActionOptions::Number' has a wrong offset!");

// Function portal_phys.portal_phys_C.gatherDataFromKeyT
// 0x0001 (0x0001 - 0x0000)
struct Portal_phys_C_GatherDataFromKeyT final
{
public:
	bool                                          Gather;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_GatherDataFromKeyT) == 0x000001, "Wrong alignment on Portal_phys_C_GatherDataFromKeyT");
static_assert(sizeof(Portal_phys_C_GatherDataFromKeyT) == 0x000001, "Wrong size on Portal_phys_C_GatherDataFromKeyT");
static_assert(offsetof(Portal_phys_C_GatherDataFromKeyT, Gather) == 0x000000, "Member 'Portal_phys_C_GatherDataFromKeyT::Gather' has a wrong offset!");

// Function portal_phys.portal_phys_C.getTriggerData
// 0x0230 (0x0230 - 0x0000)
struct Portal_phys_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0100(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_triggerSave                    K2Node_MakeStruct_struct_triggerSave;              // 0x0140(0x00F0)(HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_GetTriggerData) == 0x000010, "Wrong alignment on Portal_phys_C_GetTriggerData");
static_assert(sizeof(Portal_phys_C_GetTriggerData) == 0x000230, "Wrong size on Portal_phys_C_GetTriggerData");
static_assert(offsetof(Portal_phys_C_GetTriggerData, Data) == 0x000000, "Member 'Portal_phys_C_GetTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetTriggerData, K2Node_MakeArray_Array) == 0x0000F0, "Member 'Portal_phys_C_GetTriggerData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetTriggerData, CallFunc_GetTransform_ReturnValue) == 0x000100, "Member 'Portal_phys_C_GetTriggerData::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetTriggerData, CallFunc_GetObjectClass_ReturnValue) == 0x000130, "Member 'Portal_phys_C_GetTriggerData::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_GetTriggerData, K2Node_MakeStruct_struct_triggerSave) == 0x000140, "Member 'Portal_phys_C_GetTriggerData::K2Node_MakeStruct_struct_triggerSave' has a wrong offset!");

// Function portal_phys.portal_phys_C.loadTriggerData
// 0x0110 (0x0110 - 0x0000)
struct Portal_phys_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_LoadTriggerData) == 0x000010, "Wrong alignment on Portal_phys_C_LoadTriggerData");
static_assert(sizeof(Portal_phys_C_LoadTriggerData) == 0x000110, "Wrong size on Portal_phys_C_LoadTriggerData");
static_assert(offsetof(Portal_phys_C_LoadTriggerData, Data) == 0x000000, "Member 'Portal_phys_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_LoadTriggerData, Return) == 0x0000F0, "Member 'Portal_phys_C_LoadTriggerData::Return' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_LoadTriggerData, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'Portal_phys_C_LoadTriggerData::CallFunc_Array_Get_Item' has a wrong offset!");

// Function portal_phys.portal_phys_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Portal_phys_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on Portal_phys_C_IgnoreSave_trigger");
static_assert(sizeof(Portal_phys_C_IgnoreSave_trigger) == 0x000001, "Wrong size on Portal_phys_C_IgnoreSave_trigger");
static_assert(offsetof(Portal_phys_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'Portal_phys_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function portal_phys.portal_phys_C.noScale
// 0x00C0 (0x00C0 - 0x0000)
struct Portal_phys_C_NoScale final
{
public:
	struct FTransform                             InTransform;                                       // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ReturnValue;                                       // 0x0030(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_NoScale) == 0x000010, "Wrong alignment on Portal_phys_C_NoScale");
static_assert(sizeof(Portal_phys_C_NoScale) == 0x0000C0, "Wrong size on Portal_phys_C_NoScale");
static_assert(offsetof(Portal_phys_C_NoScale, InTransform) == 0x000000, "Member 'Portal_phys_C_NoScale::InTransform' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_NoScale, ReturnValue) == 0x000030, "Member 'Portal_phys_C_NoScale::ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_NoScale, CallFunc_BreakTransform_Location) == 0x000060, "Member 'Portal_phys_C_NoScale::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_NoScale, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'Portal_phys_C_NoScale::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_NoScale, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'Portal_phys_C_NoScale::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_NoScale, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'Portal_phys_C_NoScale::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function portal_phys.portal_phys_C.rebuild
// 0x00B0 (0x00B0 - 0x0000)
struct Portal_phys_C_Rebuild final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_Rebuild) == 0x000010, "Wrong alignment on Portal_phys_C_Rebuild");
static_assert(sizeof(Portal_phys_C_Rebuild) == 0x0000B0, "Wrong size on Portal_phys_C_Rebuild");
static_assert(offsetof(Portal_phys_C_Rebuild, Temp_int_Variable) == 0x000000, "Member 'Portal_phys_C_Rebuild::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, Temp_struct_Variable) == 0x000010, "Member 'Portal_phys_C_Rebuild::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'Portal_phys_C_Rebuild::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'Portal_phys_C_Rebuild::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, Temp_int_Array_Index_Variable) == 0x000050, "Member 'Portal_phys_C_Rebuild::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'Portal_phys_C_Rebuild::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Array_Get_Item) == 0x000058, "Member 'Portal_phys_C_Rebuild::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'Portal_phys_C_Rebuild::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'Portal_phys_C_Rebuild::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'Portal_phys_C_Rebuild::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'Portal_phys_C_Rebuild::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'Portal_phys_C_Rebuild::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'Portal_phys_C_Rebuild::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Less_IntInt_ReturnValue_1) == 0x000080, "Member 'Portal_phys_C_Rebuild::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000088, "Member 'Portal_phys_C_Rebuild::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000090, "Member 'Portal_phys_C_Rebuild::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'Portal_phys_C_Rebuild::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_Array_Add_ReturnValue_1) == 0x00009C, "Member 'Portal_phys_C_Rebuild::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_Rebuild, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A0, "Member 'Portal_phys_C_Rebuild::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function portal_phys.portal_phys_C.UserConstructionScript
// 0x04A8 (0x04A8 - 0x0000)
struct Portal_phys_C_UserConstructionScript final
{
public:
	class APortal_C*                              K2Node_DynamicCast_AsPortal;                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_8;                 // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_9;                 // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_8;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_getKey_self_CastInput;                    // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_getKey_key;                               // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_9;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_10;                // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_11;                // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0154(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01DC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0264(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x02EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APortal_C*                              K2Node_DynamicCast_AsPortal_1;                     // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APortal_C*                              K2Node_DynamicCast_AsPortal_2;                     // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_4;  // 0x0394(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_5;  // 0x041C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Portal_phys_C_UserConstructionScript) == 0x000008, "Wrong alignment on Portal_phys_C_UserConstructionScript");
static_assert(sizeof(Portal_phys_C_UserConstructionScript) == 0x0004A8, "Wrong size on Portal_phys_C_UserConstructionScript");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, K2Node_DynamicCast_AsPortal) == 0x000000, "Member 'Portal_phys_C_UserConstructionScript::K2Node_DynamicCast_AsPortal' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Portal_phys_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x00000C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000018, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000024, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000030, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000034, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000038, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x00003C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x00004C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000050, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000054, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x00006C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000078, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000080, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x00008C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000098, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00009C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_4) == 0x0000A4, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_5) == 0x0000B0, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000BC, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0000C0, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x0000C4, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x0000C8, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_6) == 0x0000CC, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_7) == 0x0000D8, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x0000E4, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_5) == 0x0000E8, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x0000EC, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x0000F0, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_8) == 0x0000F4, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_9) == 0x000100, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_8) == 0x00010C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_getKey_self_CastInput) == 0x000110, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_getKey_self_CastInput' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_getKey_key) == 0x000120, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_6) == 0x000130, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_9) == 0x000134, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_7) == 0x000138, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_10) == 0x00013C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_11) == 0x000148, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000154, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0001DC, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000264, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x0002EC, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, K2Node_DynamicCast_AsPortal_1) == 0x000378, "Member 'Portal_phys_C_UserConstructionScript::K2Node_DynamicCast_AsPortal_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_1) == 0x000380, "Member 'Portal_phys_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, K2Node_DynamicCast_AsPortal_2) == 0x000388, "Member 'Portal_phys_C_UserConstructionScript::K2Node_DynamicCast_AsPortal_2' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_2) == 0x000390, "Member 'Portal_phys_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_4) == 0x000394, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_5) == 0x00041C, "Member 'Portal_phys_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_5' has a wrong offset!");

// Function portal_phys.portal_phys_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Portal_phys_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_StuffUpgraded) == 0x000008, "Wrong alignment on Portal_phys_C_StuffUpgraded");
static_assert(sizeof(Portal_phys_C_StuffUpgraded) == 0x000008, "Wrong size on Portal_phys_C_StuffUpgraded");
static_assert(offsetof(Portal_phys_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Portal_phys_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function portal_phys.portal_phys_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct Portal_phys_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_SettingsApplied) == 0x000008, "Wrong alignment on Portal_phys_C_SettingsApplied");
static_assert(sizeof(Portal_phys_C_SettingsApplied) == 0x0000F0, "Wrong size on Portal_phys_C_SettingsApplied");
static_assert(offsetof(Portal_phys_C_SettingsApplied, Settings) == 0x000000, "Member 'Portal_phys_C_SettingsApplied::Settings' has a wrong offset!");

// Function portal_phys.portal_phys_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Portal_phys_C_AnyKey final
{
public:
	struct FKey                                   Param_Key;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_phys_C_AnyKey) == 0x000008, "Wrong alignment on Portal_phys_C_AnyKey");
static_assert(sizeof(Portal_phys_C_AnyKey) == 0x000020, "Wrong size on Portal_phys_C_AnyKey");
static_assert(offsetof(Portal_phys_C_AnyKey, Param_Key) == 0x000000, "Member 'Portal_phys_C_AnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_AnyKey, Pressed) == 0x000018, "Member 'Portal_phys_C_AnyKey::Pressed' has a wrong offset!");

// Function portal_phys.portal_phys_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Portal_phys_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_ApplyColor) == 0x000004, "Wrong alignment on Portal_phys_C_ApplyColor");
static_assert(sizeof(Portal_phys_C_ApplyColor) == 0x000010, "Wrong size on Portal_phys_C_ApplyColor");
static_assert(offsetof(Portal_phys_C_ApplyColor, Color) == 0x000000, "Member 'Portal_phys_C_ApplyColor::Color' has a wrong offset!");

// Function portal_phys.portal_phys_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct Portal_phys_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_phys_C_TexturePickerApply) == 0x000008, "Wrong alignment on Portal_phys_C_TexturePickerApply");
static_assert(sizeof(Portal_phys_C_TexturePickerApply) == 0x000018, "Wrong size on Portal_phys_C_TexturePickerApply");
static_assert(offsetof(Portal_phys_C_TexturePickerApply, Picker) == 0x000000, "Member 'Portal_phys_C_TexturePickerApply::Picker' has a wrong offset!");
static_assert(offsetof(Portal_phys_C_TexturePickerApply, Texture) == 0x000008, "Member 'Portal_phys_C_TexturePickerApply::Texture' has a wrong offset!");
