#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Portal

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function portal.portal_C.dreamInv
// 0x0018 (0x0018 - 0x0000)
struct Portal_C_DreamInv final
{
public:
	TArray<struct FStruct_save>                   Invv;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ADreamBase_C*                           Param_Base;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_DreamInv) == 0x000008, "Wrong alignment on Portal_C_DreamInv");
static_assert(sizeof(Portal_C_DreamInv) == 0x000018, "Wrong size on Portal_C_DreamInv");
static_assert(offsetof(Portal_C_DreamInv, Invv) == 0x000000, "Member 'Portal_C_DreamInv::Invv' has a wrong offset!");
static_assert(offsetof(Portal_C_DreamInv, Param_Base) == 0x000010, "Member 'Portal_C_DreamInv::Param_Base' has a wrong offset!");

// Function portal.portal_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct Portal_C_SetActive final
{
public:
	bool                                          Param_IsActive;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_C_SetActive) == 0x000001, "Wrong alignment on Portal_C_SetActive");
static_assert(sizeof(Portal_C_SetActive) == 0x000001, "Wrong size on Portal_C_SetActive");
static_assert(offsetof(Portal_C_SetActive, Param_IsActive) == 0x000000, "Member 'Portal_C_SetActive::Param_IsActive' has a wrong offset!");

// Function portal.portal_C.applyVisual
// 0x0008 (0x0008 - 0x0000)
struct Portal_C_ApplyVisual final
{
public:
	float                                         CallFunc_GetMinElement_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_C_ApplyVisual) == 0x000004, "Wrong alignment on Portal_C_ApplyVisual");
static_assert(sizeof(Portal_C_ApplyVisual) == 0x000008, "Wrong size on Portal_C_ApplyVisual");
static_assert(offsetof(Portal_C_ApplyVisual, CallFunc_GetMinElement_ReturnValue) == 0x000000, "Member 'Portal_C_ApplyVisual::CallFunc_GetMinElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_C_ApplyVisual, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Portal_C_ApplyVisual::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_C_ApplyVisual, CallFunc_SetStaticMesh_ReturnValue) == 0x000005, "Member 'Portal_C_ApplyVisual::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function portal.portal_C.Render
// 0x0001 (0x0001 - 0x0000)
struct Portal_C_Render final
{
public:
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_C_Render) == 0x000001, "Wrong alignment on Portal_C_Render");
static_assert(sizeof(Portal_C_Render) == 0x000001, "Wrong size on Portal_C_Render");
static_assert(offsetof(Portal_C_Render, CallFunc_BooleanAND_ReturnValue) == 0x000000, "Member 'Portal_C_Render::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function portal.portal_C.makeRt
// 0x0018 (0x0018 - 0x0000)
struct Portal_C_MakeRt final
{
public:
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Conv_Vector2DToIntPoint_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_MakeRt) == 0x000008, "Wrong alignment on Portal_C_MakeRt");
static_assert(sizeof(Portal_C_MakeRt) == 0x000018, "Wrong size on Portal_C_MakeRt");
static_assert(offsetof(Portal_C_MakeRt, CallFunc_GetViewportSize_ReturnValue) == 0x000000, "Member 'Portal_C_MakeRt::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_C_MakeRt, CallFunc_Conv_Vector2DToIntPoint_ReturnValue) == 0x000008, "Member 'Portal_C_MakeRt::CallFunc_Conv_Vector2DToIntPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(Portal_C_MakeRt, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000010, "Member 'Portal_C_MakeRt::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");

// Function portal.portal_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Portal_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_ApplyColor) == 0x000004, "Wrong alignment on Portal_C_ApplyColor");
static_assert(sizeof(Portal_C_ApplyColor) == 0x000010, "Wrong size on Portal_C_ApplyColor");
static_assert(offsetof(Portal_C_ApplyColor, Color) == 0x000000, "Member 'Portal_C_ApplyColor::Color' has a wrong offset!");

// Function portal.portal_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct Portal_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_TexturePickerApply) == 0x000008, "Wrong alignment on Portal_C_TexturePickerApply");
static_assert(sizeof(Portal_C_TexturePickerApply) == 0x000018, "Wrong size on Portal_C_TexturePickerApply");
static_assert(offsetof(Portal_C_TexturePickerApply, Picker) == 0x000000, "Member 'Portal_C_TexturePickerApply::Picker' has a wrong offset!");
static_assert(offsetof(Portal_C_TexturePickerApply, Texture) == 0x000008, "Member 'Portal_C_TexturePickerApply::Texture' has a wrong offset!");
static_assert(offsetof(Portal_C_TexturePickerApply, Param_Index) == 0x000010, "Member 'Portal_C_TexturePickerApply::Param_Index' has a wrong offset!");

// Function portal.portal_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct Portal_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_SettingsApplied) == 0x000008, "Wrong alignment on Portal_C_SettingsApplied");
static_assert(sizeof(Portal_C_SettingsApplied) == 0x0000F0, "Wrong size on Portal_C_SettingsApplied");
static_assert(offsetof(Portal_C_SettingsApplied, Settings) == 0x000000, "Member 'Portal_C_SettingsApplied::Settings' has a wrong offset!");

// Function portal.portal_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Portal_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_ReceiveTick) == 0x000004, "Wrong alignment on Portal_C_ReceiveTick");
static_assert(sizeof(Portal_C_ReceiveTick) == 0x000004, "Wrong size on Portal_C_ReceiveTick");
static_assert(offsetof(Portal_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Portal_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function portal.portal_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Portal_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_C_AnyKey) == 0x000008, "Wrong alignment on Portal_C_AnyKey");
static_assert(sizeof(Portal_C_AnyKey) == 0x000020, "Wrong size on Portal_C_AnyKey");
static_assert(offsetof(Portal_C_AnyKey, Key) == 0x000000, "Member 'Portal_C_AnyKey::Key' has a wrong offset!");
static_assert(offsetof(Portal_C_AnyKey, Pressed) == 0x000018, "Member 'Portal_C_AnyKey::Pressed' has a wrong offset!");

// Function portal.portal_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Portal_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Portal_C_StuffUpgraded) == 0x000008, "Wrong alignment on Portal_C_StuffUpgraded");
static_assert(sizeof(Portal_C_StuffUpgraded) == 0x000008, "Wrong size on Portal_C_StuffUpgraded");
static_assert(offsetof(Portal_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Portal_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function portal.portal_C.fl
// 0x0010 (0x0010 - 0x0000)
struct Portal_C_Fl final
{
public:
	class USpotLightComponent*                    Light;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Portal_C_Fl) == 0x000008, "Wrong alignment on Portal_C_Fl");
static_assert(sizeof(Portal_C_Fl) == 0x000010, "Wrong size on Portal_C_Fl");
static_assert(offsetof(Portal_C_Fl, Light) == 0x000000, "Member 'Portal_C_Fl::Light' has a wrong offset!");
static_assert(offsetof(Portal_C_Fl, Visible) == 0x000008, "Member 'Portal_C_Fl::Visible' has a wrong offset!");

// Function portal.portal_C.ExecuteUbergraph_portal
// 0x0570 (0x0570 - 0x0000)
struct Portal_C_ExecuteUbergraph_portal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USpotLightComponent* Light, bool Visible)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           K2Node_Event_color;                                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0040(0x00F0)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0180(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x0288(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x02A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    K2Node_CustomEvent_light;                          // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_visible;                        // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x03C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_3;     // 0x03F0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChildActor_ReturnValue;                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43B[0x5];                                      // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_4;     // 0x0440(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0xF];                                      // 0x0471(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue_1;      // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x04B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x04E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Portal_C_ExecuteUbergraph_portal) == 0x000010, "Wrong alignment on Portal_C_ExecuteUbergraph_portal");
static_assert(sizeof(Portal_C_ExecuteUbergraph_portal) == 0x000570, "Wrong size on Portal_C_ExecuteUbergraph_portal");
static_assert(offsetof(Portal_C_ExecuteUbergraph_portal, EntryPoint) == 0x000000, "Member 'Portal_C_ExecuteUbergraph_portal::EntryPoint' has a wrong offset!");
static_assert(offsetof(Portal_C_ExecuteUbergraph_portal, Temp_bool_Variable) == 0x000004, "Member 'Portal_C_ExecuteUbergraph_portal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Portal_C_ExecuteUbergraph_portal, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Portal_C_ExecuteUbergraph_portal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
