#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrintedObject

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "Struct_dangerProp_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_customMesh_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_mVector_structs.hpp"
#include "Struct_multisectionCustomMesh_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function printedObject.printedObject_C.ExecuteUbergraph_printedObject
// 0x06D0 (0x06D0 - 0x0000)
struct PrintedObject_C_ExecuteUbergraph_printedObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key_2;                                // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0130(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x01C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0258(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0340(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0370(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0438(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_getKey_key;                               // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0524(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x05AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x05C8(0x00F0)(HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_impactDamage_self_CastInput;              // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ExecuteUbergraph_printedObject) == 0x000008, "Wrong alignment on PrintedObject_C_ExecuteUbergraph_printedObject");
static_assert(sizeof(PrintedObject_C_ExecuteUbergraph_printedObject) == 0x0006D0, "Wrong size on PrintedObject_C_ExecuteUbergraph_printedObject");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, EntryPoint) == 0x000000, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_key_2) == 0x000008, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_pressed_1) == 0x000020, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_color) == 0x000024, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_picker) == 0x000038, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_texture) == 0x000040, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_index) == 0x000048, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_5) == 0x00004C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_5) == 0x000050, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_actor_1) == 0x0000D8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_impact_1) == 0x0000E0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water_3) == 0x0000F0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water_2) == 0x0000F8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water_1) == 0x000100, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_water) == 0x000108, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_activate) == 0x000110, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_static) == 0x000111, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_frozen) == 0x000112, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_active) == 0x000113, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_key_1) == 0x000118, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_12) == 0x000128, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_4) == 0x000130, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_4) == 0x0001B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_fuel) == 0x0001BC, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_3) == 0x0001C0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hot) == 0x0001C4, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_11) == 0x000250, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_3) == 0x000258, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_action) == 0x0002E0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_10) == 0x0002E8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_9) == 0x0002F0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_2) == 0x0002F8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_location_1) == 0x0002FC, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_8) == 0x000308, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_7) == 0x000310, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_6) == 0x000318, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_wheelDelta) == 0x000320, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_5) == 0x000328, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_mouse) == 0x000330, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_4) == 0x000338, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_key) == 0x000340, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_pressed) == 0x000358, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_temperature_1) == 0x00035C, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_temperature) == 0x000360, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_speed) == 0x000364, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_3) == 0x000368, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_2) == 0x000370, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_name) == 0x0003F8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_volume) == 0x000408, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_2) == 0x000410, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_location) == 0x000418, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage_1) == 0x000424, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_clean_1) == 0x000428, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player_1) == 0x000430, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit_1) == 0x000438, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hook_1) == 0x0004C0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_clean) == 0x0004C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_player) == 0x0004D0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hook) == 0x0004D8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_ignore) == 0x0004E0, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getKey_key) == 0x0004E8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0004F8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Array_Add_ReturnValue) == 0x000500, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000508, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Array_RemoveItem_ReturnValue) == 0x000510, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_actor) == 0x000518, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_damage) == 0x000520, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_hit) == 0x000524, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_impact) == 0x0005AC, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_skipSetting) == 0x0005B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0005BC, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_settings) == 0x0005C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, CallFunc_impactDamage_self_CastInput) == 0x0006B8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::CallFunc_impactDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ExecuteUbergraph_printedObject, K2Node_Event_gamemode) == 0x0006C8, "Member 'PrintedObject_C_ExecuteUbergraph_printedObject::K2Node_Event_gamemode' has a wrong offset!");

// Function printedObject.printedObject_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_StuffUpgraded) == 0x000008, "Wrong alignment on PrintedObject_C_StuffUpgraded");
static_assert(sizeof(PrintedObject_C_StuffUpgraded) == 0x000008, "Wrong size on PrintedObject_C_StuffUpgraded");
static_assert(offsetof(PrintedObject_C_StuffUpgraded, GameMode) == 0x000000, "Member 'PrintedObject_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function printedObject.printedObject_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct PrintedObject_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_SettingsApplied) == 0x000008, "Wrong alignment on PrintedObject_C_SettingsApplied");
static_assert(sizeof(PrintedObject_C_SettingsApplied) == 0x0000F0, "Wrong size on PrintedObject_C_SettingsApplied");
static_assert(offsetof(PrintedObject_C_SettingsApplied, Settings) == 0x000000, "Member 'PrintedObject_C_SettingsApplied::Settings' has a wrong offset!");

// Function printedObject.printedObject_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct PrintedObject_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_AddDamage) == 0x000008, "Wrong alignment on PrintedObject_C_AddDamage");
static_assert(sizeof(PrintedObject_C_AddDamage) == 0x0000A8, "Wrong size on PrintedObject_C_AddDamage");
static_assert(offsetof(PrintedObject_C_AddDamage, Actor) == 0x000000, "Member 'PrintedObject_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, Damage) == 0x000008, "Member 'PrintedObject_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, Hit) == 0x00000C, "Member 'PrintedObject_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, Impact) == 0x000094, "Member 'PrintedObject_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'PrintedObject_C_AddDamage::SkipSetting' has a wrong offset!");

// Function printedObject.printedObject_C.setIgnoreSave
// 0x0001 (0x0001 - 0x0000)
struct PrintedObject_C_SetIgnoreSave final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_SetIgnoreSave) == 0x000001, "Wrong alignment on PrintedObject_C_SetIgnoreSave");
static_assert(sizeof(PrintedObject_C_SetIgnoreSave) == 0x000001, "Wrong size on PrintedObject_C_SetIgnoreSave");
static_assert(offsetof(PrintedObject_C_SetIgnoreSave, Ignore) == 0x000000, "Member 'PrintedObject_C_SetIgnoreSave::Ignore' has a wrong offset!");

// Function printedObject.printedObject_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_HookTension) == 0x000008, "Wrong alignment on PrintedObject_C_HookTension");
static_assert(sizeof(PrintedObject_C_HookTension) == 0x000008, "Wrong size on PrintedObject_C_HookTension");
static_assert(offsetof(PrintedObject_C_HookTension, Hook) == 0x000000, "Member 'PrintedObject_C_HookTension::Hook' has a wrong offset!");

// Function printedObject.printedObject_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_CleanSponge) == 0x000008, "Wrong alignment on PrintedObject_C_CleanSponge");
static_assert(sizeof(PrintedObject_C_CleanSponge) == 0x000010, "Wrong size on PrintedObject_C_CleanSponge");
static_assert(offsetof(PrintedObject_C_CleanSponge, Clean) == 0x000000, "Member 'PrintedObject_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_CleanSponge, Player) == 0x000008, "Member 'PrintedObject_C_CleanSponge::Player' has a wrong offset!");

// Function printedObject.printedObject_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_Hooked) == 0x000008, "Wrong alignment on PrintedObject_C_Hooked");
static_assert(sizeof(PrintedObject_C_Hooked) == 0x000008, "Wrong size on PrintedObject_C_Hooked");
static_assert(offsetof(PrintedObject_C_Hooked, Hook) == 0x000000, "Member 'PrintedObject_C_Hooked::Hook' has a wrong offset!");

// Function printedObject.printedObject_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct PrintedObject_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PrintedObject_C_PlayerUsedOn) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerUsedOn");
static_assert(sizeof(PrintedObject_C_PlayerUsedOn) == 0x000090, "Wrong size on PrintedObject_C_PlayerUsedOn");
static_assert(offsetof(PrintedObject_C_PlayerUsedOn, Player) == 0x000000, "Member 'PrintedObject_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerUsedOn, Hit) == 0x000008, "Member 'PrintedObject_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function printedObject.printedObject_C.slice
// 0x0001 (0x0001 - 0x0000)
struct PrintedObject_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_Slice) == 0x000001, "Wrong alignment on PrintedObject_C_Slice");
static_assert(sizeof(PrintedObject_C_Slice) == 0x000001, "Wrong size on PrintedObject_C_Slice");
static_assert(offsetof(PrintedObject_C_Slice, Clean) == 0x000000, "Member 'PrintedObject_C_Slice::Clean' has a wrong offset!");

// Function printedObject.printedObject_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ReachedByExplosion) == 0x000004, "Wrong alignment on PrintedObject_C_ReachedByExplosion");
static_assert(sizeof(PrintedObject_C_ReachedByExplosion) == 0x000010, "Wrong size on PrintedObject_C_ReachedByExplosion");
static_assert(offsetof(PrintedObject_C_ReachedByExplosion, Location) == 0x000000, "Member 'PrintedObject_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'PrintedObject_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function printedObject.printedObject_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerLookAway) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerLookAway");
static_assert(sizeof(PrintedObject_C_PlayerLookAway) == 0x000008, "Wrong size on PrintedObject_C_PlayerLookAway");
static_assert(offsetof(PrintedObject_C_PlayerLookAway, Player) == 0x000000, "Member 'PrintedObject_C_PlayerLookAway::Player' has a wrong offset!");

// Function printedObject.printedObject_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct PrintedObject_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_Stepped) == 0x000004, "Wrong alignment on PrintedObject_C_Stepped");
static_assert(sizeof(PrintedObject_C_Stepped) == 0x000004, "Wrong size on PrintedObject_C_Stepped");
static_assert(offsetof(PrintedObject_C_Stepped, Volume) == 0x000000, "Member 'PrintedObject_C_Stepped::Volume' has a wrong offset!");

// Function printedObject.printedObject_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct PrintedObject_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ActionName) == 0x000008, "Wrong alignment on PrintedObject_C_ActionName");
static_assert(sizeof(PrintedObject_C_ActionName) == 0x0000A0, "Wrong size on PrintedObject_C_ActionName");
static_assert(offsetof(PrintedObject_C_ActionName, Player) == 0x000000, "Member 'PrintedObject_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionName, Hit) == 0x000008, "Member 'PrintedObject_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionName, Param_Name) == 0x000090, "Member 'PrintedObject_C_ActionName::Param_Name' has a wrong offset!");

// Function printedObject.printedObject_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_AccumulateTemperature) == 0x000004, "Wrong alignment on PrintedObject_C_AccumulateTemperature");
static_assert(sizeof(PrintedObject_C_AccumulateTemperature) == 0x000008, "Wrong size on PrintedObject_C_AccumulateTemperature");
static_assert(offsetof(PrintedObject_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'PrintedObject_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_AccumulateTemperature, Speed) == 0x000004, "Member 'PrintedObject_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function printedObject.printedObject_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct PrintedObject_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_AddTemperature) == 0x000004, "Wrong alignment on PrintedObject_C_AddTemperature");
static_assert(sizeof(PrintedObject_C_AddTemperature) == 0x000004, "Wrong size on PrintedObject_C_AddTemperature");
static_assert(offsetof(PrintedObject_C_AddTemperature, Temperature) == 0x000000, "Member 'PrintedObject_C_AddTemperature::Temperature' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct PrintedObject_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Param_Key;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PrintedObject_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandAnyKey");
static_assert(sizeof(PrintedObject_C_PlayerHandAnyKey) == 0x000028, "Wrong size on PrintedObject_C_PlayerHandAnyKey");
static_assert(offsetof(PrintedObject_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandAnyKey, Param_Key) == 0x000008, "Member 'PrintedObject_C_PlayerHandAnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'PrintedObject_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandMouse) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandMouse");
static_assert(sizeof(PrintedObject_C_PlayerHandMouse) == 0x000010, "Wrong size on PrintedObject_C_PlayerHandMouse");
static_assert(offsetof(PrintedObject_C_PlayerHandMouse, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'PrintedObject_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandMouseWheel");
static_assert(sizeof(PrintedObject_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on PrintedObject_C_PlayerHandMouseWheel");
static_assert(offsetof(PrintedObject_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'PrintedObject_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandRelease_LMB");
static_assert(sizeof(PrintedObject_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on PrintedObject_C_PlayerHandRelease_LMB");
static_assert(offsetof(PrintedObject_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandRelease_RMB");
static_assert(sizeof(PrintedObject_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on PrintedObject_C_PlayerHandRelease_RMB");
static_assert(offsetof(PrintedObject_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function printedObject.printedObject_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct PrintedObject_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_Exploded) == 0x000004, "Wrong alignment on PrintedObject_C_Exploded");
static_assert(sizeof(PrintedObject_C_Exploded) == 0x000010, "Wrong size on PrintedObject_C_Exploded");
static_assert(offsetof(PrintedObject_C_Exploded, Damage) == 0x000000, "Member 'PrintedObject_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_Exploded, Location) == 0x000004, "Member 'PrintedObject_C_Exploded::Location' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandUse_LMB");
static_assert(sizeof(PrintedObject_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on PrintedObject_C_PlayerHandUse_LMB");
static_assert(offsetof(PrintedObject_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function printedObject.printedObject_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct PrintedObject_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on PrintedObject_C_PlayerHandUse_RMB");
static_assert(sizeof(PrintedObject_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on PrintedObject_C_PlayerHandUse_RMB");
static_assert(offsetof(PrintedObject_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'PrintedObject_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function printedObject.printedObject_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct PrintedObject_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_ActionOptionIndex) == 0x000008, "Wrong alignment on PrintedObject_C_ActionOptionIndex");
static_assert(sizeof(PrintedObject_C_ActionOptionIndex) == 0x000098, "Wrong size on PrintedObject_C_ActionOptionIndex");
static_assert(offsetof(PrintedObject_C_ActionOptionIndex, Player) == 0x000000, "Member 'PrintedObject_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionOptionIndex, Hit) == 0x000008, "Member 'PrintedObject_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ActionOptionIndex, Action) == 0x000090, "Member 'PrintedObject_C_ActionOptionIndex::Action' has a wrong offset!");

// Function printedObject.printedObject_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct PrintedObject_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PrintedObject_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on PrintedObject_C_ReceivedPhyiscsDamage");
static_assert(sizeof(PrintedObject_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on PrintedObject_C_ReceivedPhyiscsDamage");
static_assert(offsetof(PrintedObject_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'PrintedObject_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(PrintedObject_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'PrintedObject_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function printedObject.printedObject_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct PrintedObject_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_Ignite) == 0x000004, "Wrong alignment on PrintedObject_C_Ignite");
static_assert(sizeof(PrintedObject_C_Ignite) == 0x000004, "Wrong size on PrintedObject_C_Ignite");
static_assert(offsetof(PrintedObject_C_Ignite, Fuel) == 0x000000, "Member 'PrintedObject_C_Ignite::Fuel' has a wrong offset!");

// Function printedObject.printedObject_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct PrintedObject_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PrintedObject_C_FireDamage) == 0x000004, "Wrong alignment on PrintedObject_C_FireDamage");
static_assert(sizeof(PrintedObject_C_FireDamage) == 0x000004, "Wrong size on PrintedObject_C_FireDamage");
static_assert(offsetof(PrintedObject_C_FireDamage, Damage) == 0x000000, "Member 'PrintedObject_C_FireDamage::Damage' has a wrong offset!");

// Function printedObject.printedObject_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct PrintedObject_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
