#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_popcorn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_popcorn.prop_popcorn_C
// 0x0010 (0x0388 - 0x0378)
class AProp_popcorn_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_popcorn_C;                     // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Inflat;                                            // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EatenPerc;                                         // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_popcorn(int32 EntryPoint);
	void Pop();
	void Upd();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void Microwave();
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_popcorn_C">();
	}
	static class AProp_popcorn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_popcorn_C>();
	}
};
static_assert(alignof(AProp_popcorn_C) == 0x000008, "Wrong alignment on AProp_popcorn_C");
static_assert(sizeof(AProp_popcorn_C) == 0x000388, "Wrong size on AProp_popcorn_C");
static_assert(offsetof(AProp_popcorn_C, UberGraphFrame_Prop_popcorn_C) == 0x000378, "Member 'AProp_popcorn_C::UberGraphFrame_Prop_popcorn_C' has a wrong offset!");
static_assert(offsetof(AProp_popcorn_C, Inflat) == 0x000380, "Member 'AProp_popcorn_C::Inflat' has a wrong offset!");
static_assert(offsetof(AProp_popcorn_C, EatenPerc) == 0x000384, "Member 'AProp_popcorn_C::EatenPerc' has a wrong offset!");

}

