#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropSpawner_editor

#include "Basic.hpp"

#include "Struct_food1_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_prop_structs.hpp"


namespace SDK::Params
{

// Function propSpawner_editor.propSpawner_editor_C.ExecuteUbergraph_propSpawner_editor
// 0x0010 (0x0010 - 0x0000)
struct PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B73[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_spawn_OutputPin;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor) == 0x000008, "Wrong alignment on PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor");
static_assert(sizeof(PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor) == 0x000010, "Wrong size on PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor");
static_assert(offsetof(PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor, EntryPoint) == 0x000000, "Member 'PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor::EntryPoint' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor, CallFunc_spawn_OutputPin) == 0x000008, "Member 'PropSpawner_editor_C_ExecuteUbergraph_propSpawner_editor::CallFunc_spawn_OutputPin' has a wrong offset!");

// Function propSpawner_editor.propSpawner_editor_C.UserConstructionScript
// 0x0088 (0x0088 - 0x0000)
struct PropSpawner_editor_C_UserConstructionScript final
{
public:
	struct FStruct_prop                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PropSpawner_editor_C_UserConstructionScript) == 0x000008, "Wrong alignment on PropSpawner_editor_C_UserConstructionScript");
static_assert(sizeof(PropSpawner_editor_C_UserConstructionScript) == 0x000088, "Wrong size on PropSpawner_editor_C_UserConstructionScript");
static_assert(offsetof(PropSpawner_editor_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'PropSpawner_editor_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_UserConstructionScript, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'PropSpawner_editor_C_UserConstructionScript::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000081, "Member 'PropSpawner_editor_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function propSpawner_editor.propSpawner_editor_C.Spawn
// 0x0200 (0x0200 - 0x0000)
struct PropSpawner_editor_C_Spawn final
{
public:
	class AActor*                                 OutputPin;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B74[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B75[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x004C(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B76[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B77[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0078(0x0080)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B78[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B79[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7A[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return_1;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7B[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7C[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7D[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7E[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7F[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B80[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B81[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B82[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PropSpawner_editor_C_Spawn) == 0x000010, "Wrong alignment on PropSpawner_editor_C_Spawn");
static_assert(sizeof(PropSpawner_editor_C_Spawn) == 0x000200, "Wrong size on PropSpawner_editor_C_Spawn");
static_assert(offsetof(PropSpawner_editor_C_Spawn, OutputPin) == 0x000000, "Member 'PropSpawner_editor_C_Spawn::OutputPin' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PropSpawner_editor_C_Spawn::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'PropSpawner_editor_C_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_propToObject_ReturnValue) == 0x000048, "Member 'PropSpawner_editor_C_Spawn::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_propToObject_foodData) == 0x00004C, "Member 'PropSpawner_editor_C_Spawn::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_propToObject_object) == 0x000068, "Member 'PropSpawner_editor_C_Spawn::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_propToObject_isFood) == 0x000070, "Member 'PropSpawner_editor_C_Spawn::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_propToObject_propData) == 0x000078, "Member 'PropSpawner_editor_C_Spawn::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000F8, "Member 'PropSpawner_editor_C_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_IsValidClass_ReturnValue) == 0x000100, "Member 'PropSpawner_editor_C_Spawn::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'PropSpawner_editor_C_Spawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_AsInt_Player) == 0x000110, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000128, "Member 'PropSpawner_editor_C_Spawn::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_asProp_return) == 0x000130, "Member 'PropSpawner_editor_C_Spawn::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000138, "Member 'PropSpawner_editor_C_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000140, "Member 'PropSpawner_editor_C_Spawn::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_AsInt_Player_1) == 0x000148, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_AsInt_Player_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_asProp_return_1) == 0x000160, "Member 'PropSpawner_editor_C_Spawn::CallFunc_asProp_return_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_IsEmpty_ReturnValue) == 0x000168, "Member 'PropSpawner_editor_C_Spawn::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_AsInt_Objects) == 0x000170, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_AsInt_Save_1) == 0x000188, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_AsInt_Save_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0001A0, "Member 'PropSpawner_editor_C_Spawn::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_Array_Contains_ReturnValue) == 0x0001A8, "Member 'PropSpawner_editor_C_Spawn::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_IsEmpty_ReturnValue_1) == 0x0001A9, "Member 'PropSpawner_editor_C_Spawn::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_AsInt_Objects_1) == 0x0001B0, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_DynamicCast_bSuccess_4) == 0x0001C0, "Member 'PropSpawner_editor_C_Spawn::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, Temp_int_Variable) == 0x0001C4, "Member 'PropSpawner_editor_C_Spawn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, Temp_int_Variable_1) == 0x0001C8, "Member 'PropSpawner_editor_C_Spawn::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001CC, "Member 'PropSpawner_editor_C_Spawn::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_Add_IntInt_ReturnValue) == 0x0001D0, "Member 'PropSpawner_editor_C_Spawn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, Temp_int_Variable_2) == 0x0001D4, "Member 'PropSpawner_editor_C_Spawn::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, Temp_int_Variable_3) == 0x0001D8, "Member 'PropSpawner_editor_C_Spawn::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, K2Node_Select_Default) == 0x0001E0, "Member 'PropSpawner_editor_C_Spawn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001E8, "Member 'PropSpawner_editor_C_Spawn::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001EC, "Member 'PropSpawner_editor_C_Spawn::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, Temp_int_Variable_4) == 0x0001F0, "Member 'PropSpawner_editor_C_Spawn::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001F4, "Member 'PropSpawner_editor_C_Spawn::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0001F8, "Member 'PropSpawner_editor_C_Spawn::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function propSpawner_editor.propSpawner_editor_C.despawn
// 0x000C (0x000C - 0x0000)
struct PropSpawner_editor_C_Despawn final
{
public:
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B83[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PropSpawner_editor_C_Despawn) == 0x000004, "Wrong alignment on PropSpawner_editor_C_Despawn");
static_assert(sizeof(PropSpawner_editor_C_Despawn) == 0x00000C, "Wrong size on PropSpawner_editor_C_Despawn");
static_assert(offsetof(PropSpawner_editor_C_Despawn, CallFunc_IsEmpty_ReturnValue) == 0x000000, "Member 'PropSpawner_editor_C_Despawn::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Despawn, CallFunc_GetDistanceTo_ReturnValue) == 0x000004, "Member 'PropSpawner_editor_C_Despawn::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Despawn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'PropSpawner_editor_C_Despawn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Despawn, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'PropSpawner_editor_C_Despawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function propSpawner_editor.propSpawner_editor_C.spawn_treehouse
// 0x01F0 (0x01F0 - 0x0000)
struct PropSpawner_editor_C_Spawn_treehouse final
{
public:
	class ATreehouse_C*                           Treehouse;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OutputPin;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B84[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B85[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B86[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B87[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x00B4(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B88[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B89[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x00E0(0x0080)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B8A[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player_1;                 // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B8B[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return_1;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B8C[0x5];                                     // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B8D[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B8E[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B8F[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PropSpawner_editor_C_Spawn_treehouse) == 0x000010, "Wrong alignment on PropSpawner_editor_C_Spawn_treehouse");
static_assert(sizeof(PropSpawner_editor_C_Spawn_treehouse) == 0x0001F0, "Wrong size on PropSpawner_editor_C_Spawn_treehouse");
static_assert(offsetof(PropSpawner_editor_C_Spawn_treehouse, Treehouse) == 0x000000, "Member 'PropSpawner_editor_C_Spawn_treehouse::Treehouse' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn_treehouse, OutputPin) == 0x000008, "Member 'PropSpawner_editor_C_Spawn_treehouse::OutputPin' has a wrong offset!");
static_assert(offsetof(PropSpawner_editor_C_Spawn_treehouse, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PropSpawner_editor_C_Spawn_treehouse::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
