#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_crystal_explode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_crystal_explode.prop_crystal_explode_C.ExecuteUbergraph_prop_crystal_explode
// 0x0060 (0x0060 - 0x0000)
struct Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode) == 0x000010, "Wrong alignment on Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode");
static_assert(sizeof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode) == 0x000060, "Wrong size on Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode");
static_assert(offsetof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode, EntryPoint) == 0x000000, "Member 'Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode, CallFunc_Add_VectorVector_ReturnValue) == 0x000010, "Member 'Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Prop_crystal_explode_C_ExecuteUbergraph_prop_crystal_explode::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

