#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_drive

#include "Basic.hpp"

#include "Struct_signalDataDynamic_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_signal_data1_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_drive.prop_drive_C
// 0x0260 (0x05D8 - 0x0378)
class AProp_drive_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_drive_C;                       // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P;                                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Panel;                                             // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Kicked_0;                                          // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_signal_data1                   DataPaste;                                         // 0x0398(0x01D0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_signalDataDynamic              Data_0;                                            // 0x0568(0x0070)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_drive(int32 EntryPoint);
	void BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Param_Hit);
	void Upd();
	void Inserted();
	void Imported();
	void Exported();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void Kicked(bool Kick);
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void IsButtonUsed(bool* Failed);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_drive_C">();
	}
	static class AProp_drive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_drive_C>();
	}
};
static_assert(alignof(AProp_drive_C) == 0x000008, "Wrong alignment on AProp_drive_C");
static_assert(sizeof(AProp_drive_C) == 0x0005D8, "Wrong size on AProp_drive_C");
static_assert(offsetof(AProp_drive_C, UberGraphFrame_Prop_drive_C) == 0x000378, "Member 'AProp_drive_C::UberGraphFrame_Prop_drive_C' has a wrong offset!");
static_assert(offsetof(AProp_drive_C, P) == 0x000380, "Member 'AProp_drive_C::P' has a wrong offset!");
static_assert(offsetof(AProp_drive_C, Panel) == 0x000388, "Member 'AProp_drive_C::Panel' has a wrong offset!");
static_assert(offsetof(AProp_drive_C, Kicked_0) == 0x000390, "Member 'AProp_drive_C::Kicked_0' has a wrong offset!");
static_assert(offsetof(AProp_drive_C, DataPaste) == 0x000398, "Member 'AProp_drive_C::DataPaste' has a wrong offset!");
static_assert(offsetof(AProp_drive_C, Data_0) == 0x000568, "Member 'AProp_drive_C::Data_0' has a wrong offset!");

}

