#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_hexpillar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_hexpillar.prop_hexpillar_C.ExecuteUbergraph_prop_hexpillar
// 0x0050 (0x0050 - 0x0000)
struct Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHexpillar_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar) == 0x000010, "Wrong alignment on Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar");
static_assert(sizeof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar) == 0x000050, "Wrong size on Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar");
static_assert(offsetof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar, EntryPoint) == 0x000000, "Member 'Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_hexpillar_C_ExecuteUbergraph_prop_hexpillar::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

