#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wallAttachable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wallAttachable.prop_wallAttachable_C
// 0x0098 (0x0410 - 0x0378)
#pragma pack(push, 0x1)
class alignas(0x10) AProp_wallAttachable_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wallAttachable_C;              // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Stick;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_a_CA19E13042411C2EBCE2C084B23FE79E;     // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_CA19E13042411C2EBCE2C084B23FE79E; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoStick;                                           // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Tr_A;                                              // 0x03A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Tr_B;                                              // 0x03D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Dir;                                               // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreParentUnstick;                               // 0x0404(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_wallAttachable(int32 EntryPoint);
	void Dest(class AActor* DestroyedActor);
	void ForceStick();
	void Sticking();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void TryStick(struct FHitResult* OutHit);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void SetPropProps(bool Param_Static, bool Param_Frozen, bool Active);
	void ReceiveBeginPlay();
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wallAttachable_C">();
	}
	static class AProp_wallAttachable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wallAttachable_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AProp_wallAttachable_C) == 0x000010, "Wrong alignment on AProp_wallAttachable_C");
static_assert(sizeof(AProp_wallAttachable_C) == 0x000410, "Wrong size on AProp_wallAttachable_C");
static_assert(offsetof(AProp_wallAttachable_C, UberGraphFrame_Prop_wallAttachable_C) == 0x000378, "Member 'AProp_wallAttachable_C::UberGraphFrame_Prop_wallAttachable_C' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Stick) == 0x000380, "Member 'AProp_wallAttachable_C::Stick' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Timeline_0_a_CA19E13042411C2EBCE2C084B23FE79E) == 0x000388, "Member 'AProp_wallAttachable_C::Timeline_0_a_CA19E13042411C2EBCE2C084B23FE79E' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Timeline_0__Direction_CA19E13042411C2EBCE2C084B23FE79E) == 0x00038C, "Member 'AProp_wallAttachable_C::Timeline_0__Direction_CA19E13042411C2EBCE2C084B23FE79E' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Timeline_0) == 0x000390, "Member 'AProp_wallAttachable_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, DoStick) == 0x000398, "Member 'AProp_wallAttachable_C::DoStick' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Tr_A) == 0x0003A0, "Member 'AProp_wallAttachable_C::Tr_A' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Tr_B) == 0x0003D0, "Member 'AProp_wallAttachable_C::Tr_B' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, Dir) == 0x000400, "Member 'AProp_wallAttachable_C::Dir' has a wrong offset!");
static_assert(offsetof(AProp_wallAttachable_C, IgnoreParentUnstick) == 0x000404, "Member 'AProp_wallAttachable_C::IgnoreParentUnstick' has a wrong offset!");

}

