#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_sequence

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_wireComponent_sequence.prop_wireComponent_sequence_C.ExecuteUbergraph_prop_wireComponent_sequence
// 0x0070 (0x0070 - 0x0000)
struct Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BF5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                K2Node_Event_wire_2;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_side_1;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF6[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWire_C*                                K2Node_Event_wire_1;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_side;                                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                K2Node_Event_wire;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF9[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWire_C*                                CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence) == 0x000008, "Wrong alignment on Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence");
static_assert(sizeof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence) == 0x000070, "Wrong size on Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, EntryPoint) == 0x000000, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, K2Node_Event_wire_2) == 0x000008, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::K2Node_Event_wire_2' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, K2Node_Event_side_1) == 0x000010, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::K2Node_Event_side_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, K2Node_Event_wire_1) == 0x000018, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::K2Node_Event_wire_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, K2Node_Event_side) == 0x000020, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::K2Node_Event_side' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, K2Node_Event_wire) == 0x000028, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::K2Node_Event_wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_Get_Item) == 0x000038, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000044, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_LastIndex_ReturnValue) == 0x00004C, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000050, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, Temp_int_Variable) == 0x000058, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Percent_IntInt_ReturnValue) == 0x00005C, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000068, "Member 'Prop_wireComponent_sequence_C_ExecuteUbergraph_prop_wireComponent_sequence::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");

// Function prop_wireComponent_sequence.prop_wireComponent_sequence_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wireComponent_sequence_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_sequence_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wireComponent_sequence_C_ReceiveTick");
static_assert(sizeof(Prop_wireComponent_sequence_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wireComponent_sequence_C_ReceiveTick");
static_assert(offsetof(Prop_wireComponent_sequence_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wireComponent_sequence_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_wireComponent_sequence.prop_wireComponent_sequence_C.wirePass
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_sequence_C_WirePass final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_sequence_C_WirePass) == 0x000008, "Wrong alignment on Prop_wireComponent_sequence_C_WirePass");
static_assert(sizeof(Prop_wireComponent_sequence_C_WirePass) == 0x000008, "Wrong size on Prop_wireComponent_sequence_C_WirePass");
static_assert(offsetof(Prop_wireComponent_sequence_C_WirePass, Wire) == 0x000000, "Member 'Prop_wireComponent_sequence_C_WirePass::Wire' has a wrong offset!");

// Function prop_wireComponent_sequence.prop_wireComponent_sequence_C.wireDisconnected
// 0x0010 (0x0010 - 0x0000)
struct Prop_wireComponent_sequence_C_WireDisconnected final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Side;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wireComponent_sequence_C_WireDisconnected) == 0x000008, "Wrong alignment on Prop_wireComponent_sequence_C_WireDisconnected");
static_assert(sizeof(Prop_wireComponent_sequence_C_WireDisconnected) == 0x000010, "Wrong size on Prop_wireComponent_sequence_C_WireDisconnected");
static_assert(offsetof(Prop_wireComponent_sequence_C_WireDisconnected, Wire) == 0x000000, "Member 'Prop_wireComponent_sequence_C_WireDisconnected::Wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_WireDisconnected, Side) == 0x000008, "Member 'Prop_wireComponent_sequence_C_WireDisconnected::Side' has a wrong offset!");

// Function prop_wireComponent_sequence.prop_wireComponent_sequence_C.wireConnected
// 0x0010 (0x0010 - 0x0000)
struct Prop_wireComponent_sequence_C_WireConnected final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Side;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wireComponent_sequence_C_WireConnected) == 0x000008, "Wrong alignment on Prop_wireComponent_sequence_C_WireConnected");
static_assert(sizeof(Prop_wireComponent_sequence_C_WireConnected) == 0x000010, "Wrong size on Prop_wireComponent_sequence_C_WireConnected");
static_assert(offsetof(Prop_wireComponent_sequence_C_WireConnected, Wire) == 0x000000, "Member 'Prop_wireComponent_sequence_C_WireConnected::Wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_sequence_C_WireConnected, Side) == 0x000008, "Member 'Prop_wireComponent_sequence_C_WireConnected::Side' has a wrong offset!");

}

