#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_spotlight

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"


namespace SDK::Params
{

// Function prop_spotlight.prop_spotlight_C.ExecuteUbergraph_prop_spotlight
// 0x0018 (0x0018 - 0x0000)
struct Prop_spotlight_C_ExecuteUbergraph_prop_spotlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_spotlightHead_C*                  K2Node_DynamicCast_AsProp_Spotlight_Head;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_spotlight_C_ExecuteUbergraph_prop_spotlight) == 0x000008, "Wrong alignment on Prop_spotlight_C_ExecuteUbergraph_prop_spotlight");
static_assert(sizeof(Prop_spotlight_C_ExecuteUbergraph_prop_spotlight) == 0x000018, "Wrong size on Prop_spotlight_C_ExecuteUbergraph_prop_spotlight");
static_assert(offsetof(Prop_spotlight_C_ExecuteUbergraph_prop_spotlight, EntryPoint) == 0x000000, "Member 'Prop_spotlight_C_ExecuteUbergraph_prop_spotlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_ExecuteUbergraph_prop_spotlight, K2Node_DynamicCast_AsProp_Spotlight_Head) == 0x000008, "Member 'Prop_spotlight_C_ExecuteUbergraph_prop_spotlight::K2Node_DynamicCast_AsProp_Spotlight_Head' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_ExecuteUbergraph_prop_spotlight, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Prop_spotlight_C_ExecuteUbergraph_prop_spotlight::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function prop_spotlight.prop_spotlight_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_spotlight_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_loadData_return;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_spotlight_C_LoadData) == 0x000010, "Wrong alignment on Prop_spotlight_C_LoadData");
static_assert(sizeof(Prop_spotlight_C_LoadData) == 0x0000E0, "Wrong size on Prop_spotlight_C_LoadData");
static_assert(offsetof(Prop_spotlight_C_LoadData, Data) == 0x000000, "Member 'Prop_spotlight_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_LoadData, Return) == 0x0000C0, "Member 'Prop_spotlight_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_spotlight_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_LoadData, CallFunc_loadData_return) == 0x0000D8, "Member 'Prop_spotlight_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D9, "Member 'Prop_spotlight_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_spotlight.prop_spotlight_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_spotlight_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x0180(0x0010)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_spotlight_C_GetData) == 0x000010, "Wrong alignment on Prop_spotlight_C_GetData");
static_assert(sizeof(Prop_spotlight_C_GetData) == 0x000280, "Wrong size on Prop_spotlight_C_GetData");
static_assert(offsetof(Prop_spotlight_C_GetData, Data) == 0x000000, "Member 'Prop_spotlight_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_spotlight_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_GetData, CallFunc_Array_Get_Item) == 0x000180, "Member 'Prop_spotlight_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_GetData, K2Node_MakeArray_Array) == 0x000190, "Member 'Prop_spotlight_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x0001A0, "Member 'Prop_spotlight_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_spotlight_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_spotlight_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_spotlight_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

