#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_cockroachNest

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_cockroachNest.prop_cockroachNest_C.ExecuteUbergraph_prop_cockroachNest
// 0x00D0 (0x00D0 - 0x0000)
struct Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest) == 0x000008, "Wrong alignment on Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest");
static_assert(sizeof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest) == 0x0000D0, "Wrong size on Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, EntryPoint) == 0x000000, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, K2Node_Event_player) == 0x000008, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, K2Node_Event_hit) == 0x000010, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, K2Node_Event_action) == 0x000098, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000A0, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, CallFunc_GetActorUpVector_ReturnValue) == 0x0000A8, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B4, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C0, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'Prop_cockroachNest_C_ExecuteUbergraph_prop_cockroachNest::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function prop_cockroachNest.prop_cockroachNest_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_cockroachNest_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cockroachNest_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_cockroachNest_C_ActionOptionIndex");
static_assert(sizeof(Prop_cockroachNest_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_cockroachNest_C_ActionOptionIndex");
static_assert(offsetof(Prop_cockroachNest_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_cockroachNest_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_cockroachNest_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_cockroachNest_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_cockroachNest.prop_cockroachNest_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_cockroachNest_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_cockroachNest_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_cockroachNest_C_GetActionOptions");
static_assert(sizeof(Prop_cockroachNest_C_GetActionOptions) == 0x000060, "Wrong size on Prop_cockroachNest_C_GetActionOptions");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_cockroachNest_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_cockroachNest_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_cockroachNest_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_cockroachNest_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_cockroachNest_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_cockroachNest_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_cockroachNest_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_cockroachNest_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_cockroachNest_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

