#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_arirGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_arirGun.prop_arirGun_C.ExecuteUbergraph_prop_arirGun
// 0x03A0 (0x03A0 - 0x0000)
struct Prop_arirGun_C_ExecuteUbergraph_prop_arirGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D8D[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D8E[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_3;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D8F[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D90[0xC];                                     // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D91[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D92[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AArirGun_shoot_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D93[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x01DC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D94[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D95[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D96[0x2];                                     // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D97[0x2];                                     // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x02A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D98[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D99[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x02E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9A[0x2];                                     // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9B[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x0384(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9C[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun) == 0x000010, "Wrong alignment on Prop_arirGun_C_ExecuteUbergraph_prop_arirGun");
static_assert(sizeof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun) == 0x0003A0, "Wrong size on Prop_arirGun_C_ExecuteUbergraph_prop_arirGun");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, EntryPoint) == 0x000000, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_9) == 0x000004, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_8) == 0x00000C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_7) == 0x000024, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_6) == 0x00003C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_5) == 0x000054, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_name_Variable) == 0x00006C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_bool_Variable) == 0x000074, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_SwitchName_CmpSuccess) == 0x000075, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_name_Variable_1) == 0x000078, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_name_Variable_2) == 0x000080, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_bool_Variable_1) == 0x000088, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_object_Variable) == 0x000090, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_object_Variable_1) == 0x000098, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_4) == 0x0000A0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000A8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_3) == 0x0000B8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000C0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_2) == 0x0000D0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000D8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName_1) == 0x0000E8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000F0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CustomEvent_NotifyName) == 0x000100, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_8) == 0x000108, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_name_Variable_3) == 0x000118, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_bool_Variable_2) == 0x000120, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_name_Variable_4) == 0x000124, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, Temp_name_Variable_5) == 0x00012C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000140, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_GetForwardVector_ReturnValue) == 0x000170, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000188, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_FinishSpawningActor_ReturnValue) == 0x000198, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001A0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001B0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_ComponentBoundEvent_HitComponent) == 0x0001B8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_ComponentBoundEvent_OtherActor) == 0x0001C0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_ComponentBoundEvent_OtherComp) == 0x0001C8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0001D0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_ComponentBoundEvent_Hit) == 0x0001DC, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_GetActorForwardVector_ReturnValue) == 0x000264, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_VSize_ReturnValue) == 0x000270, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000274, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000280, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000284, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000290, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_DeltaSeconds) == 0x000294, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000298, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000299, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00029C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0002A0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_BooleanAND_ReturnValue) == 0x0002A1, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Select_Default) == 0x0002A4, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0002B0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Select_Default_1) == 0x0002C0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002C8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_player_2) == 0x0002D8, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_hit) == 0x0002E0, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_index) == 0x000368, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_action) == 0x00036C, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_SwitchEnum_CmpSuccess) == 0x00036D, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_player_1) == 0x000370, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Event_player) == 0x000378, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_Not_PreBool_ReturnValue) == 0x000380, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_BooleanAND_ReturnValue_1) == 0x000381, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, K2Node_Select_Default_2) == 0x000384, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000390, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ExecuteUbergraph_prop_arirGun, CallFunc_IsValid_ReturnValue_1) == 0x000398, "Member 'Prop_arirGun_C_ExecuteUbergraph_prop_arirGun::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_arirGun_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_arirGun_C_ActionOptionIndex");
static_assert(sizeof(Prop_arirGun_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_arirGun_C_ActionOptionIndex");
static_assert(offsetof(Prop_arirGun_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_arirGun_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_arirGun_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Prop_arirGun_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_ActionOptionIndex, Action) == 0x000094, "Member 'Prop_arirGun_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_arirGun_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_arirGun_C_ReceiveTick");
static_assert(sizeof(Prop_arirGun_C_ReceiveTick) == 0x000004, "Wrong size on Prop_arirGun_C_ReceiveTick");
static_assert(offsetof(Prop_arirGun_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_arirGun_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Param_Hit) == 0x000024, "Member 'Prop_arirGun_C_BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Param_Hit' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(sizeof(Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000008, "Wrong size on Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(offsetof(Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnCompleted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(sizeof(Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000008, "Wrong size on Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(offsetof(Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnBlendOut_23E3CDBB47E01E6EE50CC0B3CDFDD7B4::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(sizeof(Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000008, "Wrong size on Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(offsetof(Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnInterrupted_23E3CDBB47E01E6EE50CC0B3CDFDD7B4::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(sizeof(Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000008, "Wrong size on Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(offsetof(Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnNotifyBegin_23E3CDBB47E01E6EE50CC0B3CDFDD7B4::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(sizeof(Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4) == 0x000008, "Wrong size on Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4");
static_assert(offsetof(Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnNotifyEnd_23E3CDBB47E01E6EE50CC0B3CDFDD7B4::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnCompleted_0B09162B49A54CB47986BFBCC0891E88
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88");
static_assert(sizeof(Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88) == 0x000008, "Wrong size on Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88");
static_assert(offsetof(Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnCompleted_0B09162B49A54CB47986BFBCC0891E88::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnBlendOut_0B09162B49A54CB47986BFBCC0891E88
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88");
static_assert(sizeof(Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88) == 0x000008, "Wrong size on Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88");
static_assert(offsetof(Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnBlendOut_0B09162B49A54CB47986BFBCC0891E88::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnInterrupted_0B09162B49A54CB47986BFBCC0891E88
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88");
static_assert(sizeof(Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88) == 0x000008, "Wrong size on Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88");
static_assert(offsetof(Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnInterrupted_0B09162B49A54CB47986BFBCC0891E88::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88");
static_assert(sizeof(Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88) == 0x000008, "Wrong size on Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88");
static_assert(offsetof(Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnNotifyBegin_0B09162B49A54CB47986BFBCC0891E88::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88) == 0x000004, "Wrong alignment on Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88");
static_assert(sizeof(Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88) == 0x000008, "Wrong size on Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88");
static_assert(offsetof(Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88, NotifyName) == 0x000000, "Member 'Prop_arirGun_C_OnNotifyEnd_0B09162B49A54CB47986BFBCC0891E88::NotifyName' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_arirGun_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_arirGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_arirGun_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_arirGun_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_arirGun_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_arirGun_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_arirGun_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_arirGun_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_arirGun_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_arirGun_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_arirGun_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_arirGun_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9D[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_2;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_arirGun_C_LoadData) == 0x000010, "Wrong alignment on Prop_arirGun_C_LoadData");
static_assert(sizeof(Prop_arirGun_C_LoadData) == 0x0000E0, "Wrong size on Prop_arirGun_C_LoadData");
static_assert(offsetof(Prop_arirGun_C_LoadData, Data) == 0x000000, "Member 'Prop_arirGun_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_LoadData, Return) == 0x0000C0, "Member 'Prop_arirGun_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_arirGun_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_arirGun_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_arirGun_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_LoadData, CallFunc_Array_Get_Item_2) == 0x0000D9, "Member 'Prop_arirGun_C_LoadData::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_arirGun_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_arirGun_C_GetData) == 0x000010, "Wrong alignment on Prop_arirGun_C_GetData");
static_assert(sizeof(Prop_arirGun_C_GetData) == 0x000280, "Wrong size on Prop_arirGun_C_GetData");
static_assert(offsetof(Prop_arirGun_C_GetData, Data) == 0x000000, "Member 'Prop_arirGun_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_arirGun_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_arirGun_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Prop_arirGun_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_arirGun_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_arirGun_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_arirGun_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_arirGun.prop_arirGun_C.getActionOptions
// 0x0058 (0x0058 - 0x0000)
struct Prop_arirGun_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_arirGun_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_arirGun_C_GetActionOptions");
static_assert(sizeof(Prop_arirGun_C_GetActionOptions) == 0x000058, "Wrong size on Prop_arirGun_C_GetActionOptions");
static_assert(offsetof(Prop_arirGun_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_arirGun_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_arirGun_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_arirGun_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_arirGun_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_arirGun_C_GetActionOptions::Options' has a wrong offset!");
