#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_balloon

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_balloon.prop_balloon_C.ExecuteUbergraph_prop_balloon
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_balloon_C_ExecuteUbergraph_prop_balloon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_getKey_self_CastInput;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_getKey_key;                               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E4E[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ANail_C*                                K2Node_CustomEvent_nail;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4F[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E50[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Prop_balloon_C_ExecuteUbergraph_prop_balloon) == 0x000010, "Wrong alignment on Prop_balloon_C_ExecuteUbergraph_prop_balloon");
static_assert(sizeof(Prop_balloon_C_ExecuteUbergraph_prop_balloon) == 0x0000F0, "Wrong size on Prop_balloon_C_ExecuteUbergraph_prop_balloon");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, EntryPoint) == 0x000000, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_getKey_self_CastInput) == 0x000008, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_getKey_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_getKey_key) == 0x000018, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00002C, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_CustomEvent_DestroyedActor) == 0x000038, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_BreakVector_X) == 0x00004C, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_BreakVector_Y) == 0x000050, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_BreakVector_Z) == 0x000054, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_DynamicCast_AsInt_Objects) == 0x000058, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000069, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_CustomEvent_nail) == 0x000070, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_CustomEvent_nail' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000078, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_DynamicCast_AsPrimitive_Component) == 0x000090, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, CallFunc_InverseTransformLocation_ReturnValue) == 0x0000D0, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ExecuteUbergraph_prop_balloon, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'Prop_balloon_C_ExecuteUbergraph_prop_balloon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function prop_balloon.prop_balloon_C.setNail
// 0x0008 (0x0008 - 0x0000)
struct Prop_balloon_C_SetNail final
{
public:
	class ANail_C*                                Param_Nail;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_balloon_C_SetNail) == 0x000008, "Wrong alignment on Prop_balloon_C_SetNail");
static_assert(sizeof(Prop_balloon_C_SetNail) == 0x000008, "Wrong size on Prop_balloon_C_SetNail");
static_assert(offsetof(Prop_balloon_C_SetNail, Param_Nail) == 0x000000, "Member 'Prop_balloon_C_SetNail::Param_Nail' has a wrong offset!");

// Function prop_balloon.prop_balloon_C.dess
// 0x0008 (0x0008 - 0x0000)
struct Prop_balloon_C_Dess final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_balloon_C_Dess) == 0x000008, "Wrong alignment on Prop_balloon_C_Dess");
static_assert(sizeof(Prop_balloon_C_Dess) == 0x000008, "Wrong size on Prop_balloon_C_Dess");
static_assert(offsetof(Prop_balloon_C_Dess, DestroyedActor) == 0x000000, "Member 'Prop_balloon_C_Dess::DestroyedActor' has a wrong offset!");

// Function prop_balloon.prop_balloon_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_balloon_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_balloon_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_balloon_C_ReceiveTick");
static_assert(sizeof(Prop_balloon_C_ReceiveTick) == 0x000004, "Wrong size on Prop_balloon_C_ReceiveTick");
static_assert(offsetof(Prop_balloon_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_balloon_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_balloon.prop_balloon_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_balloon_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E51[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_balloon_C_LoadData) == 0x000010, "Wrong alignment on Prop_balloon_C_LoadData");
static_assert(sizeof(Prop_balloon_C_LoadData) == 0x0000F0, "Wrong size on Prop_balloon_C_LoadData");
static_assert(offsetof(Prop_balloon_C_LoadData, Data) == 0x000000, "Member 'Prop_balloon_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_LoadData, Return) == 0x0000C0, "Member 'Prop_balloon_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_balloon_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_balloon_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_balloon_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_balloon.prop_balloon_C.getData
// 0x01A0 (0x01A0 - 0x0000)
struct Prop_balloon_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mString                        K2Node_MakeStruct_struct_mString;                  // 0x0190(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_balloon_C_GetData) == 0x000010, "Wrong alignment on Prop_balloon_C_GetData");
static_assert(sizeof(Prop_balloon_C_GetData) == 0x0001A0, "Wrong size on Prop_balloon_C_GetData");
static_assert(offsetof(Prop_balloon_C_GetData, Data) == 0x000000, "Member 'Prop_balloon_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_balloon_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_balloon_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_GetData, K2Node_MakeStruct_struct_mString) == 0x000190, "Member 'Prop_balloon_C_GetData::K2Node_MakeStruct_struct_mString' has a wrong offset!");

// Function prop_balloon.prop_balloon_C.processKeys
// 0x0030 (0x0030 - 0x0000)
struct Prop_balloon_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E52[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_processKeys_return;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E53[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANail_C*                                K2Node_DynamicCast_AsNail;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_balloon_C_ProcessKeys) == 0x000008, "Wrong alignment on Prop_balloon_C_ProcessKeys");
static_assert(sizeof(Prop_balloon_C_ProcessKeys) == 0x000030, "Wrong size on Prop_balloon_C_ProcessKeys");
static_assert(offsetof(Prop_balloon_C_ProcessKeys, Return) == 0x000000, "Member 'Prop_balloon_C_ProcessKeys::Return' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ProcessKeys, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Prop_balloon_C_ProcessKeys::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ProcessKeys, CallFunc_getObjectFromKey_Output) == 0x000010, "Member 'Prop_balloon_C_ProcessKeys::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ProcessKeys, CallFunc_processKeys_return) == 0x000018, "Member 'Prop_balloon_C_ProcessKeys::CallFunc_processKeys_return' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ProcessKeys, K2Node_DynamicCast_AsNail) == 0x000020, "Member 'Prop_balloon_C_ProcessKeys::K2Node_DynamicCast_AsNail' has a wrong offset!");
static_assert(offsetof(Prop_balloon_C_ProcessKeys, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Prop_balloon_C_ProcessKeys::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

