#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_sponge_bucketPour

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_sponge_bucketPour.prop_sponge_bucketPour_C.ExecuteUbergraph_prop_sponge_bucketPour
// 0x02A0 (0x02A0 - 0x0000)
struct Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_hitcomp;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_otherac;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_othercomp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_InputPin4;                            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_InputPin5;                            // 0x002C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsProp_Sponge_P;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0240(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0260(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour) == 0x000008, "Wrong alignment on Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour");
static_assert(sizeof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour) == 0x0002A0, "Wrong size on Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, EntryPoint) == 0x000000, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_Event_hitcomp) == 0x000008, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_Event_hitcomp' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_Event_otherac) == 0x000010, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_Event_otherac' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_Event_othercomp) == 0x000018, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_Event_othercomp' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_Event_InputPin4) == 0x000020, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_Event_InputPin4' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_Event_InputPin5) == 0x00002C, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_Event_InputPin5' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B4, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B5, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_Time) == 0x0000B8, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_Distance) == 0x0000BC, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_Location) == 0x0000C0, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_ImpactPoint) == 0x0000CC, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_Normal) == 0x0000D8, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E4, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_ElementIndex) == 0x000114, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_FaceIndex) == 0x000118, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_TraceStart) == 0x00011C, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_BreakHitResult_TraceEnd) == 0x000128, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_GetObjectClass_ReturnValue) == 0x000138, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000140, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_ClassDynamicCast_AsProp_Sponge_P) == 0x000150, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_ClassDynamicCast_AsProp_Sponge_P' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_ClassDynamicCast_bSuccess) == 0x000158, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000160, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, Temp_int_Array_Index_Variable) == 0x000168, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00016C, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_GetComponentBounds_Origin) == 0x000178, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_GetComponentBounds_BoxExtent) == 0x000184, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_GetComponentBounds_SphereRadius) == 0x000190, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000194, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, Temp_int_Loop_Counter_Variable) == 0x0001A0, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A4, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x0001B0, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_Add_IntInt_ReturnValue) == 0x000238, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, Temp_object_Variable) == 0x000240, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000250, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_SphereOverlapActors_OutActors) == 0x000260, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_SphereOverlapActors_ReturnValue) == 0x000270, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_Array_Length_ReturnValue) == 0x000274, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_Less_IntInt_ReturnValue) == 0x000278, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, CallFunc_Array_Get_Item) == 0x000280, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_DynamicCast_AsInt_Objects) == 0x000288, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour, K2Node_DynamicCast_bSuccess) == 0x000298, "Member 'Prop_sponge_bucketPour_C_ExecuteUbergraph_prop_sponge_bucketPour::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function prop_sponge_bucketPour.prop_sponge_bucketPour_C.collided
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_sponge_bucketPour_C_Collided final
{
public:
	class UPrimitiveComponent*                    Hitcomp;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Otherac;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InputPin4;                                         // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             InputPin5;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_sponge_bucketPour_C_Collided) == 0x000008, "Wrong alignment on Prop_sponge_bucketPour_C_Collided");
static_assert(sizeof(Prop_sponge_bucketPour_C_Collided) == 0x0000B0, "Wrong size on Prop_sponge_bucketPour_C_Collided");
static_assert(offsetof(Prop_sponge_bucketPour_C_Collided, Hitcomp) == 0x000000, "Member 'Prop_sponge_bucketPour_C_Collided::Hitcomp' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_Collided, Otherac) == 0x000008, "Member 'Prop_sponge_bucketPour_C_Collided::Otherac' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_Collided, OtherComp) == 0x000010, "Member 'Prop_sponge_bucketPour_C_Collided::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_Collided, InputPin4) == 0x000018, "Member 'Prop_sponge_bucketPour_C_Collided::InputPin4' has a wrong offset!");
static_assert(offsetof(Prop_sponge_bucketPour_C_Collided, InputPin5) == 0x000024, "Member 'Prop_sponge_bucketPour_C_Collided::InputPin5' has a wrong offset!");

}

