#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_button

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_wireComponent_button.prop_wireComponent_button_C.ExecuteUbergraph_prop_wireComponent_button
// 0x00D8 (0x00D8 - 0x0000)
struct Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                K2Node_Event_wire;                                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_side;                                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button) == 0x000008, "Wrong alignment on Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button");
static_assert(sizeof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button) == 0x0000D8, "Wrong size on Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, EntryPoint) == 0x000000, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, Temp_int_Variable) == 0x000004, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_Event_wire) == 0x000020, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_Event_wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_Event_side) == 0x000028, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_Event_side' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_CustomEvent_DestroyedActor) == 0x000030, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_Event_player) == 0x000038, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_Event_hit) == 0x000040, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_Event_action) == 0x0000C8, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_SwitchEnum_CmpSuccess) == 0x0000C9, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, CallFunc_IsValid_ReturnValue) == 0x0000CA, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, K2Node_Event_DeltaSeconds) == 0x0000CC, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'Prop_wireComponent_button_C_ExecuteUbergraph_prop_wireComponent_button::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function prop_wireComponent_button.prop_wireComponent_button_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wireComponent_button_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_button_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wireComponent_button_C_ReceiveTick");
static_assert(sizeof(Prop_wireComponent_button_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wireComponent_button_C_ReceiveTick");
static_assert(offsetof(Prop_wireComponent_button_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wireComponent_button_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_wireComponent_button.prop_wireComponent_button_C.Dest
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_button_C_Dest final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_button_C_Dest) == 0x000008, "Wrong alignment on Prop_wireComponent_button_C_Dest");
static_assert(sizeof(Prop_wireComponent_button_C_Dest) == 0x000008, "Wrong size on Prop_wireComponent_button_C_Dest");
static_assert(offsetof(Prop_wireComponent_button_C_Dest, DestroyedActor) == 0x000000, "Member 'Prop_wireComponent_button_C_Dest::DestroyedActor' has a wrong offset!");

// Function prop_wireComponent_button.prop_wireComponent_button_C.wireConnected
// 0x0010 (0x0010 - 0x0000)
struct Prop_wireComponent_button_C_WireConnected final
{
public:
	class AWire_C*                                Param_Wire;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Side;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wireComponent_button_C_WireConnected) == 0x000008, "Wrong alignment on Prop_wireComponent_button_C_WireConnected");
static_assert(sizeof(Prop_wireComponent_button_C_WireConnected) == 0x000010, "Wrong size on Prop_wireComponent_button_C_WireConnected");
static_assert(offsetof(Prop_wireComponent_button_C_WireConnected, Param_Wire) == 0x000000, "Member 'Prop_wireComponent_button_C_WireConnected::Param_Wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_WireConnected, Side) == 0x000008, "Member 'Prop_wireComponent_button_C_WireConnected::Side' has a wrong offset!");

// Function prop_wireComponent_button.prop_wireComponent_button_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_wireComponent_button_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_button_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_wireComponent_button_C_ActionOptionIndex");
static_assert(sizeof(Prop_wireComponent_button_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_wireComponent_button_C_ActionOptionIndex");
static_assert(offsetof(Prop_wireComponent_button_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_wireComponent_button_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_wireComponent_button_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_wireComponent_button_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_wireComponent_button.prop_wireComponent_button_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_wireComponent_button_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_wireComponent_button_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_wireComponent_button_C_GetActionOptions");
static_assert(sizeof(Prop_wireComponent_button_C_GetActionOptions) == 0x000060, "Wrong size on Prop_wireComponent_button_C_GetActionOptions");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_wireComponent_button_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_wireComponent_button_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_wireComponent_button_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_wireComponent_button_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_wireComponent_button_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_wireComponent_button_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_wireComponent_button_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_button_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_wireComponent_button_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

