#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_dingusDies

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_dingusDies.prop_dingusDies_C.ExecuteUbergraph_prop_dingusDies
// 0x00D0 (0x00D0 - 0x0000)
struct Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies) == 0x000010, "Wrong alignment on Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies");
static_assert(sizeof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies) == 0x0000D0, "Wrong size on Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, EntryPoint) == 0x000000, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_Array_Get_Item) == 0x00001C, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000080, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_MakeTransform_ReturnValue_1) == 0x000090, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C0, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000C8, "Member 'Prop_dingusDies_C_ExecuteUbergraph_prop_dingusDies::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

}

