#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_welder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_welder.prop_welder_C.ExecuteUbergraph_prop_welder
// 0x0170 (0x0170 - 0x0000)
struct Prop_welder_C_ExecuteUbergraph_prop_welder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B8[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B9[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeld_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37BA[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37BB[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_welder_C_ExecuteUbergraph_prop_welder) == 0x000010, "Wrong alignment on Prop_welder_C_ExecuteUbergraph_prop_welder");
static_assert(sizeof(Prop_welder_C_ExecuteUbergraph_prop_welder) == 0x000170, "Wrong size on Prop_welder_C_ExecuteUbergraph_prop_welder");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, EntryPoint) == 0x000000, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, K2Node_Event_player) == 0x000008, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_bBlockingHit) == 0x000014, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_bInitialOverlap) == 0x000015, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Time) == 0x000018, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Distance) == 0x00001C, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Location) == 0x000020, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_ImpactPoint) == 0x00002C, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Normal) == 0x000038, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_ImpactNormal) == 0x000044, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_PhysMat) == 0x000050, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitActor) == 0x000058, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitComponent) == 0x000060, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitBoneName) == 0x000068, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitItem) == 0x000070, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_ElementIndex) == 0x000074, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_FaceIndex) == 0x000078, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_TraceStart) == 0x00007C, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_TraceEnd) == 0x000088, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, K2Node_Event_player_1) == 0x0000E0, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0000E8, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0000E9, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Time_1) == 0x0000EC, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Distance_1) == 0x0000F0, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Location_1) == 0x0000F4, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000100, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_Normal_1) == 0x00010C, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000118, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_PhysMat_1) == 0x000128, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitActor_1) == 0x000130, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitComponent_1) == 0x000138, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitBoneName_1) == 0x000140, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_HitItem_1) == 0x000148, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_ElementIndex_1) == 0x00014C, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_FaceIndex_1) == 0x000150, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_TraceStart_1) == 0x000154, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_welder_C_ExecuteUbergraph_prop_welder, CallFunc_BreakHitResult_TraceEnd_1) == 0x000160, "Member 'Prop_welder_C_ExecuteUbergraph_prop_welder::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");

// Function prop_welder.prop_welder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_welder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_welder_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_welder_C_ReceiveTick");
static_assert(sizeof(Prop_welder_C_ReceiveTick) == 0x000004, "Wrong size on Prop_welder_C_ReceiveTick");
static_assert(offsetof(Prop_welder_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_welder_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_welder.prop_welder_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_welder_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_welder_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Prop_welder_C_PlayerHandRelease_LMB");
static_assert(sizeof(Prop_welder_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Prop_welder_C_PlayerHandRelease_LMB");
static_assert(offsetof(Prop_welder_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Prop_welder_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function prop_welder.prop_welder_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_welder_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_welder_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_welder_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_welder_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_welder_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_welder_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_welder_C_PlayerHandUse_LMB::Player' has a wrong offset!");

}

