#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_flamethrower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_flamethrower.prop_flamethrower_C
// 0x0018 (0x0390 - 0x0378)
class AProp_flamethrower_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_flamethrower_C;                // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_flamethrower;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_flamethrower(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void FireRay();
	void PlayerHandRelease_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_flamethrower_C">();
	}
	static class AProp_flamethrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_flamethrower_C>();
	}
};
static_assert(alignof(AProp_flamethrower_C) == 0x000008, "Wrong alignment on AProp_flamethrower_C");
static_assert(sizeof(AProp_flamethrower_C) == 0x000390, "Wrong size on AProp_flamethrower_C");
static_assert(offsetof(AProp_flamethrower_C, UberGraphFrame_Prop_flamethrower_C) == 0x000378, "Member 'AProp_flamethrower_C::UberGraphFrame_Prop_flamethrower_C' has a wrong offset!");
static_assert(offsetof(AProp_flamethrower_C, Audio) == 0x000380, "Member 'AProp_flamethrower_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_flamethrower_C, Eff_flamethrower) == 0x000388, "Member 'AProp_flamethrower_C::Eff_flamethrower' has a wrong offset!");

}

