#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_argc

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_argc.prop_argc_C.ExecuteUbergraph_prop_argc
// 0x0004 (0x0004 - 0x0000)
struct Prop_argc_C_ExecuteUbergraph_prop_argc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argc_C_ExecuteUbergraph_prop_argc) == 0x000004, "Wrong alignment on Prop_argc_C_ExecuteUbergraph_prop_argc");
static_assert(sizeof(Prop_argc_C_ExecuteUbergraph_prop_argc) == 0x000004, "Wrong size on Prop_argc_C_ExecuteUbergraph_prop_argc");
static_assert(offsetof(Prop_argc_C_ExecuteUbergraph_prop_argc, EntryPoint) == 0x000000, "Member 'Prop_argc_C_ExecuteUbergraph_prop_argc::EntryPoint' has a wrong offset!");

// Function prop_argc.prop_argc_C.setmats
// 0x0018 (0x0018 - 0x0000)
struct Prop_argc_C_Setmats final
{
public:
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argc_C_Setmats) == 0x000008, "Wrong alignment on Prop_argc_C_Setmats");
static_assert(sizeof(Prop_argc_C_Setmats) == 0x000018, "Wrong size on Prop_argc_C_Setmats");
static_assert(offsetof(Prop_argc_C_Setmats, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000000, "Member 'Prop_argc_C_Setmats::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_argc_C_Setmats, CallFunc_Array_Get_Item) == 0x000008, "Member 'Prop_argc_C_Setmats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_argc_C_Setmats, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'Prop_argc_C_Setmats::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_argc.prop_argc_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Prop_argc_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argc_C_UserConstructionScript) == 0x000008, "Wrong alignment on Prop_argc_C_UserConstructionScript");
static_assert(sizeof(Prop_argc_C_UserConstructionScript) == 0x000010, "Wrong size on Prop_argc_C_UserConstructionScript");
static_assert(offsetof(Prop_argc_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Prop_argc_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argc_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'Prop_argc_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

