#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_ritualKnife

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_ritualKnife.prop_ritualKnife_C
// 0x0028 (0x0390 - 0x0368)
class AProp_ritualKnife_C final : public AProp_C
{
public:
	uint8                                         Pad_37EE[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_ritualKnife_C;                 // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVelocityStuck_C*                       VelocityStuck;                                     // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          Pl;                                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bloody;                                            // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_ritualKnife(int32 EntryPoint);
	void ReceiveBeginPlay();
	void MontageEvent(class FName Param_Name);
	void Upd();
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_ritualKnife_C">();
	}
	static class AProp_ritualKnife_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_ritualKnife_C>();
	}
};
static_assert(alignof(AProp_ritualKnife_C) == 0x000008, "Wrong alignment on AProp_ritualKnife_C");
static_assert(sizeof(AProp_ritualKnife_C) == 0x000390, "Wrong size on AProp_ritualKnife_C");
static_assert(offsetof(AProp_ritualKnife_C, UberGraphFrame_Prop_ritualKnife_C) == 0x000368, "Member 'AProp_ritualKnife_C::UberGraphFrame_Prop_ritualKnife_C' has a wrong offset!");
static_assert(offsetof(AProp_ritualKnife_C, VelocityStuck) == 0x000370, "Member 'AProp_ritualKnife_C::VelocityStuck' has a wrong offset!");
static_assert(offsetof(AProp_ritualKnife_C, ParticleSystem) == 0x000378, "Member 'AProp_ritualKnife_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AProp_ritualKnife_C, Pl) == 0x000380, "Member 'AProp_ritualKnife_C::Pl' has a wrong offset!");
static_assert(offsetof(AProp_ritualKnife_C, bloody) == 0x000388, "Member 'AProp_ritualKnife_C::bloody' has a wrong offset!");

}

