#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_rune

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_rune.prop_rune_C.ExecuteUbergraph_prop_rune
// 0x00A0 (0x00A0 - 0x0000)
struct Prop_rune_C_ExecuteUbergraph_prop_rune final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_rune_C_ExecuteUbergraph_prop_rune) == 0x000008, "Wrong alignment on Prop_rune_C_ExecuteUbergraph_prop_rune");
static_assert(sizeof(Prop_rune_C_ExecuteUbergraph_prop_rune) == 0x0000A0, "Wrong size on Prop_rune_C_ExecuteUbergraph_prop_rune");
static_assert(offsetof(Prop_rune_C_ExecuteUbergraph_prop_rune, EntryPoint) == 0x000000, "Member 'Prop_rune_C_ExecuteUbergraph_prop_rune::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_ExecuteUbergraph_prop_rune, K2Node_Event_player) == 0x000008, "Member 'Prop_rune_C_ExecuteUbergraph_prop_rune::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_ExecuteUbergraph_prop_rune, K2Node_Event_hit) == 0x000010, "Member 'Prop_rune_C_ExecuteUbergraph_prop_rune::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_ExecuteUbergraph_prop_rune, K2Node_Event_action) == 0x000098, "Member 'Prop_rune_C_ExecuteUbergraph_prop_rune::K2Node_Event_action' has a wrong offset!");

// Function prop_rune.prop_rune_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct Prop_rune_C_SetActive final
{
public:
	bool                                          Param_Active;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_rune_C_SetActive) == 0x000001, "Wrong alignment on Prop_rune_C_SetActive");
static_assert(sizeof(Prop_rune_C_SetActive) == 0x000001, "Wrong size on Prop_rune_C_SetActive");
static_assert(offsetof(Prop_rune_C_SetActive, Param_Active) == 0x000000, "Member 'Prop_rune_C_SetActive::Param_Active' has a wrong offset!");

// Function prop_rune.prop_rune_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_rune_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_rune_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_rune_C_ActionOptionIndex");
static_assert(sizeof(Prop_rune_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_rune_C_ActionOptionIndex");
static_assert(offsetof(Prop_rune_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_rune_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_rune_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_rune_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_rune.prop_rune_C.UserConstructionScript
// 0x0054 (0x0054 - 0x0000)
struct Prop_rune_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_rune_C_UserConstructionScript) == 0x000004, "Wrong alignment on Prop_rune_C_UserConstructionScript");
static_assert(sizeof(Prop_rune_C_UserConstructionScript) == 0x000054, "Wrong size on Prop_rune_C_UserConstructionScript");
static_assert(offsetof(Prop_rune_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'Prop_rune_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_UserConstructionScript, Temp_struct_Variable) == 0x000004, "Member 'Prop_rune_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000014, "Member 'Prop_rune_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_UserConstructionScript, Temp_struct_Variable_2) == 0x000024, "Member 'Prop_rune_C_UserConstructionScript::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_UserConstructionScript, Temp_struct_Variable_3) == 0x000034, "Member 'Prop_rune_C_UserConstructionScript::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_rune_C_UserConstructionScript, K2Node_Select_Default) == 0x000044, "Member 'Prop_rune_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

