#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_rozgun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_wireComponent_rozgun.prop_wireComponent_rozgun_C.ExecuteUbergraph_prop_wireComponent_rozgun
// 0x00A0 (0x00A0 - 0x0000)
struct Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWire_C*                                K2Node_Event_wire;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC6[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun) == 0x000010, "Wrong alignment on Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun");
static_assert(sizeof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun) == 0x0000A0, "Wrong size on Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, EntryPoint) == 0x000000, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, Temp_int_Variable) == 0x000004, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, Temp_class_Variable) == 0x000008, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, Temp_class_Variable_1) == 0x000010, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, Temp_class_Variable_2) == 0x000018, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, K2Node_Select_Default) == 0x000020, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, K2Node_Event_wire) == 0x000028, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::K2Node_Event_wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_GetActorUpVector_ReturnValue) == 0x000060, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_GetMass_ReturnValue) == 0x000080, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000088, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000094, "Member 'Prop_wireComponent_rozgun_C_ExecuteUbergraph_prop_wireComponent_rozgun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function prop_wireComponent_rozgun.prop_wireComponent_rozgun_C.wirePass
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_rozgun_C_WirePass final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_rozgun_C_WirePass) == 0x000008, "Wrong alignment on Prop_wireComponent_rozgun_C_WirePass");
static_assert(sizeof(Prop_wireComponent_rozgun_C_WirePass) == 0x000008, "Wrong size on Prop_wireComponent_rozgun_C_WirePass");
static_assert(offsetof(Prop_wireComponent_rozgun_C_WirePass, Wire) == 0x000000, "Member 'Prop_wireComponent_rozgun_C_WirePass::Wire' has a wrong offset!");

}

