#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropThrown

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass propThrown.propThrown_C
// 0x0040 (0x00F0 - 0x00B0)
class UPropThrown_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimitiveComponent*                    Component;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Lastloc;                                           // 0x00D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372A[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                Prop;                                              // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CanRepeat;                                         // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_propThrown(int32 EntryPoint);
	void Fin();
	void Throw();
	void Repeat();
	void Init(class AProp_C* Param_Prop, class UPrimitiveComponent* Param_Component);
	void Hit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"propThrown_C">();
	}
	static class UPropThrown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropThrown_C>();
	}
};
static_assert(alignof(UPropThrown_C) == 0x000008, "Wrong alignment on UPropThrown_C");
static_assert(sizeof(UPropThrown_C) == 0x0000F0, "Wrong size on UPropThrown_C");
static_assert(offsetof(UPropThrown_C, UberGraphFrame) == 0x0000B0, "Member 'UPropThrown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPropThrown_C, Component) == 0x0000B8, "Member 'UPropThrown_C::Component' has a wrong offset!");
static_assert(offsetof(UPropThrown_C, Obj) == 0x0000C0, "Member 'UPropThrown_C::Obj' has a wrong offset!");
static_assert(offsetof(UPropThrown_C, Lastloc) == 0x0000D0, "Member 'UPropThrown_C::Lastloc' has a wrong offset!");
static_assert(offsetof(UPropThrown_C, Prop) == 0x0000E0, "Member 'UPropThrown_C::Prop' has a wrong offset!");
static_assert(offsetof(UPropThrown_C, CanRepeat) == 0x0000E8, "Member 'UPropThrown_C::CanRepeat' has a wrong offset!");

}

