#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wendSkull

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_wendSkull.prop_wendSkull_C.ExecuteUbergraph_prop_wendSkull
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWendussy_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0080(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWendigoDreamer_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull) == 0x000010, "Wrong alignment on Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull");
static_assert(sizeof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull) == 0x0000E0, "Wrong size on Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, EntryPoint) == 0x000000, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_int_Variable) == 0x000008, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, K2Node_Event_fuel) == 0x000014, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000018, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_bool_IsClosed_Variable) == 0x000070, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_struct_Variable) == 0x000080, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00008C, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_MakeTransform_ReturnValue_1) == 0x0000A0, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000D0, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D8, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function prop_wendSkull.prop_wendSkull_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Prop_wendSkull_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wendSkull_C_Ignite) == 0x000004, "Wrong alignment on Prop_wendSkull_C_Ignite");
static_assert(sizeof(Prop_wendSkull_C_Ignite) == 0x000004, "Wrong size on Prop_wendSkull_C_Ignite");
static_assert(offsetof(Prop_wendSkull_C_Ignite, Fuel) == 0x000000, "Member 'Prop_wendSkull_C_Ignite::Fuel' has a wrong offset!");

}

