#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_waspnest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_waspnest.prop_waspnest_C
// 0x0020 (0x0398 - 0x0378)
class AProp_waspnest_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_waspnest_C;                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Wasps_Cue;                                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Chunk;                                             // 0x0394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Active;                                            // 0x0395(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_waspnest(int32 EntryPoint);
	void Hitted();
	void broken();
	void ReceiveBeginPlay();
	void EnterWater(class AWaterVolume_C* Water);
	void DigUp();
	void ReceivedPhyiscsDamage(float Damage, const struct FHitResult& Hot);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_waspnest_C">();
	}
	static class AProp_waspnest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_waspnest_C>();
	}
};
static_assert(alignof(AProp_waspnest_C) == 0x000008, "Wrong alignment on AProp_waspnest_C");
static_assert(sizeof(AProp_waspnest_C) == 0x000398, "Wrong size on AProp_waspnest_C");
static_assert(offsetof(AProp_waspnest_C, UberGraphFrame_Prop_waspnest_C) == 0x000378, "Member 'AProp_waspnest_C::UberGraphFrame_Prop_waspnest_C' has a wrong offset!");
static_assert(offsetof(AProp_waspnest_C, Wasps_Cue) == 0x000380, "Member 'AProp_waspnest_C::Wasps_Cue' has a wrong offset!");
static_assert(offsetof(AProp_waspnest_C, ParticleSystem) == 0x000388, "Member 'AProp_waspnest_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AProp_waspnest_C, Duration) == 0x000390, "Member 'AProp_waspnest_C::Duration' has a wrong offset!");
static_assert(offsetof(AProp_waspnest_C, Chunk) == 0x000394, "Member 'AProp_waspnest_C::Chunk' has a wrong offset!");
static_assert(offsetof(AProp_waspnest_C, Active) == 0x000395, "Member 'AProp_waspnest_C::Active' has a wrong offset!");

}

