#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_paper_drawable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_paper_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_paper_drawable.prop_paper_drawable_C
// 0x0030 (0x0398 - 0x0368)
class AProp_paper_drawable_C final : public AProp_paper_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_paper_drawable_C;              // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Index_Prop_paper_drawable_C;                       // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39DE[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LoadTexture;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Rt;                                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_pencil_C*                         Pencil;                                            // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_paper_drawable(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetRT();
	void InitDraw();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_paper_drawable_C">();
	}
	static class AProp_paper_drawable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_paper_drawable_C>();
	}
};
static_assert(alignof(AProp_paper_drawable_C) == 0x000008, "Wrong alignment on AProp_paper_drawable_C");
static_assert(sizeof(AProp_paper_drawable_C) == 0x000398, "Wrong size on AProp_paper_drawable_C");
static_assert(offsetof(AProp_paper_drawable_C, UberGraphFrame_Prop_paper_drawable_C) == 0x000368, "Member 'AProp_paper_drawable_C::UberGraphFrame_Prop_paper_drawable_C' has a wrong offset!");
static_assert(offsetof(AProp_paper_drawable_C, Index_Prop_paper_drawable_C) == 0x000370, "Member 'AProp_paper_drawable_C::Index_Prop_paper_drawable_C' has a wrong offset!");
static_assert(offsetof(AProp_paper_drawable_C, LoadTexture) == 0x000378, "Member 'AProp_paper_drawable_C::LoadTexture' has a wrong offset!");
static_assert(offsetof(AProp_paper_drawable_C, Dynmat) == 0x000380, "Member 'AProp_paper_drawable_C::Dynmat' has a wrong offset!");
static_assert(offsetof(AProp_paper_drawable_C, Rt) == 0x000388, "Member 'AProp_paper_drawable_C::Rt' has a wrong offset!");
static_assert(offsetof(AProp_paper_drawable_C, Pencil) == 0x000390, "Member 'AProp_paper_drawable_C::Pencil' has a wrong offset!");

}

