#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_funGun_doohickey

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_funGun_doohickey.prop_funGun_doohickey_C.fireBulletPrimary
// 0x0070 (0x0070 - 0x0000)
struct Prop_funGun_doohickey_C_FireBulletPrimary final
{
public:
	struct FVector                                CallFunc_arm_start;                                // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoohickeyLazer_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_doohickey_C_FireBulletPrimary) == 0x000010, "Wrong alignment on Prop_funGun_doohickey_C_FireBulletPrimary");
static_assert(sizeof(Prop_funGun_doohickey_C_FireBulletPrimary) == 0x000070, "Wrong size on Prop_funGun_doohickey_C_FireBulletPrimary");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_arm_start) == 0x000000, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_arm_end) == 0x00000C, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000024, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_doohickey_C_FireBulletPrimary, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'Prop_funGun_doohickey_C_FireBulletPrimary::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

