#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_handradar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_handradar.prop_handradar_C
// 0x0018 (0x0380 - 0x0368)
class AProp_handradar_C final : public AProp_C
{
public:
	uint8                                         Pad_19E9[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_handradar_C;                   // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUmg_handradar_C*                       Hand_Radar;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_handradar(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnCompleted_3D095B7742ACA77CDF23DA915B159D1D(class FName NotifyName);
	void OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D(class FName NotifyName);
	void OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D(class FName NotifyName);
	void OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D(class FName NotifyName);
	void OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D(class FName NotifyName);
	void OnCompleted_24CE38C74EA5F51BE312D5B987A72F72(class FName NotifyName);
	void OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72(class FName NotifyName);
	void OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72(class FName NotifyName);
	void OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72(class FName NotifyName);
	void OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72(class FName NotifyName);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_handradar_C">();
	}
	static class AProp_handradar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_handradar_C>();
	}
};
static_assert(alignof(AProp_handradar_C) == 0x000008, "Wrong alignment on AProp_handradar_C");
static_assert(sizeof(AProp_handradar_C) == 0x000380, "Wrong size on AProp_handradar_C");
static_assert(offsetof(AProp_handradar_C, UberGraphFrame_Prop_handradar_C) == 0x000368, "Member 'AProp_handradar_C::UberGraphFrame_Prop_handradar_C' has a wrong offset!");
static_assert(offsetof(AProp_handradar_C, Widget) == 0x000370, "Member 'AProp_handradar_C::Widget' has a wrong offset!");
static_assert(offsetof(AProp_handradar_C, Hand_Radar) == 0x000378, "Member 'AProp_handradar_C::Hand_Radar' has a wrong offset!");

}

