#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_food_shrimp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_food_shrimp.prop_food_shrimp_C.ExecuteUbergraph_prop_food_shrimp
// 0x0070 (0x0070 - 0x0000)
struct Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9D[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp) == 0x000010, "Wrong alignment on Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp");
static_assert(sizeof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp) == 0x000070, "Wrong size on Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, EntryPoint) == 0x000000, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000050, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_name_Variable) == 0x000058, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Array_RemoveItem_ReturnValue) == 0x000064, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

}

