#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_axis

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_wireComponent_axis.prop_wireComponent_axis_C.ExecuteUbergraph_prop_wireComponent_axis
// 0x0060 (0x0060 - 0x0000)
struct Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D35[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D36[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                K2Node_Event_wire;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis) == 0x000008, "Wrong alignment on Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis");
static_assert(sizeof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis) == 0x000060, "Wrong size on Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, EntryPoint) == 0x000000, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, CallFunc_GetUpVector_ReturnValue) == 0x000004, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, CallFunc_GetUpVector_ReturnValue_1) == 0x000010, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, K2Node_DynamicCast_AsPrimitive_Component) == 0x000038, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, K2Node_Event_wire) == 0x000048, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::K2Node_Event_wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000054, "Member 'Prop_wireComponent_axis_C_ExecuteUbergraph_prop_wireComponent_axis::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

// Function prop_wireComponent_axis.prop_wireComponent_axis_C.wirePass
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_axis_C_WirePass final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_axis_C_WirePass) == 0x000008, "Wrong alignment on Prop_wireComponent_axis_C_WirePass");
static_assert(sizeof(Prop_wireComponent_axis_C_WirePass) == 0x000008, "Wrong size on Prop_wireComponent_axis_C_WirePass");
static_assert(offsetof(Prop_wireComponent_axis_C_WirePass, Wire) == 0x000000, "Member 'Prop_wireComponent_axis_C_WirePass::Wire' has a wrong offset!");

// Function prop_wireComponent_axis.prop_wireComponent_axis_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wireComponent_axis_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_axis_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wireComponent_axis_C_ReceiveTick");
static_assert(sizeof(Prop_wireComponent_axis_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wireComponent_axis_C_ReceiveTick");
static_assert(offsetof(Prop_wireComponent_axis_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wireComponent_axis_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_wireComponent_axis.prop_wireComponent_axis_C.applyTorque
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_axis_C_ApplyTorque final
{
public:
	class UStaticMeshComponent*                   InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_axis_C_ApplyTorque) == 0x000008, "Wrong alignment on Prop_wireComponent_axis_C_ApplyTorque");
static_assert(sizeof(Prop_wireComponent_axis_C_ApplyTorque) == 0x000008, "Wrong size on Prop_wireComponent_axis_C_ApplyTorque");
static_assert(offsetof(Prop_wireComponent_axis_C_ApplyTorque, InputPin) == 0x000000, "Member 'Prop_wireComponent_axis_C_ApplyTorque::InputPin' has a wrong offset!");

}

