#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_arirGamerYogur

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_arirGamerYogur.prop_arirGamerYogur_C
// 0x0010 (0x0388 - 0x0378)
class AProp_arirGamerYogur_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_arirGamerYogur_C;              // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Open;                                              // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Cap;                                               // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x2];                                      // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Uses;                                              // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_arirGamerYogur(int32 EntryPoint);
	void Set();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_arirGamerYogur_C">();
	}
	static class AProp_arirGamerYogur_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_arirGamerYogur_C>();
	}
};
static_assert(alignof(AProp_arirGamerYogur_C) == 0x000008, "Wrong alignment on AProp_arirGamerYogur_C");
static_assert(sizeof(AProp_arirGamerYogur_C) == 0x000388, "Wrong size on AProp_arirGamerYogur_C");
static_assert(offsetof(AProp_arirGamerYogur_C, UberGraphFrame_Prop_arirGamerYogur_C) == 0x000378, "Member 'AProp_arirGamerYogur_C::UberGraphFrame_Prop_arirGamerYogur_C' has a wrong offset!");
static_assert(offsetof(AProp_arirGamerYogur_C, Open) == 0x000380, "Member 'AProp_arirGamerYogur_C::Open' has a wrong offset!");
static_assert(offsetof(AProp_arirGamerYogur_C, Cap) == 0x000381, "Member 'AProp_arirGamerYogur_C::Cap' has a wrong offset!");
static_assert(offsetof(AProp_arirGamerYogur_C, Uses) == 0x000384, "Member 'AProp_arirGamerYogur_C::Uses' has a wrong offset!");

}

