#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_fish.prop_fish_C
// 0x0028 (0x03A0 - 0x0378)
class AProp_fish_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_fish_C;                        // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          InWater;                                           // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Obj;                                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHit;                                             // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Type;                                              // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dead;                                              // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Health;                                            // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_fish(int32 EntryPoint);
	void BndEvt__prop_fish_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Param_Hit);
	void TimerCheckPlayer();
	void ReceiveTick(float DeltaSeconds);
	void AddDamage(class AActor* Actor, float Damage, const struct FHitResult& Param_Hit, const struct FVector& Impact, bool SkipSetting);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void ExitTheWater();
	void EnteredTheWater();
	void ReceiveBeginPlay();
	void Slice(bool Clean);
	void LeaveWater(class AWaterVolume_C* Water);
	void Init();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_fish_C">();
	}
	static class AProp_fish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_fish_C>();
	}
};
static_assert(alignof(AProp_fish_C) == 0x000008, "Wrong alignment on AProp_fish_C");
static_assert(sizeof(AProp_fish_C) == 0x0003A0, "Wrong size on AProp_fish_C");
static_assert(offsetof(AProp_fish_C, UberGraphFrame_Prop_fish_C) == 0x000378, "Member 'AProp_fish_C::UberGraphFrame_Prop_fish_C' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, InWater) == 0x000380, "Member 'AProp_fish_C::InWater' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, Speed) == 0x000384, "Member 'AProp_fish_C::Speed' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, Obj) == 0x000388, "Member 'AProp_fish_C::Obj' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, IsHit) == 0x000390, "Member 'AProp_fish_C::IsHit' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, Type) == 0x000394, "Member 'AProp_fish_C::Type' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, Dead) == 0x000398, "Member 'AProp_fish_C::Dead' has a wrong offset!");
static_assert(offsetof(AProp_fish_C, Health) == 0x00039C, "Member 'AProp_fish_C::Health' has a wrong offset!");

}

