#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_grunt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_grunt.prop_grunt_C
// 0x0040 (0x03B8 - 0x0378)
class AProp_grunt_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_grunt_C;                       // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DamageSphere;                                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Jumped;                                            // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Health;                                            // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccDamage;                                         // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Crit;                                              // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_madnessCombat_C*                   Killcount;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_grunt(int32 EntryPoint);
	void CustomEvent();
	void BndEvt__prop_grunt_damageSphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ResumeJump();
	void BndEvt__prop_grunt_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Param_Hit);
	void ReceiveTick(float DeltaSeconds);
	void AssignGib(class UObject* Self2);
	void SetDmg();
	void FireDamage(float Param_Damage);
	void AddDamage(class AActor* Actor, float Param_Damage, const struct FHitResult& Param_Hit, const struct FVector& Impact, bool SkipSetting);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Exploded(float Param_Damage, const struct FVector& Location);
	void ReceivedPhyiscsDamage(float Param_Damage, const struct FHitResult& Hot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_grunt_C">();
	}
	static class AProp_grunt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_grunt_C>();
	}
};
static_assert(alignof(AProp_grunt_C) == 0x000008, "Wrong alignment on AProp_grunt_C");
static_assert(sizeof(AProp_grunt_C) == 0x0003B8, "Wrong size on AProp_grunt_C");
static_assert(offsetof(AProp_grunt_C, UberGraphFrame_Prop_grunt_C) == 0x000378, "Member 'AProp_grunt_C::UberGraphFrame_Prop_grunt_C' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Audio) == 0x000380, "Member 'AProp_grunt_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, DamageSphere) == 0x000388, "Member 'AProp_grunt_C::DamageSphere' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Jumped) == 0x000390, "Member 'AProp_grunt_C::Jumped' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Speed) == 0x000394, "Member 'AProp_grunt_C::Speed' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, MaxHealth) == 0x000398, "Member 'AProp_grunt_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Health) == 0x00039C, "Member 'AProp_grunt_C::Health' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, AccDamage) == 0x0003A0, "Member 'AProp_grunt_C::AccDamage' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Crit) == 0x0003A4, "Member 'AProp_grunt_C::Crit' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Killcount) == 0x0003A8, "Member 'AProp_grunt_C::Killcount' has a wrong offset!");
static_assert(offsetof(AProp_grunt_C, Damage) == 0x0003B0, "Member 'AProp_grunt_C::Damage' has a wrong offset!");

}

