#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_food_shrimp

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_food1_structs.hpp"


namespace SDK::Params
{

// Function prop_food_shrimp.prop_food_shrimp_C.ExecuteUbergraph_prop_food_shrimp
// 0x02F0 (0x02F0 - 0x0000)
struct Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x0054(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0080(0x0080)(HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0100(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x01D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_cookingFood_shrimp_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0260(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp) == 0x000010, "Wrong alignment on Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp");
static_assert(sizeof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp) == 0x0002F0, "Wrong size on Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, EntryPoint) == 0x000000, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_int_Variable) == 0x000004, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_int_Variable_1) == 0x000010, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_propToObject_ReturnValue) == 0x000050, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_propToObject_foodData) == 0x000054, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_propToObject_object) == 0x000070, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_propToObject_isFood) == 0x000078, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_propToObject_propData) == 0x000080, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_name_Variable) == 0x000100, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_IsValidClass_ReturnValue) == 0x000108, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_int_Variable_2) == 0x00010C, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_int_Variable_3) == 0x000110, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000114, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Add_IntInt_ReturnValue_2) == 0x000118, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_int_Variable_4) == 0x00011C, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000120, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Array_Add_ReturnValue) == 0x000128, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Array_RemoveItem_ReturnValue) == 0x00012C, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_Event_player_1) == 0x000130, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_Event_player) == 0x000138, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_Event_hit) == 0x000140, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_Event_action) == 0x0001C8, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_SwitchEnum_CmpSuccess) == 0x0001C9, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001CC, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, Temp_name_Variable_1) == 0x0001D0, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_GetTransform_ReturnValue) == 0x0001E0, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_ComposeTransforms_ReturnValue) == 0x000210, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000240, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000248, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_FinishSpawningActor_ReturnValue) == 0x000250, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_GetTransform_ReturnValue_1) == 0x000260, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000290, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000298, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0002A0, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_DynamicCast_AsInt_Player) == 0x0002A8, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, K2Node_DynamicCast_bSuccess) == 0x0002B8, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0002C0, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_asProp_return) == 0x0002C8, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0002D0, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0002D8, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp, CallFunc_Conv_NameToString_ReturnValue) == 0x0002E0, "Member 'Prop_food_shrimp_C_ExecuteUbergraph_prop_food_shrimp::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_food_shrimp_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_shrimp_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_food_shrimp_C_ActionOptionIndex");
static_assert(sizeof(Prop_food_shrimp_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_food_shrimp_C_ActionOptionIndex");
static_assert(offsetof(Prop_food_shrimp_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_food_shrimp_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_food_shrimp_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_food_shrimp_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.upd
// 0x0060 (0x0060 - 0x0000)
struct Prop_food_shrimp_C_Upd final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_food_shrimp_C_Upd) == 0x000010, "Wrong alignment on Prop_food_shrimp_C_Upd");
static_assert(sizeof(Prop_food_shrimp_C_Upd) == 0x000060, "Wrong size on Prop_food_shrimp_C_Upd");
static_assert(offsetof(Prop_food_shrimp_C_Upd, Temp_int_Variable) == 0x000000, "Member 'Prop_food_shrimp_C_Upd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000004, "Member 'Prop_food_shrimp_C_Upd::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'Prop_food_shrimp_C_Upd::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_food_shrimp_C_Upd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Prop_food_shrimp_C_Upd::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Prop_food_shrimp_C_Upd::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_AddInstance_ReturnValue) == 0x000050, "Member 'Prop_food_shrimp_C_Upd::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_Upd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'Prop_food_shrimp_C_Upd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_food_shrimp_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_shrimp_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_food_shrimp_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_food_shrimp_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_food_shrimp_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_food_shrimp_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_food_shrimp_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.lookAt
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_food_shrimp_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_shrimp_C_LookAt) == 0x000008, "Wrong alignment on Prop_food_shrimp_C_LookAt");
static_assert(sizeof(Prop_food_shrimp_C_LookAt) == 0x0000E0, "Wrong size on Prop_food_shrimp_C_LookAt");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, Player) == 0x000000, "Member 'Prop_food_shrimp_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_food_shrimp_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, Return) == 0x000090, "Member 'Prop_food_shrimp_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, Text) == 0x000098, "Member 'Prop_food_shrimp_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_food_shrimp_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, Number) == 0x0000B0, "Member 'Prop_food_shrimp_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'Prop_food_shrimp_C_LookAt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'Prop_food_shrimp_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_food_shrimp_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_shrimp_C_LoadData) == 0x000010, "Wrong alignment on Prop_food_shrimp_C_LoadData");
static_assert(sizeof(Prop_food_shrimp_C_LoadData) == 0x0000E0, "Wrong size on Prop_food_shrimp_C_LoadData");
static_assert(offsetof(Prop_food_shrimp_C_LoadData, Data) == 0x000000, "Member 'Prop_food_shrimp_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LoadData, Return) == 0x0000C0, "Member 'Prop_food_shrimp_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_food_shrimp_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_food_shrimp_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_food_shrimp_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_food_shrimp_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_food_shrimp_C_GetActionOptions");
static_assert(sizeof(Prop_food_shrimp_C_GetActionOptions) == 0x000060, "Wrong size on Prop_food_shrimp_C_GetActionOptions");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_food_shrimp_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_food_shrimp_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_food_shrimp_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_food_shrimp_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_food_shrimp_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_food_shrimp_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_food_shrimp_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_food_shrimp_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function prop_food_shrimp.prop_food_shrimp_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_food_shrimp_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_shrimp_C_GetData) == 0x000010, "Wrong alignment on Prop_food_shrimp_C_GetData");
static_assert(sizeof(Prop_food_shrimp_C_GetData) == 0x000270, "Wrong size on Prop_food_shrimp_C_GetData");
static_assert(offsetof(Prop_food_shrimp_C_GetData, Data) == 0x000000, "Member 'Prop_food_shrimp_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_food_shrimp_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_food_shrimp_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_food_shrimp_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_food_shrimp_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
