#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_furfurPaltar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_furfurPaltar.prop_furfurPAltar_C.ExecuteUbergraph_prop_furfurPAltar
// 0x0410 (0x0410 - 0x0000)
struct Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385F[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AProp_furfurPaltar_1_C*                 K2Node_DynamicCast_AsProp_Furfur_Paltar_1;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3860[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3861[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00E0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3862[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_furfurPaltar_2_C*                 K2Node_DynamicCast_AsProp_Furfur_Paltar_2;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3863[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue_1;        // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x01C0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3864[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0280(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x02B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3865[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_2;           // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3866[0x2];                                     // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_3;           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue_2;        // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_4;           // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_5;           // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue;          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue_1;        // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0386(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0387(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3867[0x3];                                     // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_3;           // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3868[0x3];                                     // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue_6;           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x03A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x03A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x03A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       K2Node_DynamicCast_AsProp_Blood_Gib;               // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3869[0x6];                                     // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x03D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_furfurPlush_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar) == 0x000010, "Wrong alignment on Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar");
static_assert(sizeof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar) == 0x000410, "Wrong size on Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, EntryPoint) == 0x000000, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000024, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000028, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_DynamicCast_AsProp_Furfur_Paltar_1) == 0x0000B0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_DynamicCast_AsProp_Furfur_Paltar_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000C0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OtherActor) == 0x0000C8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OtherComp) == 0x0000D0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000DC, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_ComponentBoundEvent_SweepResult) == 0x0000E0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorForwardVector_ReturnValue) == 0x000168, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_DynamicCast_AsProp_Furfur_Paltar_2) == 0x000178, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_DynamicCast_AsProp_Furfur_Paltar_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorRightVector_ReturnValue) == 0x000184, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorRightVector_ReturnValue_1) == 0x000190, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x00019C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorUpVector_ReturnValue) == 0x0001A8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorUpVector_ReturnValue_1) == 0x0001B4, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetTransform_ReturnValue) == 0x0001C0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0001F0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000278, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetTransform_ReturnValue_1) == 0x000280, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x0002B0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x000338, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorUpVector_ReturnValue_2) == 0x00033C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorUpVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorForwardVector_ReturnValue_2) == 0x000348, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue) == 0x000354, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000358, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00035C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00035D, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x000360, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue_3) == 0x000364, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000368, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000369, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue) == 0x00036A, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue_1) == 0x00036B, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorRightVector_ReturnValue_2) == 0x00036C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorRightVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue_4) == 0x000378, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue_5) == 0x00037C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x000380, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x000381, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue_2) == 0x000382, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue_3) == 0x000383, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetCollisionEnabled_ReturnValue) == 0x000384, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetCollisionEnabled_ReturnValue_1) == 0x000385, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetCollisionEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000386, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000387, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanOR_ReturnValue) == 0x000388, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_Event_DeltaSeconds) == 0x00038C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetActorUpVector_ReturnValue_3) == 0x000390, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetActorUpVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue_4) == 0x00039C, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Dot_VectorVector_ReturnValue_6) == 0x0003A0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Dot_VectorVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Greater_FloatFloat_ReturnValue_6) == 0x0003A4, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Greater_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Not_PreBool_ReturnValue) == 0x0003A5, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue_5) == 0x0003A6, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BooleanAND_ReturnValue_6) == 0x0003A7, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0003A8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_Array_Get_Item) == 0x0003B8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_DynamicCast_AsProp_Blood_Gib) == 0x0003C0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_DynamicCast_AsProp_Blood_Gib' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, K2Node_DynamicCast_bSuccess_2) == 0x0003C8, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_IsValid_ReturnValue) == 0x0003C9, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_GetTransform_ReturnValue_2) == 0x0003D0, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000400, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar, CallFunc_FinishSpawningActor_ReturnValue) == 0x000408, "Member 'Prop_furfurPAltar_C_ExecuteUbergraph_prop_furfurPAltar::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_furfurPaltar.prop_furfurPAltar_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_furfurPAltar_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_furfurPAltar_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_furfurPAltar_C_ReceiveTick");
static_assert(sizeof(Prop_furfurPAltar_C_ReceiveTick) == 0x000004, "Wrong size on Prop_furfurPAltar_C_ReceiveTick");
static_assert(offsetof(Prop_furfurPAltar_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_furfurPAltar_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_furfurPaltar.prop_furfurPAltar_C.BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_2_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_furfurPaltar.prop_furfurPAltar_C.BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_furfurPAltar_C_BndEvt__prop_furfurPAltar_1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_furfurPaltar.prop_furfurPAltar_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_furfurPAltar_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386C[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_furfurPAltar_C_LoadData) == 0x000010, "Wrong alignment on Prop_furfurPAltar_C_LoadData");
static_assert(sizeof(Prop_furfurPAltar_C_LoadData) == 0x0000E0, "Wrong size on Prop_furfurPAltar_C_LoadData");
static_assert(offsetof(Prop_furfurPAltar_C_LoadData, Data) == 0x000000, "Member 'Prop_furfurPAltar_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_LoadData, Return) == 0x0000C0, "Member 'Prop_furfurPAltar_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_furfurPAltar_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_furfurPAltar_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_furfurPAltar_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_furfurPaltar.prop_furfurPAltar_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_furfurPAltar_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_furfurPAltar_C_GetData) == 0x000010, "Wrong alignment on Prop_furfurPAltar_C_GetData");
static_assert(sizeof(Prop_furfurPAltar_C_GetData) == 0x000280, "Wrong size on Prop_furfurPAltar_C_GetData");
static_assert(offsetof(Prop_furfurPAltar_C_GetData, Data) == 0x000000, "Member 'Prop_furfurPAltar_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_furfurPAltar_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_furfurPAltar_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_furfurPAltar_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Prop_furfurPAltar_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
