#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_beacon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"


namespace SDK::Params
{

// Function prop_beacon.prop_beacon_C.ExecuteUbergraph_prop_beacon
// 0x0178 (0x0178 - 0x0000)
struct Prop_beacon_C_ExecuteUbergraph_prop_beacon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Ubeacon_Skeleton_AnimBlueprint_C*       K2Node_DynamicCast_AsBeacon_Skeleton_Anim_Blueprint; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue_1;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_instant;                        // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue_2;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_beacon_C_ExecuteUbergraph_prop_beacon) == 0x000008, "Wrong alignment on Prop_beacon_C_ExecuteUbergraph_prop_beacon");
static_assert(sizeof(Prop_beacon_C_ExecuteUbergraph_prop_beacon) == 0x000178, "Wrong size on Prop_beacon_C_ExecuteUbergraph_prop_beacon");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, EntryPoint) == 0x000000, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, Temp_object_Variable) == 0x000010, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, Temp_object_Variable_1) == 0x000018, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, Temp_bool_Variable) == 0x000020, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, Temp_object_Variable_2) == 0x000028, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, Temp_object_Variable_3) == 0x000030, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Lerp_ReturnValue_1) == 0x000040, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_DynamicCast_AsBeacon_Skeleton_Anim_Blueprint) == 0x000050, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_DynamicCast_AsBeacon_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_GetCollisionEnabled_ReturnValue) == 0x000059, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_GetCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, Temp_bool_Variable_1) == 0x00005B, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Not_PreBool_ReturnValue) == 0x00005C, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_Select_Default) == 0x000060, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_GetCollisionEnabled_ReturnValue_1) == 0x000068, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_GetCollisionEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000069, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_CustomEvent_Condition) == 0x00006A, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_CustomEvent_Condition' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_CustomEvent_instant) == 0x00006B, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_CustomEvent_instant' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_RandomUnitVector_ReturnValue) == 0x00006C, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000078, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Lerp_ReturnValue_2) == 0x00007C, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Lerp_ReturnValue_3) == 0x000080, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000088, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000098, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x0000A0, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000A8, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x0000B0, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_GetCollisionEnabled_ReturnValue_2) == 0x0000B8, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_GetCollisionEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_Select_Default_1) == 0x0000C0, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000C8, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_Event_player_1) == 0x0000D0, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_Event_hit) == 0x0000D8, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_Event_action) == 0x000160, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_Event_player) == 0x000168, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ExecuteUbergraph_prop_beacon, K2Node_SwitchEnum_CmpSuccess_1) == 0x000170, "Member 'Prop_beacon_C_ExecuteUbergraph_prop_beacon::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.Open
// 0x0002 (0x0002 - 0x0000)
struct Prop_beacon_C_Open final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Instant;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_beacon_C_Open) == 0x000001, "Wrong alignment on Prop_beacon_C_Open");
static_assert(sizeof(Prop_beacon_C_Open) == 0x000002, "Wrong size on Prop_beacon_C_Open");
static_assert(offsetof(Prop_beacon_C_Open, Condition) == 0x000000, "Member 'Prop_beacon_C_Open::Condition' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_Open, Instant) == 0x000001, "Member 'Prop_beacon_C_Open::Instant' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_beacon_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_beacon_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_beacon_C_ActionOptionIndex");
static_assert(sizeof(Prop_beacon_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_beacon_C_ActionOptionIndex");
static_assert(offsetof(Prop_beacon_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_beacon_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_beacon_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_beacon_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_beacon_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_beacon_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_beacon_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_beacon_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_beacon_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_beacon_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_beacon_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_beacon_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_loadData_return;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_beacon_C_LoadData) == 0x000010, "Wrong alignment on Prop_beacon_C_LoadData");
static_assert(sizeof(Prop_beacon_C_LoadData) == 0x0000E0, "Wrong size on Prop_beacon_C_LoadData");
static_assert(offsetof(Prop_beacon_C_LoadData, Data) == 0x000000, "Member 'Prop_beacon_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LoadData, Return) == 0x0000C0, "Member 'Prop_beacon_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_beacon_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LoadData, CallFunc_loadData_return) == 0x0000D8, "Member 'Prop_beacon_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D9, "Member 'Prop_beacon_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_beacon_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_beacon_C_GetData) == 0x000010, "Wrong alignment on Prop_beacon_C_GetData");
static_assert(sizeof(Prop_beacon_C_GetData) == 0x000280, "Wrong size on Prop_beacon_C_GetData");
static_assert(offsetof(Prop_beacon_C_GetData, Data) == 0x000000, "Member 'Prop_beacon_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_beacon_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_beacon_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Prop_beacon_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_beacon_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_beacon_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_beacon_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.lookAt
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_beacon_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_beacon_C_LookAt) == 0x000008, "Wrong alignment on Prop_beacon_C_LookAt");
static_assert(sizeof(Prop_beacon_C_LookAt) == 0x0000E0, "Wrong size on Prop_beacon_C_LookAt");
static_assert(offsetof(Prop_beacon_C_LookAt, Player) == 0x000000, "Member 'Prop_beacon_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_beacon_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, Return) == 0x000090, "Member 'Prop_beacon_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, Text) == 0x000098, "Member 'Prop_beacon_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_beacon_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, Number) == 0x0000B0, "Member 'Prop_beacon_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'Prop_beacon_C_LookAt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'Prop_beacon_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function prop_beacon.prop_beacon_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_beacon_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_beacon_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_beacon_C_GetActionOptions");
static_assert(sizeof(Prop_beacon_C_GetActionOptions) == 0x000060, "Wrong size on Prop_beacon_C_GetActionOptions");
static_assert(offsetof(Prop_beacon_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_beacon_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_beacon_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_beacon_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_beacon_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_beacon_C_GetActionOptions::Options' has a wrong offset!");
