#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_shake

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_shake.prop_shake_C.ExecuteUbergraph_prop_shake
// 0x0020 (0x0020 - 0x0000)
struct Prop_shake_C_ExecuteUbergraph_prop_shake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38F7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UblackScreen_C*                         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_shake_C_ExecuteUbergraph_prop_shake) == 0x000008, "Wrong alignment on Prop_shake_C_ExecuteUbergraph_prop_shake");
static_assert(sizeof(Prop_shake_C_ExecuteUbergraph_prop_shake) == 0x000020, "Wrong size on Prop_shake_C_ExecuteUbergraph_prop_shake");
static_assert(offsetof(Prop_shake_C_ExecuteUbergraph_prop_shake, EntryPoint) == 0x000000, "Member 'Prop_shake_C_ExecuteUbergraph_prop_shake::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_shake_C_ExecuteUbergraph_prop_shake, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'Prop_shake_C_ExecuteUbergraph_prop_shake::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_shake_C_ExecuteUbergraph_prop_shake, CallFunc_Create_ReturnValue) == 0x000010, "Member 'Prop_shake_C_ExecuteUbergraph_prop_shake::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_shake_C_ExecuteUbergraph_prop_shake, K2Node_Event_player) == 0x000018, "Member 'Prop_shake_C_ExecuteUbergraph_prop_shake::K2Node_Event_player' has a wrong offset!");

// Function prop_shake.prop_shake_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_shake_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_shake_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_shake_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_shake_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_shake_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_shake_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_shake_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

