#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_wireless

#include "Basic.hpp"

#include "Prop_wireComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_wireless.prop_wireComponent_wireless_C
// 0x0020 (0x0390 - 0x0370)
class AProp_wireComponent_wireless_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_wireless_C;      // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AProp_wireComponent_wireless_C*         To;                                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWire_C*                                ConnectOut;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_wireComponent_wireless(int32 EntryPoint);
	void WirePass(class AWire_C* Wire);
	void WireDisconnected(class AWire_C* Wire, bool Side);
	void WireConnected(class AWire_C* Wire, bool Side);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_wireless_C">();
	}
	static class AProp_wireComponent_wireless_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_wireless_C>();
	}
};
static_assert(alignof(AProp_wireComponent_wireless_C) == 0x000008, "Wrong alignment on AProp_wireComponent_wireless_C");
static_assert(sizeof(AProp_wireComponent_wireless_C) == 0x000390, "Wrong size on AProp_wireComponent_wireless_C");
static_assert(offsetof(AProp_wireComponent_wireless_C, UberGraphFrame_Prop_wireComponent_wireless_C) == 0x000370, "Member 'AProp_wireComponent_wireless_C::UberGraphFrame_Prop_wireComponent_wireless_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_wireless_C, Billboard) == 0x000378, "Member 'AProp_wireComponent_wireless_C::Billboard' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_wireless_C, To) == 0x000380, "Member 'AProp_wireComponent_wireless_C::To' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_wireless_C, ConnectOut) == 0x000388, "Member 'AProp_wireComponent_wireless_C::ConnectOut' has a wrong offset!");

}

