#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fork

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_fork.prop_fork_C.ExecuteUbergraph_prop_fork
// 0x0170 (0x0170 - 0x0000)
struct Prop_fork_C_ExecuteUbergraph_prop_fork final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_DynamicCast_AsCord_Socket;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fork_C_ExecuteUbergraph_prop_fork) == 0x000010, "Wrong alignment on Prop_fork_C_ExecuteUbergraph_prop_fork");
static_assert(sizeof(Prop_fork_C_ExecuteUbergraph_prop_fork) == 0x000170, "Wrong size on Prop_fork_C_ExecuteUbergraph_prop_fork");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, EntryPoint) == 0x000000, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_getMainPlayer_AsMain_Player) == 0x0000B0, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_DynamicCast_AsCord_Socket) == 0x0000B8, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_DynamicCast_AsCord_Socket' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C4, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D0, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000DC, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, Temp_int_Variable) == 0x0000E8, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_SetVectorLength_ReturnValue) == 0x0000EC, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000F8, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000100, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00010C, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000110, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000150, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_FinishSpawningActor_ReturnValue) == 0x000158, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_ExecuteUbergraph_prop_fork, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000160, "Member 'Prop_fork_C_ExecuteUbergraph_prop_fork::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

// Function prop_fork.prop_fork_C.BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_fork_C_BndEvt__prop_fork_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

