#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_glowstick_rb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_glowstick_rb.prop_glowstick_rb_C.ExecuteUbergraph_prop_glowstick_rb
// 0x002C (0x002C - 0x0000)
struct Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_HSVToRGB_ReturnValue;                     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb) == 0x000004, "Wrong alignment on Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb");
static_assert(sizeof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb) == 0x00002C, "Wrong size on Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, EntryPoint) == 0x000000, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, CallFunc_HSVToRGB_ReturnValue) == 0x00000C, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::CallFunc_HSVToRGB_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x00001C, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000024, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000028, "Member 'Prop_glowstick_rb_C_ExecuteUbergraph_prop_glowstick_rb::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function prop_glowstick_rb.prop_glowstick_rb_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_glowstick_rb_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_glowstick_rb_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_glowstick_rb_C_ReceiveTick");
static_assert(sizeof(Prop_glowstick_rb_C_ReceiveTick) == 0x000004, "Wrong size on Prop_glowstick_rb_C_ReceiveTick");
static_assert(offsetof(Prop_glowstick_rb_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_glowstick_rb_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_glowstick_rb.prop_glowstick_rb_C.Init
// 0x0008 (0x0008 - 0x0000)
struct Prop_glowstick_rb_C_Init final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_glowstick_rb_C_Init) == 0x000008, "Wrong alignment on Prop_glowstick_rb_C_Init");
static_assert(sizeof(Prop_glowstick_rb_C_Init) == 0x000008, "Wrong size on Prop_glowstick_rb_C_Init");
static_assert(offsetof(Prop_glowstick_rb_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Prop_glowstick_rb_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

