#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wallAttachable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_wallAttachable.prop_wallAttachable_C.ExecuteUbergraph_prop_wallAttachable
// 0x0470 (0x0470 - 0x0000)
struct Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_tryStick_OutHit;                          // 0x010C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_tryStick_OutHit_1;                        // 0x0194(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21E[0x2];                                      // 0x021E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x031D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x031E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x031F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue_1;        // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0348(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x03D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChildActor_ReturnValue;                 // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0440(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable) == 0x000010, "Wrong alignment on Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable");
static_assert(sizeof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable) == 0x000470, "Wrong size on Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, EntryPoint) == 0x000000, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_TLerp_ReturnValue) == 0x000050, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000080, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000108, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_tryStick_OutHit) == 0x00010C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_tryStick_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_tryStick_OutHit_1) == 0x000194, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_tryStick_OutHit_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_bBlockingHit) == 0x00021C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_bInitialOverlap) == 0x00021D, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Time) == 0x000220, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Distance) == 0x000224, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Location) == 0x000228, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_ImpactPoint) == 0x000234, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Normal) == 0x000240, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_ImpactNormal) == 0x00024C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_PhysMat) == 0x000258, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitActor) == 0x000260, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitComponent) == 0x000268, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitBoneName) == 0x000270, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitItem) == 0x000278, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_ElementIndex) == 0x00027C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_FaceIndex) == 0x000280, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_TraceStart) == 0x000284, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_TraceEnd) == 0x000290, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00029C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00029D, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Time_1) == 0x0002A0, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Distance_1) == 0x0002A4, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Location_1) == 0x0002A8, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002B4, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_Normal_1) == 0x0002C0, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002CC, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_PhysMat_1) == 0x0002D8, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitActor_1) == 0x0002E0, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitComponent_1) == 0x0002E8, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitBoneName_1) == 0x0002F0, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_HitItem_1) == 0x0002F8, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_ElementIndex_1) == 0x0002FC, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_FaceIndex_1) == 0x000300, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_TraceStart_1) == 0x000304, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BreakHitResult_TraceEnd_1) == 0x000310, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_IsValid_ReturnValue) == 0x00031C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_IsValid_ReturnValue_1) == 0x00031D, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x00031E, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Not_PreBool_ReturnValue) == 0x00031F, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_IsSimulatingPhysics_ReturnValue_1) == 0x000320, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_IsSimulatingPhysics_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BooleanAND_ReturnValue) == 0x000321, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Not_PreBool_ReturnValue_1) == 0x000322, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_BooleanAND_ReturnValue_1) == 0x000323, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_GetActorUpVector_ReturnValue) == 0x000324, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_GetActorRightVector_ReturnValue) == 0x000330, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_Event_player) == 0x000340, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_Event_hit) == 0x000348, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_Event_action) == 0x0003D0, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_Event_static) == 0x0003D1, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_Event_frozen) == 0x0003D2, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_Event_active) == 0x0003D3, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_IsChildActor_ReturnValue) == 0x0003D4, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_IsChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003D8, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003E4, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0003E8, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0003F4, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, K2Node_CustomEvent_DestroyedActor) == 0x000400, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Dot_VectorVector_ReturnValue) == 0x000408, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_SignOfFloat_ReturnValue) == 0x00040C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Abs_ReturnValue) == 0x000410, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000414, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000418, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_MakeVector_ReturnValue) == 0x00041C, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000428, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_SelectRotator_ReturnValue) == 0x000434, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable, CallFunc_MakeTransform_ReturnValue) == 0x000440, "Member 'Prop_wallAttachable_C_ExecuteUbergraph_prop_wallAttachable::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function prop_wallAttachable.prop_wallAttachable_C.Dest
// 0x0008 (0x0008 - 0x0000)
struct Prop_wallAttachable_C_Dest final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallAttachable_C_Dest) == 0x000008, "Wrong alignment on Prop_wallAttachable_C_Dest");
static_assert(sizeof(Prop_wallAttachable_C_Dest) == 0x000008, "Wrong size on Prop_wallAttachable_C_Dest");
static_assert(offsetof(Prop_wallAttachable_C_Dest, DestroyedActor) == 0x000000, "Member 'Prop_wallAttachable_C_Dest::DestroyedActor' has a wrong offset!");

// Function prop_wallAttachable.prop_wallAttachable_C.tryStick
// 0x0180 (0x0180 - 0x0000)
struct Prop_wallAttachable_C_TryStick final
{
public:
	struct FHitResult                             OutHit;                                            // 0x0000(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0088(0x0010)(ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x00F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wallAttachable_C_TryStick) == 0x000008, "Wrong alignment on Prop_wallAttachable_C_TryStick");
static_assert(sizeof(Prop_wallAttachable_C_TryStick) == 0x000180, "Wrong size on Prop_wallAttachable_C_TryStick");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, OutHit) == 0x000000, "Member 'Prop_wallAttachable_C_TryStick::OutHit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_obj_statDyn_obj) == 0x000088, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, Temp_object_Variable) == 0x000098, "Member 'Prop_wallAttachable_C_TryStick::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_GetForwardVector_ReturnValue) == 0x0000B4, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C0, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000CC, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E4, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0000F0, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_TryStick, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000178, "Member 'Prop_wallAttachable_C_TryStick::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function prop_wallAttachable.prop_wallAttachable_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_wallAttachable_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallAttachable_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_wallAttachable_C_ActionOptionIndex");
static_assert(sizeof(Prop_wallAttachable_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_wallAttachable_C_ActionOptionIndex");
static_assert(offsetof(Prop_wallAttachable_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_wallAttachable_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_wallAttachable_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_wallAttachable_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_wallAttachable.prop_wallAttachable_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Prop_wallAttachable_C_SetPropProps final
{
public:
	bool                                          Param_Static;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_Frozen;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wallAttachable_C_SetPropProps) == 0x000001, "Wrong alignment on Prop_wallAttachable_C_SetPropProps");
static_assert(sizeof(Prop_wallAttachable_C_SetPropProps) == 0x000003, "Wrong size on Prop_wallAttachable_C_SetPropProps");
static_assert(offsetof(Prop_wallAttachable_C_SetPropProps, Param_Static) == 0x000000, "Member 'Prop_wallAttachable_C_SetPropProps::Param_Static' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_SetPropProps, Param_Frozen) == 0x000001, "Member 'Prop_wallAttachable_C_SetPropProps::Param_Frozen' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_SetPropProps, Active) == 0x000002, "Member 'Prop_wallAttachable_C_SetPropProps::Active' has a wrong offset!");

// Function prop_wallAttachable.prop_wallAttachable_C.lookAt
// 0x00B8 (0x00B8 - 0x0000)
struct Prop_wallAttachable_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallAttachable_C_LookAt) == 0x000008, "Wrong alignment on Prop_wallAttachable_C_LookAt");
static_assert(sizeof(Prop_wallAttachable_C_LookAt) == 0x0000B8, "Wrong size on Prop_wallAttachable_C_LookAt");
static_assert(offsetof(Prop_wallAttachable_C_LookAt, Player) == 0x000000, "Member 'Prop_wallAttachable_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_wallAttachable_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_LookAt, Return) == 0x000090, "Member 'Prop_wallAttachable_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_wallAttachable_C_LookAt, Text) == 0x000098, "Member 'Prop_wallAttachable_C_LookAt::Text' has a wrong offset!");
