#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_dynamite

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_wireComponent_dynamite.prop_wireComponent_dynamite_C.ExecuteUbergraph_prop_wireComponent_dynamite
// 0x0050 (0x0050 - 0x0000)
struct Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D33[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                K2Node_Event_wire;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite) == 0x000010, "Wrong alignment on Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite");
static_assert(sizeof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite) == 0x000050, "Wrong size on Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite");
static_assert(offsetof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite, EntryPoint) == 0x000000, "Member 'Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite, K2Node_Event_wire) == 0x000008, "Member 'Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite::K2Node_Event_wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_wireComponent_dynamite_C_ExecuteUbergraph_prop_wireComponent_dynamite::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_wireComponent_dynamite.prop_wireComponent_dynamite_C.wirePass
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_dynamite_C_WirePass final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_dynamite_C_WirePass) == 0x000008, "Wrong alignment on Prop_wireComponent_dynamite_C_WirePass");
static_assert(sizeof(Prop_wireComponent_dynamite_C_WirePass) == 0x000008, "Wrong size on Prop_wireComponent_dynamite_C_WirePass");
static_assert(offsetof(Prop_wireComponent_dynamite_C_WirePass, Wire) == 0x000000, "Member 'Prop_wireComponent_dynamite_C_WirePass::Wire' has a wrong offset!");

}

