#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_lighter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"


namespace SDK::Params
{

// Function prop_lighter.prop_lighter_C.ExecuteUbergraph_prop_lighter
// 0x0188 (0x0188 - 0x0000)
struct Prop_lighter_C_ExecuteUbergraph_prop_lighter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isFlammable_isFlammable;                  // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_ExecuteUbergraph_prop_lighter) == 0x000008, "Wrong alignment on Prop_lighter_C_ExecuteUbergraph_prop_lighter");
static_assert(sizeof(Prop_lighter_C_ExecuteUbergraph_prop_lighter) == 0x000188, "Wrong size on Prop_lighter_C_ExecuteUbergraph_prop_lighter");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, EntryPoint) == 0x000000, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CustomEvent_NotifyName_2) == 0x00001C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CustomEvent_NotifyName_1) == 0x000024, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CustomEvent_NotifyName) == 0x00003C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, Temp_name_Variable) == 0x000054, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CustomEvent_NotifyName_3) == 0x00005C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CreateDelegate_OutputDelegate_3) == 0x000064, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, Temp_int_Variable) == 0x000084, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00008C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_RandomFloat_ReturnValue) == 0x000090, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_FInterpTo_ReturnValue) == 0x000094, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_Event_player_1) == 0x0000A0, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_Event_player) == 0x0000A8, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B1, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B2, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_Time) == 0x0000B4, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_Distance) == 0x0000B8, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_Location) == 0x0000BC, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C8, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_Normal) == 0x0000D4, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E0, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_ElementIndex) == 0x000114, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_FaceIndex) == 0x000118, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_TraceStart) == 0x00011C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_BreakHitResult_TraceEnd) == 0x000128, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_DynamicCast_AsInt_Objects) == 0x000138, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_DynamicCast_AsInt_Objects_1) == 0x000150, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_DoesImplementInterface_ReturnValue) == 0x000161, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_isFlammable_isFlammable) == 0x000162, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_isFlammable_isFlammable' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000168, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, K2Node_CustomEvent_NotifyName_4) == 0x000174, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_Greater_IntInt_ReturnValue) == 0x00017C, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ExecuteUbergraph_prop_lighter, CallFunc_Subtract_IntInt_ReturnValue) == 0x000180, "Member 'Prop_lighter_C_ExecuteUbergraph_prop_lighter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_lighter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_lighter_C_ReceiveTick");
static_assert(sizeof(Prop_lighter_C_ReceiveTick) == 0x000004, "Wrong size on Prop_lighter_C_ReceiveTick");
static_assert(offsetof(Prop_lighter_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_lighter_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.OnCompleted_FBED7E6740590F83EA0294A86484A7A2
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2) == 0x000004, "Wrong alignment on Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2");
static_assert(sizeof(Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2) == 0x000008, "Wrong size on Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2");
static_assert(offsetof(Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2, NotifyName) == 0x000000, "Member 'Prop_lighter_C_OnCompleted_FBED7E6740590F83EA0294A86484A7A2::NotifyName' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.OnBlendOut_FBED7E6740590F83EA0294A86484A7A2
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2) == 0x000004, "Wrong alignment on Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2");
static_assert(sizeof(Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2) == 0x000008, "Wrong size on Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2");
static_assert(offsetof(Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2, NotifyName) == 0x000000, "Member 'Prop_lighter_C_OnBlendOut_FBED7E6740590F83EA0294A86484A7A2::NotifyName' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.OnInterrupted_FBED7E6740590F83EA0294A86484A7A2
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2) == 0x000004, "Wrong alignment on Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2");
static_assert(sizeof(Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2) == 0x000008, "Wrong size on Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2");
static_assert(offsetof(Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2, NotifyName) == 0x000000, "Member 'Prop_lighter_C_OnInterrupted_FBED7E6740590F83EA0294A86484A7A2::NotifyName' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2) == 0x000004, "Wrong alignment on Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2");
static_assert(sizeof(Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2) == 0x000008, "Wrong size on Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2");
static_assert(offsetof(Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2, NotifyName) == 0x000000, "Member 'Prop_lighter_C_OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2::NotifyName' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2) == 0x000004, "Wrong alignment on Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2");
static_assert(sizeof(Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2) == 0x000008, "Wrong size on Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2");
static_assert(offsetof(Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2, NotifyName) == 0x000000, "Member 'Prop_lighter_C_OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2::NotifyName' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.upd
// 0x0050 (0x0050 - 0x0000)
struct Prop_lighter_C_Upd final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_lighter_C_Upd) == 0x000008, "Wrong alignment on Prop_lighter_C_Upd");
static_assert(sizeof(Prop_lighter_C_Upd) == 0x000050, "Wrong size on Prop_lighter_C_Upd");
static_assert(offsetof(Prop_lighter_C_Upd, Temp_bool_Variable) == 0x000000, "Member 'Prop_lighter_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, Temp_object_Variable) == 0x000008, "Member 'Prop_lighter_C_Upd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, Temp_object_Variable_1) == 0x000010, "Member 'Prop_lighter_C_Upd::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, Temp_bool_Variable_1) == 0x000018, "Member 'Prop_lighter_C_Upd::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, Temp_object_Variable_2) == 0x000020, "Member 'Prop_lighter_C_Upd::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'Prop_lighter_C_Upd::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, K2Node_Select_Default) == 0x000030, "Member 'Prop_lighter_C_Upd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000038, "Member 'Prop_lighter_C_Upd::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'Prop_lighter_C_Upd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, K2Node_Select_Default_1) == 0x000040, "Member 'Prop_lighter_C_Upd::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_Upd, CallFunc_SetStaticMesh_ReturnValue) == 0x000048, "Member 'Prop_lighter_C_Upd::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.showUses
// 0x0080 (0x0080 - 0x0000)
struct Prop_lighter_C_ShowUses final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
};
static_assert(alignof(Prop_lighter_C_ShowUses) == 0x000008, "Wrong alignment on Prop_lighter_C_ShowUses");
static_assert(sizeof(Prop_lighter_C_ShowUses) == 0x000080, "Wrong size on Prop_lighter_C_ShowUses");
static_assert(offsetof(Prop_lighter_C_ShowUses, Result) == 0x000000, "Member 'Prop_lighter_C_ShowUses::Result' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ShowUses, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'Prop_lighter_C_ShowUses::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ShowUses, K2Node_MakeArray_Array) == 0x000058, "Member 'Prop_lighter_C_ShowUses::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_ShowUses, CallFunc_Format_ReturnValue) == 0x000068, "Member 'Prop_lighter_C_ShowUses::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_lighter_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_lighter_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_lighter_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_lighter_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_lighter_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_lighter_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_lighter_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_lighter_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_lighter_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_lighter_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_lighter_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_lighter_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_3;                         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_lighter_C_LoadData) == 0x000010, "Wrong alignment on Prop_lighter_C_LoadData");
static_assert(sizeof(Prop_lighter_C_LoadData) == 0x0000F0, "Wrong size on Prop_lighter_C_LoadData");
static_assert(offsetof(Prop_lighter_C_LoadData, Data) == 0x000000, "Member 'Prop_lighter_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LoadData, Return) == 0x0000C0, "Member 'Prop_lighter_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_lighter_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_lighter_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_lighter_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LoadData, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'Prop_lighter_C_LoadData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LoadData, CallFunc_Array_Get_Item_3) == 0x0000EC, "Member 'Prop_lighter_C_LoadData::CallFunc_Array_Get_Item_3' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.getData
// 0x02B0 (0x02B0 - 0x0000)
struct Prop_lighter_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	TArray<bool>                                  K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x00E0(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x00F0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_2;                          // 0x0100(0x0010)(ReferenceParm)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0110(0x00C0)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01D0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_3;                          // 0x01E0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01F0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_GetData) == 0x000010, "Wrong alignment on Prop_lighter_C_GetData");
static_assert(sizeof(Prop_lighter_C_GetData) == 0x0002B0, "Wrong size on Prop_lighter_C_GetData");
static_assert(offsetof(Prop_lighter_C_GetData, Data) == 0x000000, "Member 'Prop_lighter_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_MakeArray_Array) == 0x0000C0, "Member 'Prop_lighter_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'Prop_lighter_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x0000E0, "Member 'Prop_lighter_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x0000F0, "Member 'Prop_lighter_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_MakeArray_Array_2) == 0x000100, "Member 'Prop_lighter_C_GetData::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, CallFunc_getData_data) == 0x000110, "Member 'Prop_lighter_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'Prop_lighter_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_MakeArray_Array_3) == 0x0001E0, "Member 'Prop_lighter_C_GetData::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001F0, "Member 'Prop_lighter_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_lighter.prop_lighter_C.lookAt
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_lighter_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_showUses_Result;                          // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lighter_C_LookAt) == 0x000008, "Wrong alignment on Prop_lighter_C_LookAt");
static_assert(sizeof(Prop_lighter_C_LookAt) == 0x0000E0, "Wrong size on Prop_lighter_C_LookAt");
static_assert(offsetof(Prop_lighter_C_LookAt, Player) == 0x000000, "Member 'Prop_lighter_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_lighter_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LookAt, Return) == 0x000090, "Member 'Prop_lighter_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LookAt, Text) == 0x000098, "Member 'Prop_lighter_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_lighter_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_lighter_C_LookAt::boundObjectReplace' has a wrong offset!");
