#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_snack_sushi

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_snack_sushi.prop_snack_sushi_C.ExecuteUbergraph_prop_snack_sushi
// 0x0004 (0x0004 - 0x0000)
struct Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi) == 0x000004, "Wrong alignment on Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi");
static_assert(sizeof(Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi) == 0x000004, "Wrong size on Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi");
static_assert(offsetof(Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi, EntryPoint) == 0x000000, "Member 'Prop_snack_sushi_C_ExecuteUbergraph_prop_snack_sushi::EntryPoint' has a wrong offset!");

// Function prop_snack_sushi.prop_snack_sushi_C.upd
// 0x0038 (0x0038 - 0x0000)
struct Prop_snack_sushi_C_Upd final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_sushi_C_Upd) == 0x000008, "Wrong alignment on Prop_snack_sushi_C_Upd");
static_assert(sizeof(Prop_snack_sushi_C_Upd) == 0x000038, "Wrong size on Prop_snack_sushi_C_Upd");
static_assert(offsetof(Prop_snack_sushi_C_Upd, Temp_bool_Variable) == 0x000000, "Member 'Prop_snack_sushi_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, Temp_object_Variable) == 0x000008, "Member 'Prop_snack_sushi_C_Upd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, Temp_object_Variable_1) == 0x000010, "Member 'Prop_snack_sushi_C_Upd::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, Temp_int_Variable) == 0x000018, "Member 'Prop_snack_sushi_C_Upd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_snack_sushi_C_Upd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'Prop_snack_sushi_C_Upd::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'Prop_snack_sushi_C_Upd::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'Prop_snack_sushi_C_Upd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_sushi_C_Upd, K2Node_Select_Default) == 0x000030, "Member 'Prop_snack_sushi_C_Upd::K2Node_Select_Default' has a wrong offset!");

}

