#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_obelisk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_obelisk.prop_obelisk_C.ExecuteUbergraph_prop_obelisk
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_obelisk_C_ExecuteUbergraph_prop_obelisk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0050(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk) == 0x000008, "Wrong alignment on Prop_obelisk_C_ExecuteUbergraph_prop_obelisk");
static_assert(sizeof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk) == 0x0000F0, "Wrong size on Prop_obelisk_C_ExecuteUbergraph_prop_obelisk");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, EntryPoint) == 0x000000, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, Temp_int_Variable) == 0x000014, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, Temp_bool_IsClosed_Variable) == 0x000021, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_Event_hook) == 0x000028, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000030, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_ComponentBoundEvent_OtherActor) == 0x000038, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_ComponentBoundEvent_OtherComp) == 0x000040, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000048, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_ComponentBoundEvent_bFromSweep) == 0x00004C, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, K2Node_ComponentBoundEvent_SweepResult) == 0x000050, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000D8, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_ExecuteUbergraph_prop_obelisk, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000E0, "Member 'Prop_obelisk_C_ExecuteUbergraph_prop_obelisk::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");

// Function prop_obelisk.prop_obelisk_C.BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_obelisk_C_BndEvt__obelisk_walk_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_obelisk.prop_obelisk_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct Prop_obelisk_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_obelisk_C_HookTension) == 0x000008, "Wrong alignment on Prop_obelisk_C_HookTension");
static_assert(sizeof(Prop_obelisk_C_HookTension) == 0x000008, "Wrong size on Prop_obelisk_C_HookTension");
static_assert(offsetof(Prop_obelisk_C_HookTension, Hook) == 0x000000, "Member 'Prop_obelisk_C_HookTension::Hook' has a wrong offset!");

}

