#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_handradar

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_handradar.prop_handradar_C.ExecuteUbergraph_prop_handradar
// 0x0138 (0x0138 - 0x0000)
struct Prop_handradar_C_ExecuteUbergraph_prop_handradar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_handradar_C_ExecuteUbergraph_prop_handradar) == 0x000008, "Wrong alignment on Prop_handradar_C_ExecuteUbergraph_prop_handradar");
static_assert(sizeof(Prop_handradar_C_ExecuteUbergraph_prop_handradar) == 0x000138, "Wrong size on Prop_handradar_C_ExecuteUbergraph_prop_handradar");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, EntryPoint) == 0x000000, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_9) == 0x000004, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_8) == 0x00001C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_7) == 0x000034, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_6) == 0x00004C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_5) == 0x000064, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, Temp_name_Variable) == 0x00007C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_5) == 0x000084, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_4) == 0x000094, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_3) == 0x00009C, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A4, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_2) == 0x0000B4, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000BC, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName_1) == 0x0000CC, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000D4, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CustomEvent_NotifyName) == 0x0000E4, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000EC, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, Temp_name_Variable_1) == 0x0000FC, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000108, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_Event_player_1) == 0x000110, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, K2Node_Event_player) == 0x000118, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000120, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000128, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_handradar_C_ExecuteUbergraph_prop_handradar, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'Prop_handradar_C_ExecuteUbergraph_prop_handradar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnCompleted_3D095B7742ACA77CDF23DA915B159D1D
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D) == 0x000004, "Wrong alignment on Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(sizeof(Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D) == 0x000008, "Wrong size on Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(offsetof(Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnCompleted_3D095B7742ACA77CDF23DA915B159D1D::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D) == 0x000004, "Wrong alignment on Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(sizeof(Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D) == 0x000008, "Wrong size on Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(offsetof(Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnBlendOut_3D095B7742ACA77CDF23DA915B159D1D::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D) == 0x000004, "Wrong alignment on Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(sizeof(Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D) == 0x000008, "Wrong size on Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(offsetof(Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnInterrupted_3D095B7742ACA77CDF23DA915B159D1D::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D) == 0x000004, "Wrong alignment on Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(sizeof(Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D) == 0x000008, "Wrong size on Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(offsetof(Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnNotifyBegin_3D095B7742ACA77CDF23DA915B159D1D::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D) == 0x000004, "Wrong alignment on Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(sizeof(Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D) == 0x000008, "Wrong size on Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D");
static_assert(offsetof(Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnNotifyEnd_3D095B7742ACA77CDF23DA915B159D1D::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnCompleted_24CE38C74EA5F51BE312D5B987A72F72
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72) == 0x000004, "Wrong alignment on Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(sizeof(Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72) == 0x000008, "Wrong size on Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(offsetof(Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnCompleted_24CE38C74EA5F51BE312D5B987A72F72::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72) == 0x000004, "Wrong alignment on Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(sizeof(Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72) == 0x000008, "Wrong size on Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(offsetof(Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnBlendOut_24CE38C74EA5F51BE312D5B987A72F72::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72) == 0x000004, "Wrong alignment on Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(sizeof(Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72) == 0x000008, "Wrong size on Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(offsetof(Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnInterrupted_24CE38C74EA5F51BE312D5B987A72F72::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72) == 0x000004, "Wrong alignment on Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(sizeof(Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72) == 0x000008, "Wrong size on Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(offsetof(Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnNotifyBegin_24CE38C74EA5F51BE312D5B987A72F72::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72) == 0x000004, "Wrong alignment on Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(sizeof(Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72) == 0x000008, "Wrong size on Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72");
static_assert(offsetof(Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72, NotifyName) == 0x000000, "Member 'Prop_handradar_C_OnNotifyEnd_24CE38C74EA5F51BE312D5B987A72F72::NotifyName' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Prop_handradar_C_PlayerHandRelease_RMB");
static_assert(sizeof(Prop_handradar_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Prop_handradar_C_PlayerHandRelease_RMB");
static_assert(offsetof(Prop_handradar_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Prop_handradar_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function prop_handradar.prop_handradar_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_handradar_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_handradar_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_handradar_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_handradar_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_handradar_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_handradar_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_handradar_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

