#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_cookingFood

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "Struct_prop_structs.hpp"


namespace SDK::Params
{

// Function prop_cookingFood.prop_cookingFood_C.ExecuteUbergraph_prop_cookingFood
// 0x01C0 (0x01C0 - 0x0000)
struct Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x0094(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x00C0(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood) == 0x000010, "Wrong alignment on Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood");
static_assert(sizeof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood) == 0x0001C0, "Wrong size on Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, EntryPoint) == 0x000000, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, Temp_int_Variable) == 0x000004, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, Temp_int_Variable_1) == 0x000010, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, Temp_int_Variable_2) == 0x000014, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000018, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, K2Node_Event_clean) == 0x00002C, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000068, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000078, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, Temp_int_Variable_3) == 0x000080, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Array_Get_Item) == 0x000084, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_propToObject_ReturnValue) == 0x000091, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_propToObject_foodData) == 0x000094, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_propToObject_object) == 0x0000B0, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_propToObject_isFood) == 0x0000B8, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_propToObject_propData) == 0x0000C0, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000140, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000148, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_IsValidClass_ReturnValue) == 0x000150, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000158, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, K2Node_DynamicCast_AsInt_Player) == 0x000160, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_asProp_return) == 0x000178, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Add_IntInt_ReturnValue_3) == 0x000180, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Conv_NameToString_ReturnValue) == 0x000188, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, K2Node_Event_DeltaSeconds) == 0x000198, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00019C, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A0, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0001A4, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001A8, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001AC, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0001B0, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0001B4, "Member 'Prop_cookingFood_C_ExecuteUbergraph_prop_cookingFood::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");

// Function prop_cookingFood.prop_cookingFood_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_cookingFood_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_cookingFood_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_cookingFood_C_ReceiveTick");
static_assert(sizeof(Prop_cookingFood_C_ReceiveTick) == 0x000004, "Wrong size on Prop_cookingFood_C_ReceiveTick");
static_assert(offsetof(Prop_cookingFood_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_cookingFood_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_cookingFood.prop_cookingFood_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Prop_cookingFood_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_cookingFood_C_Slice) == 0x000001, "Wrong alignment on Prop_cookingFood_C_Slice");
static_assert(sizeof(Prop_cookingFood_C_Slice) == 0x000001, "Wrong size on Prop_cookingFood_C_Slice");
static_assert(offsetof(Prop_cookingFood_C_Slice, Clean) == 0x000000, "Member 'Prop_cookingFood_C_Slice::Clean' has a wrong offset!");

}

