#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_comet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_comet.prop_comet_C.ExecuteUbergraph_prop_comet
// 0x01E0 (0x01E0 - 0x0000)
struct Prop_comet_C_ExecuteUbergraph_prop_comet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0054(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_comet_C_ExecuteUbergraph_prop_comet) == 0x000010, "Wrong alignment on Prop_comet_C_ExecuteUbergraph_prop_comet");
static_assert(sizeof(Prop_comet_C_ExecuteUbergraph_prop_comet) == 0x0001E0, "Wrong size on Prop_comet_C_ExecuteUbergraph_prop_comet");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, EntryPoint) == 0x000000, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_GetVelocity_ReturnValue) == 0x000004, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00001C, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000028, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, K2Node_ComponentBoundEvent_HitComponent) == 0x000030, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, K2Node_ComponentBoundEvent_OtherActor) == 0x000038, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, K2Node_ComponentBoundEvent_OtherComp) == 0x000040, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000048, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, K2Node_ComponentBoundEvent_Hit) == 0x000054, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_bBlockingHit) == 0x0000DC, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000DD, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_Time) == 0x0000E0, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_Distance) == 0x0000E4, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_Location) == 0x0000E8, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_ImpactPoint) == 0x0000F4, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_Normal) == 0x000100, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_ImpactNormal) == 0x00010C, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_PhysMat) == 0x000118, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_HitActor) == 0x000120, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_HitComponent) == 0x000128, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_HitBoneName) == 0x000130, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_HitItem) == 0x000138, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_ElementIndex) == 0x00013C, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_FaceIndex) == 0x000140, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_TraceStart) == 0x000144, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BreakHitResult_TraceEnd) == 0x000150, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00015C, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_GetActorForwardVector_ReturnValue) == 0x000168, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_Add_VectorVector_ReturnValue) == 0x000174, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001B0, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B8, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0001C0, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D0, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_ExecuteUbergraph_prop_comet, K2Node_Event_DeltaSeconds) == 0x0001D8, "Member 'Prop_comet_C_ExecuteUbergraph_prop_comet::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function prop_comet.prop_comet_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_comet_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_comet_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_comet_C_ReceiveTick");
static_assert(sizeof(Prop_comet_C_ReceiveTick) == 0x000004, "Wrong size on Prop_comet_C_ReceiveTick");
static_assert(offsetof(Prop_comet_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_comet_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_comet.prop_comet_C.BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Param_Hit) == 0x000024, "Member 'Prop_comet_C_BndEvt__prop_comet_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Param_Hit' has a wrong offset!");

}

