#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_route

#include "Basic.hpp"

#include "Prop_wireComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_route.prop_wireComponent_route_C
// 0x0028 (0x0398 - 0x0370)
class AProp_wireComponent_route_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_route_C;         // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AWire_C*>                        Wires;                                             // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          T;                                                 // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_wireComponent_route(int32 EntryPoint);
	void WirePass(class AWire_C* Wire);
	void WireDisconnected(class AWire_C* Wire, bool Side);
	void WireConnected(class AWire_C* Wire, bool Side);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_route_C">();
	}
	static class AProp_wireComponent_route_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_route_C>();
	}
};
static_assert(alignof(AProp_wireComponent_route_C) == 0x000008, "Wrong alignment on AProp_wireComponent_route_C");
static_assert(sizeof(AProp_wireComponent_route_C) == 0x000398, "Wrong size on AProp_wireComponent_route_C");
static_assert(offsetof(AProp_wireComponent_route_C, UberGraphFrame_Prop_wireComponent_route_C) == 0x000370, "Member 'AProp_wireComponent_route_C::UberGraphFrame_Prop_wireComponent_route_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_route_C, Billboard) == 0x000378, "Member 'AProp_wireComponent_route_C::Billboard' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_route_C, Wires) == 0x000380, "Member 'AProp_wireComponent_route_C::Wires' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_route_C, T) == 0x000390, "Member 'AProp_wireComponent_route_C::T' has a wrong offset!");

}

