#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_coalVein

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_coalVein.prop_coalVein_C
// 0x0010 (0x0388 - 0x0378)
class AProp_coalVein_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_coalVein_C;                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Hits;                                              // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Coals;                                             // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_coalVein(int32 EntryPoint);
	void ReceiveBeginPlay();
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, float Damage);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_coalVein_C">();
	}
	static class AProp_coalVein_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_coalVein_C>();
	}
};
static_assert(alignof(AProp_coalVein_C) == 0x000008, "Wrong alignment on AProp_coalVein_C");
static_assert(sizeof(AProp_coalVein_C) == 0x000388, "Wrong size on AProp_coalVein_C");
static_assert(offsetof(AProp_coalVein_C, UberGraphFrame_Prop_coalVein_C) == 0x000378, "Member 'AProp_coalVein_C::UberGraphFrame_Prop_coalVein_C' has a wrong offset!");
static_assert(offsetof(AProp_coalVein_C, Hits) == 0x000380, "Member 'AProp_coalVein_C::Hits' has a wrong offset!");
static_assert(offsetof(AProp_coalVein_C, Coals) == 0x000384, "Member 'AProp_coalVein_C::Coals' has a wrong offset!");

}

