#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fridgeDoor2

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_fridgeDoor2.prop_fridgeDoor2_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_fridgeDoor2_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_fridgeDoor2_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_fridgeDoor2_C_GetActionOptions");
static_assert(sizeof(Prop_fridgeDoor2_C_GetActionOptions) == 0x000060, "Wrong size on Prop_fridgeDoor2_C_GetActionOptions");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_fridgeDoor2_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_fridgeDoor2_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_fridgeDoor2_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_fridgeDoor2_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_fridgeDoor2_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_fridgeDoor2_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_fridgeDoor2_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_fridgeDoor2_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_fridgeDoor2_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

