#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_lighter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_lighter.prop_lighter_C
// 0x0018 (0x0380 - 0x0368)
class AProp_lighter_C final : public AProp_C
{
public:
	uint8                                         Pad_3AC7[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_lighter_C;                     // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Opened;                                            // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AC8[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_lighter(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnCompleted_FBED7E6740590F83EA0294A86484A7A2(class FName NotifyName);
	void OnBlendOut_FBED7E6740590F83EA0294A86484A7A2(class FName NotifyName);
	void OnInterrupted_FBED7E6740590F83EA0294A86484A7A2(class FName NotifyName);
	void OnNotifyBegin_FBED7E6740590F83EA0294A86484A7A2(class FName NotifyName);
	void OnNotifyEnd_FBED7E6740590F83EA0294A86484A7A2(class FName NotifyName);
	void Upd();
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_lighter_C">();
	}
	static class AProp_lighter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_lighter_C>();
	}
};
static_assert(alignof(AProp_lighter_C) == 0x000008, "Wrong alignment on AProp_lighter_C");
static_assert(sizeof(AProp_lighter_C) == 0x000380, "Wrong size on AProp_lighter_C");
static_assert(offsetof(AProp_lighter_C, UberGraphFrame_Prop_lighter_C) == 0x000368, "Member 'AProp_lighter_C::UberGraphFrame_Prop_lighter_C' has a wrong offset!");
static_assert(offsetof(AProp_lighter_C, PointLight) == 0x000370, "Member 'AProp_lighter_C::PointLight' has a wrong offset!");
static_assert(offsetof(AProp_lighter_C, Opened) == 0x000378, "Member 'AProp_lighter_C::Opened' has a wrong offset!");
static_assert(offsetof(AProp_lighter_C, Alpha) == 0x00037C, "Member 'AProp_lighter_C::Alpha' has a wrong offset!");

}

