#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_discBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_discBox.prop_discBox_C
// 0x0030 (0x0398 - 0x0368)
class AProp_discBox_C final : public AProp_C
{
public:
	uint8                                         Pad_3B01[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_discBox_C;                     // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Disc_2;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          Disc_1;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Discs;                                             // 0x0388(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_prop_discBox(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, int32 Param_Index, Enum_interactionActions Action);
	void BndEvt__Cylinder_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Gen();
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_discBox_C">();
	}
	static class AProp_discBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_discBox_C>();
	}
};
static_assert(alignof(AProp_discBox_C) == 0x000008, "Wrong alignment on AProp_discBox_C");
static_assert(sizeof(AProp_discBox_C) == 0x000398, "Wrong size on AProp_discBox_C");
static_assert(offsetof(AProp_discBox_C, UberGraphFrame_Prop_discBox_C) == 0x000368, "Member 'AProp_discBox_C::UberGraphFrame_Prop_discBox_C' has a wrong offset!");
static_assert(offsetof(AProp_discBox_C, Cylinder) == 0x000370, "Member 'AProp_discBox_C::Cylinder' has a wrong offset!");
static_assert(offsetof(AProp_discBox_C, Disc_2) == 0x000378, "Member 'AProp_discBox_C::Disc_2' has a wrong offset!");
static_assert(offsetof(AProp_discBox_C, Disc_1) == 0x000380, "Member 'AProp_discBox_C::Disc_1' has a wrong offset!");
static_assert(offsetof(AProp_discBox_C, Discs) == 0x000388, "Member 'AProp_discBox_C::Discs' has a wrong offset!");

}

