#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_ruler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_ruler.prop_ruler_C.ExecuteUbergraph_prop_ruler
// 0x0490 (0x0490 - 0x0000)
struct Prop_ruler_C_ExecuteUbergraph_prop_ruler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BBA[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BBB[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BBC[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BBD[0x2];                                     // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BBE[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BBF[0x2];                                     // 0x023A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC0[0x4];                                     // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x02BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC1[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0368(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03B0(0x0018)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0400(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_ruler_C_ExecuteUbergraph_prop_ruler) == 0x000008, "Wrong alignment on Prop_ruler_C_ExecuteUbergraph_prop_ruler");
static_assert(sizeof(Prop_ruler_C_ExecuteUbergraph_prop_ruler) == 0x000490, "Wrong size on Prop_ruler_C_ExecuteUbergraph_prop_ruler");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, EntryPoint) == 0x000000, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, K2Node_Event_player) == 0x000008, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_bBlockingHit) == 0x000010, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_bInitialOverlap) == 0x000011, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Time) == 0x000014, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Distance) == 0x000018, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Location) == 0x00001C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ImpactPoint) == 0x000028, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Normal) == 0x000034, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ImpactNormal) == 0x000040, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_PhysMat) == 0x000050, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitActor) == 0x000058, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitComponent) == 0x000060, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitBoneName) == 0x000068, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitItem) == 0x000070, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ElementIndex) == 0x000074, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_FaceIndex) == 0x000078, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_TraceStart) == 0x00007C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_TraceEnd) == 0x000088, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000094, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000098, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, K2Node_Event_player_1) == 0x000120, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, K2Node_Event_DeltaSeconds) == 0x000128, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00012C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00012D, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Time_1) == 0x000130, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Distance_1) == 0x000134, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Location_1) == 0x000138, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000144, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Normal_1) == 0x000150, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ImpactNormal_1) == 0x00015C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_PhysMat_1) == 0x000168, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitActor_1) == 0x000170, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitComponent_1) == 0x000178, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitBoneName_1) == 0x000180, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitItem_1) == 0x000188, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ElementIndex_1) == 0x00018C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_FaceIndex_1) == 0x000190, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_TraceStart_1) == 0x000194, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_TraceEnd_1) == 0x0001A0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x0001AC, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0001B0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_bBlockingHit_2) == 0x000238, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x000239, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Time_2) == 0x00023C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Distance_2) == 0x000240, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Location_2) == 0x000244, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ImpactPoint_2) == 0x000250, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_Normal_2) == 0x00025C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ImpactNormal_2) == 0x000268, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_PhysMat_2) == 0x000278, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitActor_2) == 0x000280, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitComponent_2) == 0x000288, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitBoneName_2) == 0x000290, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_HitItem_2) == 0x000298, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_ElementIndex_2) == 0x00029C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_FaceIndex_2) == 0x0002A0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_TraceStart_2) == 0x0002A4, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_BreakHitResult_TraceEnd_2) == 0x0002B0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x0002BC, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000344, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000350, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Vector_Distance_ReturnValue) == 0x00035C, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000360, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Conv_FloatToText_ReturnValue) == 0x000368, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Conv_TextToString_ReturnValue) == 0x000380, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Concat_StrStr_ReturnValue) == 0x000390, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0003A0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Conv_StringToText_ReturnValue) == 0x0003B0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x0003C8, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0003D4, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Vector_Distance_ReturnValue_1) == 0x0003E0, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0003E4, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_FindLookAtRotation_ReturnValue) == 0x0003E8, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_MakeVector_ReturnValue) == 0x0003F4, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000400, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_ruler_C_ExecuteUbergraph_prop_ruler, CallFunc_IsValid_ReturnValue) == 0x000488, "Member 'Prop_ruler_C_ExecuteUbergraph_prop_ruler::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function prop_ruler.prop_ruler_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_ruler_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_ruler_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_ruler_C_ReceiveTick");
static_assert(sizeof(Prop_ruler_C_ReceiveTick) == 0x000004, "Wrong size on Prop_ruler_C_ReceiveTick");
static_assert(offsetof(Prop_ruler_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_ruler_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_ruler.prop_ruler_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_ruler_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_ruler_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_ruler_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_ruler_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_ruler_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_ruler_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_ruler_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_ruler.prop_ruler_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_ruler_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_ruler_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Prop_ruler_C_PlayerHandRelease_RMB");
static_assert(sizeof(Prop_ruler_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Prop_ruler_C_PlayerHandRelease_RMB");
static_assert(offsetof(Prop_ruler_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Prop_ruler_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

}

