#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_treasureChest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_treasureChest.prop_treasureChest_C
// 0x0070 (0x03E8 - 0x0378)
class AProp_treasureChest_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_treasureChest_C;               // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Cap;                                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio1;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   KeyM;                                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    KeyAxis;                                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            Closed;                                            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Gold;                                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            Nocoll2;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            Joint;                                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Op_a_AEE871A64FE54E5FC2FA3E9D5B571BC2;             // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Op__Direction_AEE871A64FE54E5FC2FA3E9D5B571BC2;    // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Op;                                                // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasGold;                                           // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasKey;                                            // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Opened;                                            // 0x03E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_treasureChest(int32 EntryPoint);
	void Open();
	void BndEvt__prop_treasureChest_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Op__UpdateFunc();
	void Op__FinishedFunc();
	void Upd();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void ReceiveBeginPlay();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_treasureChest_C">();
	}
	static class AProp_treasureChest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_treasureChest_C>();
	}
};
static_assert(alignof(AProp_treasureChest_C) == 0x000008, "Wrong alignment on AProp_treasureChest_C");
static_assert(sizeof(AProp_treasureChest_C) == 0x0003E8, "Wrong size on AProp_treasureChest_C");
static_assert(offsetof(AProp_treasureChest_C, UberGraphFrame_Prop_treasureChest_C) == 0x000378, "Member 'AProp_treasureChest_C::UberGraphFrame_Prop_treasureChest_C' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Cap) == 0x000380, "Member 'AProp_treasureChest_C::Cap' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Audio1) == 0x000388, "Member 'AProp_treasureChest_C::Audio1' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Audio) == 0x000390, "Member 'AProp_treasureChest_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Sphere) == 0x000398, "Member 'AProp_treasureChest_C::Sphere' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, KeyM) == 0x0003A0, "Member 'AProp_treasureChest_C::KeyM' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, KeyAxis) == 0x0003A8, "Member 'AProp_treasureChest_C::KeyAxis' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Closed) == 0x0003B0, "Member 'AProp_treasureChest_C::Closed' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Gold) == 0x0003B8, "Member 'AProp_treasureChest_C::Gold' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Nocoll2) == 0x0003C0, "Member 'AProp_treasureChest_C::Nocoll2' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Joint) == 0x0003C8, "Member 'AProp_treasureChest_C::Joint' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Op_a_AEE871A64FE54E5FC2FA3E9D5B571BC2) == 0x0003D0, "Member 'AProp_treasureChest_C::Op_a_AEE871A64FE54E5FC2FA3E9D5B571BC2' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Op__Direction_AEE871A64FE54E5FC2FA3E9D5B571BC2) == 0x0003D4, "Member 'AProp_treasureChest_C::Op__Direction_AEE871A64FE54E5FC2FA3E9D5B571BC2' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Op) == 0x0003D8, "Member 'AProp_treasureChest_C::Op' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, HasGold) == 0x0003E0, "Member 'AProp_treasureChest_C::HasGold' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, HasKey) == 0x0003E1, "Member 'AProp_treasureChest_C::HasKey' has a wrong offset!");
static_assert(offsetof(AProp_treasureChest_C, Opened) == 0x0003E2, "Member 'AProp_treasureChest_C::Opened' has a wrong offset!");

}

