#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_plunger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_plunger.prop_plunger_C.ExecuteUbergraph_prop_plunger
// 0x0090 (0x0090 - 0x0000)
struct Prop_plunger_C_ExecuteUbergraph_prop_plunger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlungerProjectile_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_plunger_C_ExecuteUbergraph_prop_plunger) == 0x000010, "Wrong alignment on Prop_plunger_C_ExecuteUbergraph_prop_plunger");
static_assert(sizeof(Prop_plunger_C_ExecuteUbergraph_prop_plunger) == 0x000090, "Wrong size on Prop_plunger_C_ExecuteUbergraph_prop_plunger");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, EntryPoint) == 0x000000, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, K2Node_Event_player) == 0x000008, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_GetForwardVector_ReturnValue) == 0x00001C, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_plunger_C_ExecuteUbergraph_prop_plunger, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Prop_plunger_C_ExecuteUbergraph_prop_plunger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_plunger.prop_plunger_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_plunger_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_plunger_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_plunger_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_plunger_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_plunger_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_plunger_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_plunger_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

