#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_broom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_broom.prop_broom_C
// 0x0018 (0x0380 - 0x0368)
class AProp_broom_C : public AProp_C
{
public:
	uint8                                         Pad_3B35[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_broom_C;                       // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMainPlayer_C*                          Player;                                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Force;                                             // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_broom(int32 EntryPoint);
	void OnCompleted_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnBlendOut_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnInterrupted_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnNotifyBegin_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnNotifyEnd_7E35D01041C5887545256ABEE348B954(class FName NotifyName);
	void OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10(class FName NotifyName);
	void OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10(class FName NotifyName);
	void OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10(class FName NotifyName);
	void OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10(class FName NotifyName);
	void OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10(class FName NotifyName);
	void PlayerHandUse_RMB(class AMainPlayer_C* Param_Player);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Param_Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_broom_C">();
	}
	static class AProp_broom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_broom_C>();
	}
};
static_assert(alignof(AProp_broom_C) == 0x000008, "Wrong alignment on AProp_broom_C");
static_assert(sizeof(AProp_broom_C) == 0x000380, "Wrong size on AProp_broom_C");
static_assert(offsetof(AProp_broom_C, UberGraphFrame_Prop_broom_C) == 0x000368, "Member 'AProp_broom_C::UberGraphFrame_Prop_broom_C' has a wrong offset!");
static_assert(offsetof(AProp_broom_C, Player) == 0x000370, "Member 'AProp_broom_C::Player' has a wrong offset!");
static_assert(offsetof(AProp_broom_C, Force) == 0x000378, "Member 'AProp_broom_C::Force' has a wrong offset!");
static_assert(offsetof(AProp_broom_C, Speed) == 0x00037C, "Member 'AProp_broom_C::Speed' has a wrong offset!");

}

