#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_jet

#include "Basic.hpp"

#include "Prop_wireComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_jet.prop_wireComponent_jet_C
// 0x0028 (0x0398 - 0x0370)
class AProp_wireComponent_jet_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_jet_C;           // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Rozbeam_loop;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Force;                                             // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_wireComponent_jet(int32 EntryPoint);
	void WirePass(class AWire_C* Wire);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_jet_C">();
	}
	static class AProp_wireComponent_jet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_jet_C>();
	}
};
static_assert(alignof(AProp_wireComponent_jet_C) == 0x000008, "Wrong alignment on AProp_wireComponent_jet_C");
static_assert(sizeof(AProp_wireComponent_jet_C) == 0x000398, "Wrong size on AProp_wireComponent_jet_C");
static_assert(offsetof(AProp_wireComponent_jet_C, UberGraphFrame_Prop_wireComponent_jet_C) == 0x000370, "Member 'AProp_wireComponent_jet_C::UberGraphFrame_Prop_wireComponent_jet_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_jet_C, Rozbeam_loop) == 0x000378, "Member 'AProp_wireComponent_jet_C::Rozbeam_loop' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_jet_C, ParticleSystem) == 0x000380, "Member 'AProp_wireComponent_jet_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_jet_C, Arrow) == 0x000388, "Member 'AProp_wireComponent_jet_C::Arrow' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_jet_C, Force) == 0x000390, "Member 'AProp_wireComponent_jet_C::Force' has a wrong offset!");

}

