#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_boarGray

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_boarGray.prop_boarGray_C.ExecuteUbergraph_prop_boarGray
// 0x05F0 (0x05F0 - 0x0000)
struct Prop_boarGray_C_ExecuteUbergraph_prop_boarGray final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0028(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_3;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0174(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_4;           // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_5;           // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A6[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A7[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0250(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A8[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A9[0x3];                                     // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue_4;           // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue_1;                // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39AA[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0328(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0344(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39AB[0x3];                                     // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39AC[0x2];                                     // 0x03DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_5;           // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_8;       // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x0494(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39AD[0x3];                                     // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_2;       // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_2;     // 0x052C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x05CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray) == 0x000008, "Wrong alignment on Prop_boarGray_C_ExecuteUbergraph_prop_boarGray");
static_assert(sizeof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray) == 0x0005F0, "Wrong size on Prop_boarGray_C_ExecuteUbergraph_prop_boarGray");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, EntryPoint) == 0x000000, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetActorRightVector_ReturnValue) == 0x000010, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetActorForwardVector_ReturnValue) == 0x00001C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_obj_statDyn_obj) == 0x000028, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000044, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000050, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00005C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetComponentVelocity_ReturnValue) == 0x000068, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_Event_DeltaSeconds) == 0x000074, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetForwardVector_ReturnValue) == 0x000078, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000084, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetForwardVector_ReturnValue_1) == 0x000090, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Dot_VectorVector_ReturnValue) == 0x00009C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000A8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000AC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000B8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x0000C4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetForwardVector_ReturnValue_2) == 0x0000DC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetForwardVector_ReturnValue_3) == 0x0000E8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetForwardVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x0000F4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0000F8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Abs_ReturnValue) == 0x000104, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Dot_VectorVector_ReturnValue_3) == 0x000108, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Dot_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00010C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_SignOfFloat_ReturnValue) == 0x000110, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Abs_ReturnValue_1) == 0x000114, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000118, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000120, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000124, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000130, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000134, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000140, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000144, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x000150, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00015C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000168, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000174, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetForwardVector_ReturnValue_4) == 0x0001FC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetForwardVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetActorForwardVector_ReturnValue_2) == 0x000208, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetActorForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_SetVectorLength_ReturnValue) == 0x000214, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetForwardVector_ReturnValue_5) == 0x000220, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetForwardVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000230, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_ComponentBoundEvent_OtherActor) == 0x000238, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_ComponentBoundEvent_OtherComp) == 0x000240, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000248, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_ComponentBoundEvent_bFromSweep) == 0x00024C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_ComponentBoundEvent_SweepResult) == 0x000250, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x0002D8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_DynamicCast_AsMain_Player) == 0x0002E8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Dot_VectorVector_ReturnValue_4) == 0x0002F4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Dot_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_SignOfFloat_ReturnValue_1) == 0x0002F8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_SignOfFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Abs_ReturnValue_2) == 0x0002FC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_GetVelocity_ReturnValue) == 0x000300, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x00030C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_6) == 0x000310, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00031C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000320, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, Temp_object_Variable) == 0x000328, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_7) == 0x000338, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000344, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0003CC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0003D0, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_bBlockingHit) == 0x0003DC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003DD, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_Time) == 0x0003E0, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_Distance) == 0x0003E4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_Location) == 0x0003E8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_ImpactPoint) == 0x0003F4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_Normal) == 0x000400, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_ImpactNormal) == 0x00040C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_PhysMat) == 0x000418, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_HitActor) == 0x000420, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_HitComponent) == 0x000428, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_HitBoneName) == 0x000430, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_HitItem) == 0x000438, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_ElementIndex) == 0x00043C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_FaceIndex) == 0x000440, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_TraceStart) == 0x000444, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_BreakHitResult_TraceEnd) == 0x000450, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Cross_VectorVector_ReturnValue) == 0x00045C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Dot_VectorVector_ReturnValue_5) == 0x000468, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Dot_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x00046C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000478, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x00047C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorFloat_ReturnValue_8) == 0x000488, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x000494, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Less_FloatFloat_ReturnValue) == 0x00051C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Conv_VectorToRotator_ReturnValue_2) == 0x000520, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Conv_VectorToRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_K2_SetWorldRotation_SweepHitResult_2) == 0x00052C, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_K2_SetWorldRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_FMin_ReturnValue) == 0x0005B4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0005B8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0005BC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0005C0, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Lerp_ReturnValue) == 0x0005C4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0005C8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_MakeVector_ReturnValue_1) == 0x0005CC, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_MakeVector_ReturnValue_2) == 0x0005D8, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_ExecuteUbergraph_prop_boarGray, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0005E4, "Member 'Prop_boarGray_C_ExecuteUbergraph_prop_boarGray::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");

// Function prop_boarGray.prop_boarGray_C.BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39AE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_boarGray_C_BndEvt__prop_boarGray_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_boarGray.prop_boarGray_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_boarGray_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_boarGray_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_boarGray_C_ReceiveTick");
static_assert(sizeof(Prop_boarGray_C_ReceiveTick) == 0x000004, "Wrong size on Prop_boarGray_C_ReceiveTick");
static_assert(offsetof(Prop_boarGray_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_boarGray_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

