#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_dart

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_dart.prop_dart_C.ExecuteUbergraph_prop_dart
// 0x0108 (0x0108 - 0x0000)
struct Prop_dart_C_ExecuteUbergraph_prop_dart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA4[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA5[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x007C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_dart_C_ExecuteUbergraph_prop_dart) == 0x000008, "Wrong alignment on Prop_dart_C_ExecuteUbergraph_prop_dart");
static_assert(sizeof(Prop_dart_C_ExecuteUbergraph_prop_dart) == 0x000108, "Wrong size on Prop_dart_C_ExecuteUbergraph_prop_dart");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, EntryPoint) == 0x000000, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, K2Node_Event_player) == 0x000008, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_GetVelocity_ReturnValue) == 0x000010, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_VSize_ReturnValue) == 0x00001C, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_Cross_VectorVector_ReturnValue) == 0x000020, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000030, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00003C, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000048, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000054, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, K2Node_ComponentBoundEvent_HitComponent) == 0x000058, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, K2Node_ComponentBoundEvent_OtherActor) == 0x000060, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, K2Node_ComponentBoundEvent_OtherComp) == 0x000068, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000070, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_ExecuteUbergraph_prop_dart, K2Node_ComponentBoundEvent_Hit) == 0x00007C, "Member 'Prop_dart_C_ExecuteUbergraph_prop_dart::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");

// Function prop_dart.prop_dart_C.BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Param_Hit) == 0x000024, "Member 'Prop_dart_C_BndEvt__prop_dart_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Param_Hit' has a wrong offset!");

// Function prop_dart.prop_dart_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Prop_dart_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_dart_C_Thrown) == 0x000008, "Wrong alignment on Prop_dart_C_Thrown");
static_assert(sizeof(Prop_dart_C_Thrown) == 0x000008, "Wrong size on Prop_dart_C_Thrown");
static_assert(offsetof(Prop_dart_C_Thrown, Player) == 0x000000, "Member 'Prop_dart_C_Thrown::Player' has a wrong offset!");

}

