#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_burger

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_burger.prop_burger_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_burger_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_burger_C_GetData) == 0x000010, "Wrong alignment on Prop_burger_C_GetData");
static_assert(sizeof(Prop_burger_C_GetData) == 0x000280, "Wrong size on Prop_burger_C_GetData");
static_assert(offsetof(Prop_burger_C_GetData, Data) == 0x000000, "Member 'Prop_burger_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_burger_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_burger_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_GetData, CallFunc_Array_Get_Item) == 0x000190, "Member 'Prop_burger_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x0001A0, "Member 'Prop_burger_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_burger_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_burger_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_burger.prop_burger_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_burger_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_burger_C_LoadData) == 0x000010, "Wrong alignment on Prop_burger_C_LoadData");
static_assert(sizeof(Prop_burger_C_LoadData) == 0x0000E0, "Wrong size on Prop_burger_C_LoadData");
static_assert(offsetof(Prop_burger_C_LoadData, Data) == 0x000000, "Member 'Prop_burger_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_LoadData, Return) == 0x0000C0, "Member 'Prop_burger_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_burger_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_burger_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_burger_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_burger.prop_burger_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_burger_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_burger_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_burger_C_ActionOptionIndex");
static_assert(sizeof(Prop_burger_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_burger_C_ActionOptionIndex");
static_assert(offsetof(Prop_burger_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_burger_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_burger_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_burger_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_burger.prop_burger_C.ExecuteUbergraph_prop_burger
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_burger_C_ExecuteUbergraph_prop_burger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x009C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_progressAdvancement_finished;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_progressAdvancement_name;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_burger_C_ExecuteUbergraph_prop_burger) == 0x000010, "Wrong alignment on Prop_burger_C_ExecuteUbergraph_prop_burger");
static_assert(sizeof(Prop_burger_C_ExecuteUbergraph_prop_burger) == 0x0000F0, "Wrong size on Prop_burger_C_ExecuteUbergraph_prop_burger");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, EntryPoint) == 0x000000, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, K2Node_Event_player) == 0x000008, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, K2Node_Event_hit) == 0x000010, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, K2Node_Event_action) == 0x000098, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, Temp_name_Variable) == 0x00009C, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, CallFunc_progressAdvancement_finished) == 0x0000A4, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::CallFunc_progressAdvancement_finished' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, CallFunc_progressAdvancement_name) == 0x0000A8, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::CallFunc_progressAdvancement_name' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E0, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_burger_C_ExecuteUbergraph_prop_burger, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E8, "Member 'Prop_burger_C_ExecuteUbergraph_prop_burger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

