#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fishGun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_fishGun.prop_fishGun_C.ExecuteUbergraph_prop_fishGun
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_fishGun_C_ExecuteUbergraph_prop_fishGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA1[0xC];                                     // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun) == 0x000010, "Wrong alignment on Prop_fishGun_C_ExecuteUbergraph_prop_fishGun");
static_assert(sizeof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun) == 0x0000B0, "Wrong size on Prop_fishGun_C_ExecuteUbergraph_prop_fishGun");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, EntryPoint) == 0x000000, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, Temp_name_Variable) == 0x000004, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, K2Node_Event_player_1) == 0x000010, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, K2Node_Event_player) == 0x000018, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000020, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_GetActorForwardVector_ReturnValue) == 0x000028, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000040, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00004C, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000058, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishGun_C_ExecuteUbergraph_prop_fishGun, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'Prop_fishGun_C_ExecuteUbergraph_prop_fishGun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_fishGun.prop_fishGun_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_fishGun_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishGun_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Prop_fishGun_C_PlayerHandRelease_RMB");
static_assert(sizeof(Prop_fishGun_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Prop_fishGun_C_PlayerHandRelease_RMB");
static_assert(offsetof(Prop_fishGun_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Prop_fishGun_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function prop_fishGun.prop_fishGun_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_fishGun_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_fishGun_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_fishGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_fishGun_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_fishGun_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_fishGun_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

