#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fishingRod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_prop_structs.hpp"


namespace SDK::Params
{

// Function prop_fishingRod.prop_fishingRod_C.ExecuteUbergraph_prop_fishingRod
// 0x0350 (0x0350 - 0x0000)
struct Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F55[0x3];                                      // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F56[0x3];                                      // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F57[0x4];                                      // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFishingRodString_C*                    CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F58[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F59[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5A[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_fishbait_C*                       K2Node_DynamicCast_AsProp_Fishbait;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5B[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5C[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5D[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x0254(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5E[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5F[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0280(0x0080)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F60[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F61[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F62[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F63[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod) == 0x000010, "Wrong alignment on Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod");
static_assert(sizeof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod) == 0x000350, "Wrong size on Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, EntryPoint) == 0x000000, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_GetForwardVector_ReturnValue) == 0x000028, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_Ease_ReturnValue) == 0x000040, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_RLerp_ReturnValue) == 0x000044, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_K2_SetActorRelativeRotation_SweepHitResult) == 0x000050, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_K2_SetActorRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, Temp_int_Variable) == 0x0000D8, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, Temp_int_Variable_1) == 0x0000DC, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_Event_player_1) == 0x0000E8, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000100, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000160, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000168, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_FinishSpawningActor_ReturnValue) == 0x000170, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000178, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000180, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000188, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_bBlockingHit) == 0x000190, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_bInitialOverlap) == 0x000191, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_Distance) == 0x000198, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_Location) == 0x00019C, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A8, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_Normal) == 0x0001B4, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C0, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_PhysMat) == 0x0001D0, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_HitActor) == 0x0001D8, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_HitComponent) == 0x0001E0, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_HitBoneName) == 0x0001E8, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_HitItem) == 0x0001F0, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_ElementIndex) == 0x0001F4, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_FaceIndex) == 0x0001F8, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_TraceStart) == 0x0001FC, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BreakHitResult_TraceEnd) == 0x000208, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_IsValid_ReturnValue) == 0x000214, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_DynamicCast_AsProp_Fishbait) == 0x000218, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_DynamicCast_AsProp_Fishbait' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_Event_player) == 0x000228, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000230, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000234, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, Temp_int_Variable_2) == 0x000238, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00023C, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_getMainPlayer_AsMain_Player) == 0x000248, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_IsValid_ReturnValue_1) == 0x000250, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000251, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000252, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_propToObject_ReturnValue) == 0x000253, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_propToObject_foodData) == 0x000254, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_propToObject_object) == 0x000270, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_propToObject_isFood) == 0x000278, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_propToObject_propData) == 0x000280, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, Temp_int_Variable_3) == 0x000300, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000304, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_Add_IntInt_ReturnValue_2) == 0x000308, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000310, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_IsValidClass_ReturnValue) == 0x000318, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000320, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_DynamicCast_AsInt_Player) == 0x000328, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, K2Node_DynamicCast_bSuccess_1) == 0x000338, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod, CallFunc_asProp_return) == 0x000340, "Member 'Prop_fishingRod_C_ExecuteUbergraph_prop_fishingRod::CallFunc_asProp_return' has a wrong offset!");

// Function prop_fishingRod.prop_fishingRod_C.upd
// 0x0008 (0x0008 - 0x0000)
struct Prop_fishingRod_C_Upd final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F64[0x3];                                      // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishingRod_C_Upd) == 0x000004, "Wrong alignment on Prop_fishingRod_C_Upd");
static_assert(sizeof(Prop_fishingRod_C_Upd) == 0x000008, "Wrong size on Prop_fishingRod_C_Upd");
static_assert(offsetof(Prop_fishingRod_C_Upd, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Prop_fishingRod_C_Upd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_Upd, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'Prop_fishingRod_C_Upd::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function prop_fishingRod.prop_fishingRod_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_fishingRod_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishingRod_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_fishingRod_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_fishingRod_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_fishingRod_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_fishingRod_C_PlayerHandUse_LMB, Param_Player) == 0x000000, "Member 'Prop_fishingRod_C_PlayerHandUse_LMB::Param_Player' has a wrong offset!");

// Function prop_fishingRod.prop_fishingRod_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_fishingRod_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishingRod_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_fishingRod_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_fishingRod_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_fishingRod_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_fishingRod_C_PlayerHandUse_RMB, Param_Player) == 0x000000, "Member 'Prop_fishingRod_C_PlayerHandUse_RMB::Param_Player' has a wrong offset!");

// Function prop_fishingRod.prop_fishingRod_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_fishingRod_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F65[0x6];                                      // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishingRod_C_LoadData) == 0x000010, "Wrong alignment on Prop_fishingRod_C_LoadData");
static_assert(sizeof(Prop_fishingRod_C_LoadData) == 0x0000F0, "Wrong size on Prop_fishingRod_C_LoadData");
static_assert(offsetof(Prop_fishingRod_C_LoadData, Data) == 0x000000, "Member 'Prop_fishingRod_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_LoadData, Return) == 0x0000C0, "Member 'Prop_fishingRod_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_fishingRod_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_fishingRod_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_fishingRod_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_LoadData, CallFunc_Conv_StringToName_ReturnValue) == 0x0000E8, "Member 'Prop_fishingRod_C_LoadData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function prop_fishingRod.prop_fishingRod_C.getData
// 0x02A0 (0x02A0 - 0x0000)
struct Prop_fishingRod_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	struct FStruct_mString                        K2Node_MakeStruct_struct_mString;                  // 0x01B0(0x0010)(HasGetValueTypeHash)
	struct FStruct_mString                        CallFunc_Array_Get_Item_1;                         // 0x01C0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mString>                K2Node_MakeArray_Array_1;                          // 0x01D0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01E0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishingRod_C_GetData) == 0x000010, "Wrong alignment on Prop_fishingRod_C_GetData");
static_assert(sizeof(Prop_fishingRod_C_GetData) == 0x0002A0, "Wrong size on Prop_fishingRod_C_GetData");
static_assert(offsetof(Prop_fishingRod_C_GetData, Data) == 0x000000, "Member 'Prop_fishingRod_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_fishingRod_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_GetData, CallFunc_Conv_NameToString_ReturnValue) == 0x000180, "Member 'Prop_fishingRod_C_GetData::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishingRod_C_GetData, K2Node_MakeArray_Array) == 0x000190, "Member 'Prop_fishingRod_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
