#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_carKeys

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_carKeys.prop_carKeys_C.ExecuteUbergraph_prop_carKeys
// 0x0018 (0x0018 - 0x0000)
struct Prop_carKeys_C_ExecuteUbergraph_prop_carKeys final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_carKeys_C_ExecuteUbergraph_prop_carKeys) == 0x000008, "Wrong alignment on Prop_carKeys_C_ExecuteUbergraph_prop_carKeys");
static_assert(sizeof(Prop_carKeys_C_ExecuteUbergraph_prop_carKeys) == 0x000018, "Wrong size on Prop_carKeys_C_ExecuteUbergraph_prop_carKeys");
static_assert(offsetof(Prop_carKeys_C_ExecuteUbergraph_prop_carKeys, EntryPoint) == 0x000000, "Member 'Prop_carKeys_C_ExecuteUbergraph_prop_carKeys::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_carKeys_C_ExecuteUbergraph_prop_carKeys, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Prop_carKeys_C_ExecuteUbergraph_prop_carKeys::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_carKeys_C_ExecuteUbergraph_prop_carKeys, K2Node_Event_player) == 0x000010, "Member 'Prop_carKeys_C_ExecuteUbergraph_prop_carKeys::K2Node_Event_player' has a wrong offset!");

// Function prop_carKeys.prop_carKeys_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_carKeys_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_carKeys_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_carKeys_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_carKeys_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_carKeys_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_carKeys_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_carKeys_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

