#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_food_spng

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_food_spng.prop_food_spng_C.ExecuteUbergraph_prop_food_spng
// 0x0008 (0x0008 - 0x0000)
struct Prop_food_spng_C_ExecuteUbergraph_prop_food_spng final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_food_spng_C_ExecuteUbergraph_prop_food_spng) == 0x000004, "Wrong alignment on Prop_food_spng_C_ExecuteUbergraph_prop_food_spng");
static_assert(sizeof(Prop_food_spng_C_ExecuteUbergraph_prop_food_spng) == 0x000008, "Wrong size on Prop_food_spng_C_ExecuteUbergraph_prop_food_spng");
static_assert(offsetof(Prop_food_spng_C_ExecuteUbergraph_prop_food_spng, EntryPoint) == 0x000000, "Member 'Prop_food_spng_C_ExecuteUbergraph_prop_food_spng::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_food_spng_C_ExecuteUbergraph_prop_food_spng, K2Node_Event_clean) == 0x000004, "Member 'Prop_food_spng_C_ExecuteUbergraph_prop_food_spng::K2Node_Event_clean' has a wrong offset!");

// Function prop_food_spng.prop_food_spng_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Prop_food_spng_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_food_spng_C_Slice) == 0x000001, "Wrong alignment on Prop_food_spng_C_Slice");
static_assert(sizeof(Prop_food_spng_C_Slice) == 0x000001, "Wrong size on Prop_food_spng_C_Slice");
static_assert(offsetof(Prop_food_spng_C_Slice, Clean) == 0x000000, "Member 'Prop_food_spng_C_Slice::Clean' has a wrong offset!");

}

