#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_deskLamp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_deskLamp.prop_deskLamp_C.ExecuteUbergraph_prop_deskLamp
// 0x0020 (0x0020 - 0x0000)
struct Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp) == 0x000008, "Wrong alignment on Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp");
static_assert(sizeof(Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp) == 0x000020, "Wrong size on Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp");
static_assert(offsetof(Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp, EntryPoint) == 0x000000, "Member 'Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp, CallFunc_GetCenterOfMass_ReturnValue) == 0x000004, "Member 'Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp, CallFunc_Conv_VectorToString_ReturnValue) == 0x000010, "Member 'Prop_deskLamp_C_ExecuteUbergraph_prop_deskLamp::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");

}

