#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_fish.prop_fish_C.ExecuteUbergraph_prop_fish
// 0x0800 (0x0800 - 0x0000)
struct Prop_fish_C_ExecuteUbergraph_prop_fish final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3881[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3882[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3883[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3884[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3885[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3886[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3887[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue_1;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3888[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0148(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3889[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_pawn_obj;                             // 0x01C8(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388A[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue_2;        // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388B[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x021C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_2;      // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_3;           // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_8;       // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0308(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388C[0x3];                                     // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x03A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388D[0x2];                                     // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_clean;                                // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388E[0xE];                                     // 0x0442(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0450(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388F[0x7];                                     // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3890[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_fishSteak_0_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3891[0x3];                                     // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3892[0x8];                                     // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x04B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x04E0(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x04F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3893[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_fishSteak_1_C*                    CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0520(0x0010)(ZeroConstructor, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0530(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0560(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x0570(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AProp_fishSteak_2_C*                    CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_4;               // 0x05B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AProp_fishSteak_3_C*                    CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_5;               // 0x05F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AProp_fishSteak_4_C*                    CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_fishSteak_5_C*                    CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x0644(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0650(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_9;       // 0x065C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0674(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0680(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3894[0x4];                                     // 0x068C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0690(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0698(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x06A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0731(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0732(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3895[0x1];                                     // 0x0733(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x073C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0748(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0754(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0760(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3896[0x4];                                     // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0780(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x079C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x07B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x07C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6; // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrunge_C*                              CallFunc_FinishSpawningActor_ReturnValue_6;        // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fish_C_ExecuteUbergraph_prop_fish) == 0x000010, "Wrong alignment on Prop_fish_C_ExecuteUbergraph_prop_fish");
static_assert(sizeof(Prop_fish_C_ExecuteUbergraph_prop_fish) == 0x000800, "Wrong size on Prop_fish_C_ExecuteUbergraph_prop_fish");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, EntryPoint) == 0x000000, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_water) == 0x000008, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_int_Variable) == 0x000010, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_int_Variable_1) == 0x00001C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_int_Variable_2) == 0x000028, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00002C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_int_Variable_3) == 0x000034, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000038, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_IntInt_ReturnValue_3) == 0x00003C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetActorRightVector_ReturnValue) == 0x000044, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetActorForwardVector_ReturnValue) == 0x000050, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Dot_VectorVector_ReturnValue) == 0x00005C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000060, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000068, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00006C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000078, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_VectorVector_ReturnValue) == 0x000084, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000090, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetComponentVelocity_ReturnValue) == 0x00009C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000A8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0000B4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_RandomUnitVector_ReturnValue) == 0x0000C0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000CC, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0000D0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000DC, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_int_Variable_4) == 0x0000E0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0000E4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000E8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetVelocity_ReturnValue) == 0x0000EC, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetVelocity_ReturnValue_1) == 0x0000F8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000104, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_VSize_ReturnValue) == 0x000110, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Normal_ReturnValue) == 0x000114, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000120, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetActorRightVector_ReturnValue_1) == 0x000124, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetActorRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000130, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x00013C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000140, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_object_Variable) == 0x000148, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x000158, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_RandomFloat_ReturnValue) == 0x000164, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_SelectVector_ReturnValue) == 0x000168, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Ease_ReturnValue) == 0x000174, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000178, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000184, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000188, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_SignOfFloat_ReturnValue) == 0x000194, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000198, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_MakeVector_ReturnValue) == 0x00019C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0001A8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_6) == 0x0001AC, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_obj_pawn_obj) == 0x0001C8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_obj_pawn_obj' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001D8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_IsValid_ReturnValue) == 0x0001E4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetActorRightVector_ReturnValue_2) == 0x0001E8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetActorRightVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_ComponentBoundEvent_HitComponent) == 0x0001F8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_ComponentBoundEvent_OtherActor) == 0x000200, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_ComponentBoundEvent_OtherComp) == 0x000208, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000210, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_ComponentBoundEvent_Hit) == 0x00021C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0002A4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002B0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0002BC, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Normal_ReturnValue_1) == 0x0002C8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetActorForwardVector_ReturnValue_2) == 0x0002D4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetActorForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Dot_VectorVector_ReturnValue_3) == 0x0002E0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Dot_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_7) == 0x0002E4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0002F0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_8) == 0x0002F4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_player) == 0x000300, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_hit_1) == 0x000308, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_index) == 0x000390, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_action) == 0x000394, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_actor) == 0x000398, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_damage) == 0x0003A0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_hit) == 0x0003A4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_impact) == 0x00042C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_skipSetting) == 0x000438, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000439, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00043C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Less_FloatFloat_ReturnValue) == 0x000440, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_Event_clean) == 0x000441, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetTransform_ReturnValue) == 0x000450, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_SwitchInteger_CmpSuccess) == 0x000480, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000488, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_int_Variable_5) == 0x000490, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_FinishSpawningActor_ReturnValue) == 0x000498, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x0004A0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_IntInt_ReturnValue_5) == 0x0004A4, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetTransform_ReturnValue_1) == 0x0004B0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, Temp_object_Variable_1) == 0x0004E0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0004F0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_SphereOverlapActors_OutActors) == 0x0004F8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_SphereOverlapActors_ReturnValue) == 0x000508, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000510, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Array_Get_Item) == 0x000518, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, K2Node_CreateDelegate_OutputDelegate) == 0x000520, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetTransform_ReturnValue_2) == 0x000530, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000560, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000568, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetTransform_ReturnValue_3) == 0x000570, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0005A0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0005A8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetTransform_ReturnValue_4) == 0x0005B0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0005E0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x0005E8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_GetTransform_ReturnValue_5) == 0x0005F0, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_GetTransform_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x000620, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x000628, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x000630, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000638, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_RandomUnitVector_ReturnValue_1) == 0x000644, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000650, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Multiply_VectorFloat_ReturnValue_9) == 0x00065C, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Multiply_VectorFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000668, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000674, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000680, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000690, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_obj_static_obj) == 0x000698, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Prop_fish_C_ExecuteUbergraph_prop_fish, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0006A8, "Member 'Prop_fish_C_ExecuteUbergraph_prop_fish::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
