#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop

#include "Basic.hpp"

#include "Struct_mFloat_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_propDynamic_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_dangerProp_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function prop.prop_C.takenByPlayer__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_TakenByPlayer__DelegateSignature final
{
public:
	class AProp_C*                                Prop;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_TakenByPlayer__DelegateSignature) == 0x000008, "Wrong alignment on Prop_C_TakenByPlayer__DelegateSignature");
static_assert(sizeof(Prop_C_TakenByPlayer__DelegateSignature) == 0x000008, "Wrong size on Prop_C_TakenByPlayer__DelegateSignature");
static_assert(offsetof(Prop_C_TakenByPlayer__DelegateSignature, Prop) == 0x000000, "Member 'Prop_C_TakenByPlayer__DelegateSignature::Prop' has a wrong offset!");

// Function prop.prop_C.ExecuteUbergraph_prop
// 0x0A10 (0x0A10 - 0x0000)
struct Prop_C_ExecuteUbergraph_prop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_damage_7;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_8;                                // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_2;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_2;                             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFlammable_C*                           CallFunc_AddComponent_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0120(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_6;                             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x01AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0290(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x02C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0388(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x0438(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x0454(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0488(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x0514(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0530(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BC[0x4];                                      // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x05D8(0x00F0)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x06EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x06FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0784(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x3];                                      // 0x0791(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0794(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_component;                            // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_impactDamage_self_CastInput;              // 0x07A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ignore;                               // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key;                                  // 0x07C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x07E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x07EC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_875[0x3];                                      // 0x0875(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage_1;                             // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_fireDamage_self_CastInput;                // 0x0880(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x08A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x3];                                      // 0x0929(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate;              // 0x092C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x093C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93D[0x3];                                      // 0x093D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage;                               // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0944(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_9CC[0x4];                                      // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x09D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E5[0x3];                                      // 0x09E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x09E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        CallFunc_impactDamage_self_CastInput_1;            // 0x09F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_C_ExecuteUbergraph_prop) == 0x000010, "Wrong alignment on Prop_C_ExecuteUbergraph_prop");
static_assert(sizeof(Prop_C_ExecuteUbergraph_prop) == 0x000A10, "Wrong size on Prop_C_ExecuteUbergraph_prop");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, EntryPoint) == 0x000000, "Member 'Prop_C_ExecuteUbergraph_prop::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, Temp_struct_Variable) == 0x000010, "Member 'Prop_C_ExecuteUbergraph_prop::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_7) == 0x000040, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_7' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_8) == 0x000044, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_8' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_actor_2) == 0x0000D0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_actor_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_impact_2) == 0x0000D8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_impact_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_AddComponent_ReturnValue) == 0x0000E8, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_water_3) == 0x0000F0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_water_2) == 0x0000F8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_water_1) == 0x000100, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_water) == 0x000108, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_activate) == 0x000110, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_18) == 0x000118, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_7) == 0x000120, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_6) == 0x0001A8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hot) == 0x0001AC, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_17) == 0x000238, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_16) == 0x000240, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_5) == 0x000248, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_location_1) == 0x00024C, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_15) == 0x000258, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_14) == 0x000260, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_13) == 0x000268, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_wheelDelta) == 0x000270, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_12) == 0x000278, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_mouse) == 0x000280, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_11) == 0x000288, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_key_2) == 0x000290, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_pressed_1) == 0x0002A8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_temperature_1) == 0x0002AC, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_temperature) == 0x0002B0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_speed) == 0x0002B4, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_10) == 0x0002B8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_6) == 0x0002C0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_name_1) == 0x000348, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_volume) == 0x000358, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_9) == 0x000360, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_location) == 0x000368, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_4) == 0x000374, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_clean_1) == 0x000378, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_8) == 0x000380, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_5) == 0x000388, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hook_1) == 0x000410, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_clean) == 0x000418, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_7) == 0x000420, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hook) == 0x000428, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_gamemode) == 0x000430, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_key_1) == 0x000438, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_pressed) == 0x000450, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_color) == 0x000454, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_picker) == 0x000468, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_texture) == 0x000470, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_index) == 0x000478, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_6) == 0x000480, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_4) == 0x000488, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_kick) == 0x000510, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_name) == 0x000514, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_5) == 0x000520, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_4) == 0x000528, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_3) == 0x000530, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_3) == 0x0005B8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_3) == 0x0005C0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_2) == 0x0005C8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player_1) == 0x0005D0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_settings) == 0x0005D8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_IsValid_ReturnValue) == 0x0006C8, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0006D0, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_Array_Add_ReturnValue) == 0x0006D8, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x0006E0, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_static) == 0x0006E8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_frozen) == 0x0006E9, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_active) == 0x0006EA, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_Array_RemoveItem_ReturnValue) == 0x0006EB, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_actor_1) == 0x0006F0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_2) == 0x0006F8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_2) == 0x0006FC, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_impact_1) == 0x000784, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_skipSetting) == 0x000790, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000794, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_component) == 0x0007A0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_component' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_impactDamage_self_CastInput) == 0x0007A8, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_impactDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_ignore) == 0x0007B8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_key) == 0x0007C0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_CustomEvent_SelfActor) == 0x0007D0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_CustomEvent_OtherActor) == 0x0007D8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_CustomEvent_NormalImpulse) == 0x0007E0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_CustomEvent_Hit) == 0x0007EC, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_BooleanOR_ReturnValue) == 0x000874, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage_1) == 0x000878, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_fuel) == 0x00087C, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_fireDamage_self_CastInput) == 0x000880, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_fireDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_IsValid_ReturnValue_1) == 0x000890, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_player) == 0x000898, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit_1) == 0x0008A0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_action) == 0x000928, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_CreateDelegate_OutputDelegate) == 0x00092C, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_SwitchEnum_CmpSuccess) == 0x00093C, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_damage) == 0x000940, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_hit) == 0x000944, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_actor) == 0x0009D0, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, K2Node_Event_impact) == 0x0009D8, "Member 'Prop_C_ExecuteUbergraph_prop::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_IsValid_ReturnValue_2) == 0x0009E4, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x0009E8, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_C_ExecuteUbergraph_prop, CallFunc_impactDamage_self_CastInput_1) == 0x0009F8, "Member 'Prop_C_ExecuteUbergraph_prop::CallFunc_impactDamage_self_CastInput_1' has a wrong offset!");

// Function prop.prop_C.impactDamageCPP
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_C_ImpactDamageCPP final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact;                                            // 0x0098(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_ImpactDamageCPP) == 0x000008, "Wrong alignment on Prop_C_ImpactDamageCPP");
static_assert(sizeof(Prop_C_ImpactDamageCPP) == 0x0000A8, "Wrong size on Prop_C_ImpactDamageCPP");
static_assert(offsetof(Prop_C_ImpactDamageCPP, Damage) == 0x000000, "Member 'Prop_C_ImpactDamageCPP::Damage' has a wrong offset!");
static_assert(offsetof(Prop_C_ImpactDamageCPP, Param_Hit) == 0x000004, "Member 'Prop_C_ImpactDamageCPP::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_C_ImpactDamageCPP, Actor) == 0x000090, "Member 'Prop_C_ImpactDamageCPP::Actor' has a wrong offset!");
static_assert(offsetof(Prop_C_ImpactDamageCPP, Impact) == 0x000098, "Member 'Prop_C_ImpactDamageCPP::Impact' has a wrong offset!");

// Function prop.prop_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_C_ActionOptionIndex");
static_assert(sizeof(Prop_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_C_ActionOptionIndex");
static_assert(offsetof(Prop_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop.prop_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Prop_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_Ignite) == 0x000004, "Wrong alignment on Prop_C_Ignite");
static_assert(sizeof(Prop_C_Ignite) == 0x000004, "Wrong size on Prop_C_Ignite");
static_assert(offsetof(Prop_C_Ignite, Fuel) == 0x000000, "Member 'Prop_C_Ignite::Fuel' has a wrong offset!");

// Function prop.prop_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Prop_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_FireDamage) == 0x000004, "Wrong alignment on Prop_C_FireDamage");
static_assert(sizeof(Prop_C_FireDamage) == 0x000004, "Wrong size on Prop_C_FireDamage");
static_assert(offsetof(Prop_C_FireDamage, Damage) == 0x000000, "Member 'Prop_C_FireDamage::Damage' has a wrong offset!");

// Function prop.prop_C.hittedd123
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_C_Hittedd123 final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x001C(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_C_Hittedd123) == 0x000008, "Wrong alignment on Prop_C_Hittedd123");
static_assert(sizeof(Prop_C_Hittedd123) == 0x0000A8, "Wrong size on Prop_C_Hittedd123");
static_assert(offsetof(Prop_C_Hittedd123, SelfActor) == 0x000000, "Member 'Prop_C_Hittedd123::SelfActor' has a wrong offset!");
static_assert(offsetof(Prop_C_Hittedd123, OtherActor) == 0x000008, "Member 'Prop_C_Hittedd123::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_C_Hittedd123, NormalImpulse) == 0x000010, "Member 'Prop_C_Hittedd123::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_C_Hittedd123, Param_Hit) == 0x00001C, "Member 'Prop_C_Hittedd123::Param_Hit' has a wrong offset!");

// Function prop.prop_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Prop_C_SetKey final
{
public:
	class FString                                 Param_Key;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_SetKey) == 0x000008, "Wrong alignment on Prop_C_SetKey");
static_assert(sizeof(Prop_C_SetKey) == 0x000010, "Wrong size on Prop_C_SetKey");
static_assert(offsetof(Prop_C_SetKey, Param_Key) == 0x000000, "Member 'Prop_C_SetKey::Param_Key' has a wrong offset!");

// Function prop.prop_C.setIgnoreSave
// 0x0001 (0x0001 - 0x0000)
struct Prop_C_SetIgnoreSave final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_C_SetIgnoreSave) == 0x000001, "Wrong alignment on Prop_C_SetIgnoreSave");
static_assert(sizeof(Prop_C_SetIgnoreSave) == 0x000001, "Wrong size on Prop_C_SetIgnoreSave");
static_assert(offsetof(Prop_C_SetIgnoreSave, Ignore) == 0x000000, "Member 'Prop_C_SetIgnoreSave::Ignore' has a wrong offset!");

// Function prop.prop_C.impactSquishCPP
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_ImpactSquishCPP final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_ImpactSquishCPP) == 0x000008, "Wrong alignment on Prop_C_ImpactSquishCPP");
static_assert(sizeof(Prop_C_ImpactSquishCPP) == 0x000008, "Wrong size on Prop_C_ImpactSquishCPP");
static_assert(offsetof(Prop_C_ImpactSquishCPP, Component) == 0x000000, "Member 'Prop_C_ImpactSquishCPP::Component' has a wrong offset!");

// Function prop.prop_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_C_AddDamage) == 0x000008, "Wrong alignment on Prop_C_AddDamage");
static_assert(sizeof(Prop_C_AddDamage) == 0x0000A8, "Wrong size on Prop_C_AddDamage");
static_assert(offsetof(Prop_C_AddDamage, Actor) == 0x000000, "Member 'Prop_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Prop_C_AddDamage, Damage) == 0x000008, "Member 'Prop_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Prop_C_AddDamage, Param_Hit) == 0x00000C, "Member 'Prop_C_AddDamage::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_C_AddDamage, Impact) == 0x000094, "Member 'Prop_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Prop_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Prop_C_AddDamage::SkipSetting' has a wrong offset!");

// Function prop.prop_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Prop_C_SetPropProps final
{
public:
	bool                                          Param_Static;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_Frozen;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_C_SetPropProps) == 0x000001, "Wrong alignment on Prop_C_SetPropProps");
static_assert(sizeof(Prop_C_SetPropProps) == 0x000003, "Wrong size on Prop_C_SetPropProps");
static_assert(offsetof(Prop_C_SetPropProps, Param_Static) == 0x000000, "Member 'Prop_C_SetPropProps::Param_Static' has a wrong offset!");
static_assert(offsetof(Prop_C_SetPropProps, Param_Frozen) == 0x000001, "Member 'Prop_C_SetPropProps::Param_Frozen' has a wrong offset!");
static_assert(offsetof(Prop_C_SetPropProps, Active) == 0x000002, "Member 'Prop_C_SetPropProps::Active' has a wrong offset!");

// Function prop.prop_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_SettingsApplied) == 0x000008, "Wrong alignment on Prop_C_SettingsApplied");
static_assert(sizeof(Prop_C_SettingsApplied) == 0x0000F0, "Wrong size on Prop_C_SettingsApplied");
static_assert(offsetof(Prop_C_SettingsApplied, Settings) == 0x000000, "Member 'Prop_C_SettingsApplied::Settings' has a wrong offset!");

// Function prop.prop_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_PlayerR) == 0x000008, "Wrong alignment on Prop_C_PlayerR");
static_assert(sizeof(Prop_C_PlayerR) == 0x000008, "Wrong size on Prop_C_PlayerR");
static_assert(offsetof(Prop_C_PlayerR, Player) == 0x000000, "Member 'Prop_C_PlayerR::Player' has a wrong offset!");

// Function prop.prop_C.playerHold
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_PlayerHold final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_PlayerHold) == 0x000008, "Wrong alignment on Prop_C_PlayerHold");
static_assert(sizeof(Prop_C_PlayerHold) == 0x000008, "Wrong size on Prop_C_PlayerHold");
static_assert(offsetof(Prop_C_PlayerHold, Player) == 0x000000, "Member 'Prop_C_PlayerHold::Player' has a wrong offset!");

// Function prop.prop_C.playerUnequip
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_PlayerUnequip final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_PlayerUnequip) == 0x000008, "Wrong alignment on Prop_C_PlayerUnequip");
static_assert(sizeof(Prop_C_PlayerUnequip) == 0x000008, "Wrong size on Prop_C_PlayerUnequip");
static_assert(offsetof(Prop_C_PlayerUnequip, Player) == 0x000000, "Member 'Prop_C_PlayerUnequip::Player' has a wrong offset!");

// Function prop.prop_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct Prop_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_DamageByPlayer) == 0x000008, "Wrong alignment on Prop_C_DamageByPlayer");
static_assert(sizeof(Prop_C_DamageByPlayer) == 0x000098, "Wrong size on Prop_C_DamageByPlayer");
static_assert(offsetof(Prop_C_DamageByPlayer, Player) == 0x000000, "Member 'Prop_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Prop_C_DamageByPlayer, Param_Hit) == 0x000008, "Member 'Prop_C_DamageByPlayer::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_C_DamageByPlayer, Damage) == 0x000090, "Member 'Prop_C_DamageByPlayer::Damage' has a wrong offset!");

// Function prop.prop_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_Thrown) == 0x000008, "Wrong alignment on Prop_C_Thrown");
static_assert(sizeof(Prop_C_Thrown) == 0x000008, "Wrong size on Prop_C_Thrown");
static_assert(offsetof(Prop_C_Thrown, Player) == 0x000000, "Member 'Prop_C_Thrown::Player' has a wrong offset!");

// Function prop.prop_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Prop_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_C_SendName) == 0x000004, "Wrong alignment on Prop_C_SendName");
static_assert(sizeof(Prop_C_SendName) == 0x000008, "Wrong size on Prop_C_SendName");
