#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_tvSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_tvSpawner.prop_tvSpawner_C.ExecuteUbergraph_prop_tvSpawner
// 0x0070 (0x0070 - 0x0000)
struct Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner) == 0x000010, "Wrong alignment on Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner");
static_assert(sizeof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner) == 0x000070, "Wrong size on Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, EntryPoint) == 0x000000, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, Temp_bool_Variable) == 0x000004, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, Temp_class_Variable) == 0x000008, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, Temp_class_Variable_1) == 0x000010, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000050, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, K2Node_Select_Default) == 0x000058, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'Prop_tvSpawner_C_ExecuteUbergraph_prop_tvSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

