#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_piston

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_wireComponent_piston.prop_wireComponent_piston_C.ExecuteUbergraph_prop_wireComponent_piston
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWire_C*                                K2Node_Event_wire;                                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA0[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActorTickEnabled_ReturnValue;           // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston) == 0x000008, "Wrong alignment on Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston");
static_assert(sizeof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston) == 0x0000F0, "Wrong size on Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, EntryPoint) == 0x000000, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, K2Node_Event_wire) == 0x000020, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::K2Node_Event_wire' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000034, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, K2Node_Event_DeltaSeconds) == 0x0000BC, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000C0, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, K2Node_DynamicCast_AsPrimitive_Component) == 0x0000C8, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000D4, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D8, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0000DC, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_FClamp_ReturnValue) == 0x0000E0, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000E4, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E5, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_IsActorTickEnabled_ReturnValue) == 0x0000E6, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_IsActorTickEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_BooleanOR_ReturnValue) == 0x0000E7, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0000E8, "Member 'Prop_wireComponent_piston_C_ExecuteUbergraph_prop_wireComponent_piston::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function prop_wireComponent_piston.prop_wireComponent_piston_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wireComponent_piston_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_piston_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wireComponent_piston_C_ReceiveTick");
static_assert(sizeof(Prop_wireComponent_piston_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wireComponent_piston_C_ReceiveTick");
static_assert(offsetof(Prop_wireComponent_piston_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wireComponent_piston_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_wireComponent_piston.prop_wireComponent_piston_C.wirePass
// 0x0008 (0x0008 - 0x0000)
struct Prop_wireComponent_piston_C_WirePass final
{
public:
	class AWire_C*                                Wire;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wireComponent_piston_C_WirePass) == 0x000008, "Wrong alignment on Prop_wireComponent_piston_C_WirePass");
static_assert(sizeof(Prop_wireComponent_piston_C_WirePass) == 0x000008, "Wrong size on Prop_wireComponent_piston_C_WirePass");
static_assert(offsetof(Prop_wireComponent_piston_C_WirePass, Wire) == 0x000000, "Member 'Prop_wireComponent_piston_C_WirePass::Wire' has a wrong offset!");

}

