#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_tv2

#include "Basic.hpp"

#include "Struct_tv_structs.hpp"
#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_playlist_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_tv2.prop_tv2_C
// 0x00A8 (0x0410 - 0x0368)
class AProp_tv2_C : public AProp_C
{
public:
	uint8                                         Pad_3A34[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_tv2_C;                         // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Rt;                                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Playvid;                                           // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A35[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_videobrowser_C*                    W;                                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UMediaTexture*                          MediaTexture;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_tvOffline_C*                       Interface;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_tv                             Data;                                              // 0x03C8(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	Enum_playlist                                 PlayMode;                                          // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A36[0x3];                                     // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayIndex;                                         // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PausePlayer;                                       // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A37[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Indexes;                                           // 0x0400(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_prop_tv2(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, int32 Param_Index, Enum_interactionActions Action);
	void Fin();
	void OpenLink(const struct FStruct_tv& Param_Data, bool Param_PausePlayer);
	void Opened(const class FString& OpenedUrl);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_tv2_C">();
	}
	static class AProp_tv2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_tv2_C>();
	}
};
static_assert(alignof(AProp_tv2_C) == 0x000008, "Wrong alignment on AProp_tv2_C");
static_assert(sizeof(AProp_tv2_C) == 0x000410, "Wrong size on AProp_tv2_C");
static_assert(offsetof(AProp_tv2_C, UberGraphFrame_Prop_tv2_C) == 0x000368, "Member 'AProp_tv2_C::UberGraphFrame_Prop_tv2_C' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, MediaSound) == 0x000370, "Member 'AProp_tv2_C::MediaSound' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Widget) == 0x000378, "Member 'AProp_tv2_C::Widget' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Dynmat) == 0x000380, "Member 'AProp_tv2_C::Dynmat' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Rt) == 0x000388, "Member 'AProp_tv2_C::Rt' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Playvid) == 0x000390, "Member 'AProp_tv2_C::Playvid' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, W) == 0x000398, "Member 'AProp_tv2_C::W' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, MediaPlayer) == 0x0003A0, "Member 'AProp_tv2_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, URL) == 0x0003A8, "Member 'AProp_tv2_C::URL' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, MediaTexture) == 0x0003B8, "Member 'AProp_tv2_C::MediaTexture' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Interface) == 0x0003C0, "Member 'AProp_tv2_C::Interface' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Data) == 0x0003C8, "Member 'AProp_tv2_C::Data' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, PlayMode) == 0x0003F0, "Member 'AProp_tv2_C::PlayMode' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, PlayIndex) == 0x0003F4, "Member 'AProp_tv2_C::PlayIndex' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, PausePlayer) == 0x0003F8, "Member 'AProp_tv2_C::PausePlayer' has a wrong offset!");
static_assert(offsetof(AProp_tv2_C, Indexes) == 0x000400, "Member 'AProp_tv2_C::Indexes' has a wrong offset!");

}

