#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_piston

#include "Basic.hpp"

#include "Prop_wireComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_piston.prop_wireComponent_piston_C
// 0x0040 (0x03C0 - 0x0380)
class AProp_wireComponent_piston_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_piston_C;        // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        DoorSlide1;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mid;                                               // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsConstraintComponent*            PhysicsConstraint;                                 // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Head;                                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Alpha;                                             // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HeadComponent;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Snd;                                               // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_wireComponent_piston(int32 EntryPoint);
	void Tick();
	void ReceiveTick(float DeltaSeconds);
	void WirePass(class AWire_C* Wire);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_piston_C">();
	}
	static class AProp_wireComponent_piston_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_piston_C>();
	}
};
static_assert(alignof(AProp_wireComponent_piston_C) == 0x000008, "Wrong alignment on AProp_wireComponent_piston_C");
static_assert(sizeof(AProp_wireComponent_piston_C) == 0x0003C0, "Wrong size on AProp_wireComponent_piston_C");
static_assert(offsetof(AProp_wireComponent_piston_C, UberGraphFrame_Prop_wireComponent_piston_C) == 0x000380, "Member 'AProp_wireComponent_piston_C::UberGraphFrame_Prop_wireComponent_piston_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, DoorSlide1) == 0x000388, "Member 'AProp_wireComponent_piston_C::DoorSlide1' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, Mid) == 0x000390, "Member 'AProp_wireComponent_piston_C::Mid' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, PhysicsConstraint) == 0x000398, "Member 'AProp_wireComponent_piston_C::PhysicsConstraint' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, Head) == 0x0003A0, "Member 'AProp_wireComponent_piston_C::Head' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, Active) == 0x0003A8, "Member 'AProp_wireComponent_piston_C::Active' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, Alpha) == 0x0003AC, "Member 'AProp_wireComponent_piston_C::Alpha' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, HeadComponent) == 0x0003B0, "Member 'AProp_wireComponent_piston_C::HeadComponent' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, Speed) == 0x0003B8, "Member 'AProp_wireComponent_piston_C::Speed' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piston_C, Snd) == 0x0003BC, "Member 'AProp_wireComponent_piston_C::Snd' has a wrong offset!");

}

