#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_piezo

#include "Basic.hpp"

#include "Prop_wireComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_piezo.prop_wireComponent_piezo_C
// 0x0020 (0x03A0 - 0x0380)
class AProp_wireComponent_piezo_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_piezo_C;         // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_wireComponent_piezo(int32 EntryPoint);
	void WirePass(class AWire_C* Wire);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_piezo_C">();
	}
	static class AProp_wireComponent_piezo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_piezo_C>();
	}
};
static_assert(alignof(AProp_wireComponent_piezo_C) == 0x000008, "Wrong alignment on AProp_wireComponent_piezo_C");
static_assert(sizeof(AProp_wireComponent_piezo_C) == 0x0003A0, "Wrong size on AProp_wireComponent_piezo_C");
static_assert(offsetof(AProp_wireComponent_piezo_C, UberGraphFrame_Prop_wireComponent_piezo_C) == 0x000380, "Member 'AProp_wireComponent_piezo_C::UberGraphFrame_Prop_wireComponent_piezo_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piezo_C, Billboard) == 0x000388, "Member 'AProp_wireComponent_piezo_C::Billboard' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piezo_C, Audio) == 0x000390, "Member 'AProp_wireComponent_piezo_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_piezo_C, Pitch) == 0x000398, "Member 'AProp_wireComponent_piezo_C::Pitch' has a wrong offset!");

}

