#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bucket

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"


namespace SDK::Params
{

// Function prop_bucket.prop_bucket_C.ExecuteUbergraph_prop_bucket
// 0x0420 (0x0420 - 0x0000)
struct Prop_bucket_C_ExecuteUbergraph_prop_bucket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5A[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5B[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody_1; // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue_1; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5C[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_3;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5D[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5E[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F8(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5F[0x2];                                     // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x022C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3C60[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C61[0x3];                                     // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C62[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C63[0x3];                                     // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0318(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C64[0x3];                                     // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C65[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C66[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C67[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue_1;        // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_bucket_C_ExecuteUbergraph_prop_bucket) == 0x000010, "Wrong alignment on Prop_bucket_C_ExecuteUbergraph_prop_bucket");
static_assert(sizeof(Prop_bucket_C_ExecuteUbergraph_prop_bucket) == 0x000420, "Wrong size on Prop_bucket_C_ExecuteUbergraph_prop_bucket");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, EntryPoint) == 0x000000, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000004, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_TransformRotation_ReturnValue) == 0x000050, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00005C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00006C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetTransform_ReturnValue_1) == 0x000080, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000BC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x0000C8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x0000D4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetClosestPointOnCollision_OutPointOnBody_1) == 0x0000D8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetClosestPointOnCollision_OutPointOnBody_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetClosestPointOnCollision_ReturnValue_1) == 0x0000E4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetClosestPointOnCollision_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_InverseTransformLocation_ReturnValue) == 0x0000E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000F4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_TransformLocation_ReturnValue) == 0x000100, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X) == 0x00010C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y) == 0x000110, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z) == 0x000114, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_1) == 0x000124, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_1) == 0x000128, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_1) == 0x00012C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_2) == 0x000130, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_2) == 0x000134, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_2) == 0x000138, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00013C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000140, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_3) == 0x000144, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_3) == 0x000148, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_3) == 0x00014C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000150, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_FloatFloat_ReturnValue) == 0x000154, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMin_ReturnValue) == 0x000158, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00015C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Not_PreBool_ReturnValue) == 0x0001A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001A8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeArray_Array) == 0x0001E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Format_ReturnValue) == 0x0001F8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000210, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Conv_TextToString_ReturnValue) == 0x000218, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Not_PreBool_ReturnValue_1) == 0x000228, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BooleanAND_ReturnValue) == 0x000229, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00022C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0002B8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_4) == 0x0002C0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_4) == 0x0002C4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_4) == 0x0002C8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Array_Find_ReturnValue) == 0x0002CC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Array_Get_Item) == 0x0002D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002D4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0002D8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMax_ReturnValue) == 0x0002DC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMin_ReturnValue_1) == 0x0002E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetActorUpVector_ReturnValue) == 0x0002E4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002F0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002F4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0002F5, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0002F8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000300, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000308, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000310, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_bFromSweep) == 0x000314, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_SweepResult) == 0x000318, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_AsInt_Objects) == 0x0003A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_bSuccess) == 0x0003B0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomFloatInRange_ReturnValue) == 0x0003B4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0003B8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0003BC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeVector_ReturnValue) == 0x0003C0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0003D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherActor) == 0x0003D8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherComp) == 0x0003E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0003E8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0003F0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0003F8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000404, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000410, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_IsSimulatingPhysics_ReturnValue_1) == 0x00041C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_IsSimulatingPhysics_ReturnValue_1' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C68[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_bucket_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_bucket_C_ReceiveTick");
static_assert(sizeof(Prop_bucket_C_ReceiveTick) == 0x000004, "Wrong size on Prop_bucket_C_ReceiveTick");
static_assert(offsetof(Prop_bucket_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_bucket_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.upd
// 0x0018 (0x0018 - 0x0000)
struct Prop_bucket_C_Upd final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C69[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_Upd) == 0x000008, "Wrong alignment on Prop_bucket_C_Upd");
static_assert(sizeof(Prop_bucket_C_Upd) == 0x000018, "Wrong size on Prop_bucket_C_Upd");
static_assert(offsetof(Prop_bucket_C_Upd, Temp_bool_Variable) == 0x000000, "Member 'Prop_bucket_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Upd, Temp_object_Variable) == 0x000008, "Member 'Prop_bucket_C_Upd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Upd, K2Node_Select_Default) == 0x000010, "Member 'Prop_bucket_C_Upd::K2Node_Select_Default' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.interpFlow
// 0x0068 (0x0068 - 0x0000)
struct Prop_bucket_C_InterpFlow final
{
public:
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C6A[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_InterpFlow) == 0x000004, "Wrong alignment on Prop_bucket_C_InterpFlow");
static_assert(sizeof(Prop_bucket_C_InterpFlow) == 0x000068, "Wrong size on Prop_bucket_C_InterpFlow");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_FMax_ReturnValue) == 0x000000, "Member 'Prop_bucket_C_InterpFlow::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_GetActorUpVector_ReturnValue) == 0x000004, "Member 'Prop_bucket_C_InterpFlow::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'Prop_bucket_C_InterpFlow::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_GetActorUpVector_ReturnValue_1) == 0x000028, "Member 'Prop_bucket_C_InterpFlow::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000034, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Dot_VectorVector_ReturnValue) == 0x000038, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_FClamp_ReturnValue) == 0x00003C, "Member 'Prop_bucket_C_InterpFlow::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_FClamp_ReturnValue_1) == 0x000040, "Member 'Prop_bucket_C_InterpFlow::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'Prop_bucket_C_InterpFlow::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Lerp_ReturnValue) == 0x000048, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00004C, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000050, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000054, "Member 'Prop_bucket_C_InterpFlow::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000060, "Member 'Prop_bucket_C_InterpFlow::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_InterpFlow, CallFunc_FInterpTo_ReturnValue) == 0x000064, "Member 'Prop_bucket_C_InterpFlow::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.dipped
// 0x0030 (0x0030 - 0x0000)
struct Prop_bucket_C_Dipped final
{
public:
	bool                                          IsDipped;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C6B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_bucket_C_Dipped) == 0x000008, "Wrong alignment on Prop_bucket_C_Dipped");
static_assert(sizeof(Prop_bucket_C_Dipped) == 0x000030, "Wrong size on Prop_bucket_C_Dipped");
static_assert(offsetof(Prop_bucket_C_Dipped, IsDipped) == 0x000000, "Member 'Prop_bucket_C_Dipped::IsDipped' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Dipped, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'Prop_bucket_C_Dipped::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Dipped, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'Prop_bucket_C_Dipped::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Dipped, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'Prop_bucket_C_Dipped::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Dipped, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000028, "Member 'Prop_bucket_C_Dipped::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Dipped, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'Prop_bucket_C_Dipped::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Prop_bucket_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_UserConstructionScript) == 0x000008, "Wrong alignment on Prop_bucket_C_UserConstructionScript");
static_assert(sizeof(Prop_bucket_C_UserConstructionScript) == 0x000008, "Wrong size on Prop_bucket_C_UserConstructionScript");
static_assert(offsetof(Prop_bucket_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Prop_bucket_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_bucket_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C6D[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_loadData_return;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C6E[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_LoadData) == 0x000010, "Wrong alignment on Prop_bucket_C_LoadData");
static_assert(sizeof(Prop_bucket_C_LoadData) == 0x0000E0, "Wrong size on Prop_bucket_C_LoadData");
static_assert(offsetof(Prop_bucket_C_LoadData, Data) == 0x000000, "Member 'Prop_bucket_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_LoadData, Return) == 0x0000C0, "Member 'Prop_bucket_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_bucket_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_LoadData, CallFunc_loadData_return) == 0x0000D8, "Member 'Prop_bucket_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000DC, "Member 'Prop_bucket_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.getData
// 0x0290 (0x0290 - 0x0000)
struct Prop_bucket_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6F[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
