#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_glue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_glue.prop_glue_C.ExecuteUbergraph_prop_glue
// 0x01E0 (0x01E0 - 0x0000)
struct Prop_glue_C_ExecuteUbergraph_prop_glue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_OutputPin;                            // 0x0020(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGluePoint_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_glue_C_ExecuteUbergraph_prop_glue) == 0x000010, "Wrong alignment on Prop_glue_C_ExecuteUbergraph_prop_glue");
static_assert(sizeof(Prop_glue_C_ExecuteUbergraph_prop_glue) == 0x0001E0, "Wrong size on Prop_glue_C_ExecuteUbergraph_prop_glue");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, EntryPoint) == 0x000000, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, Temp_object_Variable) == 0x000008, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_obj_OutputPin) == 0x000020, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_obj_OutputPin' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000048, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000060, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0000E8, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_bBlockingHit) == 0x0000E9, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000EA, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_Time) == 0x0000EC, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_Distance) == 0x0000F0, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_Location) == 0x0000F4, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_ImpactPoint) == 0x000100, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_Normal) == 0x00010C, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_ImpactNormal) == 0x000118, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00016C, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000178, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C0, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C8, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_ExecuteUbergraph_prop_glue, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001D0, "Member 'Prop_glue_C_ExecuteUbergraph_prop_glue::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function prop_glue.prop_glue_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_glue_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_glue_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_glue_C_ReceiveTick");
static_assert(sizeof(Prop_glue_C_ReceiveTick) == 0x000004, "Wrong size on Prop_glue_C_ReceiveTick");
static_assert(offsetof(Prop_glue_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_glue_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_glue.prop_glue_C.obj
// 0x0030 (0x0030 - 0x0000)
struct Prop_glue_C_Obj final
{
public:
	TArray<EObjectTypeQuery>                      OutputPin;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm)
	TArray<EObjectTypeQuery>                      A;                                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_glue_C_Obj) == 0x000008, "Wrong alignment on Prop_glue_C_Obj");
static_assert(sizeof(Prop_glue_C_Obj) == 0x000030, "Wrong size on Prop_glue_C_Obj");
static_assert(offsetof(Prop_glue_C_Obj, OutputPin) == 0x000000, "Member 'Prop_glue_C_Obj::OutputPin' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_Obj, A) == 0x000010, "Member 'Prop_glue_C_Obj::A' has a wrong offset!");
static_assert(offsetof(Prop_glue_C_Obj, K2Node_MakeArray_Array) == 0x000020, "Member 'Prop_glue_C_Obj::K2Node_MakeArray_Array' has a wrong offset!");

}

