#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_soos

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_soos.prop_soos_C.ExecuteUbergraph_prop_soos
// 0x0120 (0x0120 - 0x0000)
struct Prop_soos_C_ExecuteUbergraph_prop_soos final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C7[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C8[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C9[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CA[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CB[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CC[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CD[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewIntensity;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_skip;                           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CE[0x1];                                     // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37CF[0xC];                                     // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D0[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_soos_C_ExecuteUbergraph_prop_soos) == 0x000010, "Wrong alignment on Prop_soos_C_ExecuteUbergraph_prop_soos");
static_assert(sizeof(Prop_soos_C_ExecuteUbergraph_prop_soos) == 0x000120, "Wrong size on Prop_soos_C_ExecuteUbergraph_prop_soos");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, EntryPoint) == 0x000000, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, K2Node_Event_water) == 0x000008, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, Temp_int_Variable) == 0x000010, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000020, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Lerp_ReturnValue) == 0x000024, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Lerp_ReturnValue_1) == 0x000028, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Lerp_ReturnValue_2) == 0x00002C, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Lerp_ReturnValue_3) == 0x000030, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000038, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, Temp_bool_Has_Been_Initd_Variable) == 0x00004D, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, Temp_int_Variable_1) == 0x000050, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000054, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000058, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2) == 0x000060, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Lerp_ReturnValue_4) == 0x000068, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, Temp_bool_Has_Been_Initd_Variable_1) == 0x00006D, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, Temp_bool_IsClosed_Variable_1) == 0x00006E, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomFloatInRange_ReturnValue) == 0x000070, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000078, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Lerp_ReturnValue_5) == 0x000080, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000088, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomUnitVector_ReturnValue) == 0x000090, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00009C, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, K2Node_CustomEvent_NewIntensity) == 0x0000A0, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::K2Node_CustomEvent_NewIntensity' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A4, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0000B0, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, K2Node_CustomEvent_skip) == 0x0000B4, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::K2Node_CustomEvent_skip' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000B5, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomBoolWithWeight_ReturnValue_1) == 0x0000B6, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomBoolWithWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000100, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000108, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_ExecuteUbergraph_prop_soos, CallFunc_FinishSpawningActor_ReturnValue) == 0x000110, "Member 'Prop_soos_C_ExecuteUbergraph_prop_soos::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_soos.prop_soos_C.Exp
// 0x0001 (0x0001 - 0x0000)
struct Prop_soos_C_Exp final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_soos_C_Exp) == 0x000001, "Wrong alignment on Prop_soos_C_Exp");
static_assert(sizeof(Prop_soos_C_Exp) == 0x000001, "Wrong size on Prop_soos_C_Exp");
static_assert(offsetof(Prop_soos_C_Exp, Skip) == 0x000000, "Member 'Prop_soos_C_Exp::Skip' has a wrong offset!");

// Function prop_soos.prop_soos_C.Light
// 0x0004 (0x0004 - 0x0000)
struct Prop_soos_C_Light final
{
public:
	float                                         NewIntensity;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_soos_C_Light) == 0x000004, "Wrong alignment on Prop_soos_C_Light");
static_assert(sizeof(Prop_soos_C_Light) == 0x000004, "Wrong size on Prop_soos_C_Light");
static_assert(offsetof(Prop_soos_C_Light, NewIntensity) == 0x000000, "Member 'Prop_soos_C_Light::NewIntensity' has a wrong offset!");

// Function prop_soos.prop_soos_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct Prop_soos_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_soos_C_LeaveWater) == 0x000008, "Wrong alignment on Prop_soos_C_LeaveWater");
static_assert(sizeof(Prop_soos_C_LeaveWater) == 0x000008, "Wrong size on Prop_soos_C_LeaveWater");
static_assert(offsetof(Prop_soos_C_LeaveWater, Water) == 0x000000, "Member 'Prop_soos_C_LeaveWater::Water' has a wrong offset!");

// Function prop_soos.prop_soos_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_soos_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37D1[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_soos_C_LoadData) == 0x000010, "Wrong alignment on Prop_soos_C_LoadData");
static_assert(sizeof(Prop_soos_C_LoadData) == 0x0000E0, "Wrong size on Prop_soos_C_LoadData");
static_assert(offsetof(Prop_soos_C_LoadData, Data) == 0x000000, "Member 'Prop_soos_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_LoadData, Return) == 0x0000C0, "Member 'Prop_soos_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_soos_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_soos_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_soos_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_soos.prop_soos_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_soos_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_soos_C_GetData) == 0x000010, "Wrong alignment on Prop_soos_C_GetData");
static_assert(sizeof(Prop_soos_C_GetData) == 0x000280, "Wrong size on Prop_soos_C_GetData");
static_assert(offsetof(Prop_soos_C_GetData, Data) == 0x000000, "Member 'Prop_soos_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_soos_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_soos_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Prop_soos_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_soos_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_soos_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_soos_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_soos_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

