#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_argw

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_argw.prop_argw_C.ExecuteUbergraph_prop_argw
// 0x0200 (0x0200 - 0x0000)
struct Prop_argw_C_ExecuteUbergraph_prop_argw final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0020(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x009C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argw_C_ExecuteUbergraph_prop_argw) == 0x000008, "Wrong alignment on Prop_argw_C_ExecuteUbergraph_prop_argw");
static_assert(sizeof(Prop_argw_C_ExecuteUbergraph_prop_argw) == 0x000200, "Wrong size on Prop_argw_C_ExecuteUbergraph_prop_argw");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, EntryPoint) == 0x000000, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000010, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_obj_statDyn_obj) == 0x000020, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_GetActorRightVector_ReturnValue) == 0x000030, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_GetActorForwardVector_ReturnValue) == 0x00003C, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Dot_VectorVector_ReturnValue) == 0x000048, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x00004C, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000054, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000064, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, Temp_object_Variable) == 0x000080, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000090, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x00009C, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000124, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000128, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_bBlockingHit) == 0x000134, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_bInitialOverlap) == 0x000135, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_Time) == 0x000138, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_Distance) == 0x00013C, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_Location) == 0x000140, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_ImpactPoint) == 0x00014C, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_Normal) == 0x000158, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_ImpactNormal) == 0x000164, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_PhysMat) == 0x000170, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_HitActor) == 0x000178, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_HitComponent) == 0x000180, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_HitBoneName) == 0x000188, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_HitItem) == 0x000190, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_ElementIndex) == 0x000194, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_FaceIndex) == 0x000198, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_TraceStart) == 0x00019C, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_BreakHitResult_TraceEnd) == 0x0001A8, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_FMin_ReturnValue) == 0x0001B4, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_GetComponentVelocity_ReturnValue) == 0x0001B8, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001C4, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001C8, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Lerp_ReturnValue) == 0x0001CC, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0001D0, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_MakeVector_ReturnValue) == 0x0001D4, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0001E0, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001E4, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_ExecuteUbergraph_prop_argw, CallFunc_MakeVector_ReturnValue_1) == 0x0001F0, "Member 'Prop_argw_C_ExecuteUbergraph_prop_argw::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function prop_argw.prop_argw_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_argw_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argw_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_argw_C_ReceiveTick");
static_assert(sizeof(Prop_argw_C_ReceiveTick) == 0x000004, "Wrong size on Prop_argw_C_ReceiveTick");
static_assert(offsetof(Prop_argw_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_argw_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_argw.prop_argw_C.setmats
// 0x0018 (0x0018 - 0x0000)
struct Prop_argw_C_Setmats final
{
public:
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argw_C_Setmats) == 0x000008, "Wrong alignment on Prop_argw_C_Setmats");
static_assert(sizeof(Prop_argw_C_Setmats) == 0x000018, "Wrong size on Prop_argw_C_Setmats");
static_assert(offsetof(Prop_argw_C_Setmats, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000000, "Member 'Prop_argw_C_Setmats::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_Setmats, CallFunc_Array_Get_Item) == 0x000008, "Member 'Prop_argw_C_Setmats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_Setmats, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'Prop_argw_C_Setmats::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_argw.prop_argw_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Prop_argw_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_argw_C_UserConstructionScript) == 0x000008, "Wrong alignment on Prop_argw_C_UserConstructionScript");
static_assert(sizeof(Prop_argw_C_UserConstructionScript) == 0x000010, "Wrong size on Prop_argw_C_UserConstructionScript");
static_assert(offsetof(Prop_argw_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Prop_argw_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_argw_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'Prop_argw_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

