#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wMannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_wMannequin.prop_wMannequin_C.ExecuteUbergraph_prop_wMannequin
// 0x0370 (0x0370 - 0x0000)
struct Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A3[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_GetCurrentPath_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A4[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        K2Node_CustomEvent_AffectedPath;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavPathEvent                                 K2Node_CustomEvent_PathEvent;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A5[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_GetCurrentPath_ReturnValue_1;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A6[0x2];                                     // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UNavigationPath* AffectedPath, ENavPathEvent PathEvent)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_2;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A7[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_3;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A8[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A9[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x01BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AA[0xB];                                     // 0x0245(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0250(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AChildPawn_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AB[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0298(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AC[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27AD[0x2];                                     // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue_1;            // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AE[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0318(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27AF[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage;                               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B0[0x2];                                     // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0350(0x0010)(ReferenceParm)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin) == 0x000010, "Wrong alignment on Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin");
static_assert(sizeof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin) == 0x000370, "Wrong size on Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, EntryPoint) == 0x000000, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetActorRightVector_ReturnValue) == 0x000018, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetActorForwardVector_ReturnValue) == 0x000024, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Dot_VectorVector_ReturnValue) == 0x000030, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000034, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000040, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00004C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000058, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CustomEvent_MovementResult_1) == 0x00007C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000080, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000084, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000088, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000090, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetController_ReturnValue) == 0x000098, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetCurrentPath_ReturnValue) == 0x0000A0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetCurrentPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_IsValid_ReturnValue_2) == 0x0000AA, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, Temp_int_Variable) == 0x0000AC, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CustomEvent_AffectedPath) == 0x0000B0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CustomEvent_AffectedPath' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CustomEvent_PathEvent) == 0x0000B8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CustomEvent_PathEvent' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetController_ReturnValue_1) == 0x0000C0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetCurrentPath_ReturnValue_1) == 0x0000C8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetCurrentPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_IsValid_ReturnValue_3) == 0x0000DC, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000DD, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Add_IntInt_ReturnValue) == 0x0000F0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetActorUpVector_ReturnValue) == 0x0000F4, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Dot_VectorVector_ReturnValue_2) == 0x000100, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Dot_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_FClamp_ReturnValue) == 0x000104, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000108, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00010C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_SelectFloat_ReturnValue) == 0x000110, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, Temp_byte_Variable) == 0x000114, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_SelectFloat_ReturnValue_1) == 0x000118, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_SelectFloat_ReturnValue_2) == 0x00011C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000120, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BreakVector_X) == 0x00012C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BreakVector_Y) == 0x000130, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BreakVector_Z) == 0x000134, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Normal_ReturnValue) == 0x000138, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000144, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Dot_VectorVector_ReturnValue_3) == 0x000150, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Dot_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000154, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000160, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_SignOfFloat_ReturnValue) == 0x000164, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Abs_ReturnValue) == 0x000168, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x00016C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000170, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000174, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000180, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_VSize_ReturnValue) == 0x000184, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000188, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000194, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000198, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_SetVectorLength_ReturnValue) == 0x0001A4, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BreakVector_X_1) == 0x0001B0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BreakVector_Y_1) == 0x0001B4, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BreakVector_Z_1) == 0x0001B8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x0001BC, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000244, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetTransform_ReturnValue) == 0x000250, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000280, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_FinishSpawningActor_ReturnValue) == 0x000288, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Not_PreBool_ReturnValue) == 0x000290, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000298, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BooleanAND_ReturnValue) == 0x0002A8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Array_Get_Item_1) == 0x0002B0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_DynamicCast_AsMain_Player) == 0x0002B8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_DynamicCast_bSuccess) == 0x0002C0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CustomEvent_MovementResult) == 0x0002C1, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0002C4, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002D0, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x0002DC, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0002E8, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002F4, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_SetVectorLength_ReturnValue_1) == 0x000304, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_SetVectorLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000310, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000318, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Array_Get_Item_2) == 0x000328, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_DynamicCast_AsDoor) == 0x000330, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_DynamicCast_AsDoor' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_DynamicCast_bSuccess_1) == 0x000338, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_Event_damage) == 0x00033C, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_Not_PreBool_ReturnValue_1) == 0x000340, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BooleanAND_ReturnValue_1) == 0x000341, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000344, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, K2Node_MakeArray_Array) == 0x000350, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_getMainPlayer_AsMain_Player) == 0x000360, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_BooleanOR_ReturnValue) == 0x000368, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000369, "Member 'Prop_wMannequin_C_ExecuteUbergraph_prop_wMannequin::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Prop_wMannequin_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wMannequin_C_FireDamage) == 0x000004, "Wrong alignment on Prop_wMannequin_C_FireDamage");
static_assert(sizeof(Prop_wMannequin_C_FireDamage) == 0x000004, "Wrong size on Prop_wMannequin_C_FireDamage");
static_assert(offsetof(Prop_wMannequin_C_FireDamage, Damage) == 0x000000, "Member 'Prop_wMannequin_C_FireDamage::Damage' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.upd
// 0x0010 (0x0010 - 0x0000)
struct Prop_wMannequin_C_Upd final
{
public:
	class UNavigationPath*                        AffectedPath;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENavPathEvent                                 PathEvent;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wMannequin_C_Upd) == 0x000008, "Wrong alignment on Prop_wMannequin_C_Upd");
static_assert(sizeof(Prop_wMannequin_C_Upd) == 0x000010, "Wrong size on Prop_wMannequin_C_Upd");
static_assert(offsetof(Prop_wMannequin_C_Upd, AffectedPath) == 0x000000, "Member 'Prop_wMannequin_C_Upd::AffectedPath' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_Upd, PathEvent) == 0x000008, "Member 'Prop_wMannequin_C_Upd::PathEvent' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wMannequin_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wMannequin_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wMannequin_C_ReceiveTick");
static_assert(sizeof(Prop_wMannequin_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wMannequin_C_ReceiveTick");
static_assert(offsetof(Prop_wMannequin_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wMannequin_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679
// 0x0001 (0x0001 - 0x0000)
struct Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679) == 0x000001, "Wrong alignment on Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679");
static_assert(sizeof(Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679) == 0x000001, "Wrong size on Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679");
static_assert(offsetof(Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679, MovementResult) == 0x000000, "Member 'Prop_wMannequin_C_OnSuccess_8AF90BF14EEA5E13962F0D85A5B30679::MovementResult' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.OnFail_8AF90BF14EEA5E13962F0D85A5B30679
// 0x0001 (0x0001 - 0x0000)
struct Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679) == 0x000001, "Wrong alignment on Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679");
static_assert(sizeof(Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679) == 0x000001, "Wrong size on Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679");
static_assert(offsetof(Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679, MovementResult) == 0x000000, "Member 'Prop_wMannequin_C_OnFail_8AF90BF14EEA5E13962F0D85A5B30679::MovementResult' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_wMannequin_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B1[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wMannequin_C_LoadData) == 0x000010, "Wrong alignment on Prop_wMannequin_C_LoadData");
static_assert(sizeof(Prop_wMannequin_C_LoadData) == 0x0000E0, "Wrong size on Prop_wMannequin_C_LoadData");
static_assert(offsetof(Prop_wMannequin_C_LoadData, Data) == 0x000000, "Member 'Prop_wMannequin_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_LoadData, Return) == 0x0000C0, "Member 'Prop_wMannequin_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_wMannequin_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_wMannequin_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_wMannequin_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_wMannequin.prop_wMannequin_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_wMannequin_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_wMannequin_C_GetData) == 0x000010, "Wrong alignment on Prop_wMannequin_C_GetData");
static_assert(sizeof(Prop_wMannequin_C_GetData) == 0x000280, "Wrong size on Prop_wMannequin_C_GetData");
static_assert(offsetof(Prop_wMannequin_C_GetData, Data) == 0x000000, "Member 'Prop_wMannequin_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_wMannequin_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_wMannequin_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_wMannequin_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Prop_wMannequin_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
