#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_lifeCrystal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_lifeCrystal.prop_lifeCrystal_C
// 0x0050 (0x03C8 - 0x0378)
class AProp_lifeCrystal_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_lifeCrystal_C;                 // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Voic;                                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               EffAtt;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff5;                                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff4;                                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff3;                                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff2;                                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff1;                                              // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_lifeCrystal(int32 EntryPoint);
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, float Damage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_lifeCrystal_C">();
	}
	static class AProp_lifeCrystal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_lifeCrystal_C>();
	}
};
static_assert(alignof(AProp_lifeCrystal_C) == 0x000008, "Wrong alignment on AProp_lifeCrystal_C");
static_assert(sizeof(AProp_lifeCrystal_C) == 0x0003C8, "Wrong size on AProp_lifeCrystal_C");
static_assert(offsetof(AProp_lifeCrystal_C, UberGraphFrame_Prop_lifeCrystal_C) == 0x000378, "Member 'AProp_lifeCrystal_C::UberGraphFrame_Prop_lifeCrystal_C' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Voic) == 0x000380, "Member 'AProp_lifeCrystal_C::Voic' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, EffAtt) == 0x000388, "Member 'AProp_lifeCrystal_C::EffAtt' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Eff5) == 0x000390, "Member 'AProp_lifeCrystal_C::Eff5' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Eff4) == 0x000398, "Member 'AProp_lifeCrystal_C::Eff4' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Eff3) == 0x0003A0, "Member 'AProp_lifeCrystal_C::Eff3' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Eff2) == 0x0003A8, "Member 'AProp_lifeCrystal_C::Eff2' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Eff1) == 0x0003B0, "Member 'AProp_lifeCrystal_C::Eff1' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, Audio) == 0x0003B8, "Member 'AProp_lifeCrystal_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_lifeCrystal_C, PointLight) == 0x0003C0, "Member 'AProp_lifeCrystal_C::PointLight' has a wrong offset!");

}

