#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_grenade_a

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_grenade_a.prop_grenade_a_C.ExecuteUbergraph_prop_grenade_a
// 0x0060 (0x0060 - 0x0000)
struct Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a) == 0x000010, "Wrong alignment on Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a");
static_assert(sizeof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a) == 0x000060, "Wrong size on Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, EntryPoint) == 0x000000, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000008, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'Prop_grenade_a_C_ExecuteUbergraph_prop_grenade_a::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

