#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bunkhouseDOor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_bunkhouseDOor.prop_bunkhouseDoor_C.ExecuteUbergraph_prop_bunkhouseDoor
// 0x0080 (0x0080 - 0x0000)
struct Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChildActor_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor) == 0x000010, "Wrong alignment on Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor");
static_assert(sizeof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor) == 0x000080, "Wrong size on Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, EntryPoint) == 0x000000, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, CallFunc_IsChildActor_ReturnValue) == 0x000050, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::CallFunc_IsChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, Temp_name_Variable) == 0x000054, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, CallFunc_GetVelocity_ReturnValue) == 0x00005C, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x000068, "Member 'Prop_bunkhouseDoor_C_ExecuteUbergraph_prop_bunkhouseDoor::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");

}

