#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_shovel

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_shovel.prop_shovel_C.ExecuteUbergraph_prop_shovel
// 0x0010 (0x0010 - 0x0000)
struct Prop_shovel_C_ExecuteUbergraph_prop_shovel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_shovel_C_ExecuteUbergraph_prop_shovel) == 0x000008, "Wrong alignment on Prop_shovel_C_ExecuteUbergraph_prop_shovel");
static_assert(sizeof(Prop_shovel_C_ExecuteUbergraph_prop_shovel) == 0x000010, "Wrong size on Prop_shovel_C_ExecuteUbergraph_prop_shovel");
static_assert(offsetof(Prop_shovel_C_ExecuteUbergraph_prop_shovel, EntryPoint) == 0x000000, "Member 'Prop_shovel_C_ExecuteUbergraph_prop_shovel::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_shovel_C_ExecuteUbergraph_prop_shovel, K2Node_Event_player) == 0x000008, "Member 'Prop_shovel_C_ExecuteUbergraph_prop_shovel::K2Node_Event_player' has a wrong offset!");

// Function prop_shovel.prop_shovel_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_shovel_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_shovel_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_shovel_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_shovel_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_shovel_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_shovel_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_shovel_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

