#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_container_brickstack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK::Params
{

// Function prop_container_brickstack.prop_container_brickstack_C.ExecuteUbergraph_prop_container_brickstack
// 0x0200 (0x0200 - 0x0000)
struct Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E81[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0124(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0170(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack) == 0x000010, "Wrong alignment on Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack");
static_assert(sizeof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack) == 0x000200, "Wrong size on Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, EntryPoint) == 0x000000, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, Temp_int_Variable) == 0x000004, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, K2Node_Event_player) == 0x000010, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, K2Node_Event_hit) == 0x000018, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, K2Node_Event_index) == 0x0000A0, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, K2Node_Event_action) == 0x0000A4, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, K2Node_SwitchEnum_CmpSuccess) == 0x0000A5, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_bBlockingHit) == 0x0000A6, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000A7, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_Time) == 0x0000A8, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_Distance) == 0x0000AC, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_Location) == 0x0000B0, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_ImpactPoint) == 0x0000BC, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_Normal) == 0x0000C8, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_ImpactNormal) == 0x0000D4, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_PhysMat) == 0x0000E0, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_HitActor) == 0x0000E8, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_HitComponent) == 0x0000F0, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_HitBoneName) == 0x0000F8, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_HitItem) == 0x000100, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_ElementIndex) == 0x000104, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_FaceIndex) == 0x000108, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_TraceStart) == 0x00010C, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BreakHitResult_TraceEnd) == 0x000118, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, Temp_name_Variable) == 0x000124, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_Subtract_IntInt_ReturnValue) == 0x00012C, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000130, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000160, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_FinishSpawningActor_ReturnValue) == 0x000168, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack, CallFunc_MakeHitResult_ReturnValue) == 0x000170, "Member 'Prop_container_brickstack_C_ExecuteUbergraph_prop_container_brickstack::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");

// Function prop_container_brickstack.prop_container_brickstack_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_container_brickstack_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_container_brickstack_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_container_brickstack_C_ActionOptionIndex");
static_assert(sizeof(Prop_container_brickstack_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_container_brickstack_C_ActionOptionIndex");
static_assert(offsetof(Prop_container_brickstack_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_container_brickstack_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_container_brickstack_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Prop_container_brickstack_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_ActionOptionIndex, Action) == 0x000094, "Member 'Prop_container_brickstack_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_container_brickstack.prop_container_brickstack_C.lookAt
// 0x0128 (0x0128 - 0x0000)
struct Prop_container_brickstack_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E82[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_container_brickstack_C_LookAt) == 0x000008, "Wrong alignment on Prop_container_brickstack_C_LookAt");
static_assert(sizeof(Prop_container_brickstack_C_LookAt) == 0x000128, "Wrong size on Prop_container_brickstack_C_LookAt");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, Player) == 0x000000, "Member 'Prop_container_brickstack_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_container_brickstack_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, Return) == 0x000090, "Member 'Prop_container_brickstack_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, Text) == 0x000098, "Member 'Prop_container_brickstack_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_container_brickstack_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'Prop_container_brickstack_C_LookAt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, K2Node_MakeArray_Array) == 0x0000F0, "Member 'Prop_container_brickstack_C_LookAt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, CallFunc_Format_ReturnValue) == 0x000100, "Member 'Prop_container_brickstack_C_LookAt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x000118, "Member 'Prop_container_brickstack_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function prop_container_brickstack.prop_container_brickstack_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_container_brickstack_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_container_brickstack_C_GetData) == 0x000010, "Wrong alignment on Prop_container_brickstack_C_GetData");
static_assert(sizeof(Prop_container_brickstack_C_GetData) == 0x000270, "Wrong size on Prop_container_brickstack_C_GetData");
static_assert(offsetof(Prop_container_brickstack_C_GetData, Data) == 0x000000, "Member 'Prop_container_brickstack_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_container_brickstack_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_container_brickstack_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_container_brickstack_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_container_brickstack_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_container_brickstack_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_container_brickstack.prop_container_brickstack_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_container_brickstack_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E83[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_container_brickstack_C_LoadData) == 0x000010, "Wrong alignment on Prop_container_brickstack_C_LoadData");
static_assert(sizeof(Prop_container_brickstack_C_LoadData) == 0x0000E0, "Wrong size on Prop_container_brickstack_C_LoadData");
static_assert(offsetof(Prop_container_brickstack_C_LoadData, Data) == 0x000000, "Member 'Prop_container_brickstack_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LoadData, Return) == 0x0000C0, "Member 'Prop_container_brickstack_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_container_brickstack_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_container_brickstack_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_container_brickstack_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_container_brickstack.prop_container_brickstack_C.getActionOptions
// 0x0058 (0x0058 - 0x0000)
struct Prop_container_brickstack_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_container_brickstack_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_container_brickstack_C_GetActionOptions");
static_assert(sizeof(Prop_container_brickstack_C_GetActionOptions) == 0x000058, "Wrong size on Prop_container_brickstack_C_GetActionOptions");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_container_brickstack_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_container_brickstack_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_container_brickstack_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_container_brickstack_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_container_brickstack_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_container_brickstack_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_container_brickstack_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000048, "Member 'Prop_container_brickstack_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

