#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bombBottle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_bombBottle.prop_bombBottle_C.ExecuteUbergraph_prop_bombBottle
// 0x0050 (0x0050 - 0x0000)
struct Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle) == 0x000010, "Wrong alignment on Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle");
static_assert(sizeof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle) == 0x000050, "Wrong size on Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle");
static_assert(offsetof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle, EntryPoint) == 0x000000, "Member 'Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle, CallFunc_GetCenterOfMass_ReturnValue) == 0x000004, "Member 'Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_bombBottle_C_ExecuteUbergraph_prop_bombBottle::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

