#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_gascan

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_gascan.prop_gascan_C
// 0x0030 (0x03A8 - 0x0378)
class AProp_gascan_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_gascan_C;                      // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Amount;                                            // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x038C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PickedUp;                                          // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void PickedUp__DelegateSignature();
	void ExecuteUbergraph_prop_gascan(int32 EntryPoint);
	void BndEvt__prop_gascan_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Param_Hit);
	void GetFuel(float& CurrentFuel, float MaxFuel, bool* HasFueled, bool* Changed);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void broken_fire();
	void broken();
	void Crafted();
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void GetPriceMultiplier(float* PriceMult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_gascan_C">();
	}
	static class AProp_gascan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_gascan_C>();
	}
};
static_assert(alignof(AProp_gascan_C) == 0x000008, "Wrong alignment on AProp_gascan_C");
static_assert(sizeof(AProp_gascan_C) == 0x0003A8, "Wrong size on AProp_gascan_C");
static_assert(offsetof(AProp_gascan_C, UberGraphFrame_Prop_gascan_C) == 0x000378, "Member 'AProp_gascan_C::UberGraphFrame_Prop_gascan_C' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, Billboard) == 0x000380, "Member 'AProp_gascan_C::Billboard' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, Amount) == 0x000388, "Member 'AProp_gascan_C::Amount' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, Impulse) == 0x00038C, "Member 'AProp_gascan_C::Impulse' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, PickedUp) == 0x000398, "Member 'AProp_gascan_C::PickedUp' has a wrong offset!");

}

