#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_nail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_nail.prop_nail_C.ExecuteUbergraph_prop_nail
// 0x01F0 (0x01F0 - 0x0000)
struct Prop_nail_C_ExecuteUbergraph_prop_nail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E86[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_useArm_OutHit;                            // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_useArm_ReturnValue;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E87[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E88[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E89[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E8A[0x8];                                     // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E8B[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANail_ax_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_attach_fail;                              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E8C[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANail_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_attach_fail_1;                            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E8D[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANail_super_C*                          CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_attach_fail_2;                            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E8E[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANail_ax_super_C*                       CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_attach_fail_3;                            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E8F[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANail_ball_C*                           CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_attach_fail_4;                            // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_nail_C_ExecuteUbergraph_prop_nail) == 0x000010, "Wrong alignment on Prop_nail_C_ExecuteUbergraph_prop_nail");
static_assert(sizeof(Prop_nail_C_ExecuteUbergraph_prop_nail) == 0x0001F0, "Wrong size on Prop_nail_C_ExecuteUbergraph_prop_nail");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, EntryPoint) == 0x000000, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, K2Node_Event_player) == 0x000008, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_useArm_OutHit) == 0x000010, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_useArm_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_useArm_ReturnValue) == 0x000098, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_useArm_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00009C, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_bBlockingHit) == 0x0000A8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000A9, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_Time) == 0x0000AC, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_Distance) == 0x0000B0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_Location) == 0x0000B4, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_Normal) == 0x0000CC, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_ImpactNormal) == 0x0000D8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_PhysMat) == 0x0000E8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_HitActor) == 0x0000F0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_HitComponent) == 0x0000F8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_HitBoneName) == 0x000100, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_HitItem) == 0x000108, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_ElementIndex) == 0x00010C, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_FaceIndex) == 0x000110, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_TraceStart) == 0x000114, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BreakHitResult_TraceEnd) == 0x000120, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_Add_VectorVector_ReturnValue) == 0x00012C, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000170, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, K2Node_SwitchInteger_CmpSuccess) == 0x000178, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_FinishSpawningActor_ReturnValue) == 0x000180, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000188, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_attach_fail) == 0x000190, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_attach_fail' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000198, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_attach_fail_1) == 0x0001A0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_attach_fail_1' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0001A8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001B0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0001B8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_attach_fail_2) == 0x0001C0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_attach_fail_2' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0001C8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_attach_fail_3) == 0x0001D0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_attach_fail_3' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x0001D8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x0001E0, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_nail_C_ExecuteUbergraph_prop_nail, CallFunc_attach_fail_4) == 0x0001E8, "Member 'Prop_nail_C_ExecuteUbergraph_prop_nail::CallFunc_attach_fail_4' has a wrong offset!");

// Function prop_nail.prop_nail_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_nail_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_nail_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_nail_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_nail_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_nail_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_nail_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_nail_C_PlayerHandUse_LMB::Player' has a wrong offset!");

}

