#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_gst

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_gst.prop_gst_C.ExecuteUbergraph_prop_gst
// 0x000C (0x000C - 0x0000)
struct Prop_gst_C_ExecuteUbergraph_prop_gst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ConstraintIndex_1;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ConstraintIndex;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_gst_C_ExecuteUbergraph_prop_gst) == 0x000004, "Wrong alignment on Prop_gst_C_ExecuteUbergraph_prop_gst");
static_assert(sizeof(Prop_gst_C_ExecuteUbergraph_prop_gst) == 0x00000C, "Wrong size on Prop_gst_C_ExecuteUbergraph_prop_gst");
static_assert(offsetof(Prop_gst_C_ExecuteUbergraph_prop_gst, EntryPoint) == 0x000000, "Member 'Prop_gst_C_ExecuteUbergraph_prop_gst::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_ExecuteUbergraph_prop_gst, K2Node_ComponentBoundEvent_ConstraintIndex_1) == 0x000004, "Member 'Prop_gst_C_ExecuteUbergraph_prop_gst::K2Node_ComponentBoundEvent_ConstraintIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_ExecuteUbergraph_prop_gst, K2Node_ComponentBoundEvent_ConstraintIndex) == 0x000008, "Member 'Prop_gst_C_ExecuteUbergraph_prop_gst::K2Node_ComponentBoundEvent_ConstraintIndex' has a wrong offset!");

// Function prop_gst.prop_gst_C.BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature final
{
public:
	int32                                         ConstraintIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature");
static_assert(sizeof(Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong size on Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature");
static_assert(offsetof(Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature, ConstraintIndex) == 0x000000, "Member 'Prop_gst_C_BndEvt__prop_gst_prop_to_B_K2Node_ComponentBoundEvent_1_ConstraintBrokenSignature__DelegateSignature::ConstraintIndex' has a wrong offset!");

// Function prop_gst.prop_gst_C.BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature final
{
public:
	int32                                         ConstraintIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong alignment on Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature");
static_assert(sizeof(Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong size on Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature");
static_assert(offsetof(Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature, ConstraintIndex) == 0x000000, "Member 'Prop_gst_C_BndEvt__prop_gst_A_to_prop_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature::ConstraintIndex' has a wrong offset!");

// Function prop_gst.prop_gst_C.attach
// 0x0050 (0x0050 - 0x0000)
struct Prop_gst_C_Attach final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_gst_C_Attach) == 0x000008, "Wrong alignment on Prop_gst_C_Attach");
static_assert(sizeof(Prop_gst_C_Attach) == 0x000050, "Wrong size on Prop_gst_C_Attach");
static_assert(offsetof(Prop_gst_C_Attach, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Prop_gst_C_Attach::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, CallFunc_Vector_Distance_ReturnValue) == 0x00000C, "Member 'Prop_gst_C_Attach::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'Prop_gst_C_Attach::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'Prop_gst_C_Attach::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'Prop_gst_C_Attach::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, K2Node_DynamicCast_AsPrimitive_Component) == 0x000028, "Member 'Prop_gst_C_Attach::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Prop_gst_C_Attach::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000038, "Member 'Prop_gst_C_Attach::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, K2Node_DynamicCast_AsPrimitive_Component_1) == 0x000040, "Member 'Prop_gst_C_Attach::K2Node_DynamicCast_AsPrimitive_Component_1' has a wrong offset!");
static_assert(offsetof(Prop_gst_C_Attach, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'Prop_gst_C_Attach::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

