#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_picture_h

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_wallAttachable_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_picture_h.prop_picture_h_C
// 0x0020 (0x0420 - 0x0400)
class AProp_picture_h_C : public AProp_wallAttachable_C
{
public:
	uint8                                         Pad_3DB3[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_picture_h_C;                   // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Stick_0;                                           // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_Prop_picture_h_C;                            // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB4[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Dim;                                               // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Table;                                             // 0x041C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_picture_h(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, int32 Param_Index, Enum_interactionActions Action);
	void ReceiveBeginPlay();
	void Upd();
	void SettingsApplied(const struct FStruct_settings& Settings);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_picture_h_C">();
	}
	static class AProp_picture_h_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_picture_h_C>();
	}
};
static_assert(alignof(AProp_picture_h_C) == 0x000010, "Wrong alignment on AProp_picture_h_C");
static_assert(sizeof(AProp_picture_h_C) == 0x000420, "Wrong size on AProp_picture_h_C");
static_assert(offsetof(AProp_picture_h_C, UberGraphFrame_Prop_picture_h_C) == 0x0003F8, "Member 'AProp_picture_h_C::UberGraphFrame_Prop_picture_h_C' has a wrong offset!");
static_assert(offsetof(AProp_picture_h_C, Stick_0) == 0x000400, "Member 'AProp_picture_h_C::Stick_0' has a wrong offset!");
static_assert(offsetof(AProp_picture_h_C, Index_Prop_picture_h_C) == 0x000408, "Member 'AProp_picture_h_C::Index_Prop_picture_h_C' has a wrong offset!");
static_assert(offsetof(AProp_picture_h_C, Dynmat) == 0x000410, "Member 'AProp_picture_h_C::Dynmat' has a wrong offset!");
static_assert(offsetof(AProp_picture_h_C, Dim) == 0x000418, "Member 'AProp_picture_h_C::Dim' has a wrong offset!");
static_assert(offsetof(AProp_picture_h_C, Table) == 0x00041C, "Member 'AProp_picture_h_C::Table' has a wrong offset!");

}

