#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_sponge_bucketPour

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_sponge_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_sponge_bucketPour.prop_sponge_bucketPour_C
// 0x0020 (0x03E0 - 0x03C0)
class AProp_sponge_bucketPour_C final : public AProp_sponge_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_sponge_bucketPour_C;           // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_prop_sponge_bucketPour(int32 EntryPoint);
	void Collided(class UPrimitiveComponent* Hitcomp, class AActor* Otherac, class UPrimitiveComponent* OtherComp, const struct FVector& InputPin4, const struct FHitResult& InputPin5);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_sponge_bucketPour_C">();
	}
	static class AProp_sponge_bucketPour_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_sponge_bucketPour_C>();
	}
};
static_assert(alignof(AProp_sponge_bucketPour_C) == 0x000008, "Wrong alignment on AProp_sponge_bucketPour_C");
static_assert(sizeof(AProp_sponge_bucketPour_C) == 0x0003E0, "Wrong size on AProp_sponge_bucketPour_C");
static_assert(offsetof(AProp_sponge_bucketPour_C, UberGraphFrame_Prop_sponge_bucketPour_C) == 0x0003C0, "Member 'AProp_sponge_bucketPour_C::UberGraphFrame_Prop_sponge_bucketPour_C' has a wrong offset!");
static_assert(offsetof(AProp_sponge_bucketPour_C, ParticleSystem) == 0x0003C8, "Member 'AProp_sponge_bucketPour_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AProp_sponge_bucketPour_C, Obj) == 0x0003D0, "Member 'AProp_sponge_bucketPour_C::Obj' has a wrong offset!");

}

