#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_lambert

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_lambert.prop_lambert_C.ExecuteUbergraph_prop_lambert
// 0x0098 (0x0098 - 0x0000)
struct Prop_lambert_C_ExecuteUbergraph_prop_lambert final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_383B[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_lambUI_C*                          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_pawn_obj;                             // 0x0038(0x0010)(ReferenceParm)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383C[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383D[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_lambert_C_ExecuteUbergraph_prop_lambert) == 0x000008, "Wrong alignment on Prop_lambert_C_ExecuteUbergraph_prop_lambert");
static_assert(sizeof(Prop_lambert_C_ExecuteUbergraph_prop_lambert) == 0x000098, "Wrong size on Prop_lambert_C_ExecuteUbergraph_prop_lambert");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, EntryPoint) == 0x000000, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_obj_pawn_obj) == 0x000038, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_obj_pawn_obj' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_getSaveSlot_saveSlot) == 0x000048, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_GetPlayerPawn_ReturnValue) == 0x000050, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_Less_FloatFloat_ReturnValue) == 0x000058, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00005C, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000068, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, Temp_object_Variable) == 0x000070, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_SphereOverlapActors_OutActors) == 0x000080, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_lambert_C_ExecuteUbergraph_prop_lambert, CallFunc_SphereOverlapActors_ReturnValue) == 0x000090, "Member 'Prop_lambert_C_ExecuteUbergraph_prop_lambert::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");

// Function prop_lambert.prop_lambert_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_lambert_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lambert_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_lambert_C_ReceiveTick");
static_assert(sizeof(Prop_lambert_C_ReceiveTick) == 0x000004, "Wrong size on Prop_lambert_C_ReceiveTick");
static_assert(offsetof(Prop_lambert_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_lambert_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

