#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_argbl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_argbl.prop_argbl_C
// 0x0018 (0x0390 - 0x0378)
class AProp_argbl_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_argbl_C;                       // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               Dynmat_0;                                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_1;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_argbl(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Setmats();
	void GamemodeBeginPlay();
	void PropRenderer_finishProps();
	void UserConstructionScript();
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_argbl_C">();
	}
	static class AProp_argbl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_argbl_C>();
	}
};
static_assert(alignof(AProp_argbl_C) == 0x000008, "Wrong alignment on AProp_argbl_C");
static_assert(sizeof(AProp_argbl_C) == 0x000390, "Wrong size on AProp_argbl_C");
static_assert(offsetof(AProp_argbl_C, UberGraphFrame_Prop_argbl_C) == 0x000378, "Member 'AProp_argbl_C::UberGraphFrame_Prop_argbl_C' has a wrong offset!");
static_assert(offsetof(AProp_argbl_C, Dynmat_0) == 0x000380, "Member 'AProp_argbl_C::Dynmat_0' has a wrong offset!");
static_assert(offsetof(AProp_argbl_C, Dynmat_1) == 0x000388, "Member 'AProp_argbl_C::Dynmat_1' has a wrong offset!");

}

