#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_cannedFood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_cannedFood.prop_cannedFood_C
// 0x0018 (0x0390 - 0x0378)
class AProp_cannedFood_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_cannedFood_C;                  // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Opened;                                            // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Type;                                              // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Foods;                                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_cannedFood(int32 EntryPoint);
	void Open();
	void Eat(class AMainPlayer_C* Self2);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void Init();
	void GetData(struct FStruct_save* Data);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_cannedFood_C">();
	}
	static class AProp_cannedFood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_cannedFood_C>();
	}
};
static_assert(alignof(AProp_cannedFood_C) == 0x000008, "Wrong alignment on AProp_cannedFood_C");
static_assert(sizeof(AProp_cannedFood_C) == 0x000390, "Wrong size on AProp_cannedFood_C");
static_assert(offsetof(AProp_cannedFood_C, UberGraphFrame_Prop_cannedFood_C) == 0x000378, "Member 'AProp_cannedFood_C::UberGraphFrame_Prop_cannedFood_C' has a wrong offset!");
static_assert(offsetof(AProp_cannedFood_C, Opened) == 0x000380, "Member 'AProp_cannedFood_C::Opened' has a wrong offset!");
static_assert(offsetof(AProp_cannedFood_C, Type) == 0x000384, "Member 'AProp_cannedFood_C::Type' has a wrong offset!");
static_assert(offsetof(AProp_cannedFood_C, Foods) == 0x000388, "Member 'AProp_cannedFood_C::Foods' has a wrong offset!");

}

