#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_glue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_glue.prop_glue_C
// 0x0018 (0x0390 - 0x0378)
class AProp_glue_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_glue_C;                        // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Glue;                                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Glued;                                             // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_glue(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Obj(const TArray<EObjectTypeQuery>* OutputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_glue_C">();
	}
	static class AProp_glue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_glue_C>();
	}
};
static_assert(alignof(AProp_glue_C) == 0x000008, "Wrong alignment on AProp_glue_C");
static_assert(sizeof(AProp_glue_C) == 0x000390, "Wrong size on AProp_glue_C");
static_assert(offsetof(AProp_glue_C, UberGraphFrame_Prop_glue_C) == 0x000378, "Member 'AProp_glue_C::UberGraphFrame_Prop_glue_C' has a wrong offset!");
static_assert(offsetof(AProp_glue_C, Glue) == 0x000380, "Member 'AProp_glue_C::Glue' has a wrong offset!");
static_assert(offsetof(AProp_glue_C, Glued) == 0x000388, "Member 'AProp_glue_C::Glued' has a wrong offset!");

}

