#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fishbait

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_fishbait.prop_fishbait_C.lookAt
// 0x01B8 (0x01B8 - 0x0000)
struct Prop_fishbait_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD6[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fishbait_C_LookAt) == 0x000008, "Wrong alignment on Prop_fishbait_C_LookAt");
static_assert(sizeof(Prop_fishbait_C_LookAt) == 0x0001B8, "Wrong size on Prop_fishbait_C_LookAt");
static_assert(offsetof(Prop_fishbait_C_LookAt, Player) == 0x000000, "Member 'Prop_fishbait_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_fishbait_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, Return) == 0x000090, "Member 'Prop_fishbait_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, Text) == 0x000098, "Member 'Prop_fishbait_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_fishbait_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'Prop_fishbait_C_LookAt::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000B4, "Member 'Prop_fishbait_C_LookAt::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'Prop_fishbait_C_LookAt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'Prop_fishbait_C_LookAt::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000138, "Member 'Prop_fishbait_C_LookAt::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00013C, "Member 'Prop_fishbait_C_LookAt::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'Prop_fishbait_C_LookAt::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_fishbait_C_LookAt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, CallFunc_Format_ReturnValue) == 0x000190, "Member 'Prop_fishbait_C_LookAt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fishbait_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A8, "Member 'Prop_fishbait_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

