#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_kerfurOmega

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_kerfurOmega.prop_kerfurOmega_C
// 0x0018 (0x0380 - 0x0368)
class AProp_kerfurOmega_C : public AProp_C
{
public:
	uint8                                         Pad_2D0E[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_kerfurOmega_C;                 // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Spwn;                                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sentient;                                          // 0x037C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_kerfurOmega(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, int32 Param_Index, Enum_interactionActions Action);
	void SettingsApplied(const struct FStruct_settings& Settings);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_kerfurOmega_C">();
	}
	static class AProp_kerfurOmega_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_kerfurOmega_C>();
	}
};
static_assert(alignof(AProp_kerfurOmega_C) == 0x000008, "Wrong alignment on AProp_kerfurOmega_C");
static_assert(sizeof(AProp_kerfurOmega_C) == 0x000380, "Wrong size on AProp_kerfurOmega_C");
static_assert(offsetof(AProp_kerfurOmega_C, UberGraphFrame_Prop_kerfurOmega_C) == 0x000368, "Member 'AProp_kerfurOmega_C::UberGraphFrame_Prop_kerfurOmega_C' has a wrong offset!");
static_assert(offsetof(AProp_kerfurOmega_C, Spwn) == 0x000370, "Member 'AProp_kerfurOmega_C::Spwn' has a wrong offset!");
static_assert(offsetof(AProp_kerfurOmega_C, Type) == 0x000378, "Member 'AProp_kerfurOmega_C::Type' has a wrong offset!");
static_assert(offsetof(AProp_kerfurOmega_C, Sentient) == 0x00037C, "Member 'AProp_kerfurOmega_C::Sentient' has a wrong offset!");

}

