#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bucket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"


namespace SDK::Params
{

// Function prop_bucket.prop_bucket_C.ExecuteUbergraph_prop_bucket
// 0x0530 (0x0530 - 0x0000)
struct Prop_bucket_C_ExecuteUbergraph_prop_bucket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_3;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0184(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0270(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0380(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_sponge_bucketPour_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue_1;        // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x03E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x2];                                      // 0x0462(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x04E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_sponge_bucketPour_C*              CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_bucket_C_ExecuteUbergraph_prop_bucket) == 0x000010, "Wrong alignment on Prop_bucket_C_ExecuteUbergraph_prop_bucket");
static_assert(sizeof(Prop_bucket_C_ExecuteUbergraph_prop_bucket) == 0x000530, "Wrong size on Prop_bucket_C_ExecuteUbergraph_prop_bucket");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, EntryPoint) == 0x000000, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_player) == 0x000008, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00001C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_TransformRotation_ReturnValue) == 0x000060, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X) == 0x00006C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y) == 0x000070, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z) == 0x000074, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_1) == 0x000084, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_1) == 0x000088, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_1) == 0x00008C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_2) == 0x000090, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_2) == 0x000094, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_2) == 0x000098, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00009C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_3) == 0x0000A4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_3) == 0x0000A8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_3) == 0x0000AC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000B0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMin_ReturnValue) == 0x0000B8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0000BC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeStruct_FormatArgumentData) == 0x0000C0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Not_PreBool_ReturnValue) == 0x000100, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_MakeArray_Array) == 0x000148, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Format_ReturnValue) == 0x000158, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Conv_TextToString_ReturnValue) == 0x000170, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Not_PreBool_ReturnValue_1) == 0x000180, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BooleanAND_ReturnValue) == 0x000181, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000184, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000210, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_X_4) == 0x000218, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Y_4) == 0x00021C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BreakVector_Z_4) == 0x000220, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Array_Find_ReturnValue) == 0x000224, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Array_Get_Item) == 0x000228, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00022C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000230, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMax_ReturnValue) == 0x000234, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetActorUpVector_ReturnValue) == 0x000238, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Dot_VectorVector_ReturnValue) == 0x000244, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x000248, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000249, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000250, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000258, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000260, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000268, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_bFromSweep) == 0x00026C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_SweepResult) == 0x000270, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_AsInt_Objects) == 0x0002F8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomFloatInRange_ReturnValue) == 0x00030C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000310, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000314, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeVector_ReturnValue) == 0x000318, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000328, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherActor) == 0x000330, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherComp) == 0x000338, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000340, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000348, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000350, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00035C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000368, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, Temp_int_Variable) == 0x000374, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeTransform_ReturnValue) == 0x000380, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003B0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_IntInt_ReturnValue) == 0x0003B8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003C0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_IsSimulatingPhysics_ReturnValue_1) == 0x0003C8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_IsSimulatingPhysics_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FMin_ReturnValue_1) == 0x0003CC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0003D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetVelocity_ReturnValue) == 0x0003D4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0003E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0003E4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomUnitVector_ReturnValue) == 0x0003F0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003FC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue) == 0x000408, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000414, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetActorUpVector_ReturnValue_1) == 0x000418, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000424, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, Temp_int_Variable_1) == 0x000428, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00042C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000438, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_IntInt_ReturnValue_1) == 0x000444, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x000448, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Abs_ReturnValue) == 0x00044C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000450, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000454, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FTrunc_ReturnValue) == 0x000458, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FTrunc_ReturnValue_1) == 0x00045C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000460, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000461, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomUnitVector_ReturnValue_1) == 0x000464, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000470, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00047C, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, K2Node_Event_player_1) == 0x000480, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetVelocity_ReturnValue_1) == 0x000488, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_GetForwardVector_ReturnValue) == 0x000494, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x0004A0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0004AC, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0004B8, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0004C4, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0004D0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_MakeTransform_ReturnValue_1) == 0x0004E0, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000510, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000518, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_ExecuteUbergraph_prop_bucket, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000520, "Member 'Prop_bucket_C_ExecuteUbergraph_prop_bucket::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_bucket_C_BndEvt__prop_bucket_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_bucket_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_bucket_C_ReceiveTick");
static_assert(sizeof(Prop_bucket_C_ReceiveTick) == 0x000004, "Wrong size on Prop_bucket_C_ReceiveTick");
static_assert(offsetof(Prop_bucket_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_bucket_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.upd
// 0x0018 (0x0018 - 0x0000)
struct Prop_bucket_C_Upd final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bucket_C_Upd) == 0x000008, "Wrong alignment on Prop_bucket_C_Upd");
static_assert(sizeof(Prop_bucket_C_Upd) == 0x000018, "Wrong size on Prop_bucket_C_Upd");
static_assert(offsetof(Prop_bucket_C_Upd, Temp_bool_Variable) == 0x000000, "Member 'Prop_bucket_C_Upd::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Upd, Temp_object_Variable) == 0x000008, "Member 'Prop_bucket_C_Upd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_bucket_C_Upd, K2Node_Select_Default) == 0x000010, "Member 'Prop_bucket_C_Upd::K2Node_Select_Default' has a wrong offset!");

// Function prop_bucket.prop_bucket_C.interpFlow
// 0x0068 (0x0068 - 0x0000)
struct Prop_bucket_C_InterpFlow final
{
public:
