#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_food_mushroom7

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_food_mushroom7.prop_food_mushroom7_C.ExecuteUbergraph_prop_food_mushroom7
// 0x0080 (0x0080 - 0x0000)
struct Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2A[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AProp_puffballMature_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7) == 0x000010, "Wrong alignment on Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7");
static_assert(sizeof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7) == 0x000080, "Wrong size on Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, EntryPoint) == 0x000000, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, K2Node_DynamicCast_AsInt_Objects) == 0x000068, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Prop_food_mushroom7_C_ExecuteUbergraph_prop_food_mushroom7::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

