#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_ruler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_ruler.prop_ruler_C
// 0x0028 (0x03A0 - 0x0378)
class AProp_ruler_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_ruler_C;                       // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Tape;                                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    B;                                                 // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    A;                                                 // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          P;                                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_ruler(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_ruler_C">();
	}
	static class AProp_ruler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_ruler_C>();
	}
};
static_assert(alignof(AProp_ruler_C) == 0x000008, "Wrong alignment on AProp_ruler_C");
static_assert(sizeof(AProp_ruler_C) == 0x0003A0, "Wrong size on AProp_ruler_C");
static_assert(offsetof(AProp_ruler_C, UberGraphFrame_Prop_ruler_C) == 0x000378, "Member 'AProp_ruler_C::UberGraphFrame_Prop_ruler_C' has a wrong offset!");
static_assert(offsetof(AProp_ruler_C, Tape) == 0x000380, "Member 'AProp_ruler_C::Tape' has a wrong offset!");
static_assert(offsetof(AProp_ruler_C, B) == 0x000388, "Member 'AProp_ruler_C::B' has a wrong offset!");
static_assert(offsetof(AProp_ruler_C, A) == 0x000390, "Member 'AProp_ruler_C::A' has a wrong offset!");
static_assert(offsetof(AProp_ruler_C, P) == 0x000398, "Member 'AProp_ruler_C::P' has a wrong offset!");

}

