#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_vent

#include "Basic.hpp"

#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_vent.prop_vent_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Prop_vent_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_vent_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on Prop_vent_C_IgnoreSave_trigger");
static_assert(sizeof(Prop_vent_C_IgnoreSave_trigger) == 0x000001, "Wrong size on Prop_vent_C_IgnoreSave_trigger");
static_assert(offsetof(Prop_vent_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'Prop_vent_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function prop_vent.prop_vent_C.loadTriggerData
// 0x0100 (0x0100 - 0x0000)
struct Prop_vent_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_vent_C_LoadTriggerData) == 0x000010, "Wrong alignment on Prop_vent_C_LoadTriggerData");
static_assert(sizeof(Prop_vent_C_LoadTriggerData) == 0x000100, "Wrong size on Prop_vent_C_LoadTriggerData");
static_assert(offsetof(Prop_vent_C_LoadTriggerData, Data) == 0x000000, "Member 'Prop_vent_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_LoadTriggerData, Return) == 0x0000F0, "Member 'Prop_vent_C_LoadTriggerData::Return' has a wrong offset!");

// Function prop_vent.prop_vent_C.getTriggerData
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_vent_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vent_C_GetTriggerData) == 0x000010, "Wrong alignment on Prop_vent_C_GetTriggerData");
static_assert(sizeof(Prop_vent_C_GetTriggerData) == 0x0000F0, "Wrong size on Prop_vent_C_GetTriggerData");
static_assert(offsetof(Prop_vent_C_GetTriggerData, Data) == 0x000000, "Member 'Prop_vent_C_GetTriggerData::Data' has a wrong offset!");

// Function prop_vent.prop_vent_C.set_ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Prop_vent_C_Set_ignoreSave_trigger final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_vent_C_Set_ignoreSave_trigger) == 0x000001, "Wrong alignment on Prop_vent_C_Set_ignoreSave_trigger");
static_assert(sizeof(Prop_vent_C_Set_ignoreSave_trigger) == 0x000001, "Wrong size on Prop_vent_C_Set_ignoreSave_trigger");
static_assert(offsetof(Prop_vent_C_Set_ignoreSave_trigger, NewParam) == 0x000000, "Member 'Prop_vent_C_Set_ignoreSave_trigger::NewParam' has a wrong offset!");

// Function prop_vent.prop_vent_C.cordPlugged
// 0x0010 (0x0010 - 0x0000)
struct Prop_vent_C_CordPlugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vent_C_CordPlugged) == 0x000008, "Wrong alignment on Prop_vent_C_CordPlugged");
static_assert(sizeof(Prop_vent_C_CordPlugged) == 0x000010, "Wrong size on Prop_vent_C_CordPlugged");
static_assert(offsetof(Prop_vent_C_CordPlugged, Cord) == 0x000000, "Member 'Prop_vent_C_CordPlugged::Cord' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_CordPlugged, Socket) == 0x000008, "Member 'Prop_vent_C_CordPlugged::Socket' has a wrong offset!");

// Function prop_vent.prop_vent_C.cordUnplugged
// 0x0010 (0x0010 - 0x0000)
struct Prop_vent_C_CordUnplugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vent_C_CordUnplugged) == 0x000008, "Wrong alignment on Prop_vent_C_CordUnplugged");
static_assert(sizeof(Prop_vent_C_CordUnplugged) == 0x000010, "Wrong size on Prop_vent_C_CordUnplugged");
static_assert(offsetof(Prop_vent_C_CordUnplugged, Cord) == 0x000000, "Member 'Prop_vent_C_CordUnplugged::Cord' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_CordUnplugged, Socket) == 0x000008, "Member 'Prop_vent_C_CordUnplugged::Socket' has a wrong offset!");

// Function prop_vent.prop_vent_C.setActiveTrigger
// 0x0010 (0x0010 - 0x0000)
struct Prop_vent_C_SetActiveTrigger final
{
public:
	class AActor*                                 SentFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_vent_C_SetActiveTrigger) == 0x000008, "Wrong alignment on Prop_vent_C_SetActiveTrigger");
static_assert(sizeof(Prop_vent_C_SetActiveTrigger) == 0x000010, "Wrong size on Prop_vent_C_SetActiveTrigger");
static_assert(offsetof(Prop_vent_C_SetActiveTrigger, SentFrom) == 0x000000, "Member 'Prop_vent_C_SetActiveTrigger::SentFrom' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_SetActiveTrigger, Active) == 0x000008, "Member 'Prop_vent_C_SetActiveTrigger::Active' has a wrong offset!");

// Function prop_vent.prop_vent_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Prop_vent_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vent_C_RunTrigger) == 0x000008, "Wrong alignment on Prop_vent_C_RunTrigger");
static_assert(sizeof(Prop_vent_C_RunTrigger) == 0x000010, "Wrong size on Prop_vent_C_RunTrigger");
static_assert(offsetof(Prop_vent_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Prop_vent_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_RunTrigger, Param_Index) == 0x000008, "Member 'Prop_vent_C_RunTrigger::Param_Index' has a wrong offset!");

// Function prop_vent.prop_vent_C.ExecuteUbergraph_prop_vent
// 0x0078 (0x0078 - 0x0000)
struct Prop_vent_C_ExecuteUbergraph_prop_vent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewParam;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3352[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3353[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_vent_C_ExecuteUbergraph_prop_vent) == 0x000008, "Wrong alignment on Prop_vent_C_ExecuteUbergraph_prop_vent");
static_assert(sizeof(Prop_vent_C_ExecuteUbergraph_prop_vent) == 0x000078, "Wrong size on Prop_vent_C_ExecuteUbergraph_prop_vent");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, EntryPoint) == 0x000000, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, CallFunc_GetActorUpVector_ReturnValue) == 0x000004, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_NewParam) == 0x000010, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000014, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_cord_1) == 0x000020, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_socket_1) == 0x000028, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_cord) == 0x000030, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_socket) == 0x000038, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_sentFrom) == 0x000040, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_active) == 0x000048, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_owner) == 0x000050, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, K2Node_Event_index) == 0x000058, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, CallFunc_RandomUnitVector_ReturnValue) == 0x00005C, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_vent_C_ExecuteUbergraph_prop_vent, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000068, "Member 'Prop_vent_C_ExecuteUbergraph_prop_vent::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

}

