#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_lamp_blinker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_lamp_blinker.prop_lamp_blinker_C.ExecuteUbergraph_prop_lamp_blinker
// 0x0028 (0x0028 - 0x0000)
struct Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker) == 0x000008, "Wrong alignment on Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker");
static_assert(sizeof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker) == 0x000028, "Wrong size on Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker");
static_assert(offsetof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker, EntryPoint) == 0x000000, "Member 'Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000020, "Member 'Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker, CallFunc_RandomFloatInRange_ReturnValue) == 0x000024, "Member 'Prop_lamp_blinker_C_ExecuteUbergraph_prop_lamp_blinker::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

}

