#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_physgun_soft

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_physgun_soft.prop_physgun_soft_C.ExecuteUbergraph_prop_physgun_soft
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_gravgun_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft) == 0x000010, "Wrong alignment on Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft");
static_assert(sizeof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft) == 0x0000B0, "Wrong size on Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, EntryPoint) == 0x000000, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000004, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000018, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_Vector_Distance_ReturnValue) == 0x000060, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000080, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000098, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000A0, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0000A4, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000A9, "Member 'Prop_physgun_soft_C_ExecuteUbergraph_prop_physgun_soft::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function prop_physgun_soft.prop_physgun_soft_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_physgun_soft_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_physgun_soft_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_physgun_soft_C_ReceiveTick");
static_assert(sizeof(Prop_physgun_soft_C_ReceiveTick) == 0x000004, "Wrong size on Prop_physgun_soft_C_ReceiveTick");
static_assert(offsetof(Prop_physgun_soft_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_physgun_soft_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_physgun_soft.prop_physgun_soft_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_physgun_soft_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_physgun_soft_C_LoadData) == 0x000010, "Wrong alignment on Prop_physgun_soft_C_LoadData");
static_assert(sizeof(Prop_physgun_soft_C_LoadData) == 0x0000E0, "Wrong size on Prop_physgun_soft_C_LoadData");
static_assert(offsetof(Prop_physgun_soft_C_LoadData, Data) == 0x000000, "Member 'Prop_physgun_soft_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_LoadData, Return) == 0x0000C0, "Member 'Prop_physgun_soft_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_physgun_soft_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_physgun_soft_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_physgun_soft_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_physgun_soft.prop_physgun_soft_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_physgun_soft_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_physgun_soft_C_GetData) == 0x000010, "Wrong alignment on Prop_physgun_soft_C_GetData");
static_assert(sizeof(Prop_physgun_soft_C_GetData) == 0x000280, "Wrong size on Prop_physgun_soft_C_GetData");
static_assert(offsetof(Prop_physgun_soft_C_GetData, Data) == 0x000000, "Member 'Prop_physgun_soft_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_physgun_soft_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_physgun_soft_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x000190, "Member 'Prop_physgun_soft_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_physgun_soft_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_physgun_soft_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_physgun_soft_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_physgun_soft_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

