#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_workbench

#include "Basic.hpp"

#include "Struct_food1_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_crafting_structs.hpp"


namespace SDK::Params
{

// Function prop_workbench.prop_workbench_C.ExecuteUbergraph_prop_workbench
// 0x0570 (0x0570 - 0x0000)
struct Prop_workbench_C_ExecuteUbergraph_prop_workbench final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4234[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4235[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0038(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_update_hasCraft;                          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4236[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4237[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4238[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4239[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423A[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423B[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x01B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_crafting                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0258(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423C[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423D[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x02C4(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423E[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423F[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x02F0(0x0080)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4240[0x6];                                     // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4241[0x3];                                     // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0398(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4242[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4243[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable_1;                            // 0x03B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4244[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_update_hasCraft_1;                        // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4245[0x3];                                     // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x03D0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4246[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable_2;                            // 0x03F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x03F8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4247[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4248[0x4];                                     // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4249[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424A[0xC];                                     // 0x0454(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0460(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x04D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04F0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0538(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424B[0x7];                                     // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_workbench_C_ExecuteUbergraph_prop_workbench) == 0x000010, "Wrong alignment on Prop_workbench_C_ExecuteUbergraph_prop_workbench");
static_assert(sizeof(Prop_workbench_C_ExecuteUbergraph_prop_workbench) == 0x000570, "Wrong size on Prop_workbench_C_ExecuteUbergraph_prop_workbench");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, EntryPoint) == 0x000000, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_object_Variable) == 0x000008, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Variable) == 0x000010, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000018, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000020, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000028, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000030, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_bFromSweep) == 0x000034, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_SweepResult) == 0x000038, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000C0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OtherActor) == 0x0000C8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OtherComp) == 0x0000D0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000D8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_update_hasCraft) == 0x0000DC, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_update_hasCraft' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_player_2) == 0x0000E0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_hit_1) == 0x0000E8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_index) == 0x000170, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_action) == 0x000174, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Array_Index_Variable) == 0x000178, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Variable_1) == 0x00017C, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000180, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Add_IntInt_ReturnValue) == 0x000184, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Variable_2) == 0x000188, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Loop_Counter_Variable) == 0x00018C, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Add_IntInt_ReturnValue_1) == 0x000190, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000194, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Add_IntInt_ReturnValue_2) == 0x000198, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Variable_3) == 0x00019C, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Array_Index_Variable_1) == 0x0001A0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0001A4, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001A8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_player_1) == 0x0001B0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_hit) == 0x0001B8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_name) == 0x000240, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Conv_StringToName_ReturnValue) == 0x000250, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_GetDataTableRowFromName_OutRow) == 0x000258, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000298, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Get_Item) == 0x0002A0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Length_ReturnValue) == 0x0002B0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0002B4, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Length_ReturnValue_1) == 0x0002BC, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_propToObject_ReturnValue) == 0x0002C0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_propToObject_foodData) == 0x0002C4, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_propToObject_object) == 0x0002E0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_propToObject_isFood) == 0x0002E8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_propToObject_propData) == 0x0002F0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Greater_IntInt_ReturnValue) == 0x000370, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_IsValidClass_ReturnValue) == 0x000371, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Get_Item_1) == 0x000378, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Length_ReturnValue_2) == 0x000388, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Length_ReturnValue_3) == 0x00038C, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Less_IntInt_ReturnValue) == 0x000390, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Loop_Counter_Variable_1) == 0x000394, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_string_Variable) == 0x000398, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003A8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Add_IntInt_ReturnValue_4) == 0x0003AC, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Loop_Counter_Variable_2) == 0x0003B0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_object_Variable_1) == 0x0003B8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003C0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Add_IntInt_ReturnValue_5) == 0x0003C4, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_update_hasCraft_1) == 0x0003C8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_update_hasCraft_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Find_ReturnValue) == 0x0003CC, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_string_Variable_1) == 0x0003D0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Get_Item_2) == 0x0003E0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_RemoveItem_ReturnValue) == 0x0003E8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_object_Variable_2) == 0x0003F0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_string_Variable_2) == 0x0003F8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000408, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_Event_player) == 0x000410, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_getMainPlayer_AsMain_Player) == 0x000418, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, Temp_int_Array_Index_Variable_2) == 0x000420, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Get_Item_3) == 0x000428, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Find_ReturnValue_1) == 0x000438, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Array_Get_Item_4) == 0x000440, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000448, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000460, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_BreakTransform_Location) == 0x000490, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_BreakTransform_Rotation) == 0x00049C, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_BreakTransform_Scale) == 0x0004A8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x0004B4, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0004C0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0004CC, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_TransformLocation_ReturnValue) == 0x0004D8, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_SelectVector_ReturnValue) == 0x0004E4, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_MakeTransform_ReturnValue) == 0x0004F0, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000520, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000528, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_FinishSpawningActor_ReturnValue) == 0x000530, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_DynamicCast_AsInt_Player) == 0x000538, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, K2Node_DynamicCast_bSuccess) == 0x000548, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000550, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_asProp_return) == 0x000558, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000560, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ExecuteUbergraph_prop_workbench, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000568, "Member 'Prop_workbench_C_ExecuteUbergraph_prop_workbench::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");

// Function prop_workbench.prop_workbench_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_workbench_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_workbench_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_workbench_C_ActionOptionIndex");
static_assert(sizeof(Prop_workbench_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_workbench_C_ActionOptionIndex");
static_assert(offsetof(Prop_workbench_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_workbench_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_workbench_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Prop_workbench_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_ActionOptionIndex, Action) == 0x000094, "Member 'Prop_workbench_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_workbench.prop_workbench_C.BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function prop_workbench.prop_workbench_C.BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_workbench_C_BndEvt__prop_workbench_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function prop_workbench.prop_workbench_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_workbench_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_workbench_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_workbench_C_ReceiveTick");
static_assert(sizeof(Prop_workbench_C_ReceiveTick) == 0x000004, "Wrong size on Prop_workbench_C_ReceiveTick");
static_assert(offsetof(Prop_workbench_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_workbench_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_workbench.prop_workbench_C.Update
// 0x0400 (0x0400 - 0x0000)
struct Prop_workbench_C_Update final
{
public:
	bool                                          HasCraft;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ObjectsCraftGroups_buff;                           // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Pass;                                              // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ObjectNames_buff;                                  // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Tags_d;                                            // 0x0030(0x0010)(Edit, BlueprintVisible)
	class FString                                 buff;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         Ings_d;                                            // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         CraftTags_d;                                       // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         CraftTags;                                         // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Objs_d;                                            // 0x0080(0x0010)(Edit, BlueprintVisible)
	bool                                          ContainsAll;                                       // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Objs;                                              // 0x0098(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4250[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4251[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x00C8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4252[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4253[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4254[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           Temp_struct_Variable;                              // 0x00F8(0x0080)(ConstParm, HasGetValueTypeHash)
