#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_funGun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_physSound_structs.hpp"


namespace SDK::Params
{

// Function prop_funGun.prop_funGun_C.ExecuteUbergraph_prop_funGun
// 0x0140 (0x0140 - 0x0000)
struct Prop_funGun_C_ExecuteUbergraph_prop_funGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut_1;       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_funGun_C_ExecuteUbergraph_prop_funGun) == 0x000010, "Wrong alignment on Prop_funGun_C_ExecuteUbergraph_prop_funGun");
static_assert(sizeof(Prop_funGun_C_ExecuteUbergraph_prop_funGun) == 0x000140, "Wrong size on Prop_funGun_C_ExecuteUbergraph_prop_funGun");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, EntryPoint) == 0x000000, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, K2Node_Event_player_2) == 0x000010, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000020, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, Temp_name_Variable) == 0x000028, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_GetForwardVector_ReturnValue) == 0x000060, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000078, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_RandomUnitVector_ReturnValue) == 0x000090, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00009C, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_RandomUnitVector_ReturnValue_1) == 0x0000B4, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, K2Node_Event_player_1) == 0x0000C0, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0000C8, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D4, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, K2Node_Event_player) == 0x0000D8, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000E0, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E1, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_VictoryFloatMinusEquals_FloatOut_1) == 0x0000E4, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_VictoryFloatMinusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000E8, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, Temp_int_Variable) == 0x0000EC, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000F0, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Add_IntInt_ReturnValue) == 0x0000F4, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000108, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_IsValidClass_ReturnValue) == 0x000111, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, Temp_int_Variable_1) == 0x000114, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000118, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_IsValid_ReturnValue_1) == 0x000119, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x00011A, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00011C, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, Temp_int_Variable_2) == 0x000120, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_IsValid_ReturnValue_2) == 0x000124, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000128, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000134, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_IsValidClass_ReturnValue_1) == 0x000135, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_ExecuteUbergraph_prop_funGun, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000136, "Member 'Prop_funGun_C_ExecuteUbergraph_prop_funGun::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_funGun_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_funGun_C_ReceiveTick");
static_assert(sizeof(Prop_funGun_C_ReceiveTick) == 0x000004, "Wrong size on Prop_funGun_C_ReceiveTick");
static_assert(offsetof(Prop_funGun_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_funGun_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.updateMag
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_funGun_C_UpdateMag final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(Prop_funGun_C_UpdateMag) == 0x000008, "Wrong alignment on Prop_funGun_C_UpdateMag");
static_assert(sizeof(Prop_funGun_C_UpdateMag) == 0x0000A8, "Wrong size on Prop_funGun_C_UpdateMag");
static_assert(offsetof(Prop_funGun_C_UpdateMag, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'Prop_funGun_C_UpdateMag::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_UpdateMag, K2Node_MakeStruct_FormatArgumentData_1) == 0x000040, "Member 'Prop_funGun_C_UpdateMag::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_UpdateMag, K2Node_MakeArray_Array) == 0x000080, "Member 'Prop_funGun_C_UpdateMag::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_UpdateMag, CallFunc_Format_ReturnValue) == 0x000090, "Member 'Prop_funGun_C_UpdateMag::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.fireBulletPrimary
// 0x02D8 (0x02D8 - 0x0000)
struct Prop_funGun_C_FireBulletPrimary final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start;                                // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_physSound_return;                         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_physSound                      CallFunc_physSound_data;                           // 0x0218(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_C_FireBulletPrimary) == 0x000008, "Wrong alignment on Prop_funGun_C_FireBulletPrimary");
static_assert(sizeof(Prop_funGun_C_FireBulletPrimary) == 0x0002D8, "Wrong size on Prop_funGun_C_FireBulletPrimary");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, Temp_int_Variable) == 0x000000, "Member 'Prop_funGun_C_FireBulletPrimary::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_RandomFloat_ReturnValue) == 0x000018, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00001C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000020, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000030, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_SelectFloat_ReturnValue) == 0x000038, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_GetForwardVector_ReturnValue) == 0x000040, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_GetForwardVector_ReturnValue_1) == 0x00004C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_GetUpVector_ReturnValue) == 0x000064, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_RotateAngleAxis_ReturnValue) == 0x000070, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, K2Node_MakeArray_Array) == 0x000080, "Member 'Prop_funGun_C_FireBulletPrimary::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000090, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_arm_start) == 0x00009C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_arm_end) == 0x0000A8, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B4, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000C0, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000148, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_bBlockingHit) == 0x000149, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_bInitialOverlap) == 0x00014A, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_Location) == 0x000154, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_Normal) == 0x00016C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_HitItem) == 0x0001A8, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_ElementIndex) == 0x0001AC, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_FaceIndex) == 0x0001B0, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_TraceStart) == 0x0001B4, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_BreakHitResult_TraceEnd) == 0x0001C0, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001CC, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x0001D9, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_GetMass_ReturnValue) == 0x0001DC, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, K2Node_DynamicCast_AsInt_Objects) == 0x0001E0, "Member 'Prop_funGun_C_FireBulletPrimary::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'Prop_funGun_C_FireBulletPrimary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0001F4, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0001F8, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_DoesImplementInterface_ReturnValue) == 0x0001FC, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Add_FloatFloat_ReturnValue) == 0x000200, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_SetVectorLength_ReturnValue) == 0x000204, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_physSound_return) == 0x000210, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_physSound_return' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_physSound_data) == 0x000218, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_physSound_data' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000258, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Dot_VectorVector_ReturnValue) == 0x000260, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Cross_VectorVector_ReturnValue) == 0x000264, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Abs_ReturnValue) == 0x000270, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000274, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000280, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000284, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_SelectVector_ReturnValue) == 0x000290, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x00029C, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0002A8, "Member 'Prop_funGun_C_FireBulletPrimary::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0002B4, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0002C0, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_FireBulletPrimary, CallFunc_SpawnDecalAttached_ReturnValue) == 0x0002D0, "Member 'Prop_funGun_C_FireBulletPrimary::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.checkActorTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_funGun_C_CheckActorTick final
{
public:
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_funGun_C_CheckActorTick) == 0x000001, "Wrong alignment on Prop_funGun_C_CheckActorTick");
static_assert(sizeof(Prop_funGun_C_CheckActorTick) == 0x000004, "Wrong size on Prop_funGun_C_CheckActorTick");
static_assert(offsetof(Prop_funGun_C_CheckActorTick, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000000, "Member 'Prop_funGun_C_CheckActorTick::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_CheckActorTick, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000001, "Member 'Prop_funGun_C_CheckActorTick::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_CheckActorTick, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'Prop_funGun_C_CheckActorTick::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_C_CheckActorTick, CallFunc_BooleanOR_ReturnValue_1) == 0x000003, "Member 'Prop_funGun_C_CheckActorTick::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_funGun_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_funGun_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_funGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_funGun_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_funGun_C_PlayerHandUse_RMB, Param_Player) == 0x000000, "Member 'Prop_funGun_C_PlayerHandUse_RMB::Param_Player' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_funGun_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Prop_funGun_C_PlayerHandRelease_LMB");
static_assert(sizeof(Prop_funGun_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Prop_funGun_C_PlayerHandRelease_LMB");
static_assert(offsetof(Prop_funGun_C_PlayerHandRelease_LMB, Param_Player) == 0x000000, "Member 'Prop_funGun_C_PlayerHandRelease_LMB::Param_Player' has a wrong offset!");

// Function prop_funGun.prop_funGun_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_funGun_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_funGun_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_funGun_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_funGun_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_funGun_C_PlayerHandUse_LMB, Param_Player) == 0x000000, "Member 'Prop_funGun_C_PlayerHandUse_LMB::Param_Player' has a wrong offset!");

}

