#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_erieHold

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_erieHold.prop_erieHold_C.ExecuteUbergraph_prop_erieHold
// 0x01A0 (0x01A0 - 0x0000)
struct Prop_erieHold_C_ExecuteUbergraph_prop_erieHold final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AErieDrag_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0088(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEriePlushLive_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold) == 0x000010, "Wrong alignment on Prop_erieHold_C_ExecuteUbergraph_prop_erieHold");
static_assert(sizeof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold) == 0x0001A0, "Wrong size on Prop_erieHold_C_ExecuteUbergraph_prop_erieHold");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, EntryPoint) == 0x000000, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, Temp_object_Variable) == 0x000008, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_VSize_ReturnValue) == 0x000024, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_GetVelocity_ReturnValue_1) == 0x000070, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_obj_statDyn_obj) == 0x000088, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000098, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_GetTransform_ReturnValue_1) == 0x0000B0, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E0, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000F0, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000F8, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000180, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_BooleanOR_ReturnValue) == 0x000181, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000188, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_GetAttachParentActor_ReturnValue) == 0x000190, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_ExecuteUbergraph_prop_erieHold, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'Prop_erieHold_C_ExecuteUbergraph_prop_erieHold::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function prop_erieHold.prop_erieHold_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_erieHold_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_erieHold_C_LoadData) == 0x000010, "Wrong alignment on Prop_erieHold_C_LoadData");
static_assert(sizeof(Prop_erieHold_C_LoadData) == 0x0000E0, "Wrong size on Prop_erieHold_C_LoadData");
static_assert(offsetof(Prop_erieHold_C_LoadData, Data) == 0x000000, "Member 'Prop_erieHold_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_LoadData, Return) == 0x0000C0, "Member 'Prop_erieHold_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_erieHold_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_erieHold_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_erieHold_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_erieHold.prop_erieHold_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_erieHold_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_erieHold_C_GetData) == 0x000010, "Wrong alignment on Prop_erieHold_C_GetData");
static_assert(sizeof(Prop_erieHold_C_GetData) == 0x000280, "Wrong size on Prop_erieHold_C_GetData");
static_assert(offsetof(Prop_erieHold_C_GetData, Data) == 0x000000, "Member 'Prop_erieHold_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_erieHold_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_erieHold_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x000190, "Member 'Prop_erieHold_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_erieHold_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_erieHold_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_erieHold_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_erieHold_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

