#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_llama

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_llama.prop_llama_C
// 0x0028 (0x0390 - 0x0368)
class AProp_llama_C final : public AProp_C
{
public:
	uint8                                         Pad_385A[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_llama_C;                       // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Yumpskare;                                         // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_prop_llama(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__prop_llama_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_llama_C">();
	}
	static class AProp_llama_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_llama_C>();
	}
};
static_assert(alignof(AProp_llama_C) == 0x000008, "Wrong alignment on AProp_llama_C");
static_assert(sizeof(AProp_llama_C) == 0x000390, "Wrong size on AProp_llama_C");
static_assert(offsetof(AProp_llama_C, UberGraphFrame_Prop_llama_C) == 0x000368, "Member 'AProp_llama_C::UberGraphFrame_Prop_llama_C' has a wrong offset!");
static_assert(offsetof(AProp_llama_C, PointLight) == 0x000370, "Member 'AProp_llama_C::PointLight' has a wrong offset!");
static_assert(offsetof(AProp_llama_C, Audio) == 0x000378, "Member 'AProp_llama_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_llama_C, Sphere) == 0x000380, "Member 'AProp_llama_C::Sphere' has a wrong offset!");
static_assert(offsetof(AProp_llama_C, Yumpskare) == 0x000388, "Member 'AProp_llama_C::Yumpskare' has a wrong offset!");

}

