#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wirebattery

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_wirebattery.prop_wirebattery_C.ExecuteUbergraph_prop_wirebattery
// 0x0048 (0x0048 - 0x0000)
struct Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AWire_C*                          Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA3[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AWire_C*                          Temp_object_Variable_1;                            // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWire_C*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA5[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery) == 0x000008, "Wrong alignment on Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery");
static_assert(sizeof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery) == 0x000048, "Wrong size on Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, EntryPoint) == 0x000000, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, Temp_object_Variable) == 0x000008, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, CallFunc_Array_RemoveItem_ReturnValue) == 0x000010, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, Temp_object_Variable_1) == 0x000020, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, CallFunc_Array_Get_Item) == 0x000030, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'Prop_wirebattery_C_ExecuteUbergraph_prop_wirebattery::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function prop_wirebattery.prop_wirebattery_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wirebattery_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wirebattery_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wirebattery_C_ReceiveTick");
static_assert(sizeof(Prop_wirebattery_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wirebattery_C_ReceiveTick");
static_assert(offsetof(Prop_wirebattery_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wirebattery_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

