#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_poster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_poster.prop_poster_C
// 0x0030 (0x03A8 - 0x0378)
class AProp_poster_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_poster_C;                      // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        SpawnLoc;                                          // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_Prop_poster_C;                               // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          HoldingPlayer;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_poster(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Put();
	void SetTex();
	struct FRotator NormalRot(const struct FVector& InputPin);
	void PlayerHold(class AMainPlayer_C* Player);
	void SettingsApplied(const struct FStruct_settings& Settings);
	void GamemodeBeginPlay();
	void ReceiveBeginPlay();
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_poster_C">();
	}
	static class AProp_poster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_poster_C>();
	}
};
static_assert(alignof(AProp_poster_C) == 0x000008, "Wrong alignment on AProp_poster_C");
static_assert(sizeof(AProp_poster_C) == 0x0003A8, "Wrong size on AProp_poster_C");
static_assert(offsetof(AProp_poster_C, UberGraphFrame_Prop_poster_C) == 0x000378, "Member 'AProp_poster_C::UberGraphFrame_Prop_poster_C' has a wrong offset!");
static_assert(offsetof(AProp_poster_C, Decal) == 0x000380, "Member 'AProp_poster_C::Decal' has a wrong offset!");
static_assert(offsetof(AProp_poster_C, SpawnLoc) == 0x000388, "Member 'AProp_poster_C::SpawnLoc' has a wrong offset!");
static_assert(offsetof(AProp_poster_C, Type) == 0x000390, "Member 'AProp_poster_C::Type' has a wrong offset!");
static_assert(offsetof(AProp_poster_C, Index_Prop_poster_C) == 0x000394, "Member 'AProp_poster_C::Index_Prop_poster_C' has a wrong offset!");
static_assert(offsetof(AProp_poster_C, Dynmat) == 0x000398, "Member 'AProp_poster_C::Dynmat' has a wrong offset!");
static_assert(offsetof(AProp_poster_C, HoldingPlayer) == 0x0003A0, "Member 'AProp_poster_C::HoldingPlayer' has a wrong offset!");

}

