#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_drive_debug0

#include "Basic.hpp"

#include "Struct_signalDataDynamic_structs.hpp"


namespace SDK::Params
{

// Function prop_drive_debug0.prop_drive_debug0_C.ExecuteUbergraph_prop_drive_debug0
// 0x0098 (0x0098 - 0x0000)
struct Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x0008(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BytesToBase64_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FStruct_signalDataDynamic              K2Node_MakeStruct_struct_signalDataDynamic;        // 0x0028(0x0070)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0) == 0x000008, "Wrong alignment on Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0");
static_assert(sizeof(Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0) == 0x000098, "Wrong size on Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0");
static_assert(offsetof(Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0, EntryPoint) == 0x000000, "Member 'Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0, CallFunc_GenerateRandomBytes_ByteArray) == 0x000008, "Member 'Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0, CallFunc_BytesToBase64_ReturnValue) == 0x000018, "Member 'Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0::CallFunc_BytesToBase64_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0, K2Node_MakeStruct_struct_signalDataDynamic) == 0x000028, "Member 'Prop_drive_debug0_C_ExecuteUbergraph_prop_drive_debug0::K2Node_MakeStruct_struct_signalDataDynamic' has a wrong offset!");

}

