#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_waspnest

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_waspnest.prop_waspnest_C.ExecuteUbergraph_prop_waspnest
// 0x02B0 (0x02B0 - 0x0000)
struct Prop_waspnest_C_ExecuteUbergraph_prop_waspnest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isUnderwater_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaspSwarm_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_waspnest_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x0130(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaspSwarm_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue; // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x0190(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x01CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaspSwarm_C*                           CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_4;               // 0x0260(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaspSwarm_C*                           CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest) == 0x000010, "Wrong alignment on Prop_waspnest_C_ExecuteUbergraph_prop_waspnest");
static_assert(sizeof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest) == 0x0002B0, "Wrong size on Prop_waspnest_C_ExecuteUbergraph_prop_waspnest");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, EntryPoint) == 0x000000, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, Temp_object_Variable) == 0x000008, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_isUnderwater_ReturnValue) == 0x000014, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_isUnderwater_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, Temp_int_Variable) == 0x000018, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, Temp_int_Variable_1) == 0x000028, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00002C, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000030, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000088, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000090, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Vector_Distance_ReturnValue) == 0x0000A8, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetTransform_ReturnValue_1) == 0x0000B0, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000E0, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000E8, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000F0, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, K2Node_MakeArray_Array) == 0x0000F8, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Array_Get_Item) == 0x000108, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000118, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_RandomFloatInRange_ReturnValue) == 0x00011C, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_Add_IntInt_ReturnValue_2) == 0x000124, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetTransform_ReturnValue_2) == 0x000130, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000160, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000168, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetVelocity_ReturnValue) == 0x000170, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue) == 0x00017C, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetPhysicsAngularVelocityInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetTransform_ReturnValue_3) == 0x000190, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0001C0, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, K2Node_Event_damage) == 0x0001C8, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, K2Node_Event_hot) == 0x0001CC, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000258, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_GetTransform_ReturnValue_4) == 0x000260, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_GetTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000290, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x000298, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ExecuteUbergraph_prop_waspnest, K2Node_Event_water) == 0x0002A0, "Member 'Prop_waspnest_C_ExecuteUbergraph_prop_waspnest::K2Node_Event_water' has a wrong offset!");

// Function prop_waspnest.prop_waspnest_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct Prop_waspnest_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_waspnest_C_EnterWater) == 0x000008, "Wrong alignment on Prop_waspnest_C_EnterWater");
static_assert(sizeof(Prop_waspnest_C_EnterWater) == 0x000008, "Wrong size on Prop_waspnest_C_EnterWater");
static_assert(offsetof(Prop_waspnest_C_EnterWater, Water) == 0x000000, "Member 'Prop_waspnest_C_EnterWater::Water' has a wrong offset!");

// Function prop_waspnest.prop_waspnest_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct Prop_waspnest_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_waspnest_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on Prop_waspnest_C_ReceivedPhyiscsDamage");
static_assert(sizeof(Prop_waspnest_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on Prop_waspnest_C_ReceivedPhyiscsDamage");
static_assert(offsetof(Prop_waspnest_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'Prop_waspnest_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'Prop_waspnest_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function prop_waspnest.prop_waspnest_C.loadData
// 0x00F0 (0x00F0 - 0x0000)
struct Prop_waspnest_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_3;                         // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_4;                         // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_waspnest_C_LoadData) == 0x000010, "Wrong alignment on Prop_waspnest_C_LoadData");
static_assert(sizeof(Prop_waspnest_C_LoadData) == 0x0000F0, "Wrong size on Prop_waspnest_C_LoadData");
static_assert(offsetof(Prop_waspnest_C_LoadData, Data) == 0x000000, "Member 'Prop_waspnest_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, Return) == 0x0000C0, "Member 'Prop_waspnest_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_waspnest_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_waspnest_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_waspnest_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'Prop_waspnest_C_LoadData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, CallFunc_Array_Get_Item_3) == 0x0000EC, "Member 'Prop_waspnest_C_LoadData::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_LoadData, CallFunc_Array_Get_Item_4) == 0x0000ED, "Member 'Prop_waspnest_C_LoadData::CallFunc_Array_Get_Item_4' has a wrong offset!");

// Function prop_waspnest.prop_waspnest_C.getData
// 0x02C0 (0x02C0 - 0x0000)
struct Prop_waspnest_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x00F0(0x0010)(HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0100(0x00C0)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01C0(0x0010)(HasGetValueTypeHash)
	struct FStruct_mFloat                         CallFunc_Array_Get_Item_1;                         // 0x01D0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_2;                          // 0x01E0(0x0010)(ReferenceParm)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_3;                          // 0x01F0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x0200(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_waspnest_C_GetData) == 0x000010, "Wrong alignment on Prop_waspnest_C_GetData");
static_assert(sizeof(Prop_waspnest_C_GetData) == 0x0002C0, "Wrong size on Prop_waspnest_C_GetData");
static_assert(offsetof(Prop_waspnest_C_GetData, Data) == 0x000000, "Member 'Prop_waspnest_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_GetData, K2Node_MakeArray_Array) == 0x0000C0, "Member 'Prop_waspnest_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_GetData, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'Prop_waspnest_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_waspnest_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x0000E0, "Member 'Prop_waspnest_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
