#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_food_soap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_food_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_food_soap.prop_food_soap_C
// 0x0018 (0x03D8 - 0x03C0)
class AProp_food_soap_C final : public AProp_food_C
{
public:
	uint8                                         Pad_3F54[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_food_soap_C;                   // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Foam;                                              // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_food_soap(int32 EntryPoint);
	void Upd();
	void Microwave();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_food_soap_C">();
	}
	static class AProp_food_soap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_food_soap_C>();
	}
};
static_assert(alignof(AProp_food_soap_C) == 0x000008, "Wrong alignment on AProp_food_soap_C");
static_assert(sizeof(AProp_food_soap_C) == 0x0003D8, "Wrong size on AProp_food_soap_C");
static_assert(offsetof(AProp_food_soap_C, UberGraphFrame_Prop_food_soap_C) == 0x0003C0, "Member 'AProp_food_soap_C::UberGraphFrame_Prop_food_soap_C' has a wrong offset!");
static_assert(offsetof(AProp_food_soap_C, StaticMesh1) == 0x0003C8, "Member 'AProp_food_soap_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AProp_food_soap_C, Foam) == 0x0003D0, "Member 'AProp_food_soap_C::Foam' has a wrong offset!");

}

