#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_container_orderbox

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_container_orderbox.prop_container_orderbox_C.ExecuteUbergraph_prop_container_orderbox
// 0x0098 (0x0098 - 0x0000)
struct Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A78[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox) == 0x000008, "Wrong alignment on Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox");
static_assert(sizeof(Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox) == 0x000098, "Wrong size on Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox");
static_assert(offsetof(Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox, EntryPoint) == 0x000000, "Member 'Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox, K2Node_Event_player) == 0x000008, "Member 'Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox, K2Node_Event_hit) == 0x000010, "Member 'Prop_container_orderbox_C_ExecuteUbergraph_prop_container_orderbox::K2Node_Event_hit' has a wrong offset!");

// Function prop_container_orderbox.prop_container_orderbox_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Prop_container_orderbox_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_container_orderbox_C_Player_use) == 0x000008, "Wrong alignment on Prop_container_orderbox_C_Player_use");
static_assert(sizeof(Prop_container_orderbox_C_Player_use) == 0x000090, "Wrong size on Prop_container_orderbox_C_Player_use");
static_assert(offsetof(Prop_container_orderbox_C_Player_use, Player) == 0x000000, "Member 'Prop_container_orderbox_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Prop_container_orderbox_C_Player_use, Param_Hit) == 0x000008, "Member 'Prop_container_orderbox_C_Player_use::Param_Hit' has a wrong offset!");

}

