#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_keycard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_keycard.prop_keycard_C
// 0x0020 (0x0398 - 0x0378)
class AProp_keycard_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_keycard_C;                     // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 Open;                                              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AHook_C*                                Hook;                                              // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_keycard(int32 EntryPoint);
	void Hooked(class AHook_C* Param_Hook);
	void PlayerHandRelease_LMB(class AMainPlayer_C* Player);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_keycard_C">();
	}
	static class AProp_keycard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_keycard_C>();
	}
};
static_assert(alignof(AProp_keycard_C) == 0x000008, "Wrong alignment on AProp_keycard_C");
static_assert(sizeof(AProp_keycard_C) == 0x000398, "Wrong size on AProp_keycard_C");
static_assert(offsetof(AProp_keycard_C, UberGraphFrame_Prop_keycard_C) == 0x000378, "Member 'AProp_keycard_C::UberGraphFrame_Prop_keycard_C' has a wrong offset!");
static_assert(offsetof(AProp_keycard_C, Open) == 0x000380, "Member 'AProp_keycard_C::Open' has a wrong offset!");
static_assert(offsetof(AProp_keycard_C, Hook) == 0x000390, "Member 'AProp_keycard_C::Hook' has a wrong offset!");

}

