#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_unwiseArir

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_unwiseArir.prop_unwiseArir_C
// 0x0020 (0x0388 - 0x0368)
class AProp_unwiseArir_C : public AProp_C
{
public:
	uint8                                         Pad_38E0[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_unwiseArir_C;                  // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        S;                                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         I;                                                 // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_unwiseArir(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, int32 Param_Index, Enum_interactionActions Action);
	void BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Param_Hit);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_unwiseArir_C">();
	}
	static class AProp_unwiseArir_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_unwiseArir_C>();
	}
};
static_assert(alignof(AProp_unwiseArir_C) == 0x000008, "Wrong alignment on AProp_unwiseArir_C");
static_assert(sizeof(AProp_unwiseArir_C) == 0x000388, "Wrong size on AProp_unwiseArir_C");
static_assert(offsetof(AProp_unwiseArir_C, UberGraphFrame_Prop_unwiseArir_C) == 0x000368, "Member 'AProp_unwiseArir_C::UberGraphFrame_Prop_unwiseArir_C' has a wrong offset!");
static_assert(offsetof(AProp_unwiseArir_C, S) == 0x000370, "Member 'AProp_unwiseArir_C::S' has a wrong offset!");
static_assert(offsetof(AProp_unwiseArir_C, Audio) == 0x000378, "Member 'AProp_unwiseArir_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_unwiseArir_C, I) == 0x000380, "Member 'AProp_unwiseArir_C::I' has a wrong offset!");

}

