#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_impostor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_impostor.prop_impostor_C.Init
// 0x0018 (0x0018 - 0x0000)
struct Prop_impostor_C_Init final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_GetPhysicalMaterial_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_impostor_C_Init) == 0x000008, "Wrong alignment on Prop_impostor_C_Init");
static_assert(sizeof(Prop_impostor_C_Init) == 0x000018, "Wrong size on Prop_impostor_C_Init");
static_assert(offsetof(Prop_impostor_C_Init, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'Prop_impostor_C_Init::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_Init, CallFunc_GetPhysicalMaterial_ReturnValue) == 0x000008, "Member 'Prop_impostor_C_Init::CallFunc_GetPhysicalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_Init, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Prop_impostor_C_Init::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function prop_impostor.prop_impostor_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_impostor_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_impostor_C_UserConstructionScript) == 0x000010, "Wrong alignment on Prop_impostor_C_UserConstructionScript");
static_assert(sizeof(Prop_impostor_C_UserConstructionScript) == 0x0000E0, "Wrong size on Prop_impostor_C_UserConstructionScript");
static_assert(offsetof(Prop_impostor_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'Prop_impostor_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000030, "Member 'Prop_impostor_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x00003C, "Member 'Prop_impostor_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x000048, "Member 'Prop_impostor_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_UserConstructionScript, CallFunc_InverseTransformLocation_ReturnValue) == 0x00004C, "Member 'Prop_impostor_C_UserConstructionScript::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000058, "Member 'Prop_impostor_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function prop_impostor.prop_impostor_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct Prop_impostor_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_impostor_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on Prop_impostor_C_ReceivedPhyiscsDamage");
static_assert(sizeof(Prop_impostor_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on Prop_impostor_C_ReceivedPhyiscsDamage");
static_assert(offsetof(Prop_impostor_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'Prop_impostor_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'Prop_impostor_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function prop_impostor.prop_impostor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_impostor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_impostor_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_impostor_C_ReceiveTick");
static_assert(sizeof(Prop_impostor_C_ReceiveTick) == 0x000004, "Wrong size on Prop_impostor_C_ReceiveTick");
static_assert(offsetof(Prop_impostor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_impostor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_impostor.prop_impostor_C.ExecuteUbergraph_prop_impostor
// 0x0290 (0x0290 - 0x0000)
struct Prop_impostor_C_ExecuteUbergraph_prop_impostor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0038(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_damage;                               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x0164(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_bloodGib_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_impostor_C_ExecuteUbergraph_prop_impostor) == 0x000010, "Wrong alignment on Prop_impostor_C_ExecuteUbergraph_prop_impostor");
static_assert(sizeof(Prop_impostor_C_ExecuteUbergraph_prop_impostor) == 0x000290, "Wrong size on Prop_impostor_C_ExecuteUbergraph_prop_impostor");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, EntryPoint) == 0x000000, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, Temp_int_Variable) == 0x000004, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetMaterial_ReturnValue) == 0x000010, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000020, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000028, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000030, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetBounds_ReturnValue) == 0x000038, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x000090, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BreakTransform_Location) == 0x00009C, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BreakTransform_Rotation) == 0x0000A8, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BreakTransform_Scale) == 0x0000B4, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0000C0, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000CC, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BreakVector_X) == 0x0000D8, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BreakVector_Y) == 0x0000DC, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Array_Random_OutItem) == 0x0000E4, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Array_Random_OutIndex) == 0x0000EC, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F0, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetVelocity_ReturnValue) == 0x0000F4, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000100, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_FTrunc_ReturnValue) == 0x000104, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000108, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetComponentBounds_Origin) == 0x00010C, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetComponentBounds_BoxExtent) == 0x000118, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetComponentBounds_SphereRadius) == 0x000124, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, K2Node_Event_damage) == 0x000160, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, K2Node_Event_hot) == 0x000164, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_TransformLocation_ReturnValue) == 0x0001EC, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_MakeTransform_ReturnValue_1) == 0x000200, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000230, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000238, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000248, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000250, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, K2Node_Event_DeltaSeconds) == 0x000258, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_WasRecentlyRendered_ReturnValue) == 0x00025C, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000260, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000270, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000278, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_Vector_Distance_ReturnValue) == 0x000284, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000288, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_impostor_C_ExecuteUbergraph_prop_impostor, CallFunc_BooleanOR_ReturnValue) == 0x000289, "Member 'Prop_impostor_C_ExecuteUbergraph_prop_impostor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

