#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_argc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_argc.prop_argc_C
// 0x0018 (0x0380 - 0x0368)
class AProp_argc_C final : public AProp_C
{
public:
	uint8                                         Pad_38CF[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_argc_C;                        // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               Dynmat_0;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_1;                                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_argc(int32 EntryPoint);
	void Setmats();
	void PropRenderer_finishProps();
	void GamemodeBeginPlay();
	void UserConstructionScript();
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_argc_C">();
	}
	static class AProp_argc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_argc_C>();
	}
};
static_assert(alignof(AProp_argc_C) == 0x000008, "Wrong alignment on AProp_argc_C");
static_assert(sizeof(AProp_argc_C) == 0x000380, "Wrong size on AProp_argc_C");
static_assert(offsetof(AProp_argc_C, UberGraphFrame_Prop_argc_C) == 0x000368, "Member 'AProp_argc_C::UberGraphFrame_Prop_argc_C' has a wrong offset!");
static_assert(offsetof(AProp_argc_C, Dynmat_0) == 0x000370, "Member 'AProp_argc_C::Dynmat_0' has a wrong offset!");
static_assert(offsetof(AProp_argc_C, Dynmat_1) == 0x000378, "Member 'AProp_argc_C::Dynmat_1' has a wrong offset!");

}

