#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_duc

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_duc.prop_duc_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_duc_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_duc_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_duc_C_GetActionOptions");
static_assert(sizeof(Prop_duc_C_GetActionOptions) == 0x000060, "Wrong size on Prop_duc_C_GetActionOptions");
static_assert(offsetof(Prop_duc_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_duc_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_duc_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_duc_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_duc_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_duc_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_duc_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_duc_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_duc_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function prop_duc.prop_duc_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_duc_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_duc_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_duc_C_ReceiveTick");
static_assert(sizeof(Prop_duc_C_ReceiveTick) == 0x000004, "Wrong size on Prop_duc_C_ReceiveTick");
static_assert(offsetof(Prop_duc_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_duc_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_duc.prop_duc_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_duc_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_duc_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_duc_C_ActionOptionIndex");
static_assert(sizeof(Prop_duc_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_duc_C_ActionOptionIndex");
static_assert(offsetof(Prop_duc_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_duc_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_duc_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_duc_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_duc.prop_duc_C.ExecuteUbergraph_prop_duc
// 0x02E8 (0x02E8 - 0x0000)
struct Prop_duc_C_ExecuteUbergraph_prop_duc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x00A0(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0214(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_duc_C_ExecuteUbergraph_prop_duc) == 0x000008, "Wrong alignment on Prop_duc_C_ExecuteUbergraph_prop_duc");
static_assert(sizeof(Prop_duc_C_ExecuteUbergraph_prop_duc) == 0x0002E8, "Wrong size on Prop_duc_C_ExecuteUbergraph_prop_duc");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, EntryPoint) == 0x000000, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, K2Node_Event_player) == 0x000008, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, K2Node_Event_hit) == 0x000010, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, K2Node_Event_action) == 0x000098, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, K2Node_SwitchEnum_CmpSuccess) == 0x000099, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_obj_static_obj) == 0x0000A0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_MakeVector_ReturnValue) == 0x0000B4, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000C0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0000CC, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, Temp_object_Variable) == 0x0000D8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000F4, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000F8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000180, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_bBlockingHit) == 0x000181, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_bInitialOverlap) == 0x000182, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_Time) == 0x000184, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_Distance) == 0x000188, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_Location) == 0x00018C, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_ImpactPoint) == 0x000198, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_Normal) == 0x0001A4, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_HitItem) == 0x0001E0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_ElementIndex) == 0x0001E4, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_FaceIndex) == 0x0001E8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_TraceStart) == 0x0001EC, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakHitResult_TraceEnd) == 0x0001F8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000204, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_SelectVector_ReturnValue) == 0x000208, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000214, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00029C, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_Cross_VectorVector_ReturnValue) == 0x0002A0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0002AC, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, K2Node_Event_DeltaSeconds) == 0x0002B8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0002BC, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002C8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0002D4, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakVector_X) == 0x0002D8, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakVector_Y) == 0x0002DC, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_BreakVector_Z) == 0x0002E0, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_duc_C_ExecuteUbergraph_prop_duc, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002E4, "Member 'Prop_duc_C_ExecuteUbergraph_prop_duc::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

