#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_bombBarrel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_bombBarrel.prop_bombBarrel_C.ExecuteUbergraph_prop_bombBarrel
// 0x0100 (0x0100 - 0x0000)
struct Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0064(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3EBB[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel) == 0x000010, "Wrong alignment on Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel");
static_assert(sizeof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel) == 0x000100, "Wrong size on Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, EntryPoint) == 0x000000, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, CallFunc_GetCenterOfMass_ReturnValue) == 0x000004, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, K2Node_ComponentBoundEvent_HitComponent) == 0x000040, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, K2Node_ComponentBoundEvent_OtherActor) == 0x000048, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, K2Node_ComponentBoundEvent_OtherComp) == 0x000050, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000058, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, K2Node_ComponentBoundEvent_Hit) == 0x000064, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'Prop_bombBarrel_C_ExecuteUbergraph_prop_bombBarrel::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_bombBarrel.prop_bombBarrel_C.BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Param_Hit) == 0x000024, "Member 'Prop_bombBarrel_C_BndEvt__prop_bombBarrel_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Param_Hit' has a wrong offset!");

}

