#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_physgun_soft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_physgun_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_physgun_soft.prop_physgun_soft_C
// 0x0020 (0x05B0 - 0x0590)
class AProp_physgun_soft_C final : public AProp_physgun_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_physgun_soft_C;                // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Loop;                                              // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Charges;                                           // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_physgun_soft(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Release();
	void Grab();
	void ReceiveBeginPlay();
	void MicrowaveElec();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_physgun_soft_C">();
	}
	static class AProp_physgun_soft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_physgun_soft_C>();
	}
};
static_assert(alignof(AProp_physgun_soft_C) == 0x000010, "Wrong alignment on AProp_physgun_soft_C");
static_assert(sizeof(AProp_physgun_soft_C) == 0x0005B0, "Wrong size on AProp_physgun_soft_C");
static_assert(offsetof(AProp_physgun_soft_C, UberGraphFrame_Prop_physgun_soft_C) == 0x000588, "Member 'AProp_physgun_soft_C::UberGraphFrame_Prop_physgun_soft_C' has a wrong offset!");
static_assert(offsetof(AProp_physgun_soft_C, Loop) == 0x000590, "Member 'AProp_physgun_soft_C::Loop' has a wrong offset!");
static_assert(offsetof(AProp_physgun_soft_C, Charges) == 0x000598, "Member 'AProp_physgun_soft_C::Charges' has a wrong offset!");
static_assert(offsetof(AProp_physgun_soft_C, Time) == 0x0005A0, "Member 'AProp_physgun_soft_C::Time' has a wrong offset!");

}

