#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_broom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_broom.prop_broom_C.ExecuteUbergraph_prop_broom
// 0x03E0 (0x03E0 - 0x0000)
struct Prop_broom_C_ExecuteUbergraph_prop_broom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0100(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0110(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0120(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_arm_start;                                // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0198(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_dynPhys_obj;                          // 0x02D0(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x02E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x02F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActorChipPile_C*                       K2Node_DynamicCast_AsActor_Chip_Pile;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0xC];                                      // 0x0344(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0350(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_ExecuteUbergraph_prop_broom) == 0x000010, "Wrong alignment on Prop_broom_C_ExecuteUbergraph_prop_broom");
static_assert(sizeof(Prop_broom_C_ExecuteUbergraph_prop_broom) == 0x0003E0, "Wrong size on Prop_broom_C_ExecuteUbergraph_prop_broom");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, EntryPoint) == 0x000000, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_8) == 0x000004, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_7) == 0x00000C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_6) == 0x000024, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_5) == 0x00003C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_name_Variable) == 0x000054, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_SwitchName_CmpSuccess) == 0x00006C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_4) == 0x000070, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_3) == 0x000078, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_4) == 0x000080, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_2) == 0x000090, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_5) == 0x000098, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_1) == 0x0000A8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName) == 0x0000C0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_name_Variable_1) == 0x0000D8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000E0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000F0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_object_Variable) == 0x000100, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_object_Variable_1) == 0x000110, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_object_Variable_2) == 0x000120, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_int_Array_Index_Variable) == 0x000130, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_8) == 0x000134, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_int_Loop_Counter_Variable) == 0x000144, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Add_IntInt_ReturnValue) == 0x000148, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_int_Array_Index_Variable_1) == 0x00014C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CreateDelegate_OutputDelegate_9) == 0x000150, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_Event_player_1) == 0x000160, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_Event_player) == 0x000168, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000170, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_IsValid_ReturnValue_1) == 0x000178, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_arm_start) == 0x00017C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_arm_end) == 0x000188, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_obj_statDyn_obj) == 0x000198, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001A8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000230, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_GetVelocity_ReturnValue) == 0x000234, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_bBlockingHit) == 0x000240, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_bInitialOverlap) == 0x000241, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_Time) == 0x000244, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_Distance) == 0x000248, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_Location) == 0x00024C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_ImpactPoint) == 0x000258, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_Normal) == 0x000264, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_ImpactNormal) == 0x000270, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_PhysMat) == 0x000280, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_HitActor) == 0x000288, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_HitComponent) == 0x000290, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_HitBoneName) == 0x000298, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_HitItem) == 0x0002A0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_ElementIndex) == 0x0002A4, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_FaceIndex) == 0x0002A8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_TraceStart) == 0x0002AC, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BreakHitResult_TraceEnd) == 0x0002B8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, Temp_int_Loop_Counter_Variable_1) == 0x0002C4, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002C8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_obj_dynPhys_obj) == 0x0002D0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_obj_dynPhys_obj' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_SphereOverlapActors_OutActors) == 0x0002E0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_SphereOverlapActors_ReturnValue) == 0x0002F0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_SphereOverlapActors_OutActors_1) == 0x0002F8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_SphereOverlapActors_OutActors_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_SphereOverlapActors_ReturnValue_1) == 0x000308, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_SphereOverlapActors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Array_Get_Item) == 0x000310, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Array_Length_ReturnValue) == 0x000318, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_DynamicCast_AsActor_Chip_Pile) == 0x000320, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_DynamicCast_AsActor_Chip_Pile' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_DynamicCast_bSuccess) == 0x000328, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Less_IntInt_ReturnValue) == 0x000329, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00032C, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Add_VectorVector_ReturnValue) == 0x000338, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_MakeTransform_ReturnValue) == 0x000350, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000380, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Array_Get_Item_1) == 0x000388, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000390, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_FinishSpawningActor_ReturnValue) == 0x000398, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_DynamicCast_AsPrimitive_Component) == 0x0003A0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_DynamicCast_bSuccess_1) == 0x0003A8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Array_Length_ReturnValue_1) == 0x0003AC, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, K2Node_CustomEvent_NotifyName_9) == 0x0003B0, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003B8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0003BC, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_broom_C_ExecuteUbergraph_prop_broom, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0003C8, "Member 'Prop_broom_C_ExecuteUbergraph_prop_broom::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnCompleted_7E35D01041C5887545256ABEE348B954
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954) == 0x000004, "Wrong alignment on Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954");
static_assert(sizeof(Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954) == 0x000008, "Wrong size on Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954");
static_assert(offsetof(Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnCompleted_7E35D01041C5887545256ABEE348B954::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnBlendOut_7E35D01041C5887545256ABEE348B954
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954) == 0x000004, "Wrong alignment on Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954");
static_assert(sizeof(Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954) == 0x000008, "Wrong size on Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954");
static_assert(offsetof(Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnBlendOut_7E35D01041C5887545256ABEE348B954::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnInterrupted_7E35D01041C5887545256ABEE348B954
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954) == 0x000004, "Wrong alignment on Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954");
static_assert(sizeof(Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954) == 0x000008, "Wrong size on Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954");
static_assert(offsetof(Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnInterrupted_7E35D01041C5887545256ABEE348B954::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnNotifyBegin_7E35D01041C5887545256ABEE348B954
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954) == 0x000004, "Wrong alignment on Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954");
static_assert(sizeof(Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954) == 0x000008, "Wrong size on Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954");
static_assert(offsetof(Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnNotifyBegin_7E35D01041C5887545256ABEE348B954::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnNotifyEnd_7E35D01041C5887545256ABEE348B954
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954) == 0x000004, "Wrong alignment on Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954");
static_assert(sizeof(Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954) == 0x000008, "Wrong size on Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954");
static_assert(offsetof(Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnNotifyEnd_7E35D01041C5887545256ABEE348B954::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000004, "Wrong alignment on Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(sizeof(Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000008, "Wrong size on Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(offsetof(Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnCompleted_4F1EF3E64ED6681B932422B4E0C64E10::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000004, "Wrong alignment on Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(sizeof(Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000008, "Wrong size on Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(offsetof(Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnBlendOut_4F1EF3E64ED6681B932422B4E0C64E10::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000004, "Wrong alignment on Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(sizeof(Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000008, "Wrong size on Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(offsetof(Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnInterrupted_4F1EF3E64ED6681B932422B4E0C64E10::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000004, "Wrong alignment on Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(sizeof(Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000008, "Wrong size on Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(offsetof(Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnNotifyBegin_4F1EF3E64ED6681B932422B4E0C64E10::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000004, "Wrong alignment on Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(sizeof(Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10) == 0x000008, "Wrong size on Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10");
static_assert(offsetof(Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10, NotifyName) == 0x000000, "Member 'Prop_broom_C_OnNotifyEnd_4F1EF3E64ED6681B932422B4E0C64E10::NotifyName' has a wrong offset!");

// Function prop_broom.prop_broom_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_broom_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_broom_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_broom_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_broom_C_PlayerHandUse_RMB, Param_Player) == 0x000000, "Member 'Prop_broom_C_PlayerHandUse_RMB::Param_Player' has a wrong offset!");

// Function prop_broom.prop_broom_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_broom_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_broom_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Prop_broom_C_PlayerHandRelease_RMB");
static_assert(sizeof(Prop_broom_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Prop_broom_C_PlayerHandRelease_RMB");
static_assert(offsetof(Prop_broom_C_PlayerHandRelease_RMB, Param_Player) == 0x000000, "Member 'Prop_broom_C_PlayerHandRelease_RMB::Param_Player' has a wrong offset!");

}

