#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_snack_beer

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_food1_structs.hpp"
#include "Struct_prop_structs.hpp"


namespace SDK::Params
{

// Function prop_snack_beer.prop_snack_beer_C.ExecuteUbergraph_prop_snack_beer
// 0x0300 (0x0300 - 0x0000)
struct Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0xF];                                       // 0x00F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0100(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_ReturnValue;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_food1                          CallFunc_propToObject_foodData;                    // 0x013C(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_propToObject_object;                      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_propToObject_isFood;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           CallFunc_propToObject_propData;                    // 0x0168(0x0080)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_asProp_return;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_food_C*                           CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x0250(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_collectObject_collected;                  // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_LowEntry_LocalVariable_Value__Object;       // 0x02EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer) == 0x000010, "Wrong alignment on Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer");
static_assert(sizeof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer) == 0x000300, "Wrong size on Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, EntryPoint) == 0x000000, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, Temp_int_Variable) == 0x000004, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000009, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, Temp_int_Variable_1) == 0x000010, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, Temp_int_Variable_2) == 0x00001C, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000020, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, Temp_int_Variable_3) == 0x000028, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, Temp_int_Variable_4) == 0x00002C, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, Temp_int_Variable_5) == 0x000030, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_Event_player_1) == 0x000038, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_Event_player) == 0x000040, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_Event_hit) == 0x000048, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_Event_action) == 0x0000D0, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_SwitchEnum_CmpSuccess) == 0x0000D1, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_Event_DeltaSeconds) == 0x0000D4, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_GetActorUpVector_ReturnValue) == 0x0000D8, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000E4, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0000E8, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000EC, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000F0, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_GetTransform_ReturnValue) == 0x000100, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000130, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_propToObject_ReturnValue) == 0x000138, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_propToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_propToObject_foodData) == 0x00013C, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_propToObject_foodData' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_propToObject_object) == 0x000158, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_propToObject_object' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_propToObject_isFood) == 0x000160, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_propToObject_isFood' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_propToObject_propData) == 0x000168, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_propToObject_propData' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001E8, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_IsValidClass_ReturnValue) == 0x0001F0, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001F8, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_DynamicCast_AsInt_Player) == 0x000200, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000218, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_asProp_return) == 0x000220, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000228, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000230, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_Select_Default) == 0x000238, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_Conv_NameToString_ReturnValue) == 0x000240, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_MakeHitResult_ReturnValue) == 0x000250, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_getMainPlayer_AsMain_Player) == 0x0002D8, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002E0, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_collectObject_collected) == 0x0002EC, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_collectObject_collected' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002ED, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0002EE, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002EF, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x0002F0, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer, CallFunc_BooleanOR_ReturnValue) == 0x0002F1, "Member 'Prop_snack_beer_C_ExecuteUbergraph_prop_snack_beer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_snack_beer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_beer_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_snack_beer_C_ReceiveTick");
static_assert(sizeof(Prop_snack_beer_C_ReceiveTick) == 0x000004, "Wrong size on Prop_snack_beer_C_ReceiveTick");
static_assert(offsetof(Prop_snack_beer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_snack_beer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.eat
// 0x0010 (0x0010 - 0x0000)
struct Prop_snack_beer_C_Eat final
{
public:
	class AMainPlayer_C*                          P;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bypassNoHunger;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_snack_beer_C_Eat) == 0x000008, "Wrong alignment on Prop_snack_beer_C_Eat");
static_assert(sizeof(Prop_snack_beer_C_Eat) == 0x000010, "Wrong size on Prop_snack_beer_C_Eat");
static_assert(offsetof(Prop_snack_beer_C_Eat, P) == 0x000000, "Member 'Prop_snack_beer_C_Eat::P' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_Eat, bypassNoHunger) == 0x000008, "Member 'Prop_snack_beer_C_Eat::bypassNoHunger' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.openBottle
// 0x000C (0x000C - 0x0000)
struct Prop_snack_beer_C_OpenBottle final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_beer_C_OpenBottle) == 0x000004, "Wrong alignment on Prop_snack_beer_C_OpenBottle");
static_assert(sizeof(Prop_snack_beer_C_OpenBottle) == 0x00000C, "Wrong size on Prop_snack_beer_C_OpenBottle");
static_assert(offsetof(Prop_snack_beer_C_OpenBottle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Prop_snack_beer_C_OpenBottle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_snack_beer_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_beer_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_snack_beer_C_ActionOptionIndex");
static_assert(sizeof(Prop_snack_beer_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_snack_beer_C_ActionOptionIndex");
static_assert(offsetof(Prop_snack_beer_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_snack_beer_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_snack_beer_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_snack_beer_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_snack_beer_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_beer_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_snack_beer_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_snack_beer_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_snack_beer_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_snack_beer_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_snack_beer_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_snack_beer_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_loadData_return;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_snack_beer_C_LoadData) == 0x000010, "Wrong alignment on Prop_snack_beer_C_LoadData");
static_assert(sizeof(Prop_snack_beer_C_LoadData) == 0x0000E0, "Wrong size on Prop_snack_beer_C_LoadData");
static_assert(offsetof(Prop_snack_beer_C_LoadData, Data) == 0x000000, "Member 'Prop_snack_beer_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_LoadData, Return) == 0x0000C0, "Member 'Prop_snack_beer_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_snack_beer_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_LoadData, CallFunc_loadData_return) == 0x0000D8, "Member 'Prop_snack_beer_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D9, "Member 'Prop_snack_beer_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_snack_beer.prop_snack_beer_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_snack_beer_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<bool>                                  K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mBool                          K2Node_MakeStruct_struct_mBool;                    // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mBool                          CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_beer_C_GetData) == 0x000010, "Wrong alignment on Prop_snack_beer_C_GetData");
static_assert(sizeof(Prop_snack_beer_C_GetData) == 0x000280, "Wrong size on Prop_snack_beer_C_GetData");
static_assert(offsetof(Prop_snack_beer_C_GetData, Data) == 0x000000, "Member 'Prop_snack_beer_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_snack_beer_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_snack_beer_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_snack_beer_C_GetData, K2Node_MakeStruct_struct_mBool) == 0x000190, "Member 'Prop_snack_beer_C_GetData::K2Node_MakeStruct_struct_mBool' has a wrong offset!");
