#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_emptyBottle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_emptyBottle.prop_emptyBottle_C.gascanFuel
// 0x0060 (0x0060 - 0x0000)
struct Prop_emptyBottle_C_GascanFuel final
{
public:
	class AProp_gascan_C*                         Gascan;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fueled;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_gasBottle_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_emptyBottle_C_GascanFuel) == 0x000010, "Wrong alignment on Prop_emptyBottle_C_GascanFuel");
static_assert(sizeof(Prop_emptyBottle_C_GascanFuel) == 0x000060, "Wrong size on Prop_emptyBottle_C_GascanFuel");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, Gascan) == 0x000000, "Member 'Prop_emptyBottle_C_GascanFuel::Gascan' has a wrong offset!");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, Fueled) == 0x000008, "Member 'Prop_emptyBottle_C_GascanFuel::Fueled' has a wrong offset!");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00000C, "Member 'Prop_emptyBottle_C_GascanFuel::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Prop_emptyBottle_C_GascanFuel::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'Prop_emptyBottle_C_GascanFuel::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'Prop_emptyBottle_C_GascanFuel::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_emptyBottle_C_GascanFuel, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Prop_emptyBottle_C_GascanFuel::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

