#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_food

#include "Basic.hpp"

#include "Struct_food1_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_food.prop_food_C.ExecuteUbergraph_prop_food
// 0x0340 (0x0340 - 0x0000)
struct Prop_food_C_ExecuteUbergraph_prop_food final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E97[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        CallFunc_ignite_self_CastInput;                    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E98[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E99[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_food1                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9A[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0060(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9B[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9C[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9D[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature_1;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9E[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9F[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA0[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA1[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA2[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA3[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA4[0x2];                                     // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA5[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_3;       // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_1;        // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA6[0x2];                                     // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           Temp_object_Variable;                              // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA7[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage;                               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue_1;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue_2;        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA8[0x6];                                     // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addFood_full;                             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA9[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      Temp_object_Variable_1;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAA[0x8];                                     // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0210(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      Temp_object_Variable_2;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_burntFood_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isUnderwater_ReturnValue;                 // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAB[0x2];                                     // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0268(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAC[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      K2Node_Select_Default;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_ExecuteUbergraph_prop_food) == 0x000010, "Wrong alignment on Prop_food_C_ExecuteUbergraph_prop_food");
static_assert(sizeof(Prop_food_C_ExecuteUbergraph_prop_food) == 0x000340, "Wrong size on Prop_food_C_ExecuteUbergraph_prop_food");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, EntryPoint) == 0x000000, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_ignite_self_CastInput) == 0x000010, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_ignite_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_IsActive_ReturnValue) == 0x000021, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000022, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000024, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000051, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_player_1) == 0x000058, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_hit) == 0x000060, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_index) == 0x0000E8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_action) == 0x0000EC, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_player) == 0x0000F0, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_SwitchEnum_CmpSuccess) == 0x0000F8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_RandomFloat_ReturnValue) == 0x0000FC, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Less_FloatFloat_ReturnValue) == 0x000100, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000101, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_SelectFloat_ReturnValue) == 0x000104, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_SelectFloat_ReturnValue_1) == 0x000108, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_RandomFloatInRange_ReturnValue) == 0x00010C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_temperature_1) == 0x000110, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Lerp_ReturnValue) == 0x000114, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000118, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00011C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000120, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000124, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000128, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x00012C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Abs_ReturnValue) == 0x000130, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000134, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000138, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_temperature) == 0x00013C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_speed) == 0x000140, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Add_FloatFloat_ReturnValue) == 0x000144, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_SelectFloat_ReturnValue_2) == 0x000148, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000150, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000158, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_FInterpTo_ReturnValue) == 0x00015C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Array_RemoveItem_ReturnValue) == 0x000160, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Array_Add_ReturnValue) == 0x000164, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_DeltaSeconds) == 0x000168, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x00016C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, Temp_int_Variable) == 0x000170, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_getMainSave_save_main) == 0x000178, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000180, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Add_IntInt_ReturnValue) == 0x000184, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000188, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00018C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000190, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000191, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000194, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000198, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x00019C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Lerp_ReturnValue_1) == 0x0001A0, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0001A4, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001A8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_LessEqual_FloatFloat_ReturnValue_3) == 0x0001AC, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_LessEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_EqualEqual_BoolBool_ReturnValue_1) == 0x0001AD, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_EqualEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_RandomUnitVector_ReturnValue) == 0x0001B0, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001BC, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, Temp_object_Variable) == 0x0001C8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x0001D0, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_damage) == 0x0001D4, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001D8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Lerp_ReturnValue_2) == 0x0001DC, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_IsActive_ReturnValue_1) == 0x0001E0, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_IsActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_EqualEqual_BoolBool_ReturnValue_2) == 0x0001E1, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_EqualEqual_BoolBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_getMainPlayer_AsMain_Player_1) == 0x0001E8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_getMainPlayer_AsMain_Player_2) == 0x0001F0, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_addFood_full) == 0x0001F8, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, Temp_object_Variable_1) == 0x000200, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_GetTransform_ReturnValue) == 0x000210, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000240, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, Temp_object_Variable_2) == 0x000248, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_FinishSpawningActor_ReturnValue) == 0x000250, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000258, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_Lerp_ReturnValue_3) == 0x00025C, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_isUnderwater_ReturnValue) == 0x000260, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_isUnderwater_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_BooleanOR_ReturnValue) == 0x000261, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, CallFunc_SelectFloat_ReturnValue_3) == 0x000264, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Event_settings) == 0x000268, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, Temp_bool_Variable) == 0x000334, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ExecuteUbergraph_prop_food, K2Node_Select_Default) == 0x000338, "Member 'Prop_food_C_ExecuteUbergraph_prop_food::K2Node_Select_Default' has a wrong offset!");

// Function prop_food.prop_food_C.settingsApplied
// 0x00CC (0x00CC - 0x0000)
struct Prop_food_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00CC)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_SettingsApplied) == 0x000004, "Wrong alignment on Prop_food_C_SettingsApplied");
static_assert(sizeof(Prop_food_C_SettingsApplied) == 0x0000CC, "Wrong size on Prop_food_C_SettingsApplied");
static_assert(offsetof(Prop_food_C_SettingsApplied, Settings) == 0x000000, "Member 'Prop_food_C_SettingsApplied::Settings' has a wrong offset!");

// Function prop_food.prop_food_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Prop_food_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_FireDamage) == 0x000004, "Wrong alignment on Prop_food_C_FireDamage");
static_assert(sizeof(Prop_food_C_FireDamage) == 0x000004, "Wrong size on Prop_food_C_FireDamage");
static_assert(offsetof(Prop_food_C_FireDamage, Damage) == 0x000000, "Member 'Prop_food_C_FireDamage::Damage' has a wrong offset!");

// Function prop_food.prop_food_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_food_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_food_C_ReceiveTick");
static_assert(sizeof(Prop_food_C_ReceiveTick) == 0x000004, "Wrong size on Prop_food_C_ReceiveTick");
static_assert(offsetof(Prop_food_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_food_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_food.prop_food_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_food_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_food_C_ActionOptionIndex");
static_assert(sizeof(Prop_food_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_food_C_ActionOptionIndex");
static_assert(offsetof(Prop_food_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_food_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_food_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Prop_food_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Prop_food_C_ActionOptionIndex, Action) == 0x000094, "Member 'Prop_food_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_food.prop_food_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Prop_food_C_AccumulateTemperature final
{
public:
	float                                         Param_Temperature;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Prop_food_C_AccumulateTemperature");
static_assert(sizeof(Prop_food_C_AccumulateTemperature) == 0x000008, "Wrong size on Prop_food_C_AccumulateTemperature");
static_assert(offsetof(Prop_food_C_AccumulateTemperature, Param_Temperature) == 0x000000, "Member 'Prop_food_C_AccumulateTemperature::Param_Temperature' has a wrong offset!");
static_assert(offsetof(Prop_food_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Prop_food_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function prop_food.prop_food_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Prop_food_C_AddTemperature final
{
public:
	float                                         Param_Temperature;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_AddTemperature) == 0x000004, "Wrong alignment on Prop_food_C_AddTemperature");
static_assert(sizeof(Prop_food_C_AddTemperature) == 0x000004, "Wrong size on Prop_food_C_AddTemperature");
static_assert(offsetof(Prop_food_C_AddTemperature, Param_Temperature) == 0x000000, "Member 'Prop_food_C_AddTemperature::Param_Temperature' has a wrong offset!");

// Function prop_food.prop_food_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_food_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_food_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_food_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_food_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_food_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_food_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_food.prop_food_C.loadData
// 0x0180 (0x0180 - 0x0000)
struct Prop_food_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EAD[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAE[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EAF[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mBool                          CallFunc_Array_Get_Item_3;                         // 0x00F8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_4;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_5;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_6;                         // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB0[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item_7;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_loadData_return;                          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB1[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_food1                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0138(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB2[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_food_C_LoadData) == 0x000010, "Wrong alignment on Prop_food_C_LoadData");
static_assert(sizeof(Prop_food_C_LoadData) == 0x000180, "Wrong size on Prop_food_C_LoadData");
static_assert(offsetof(Prop_food_C_LoadData, Data) == 0x000000, "Member 'Prop_food_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, Return) == 0x0000C0, "Member 'Prop_food_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C4, "Member 'Prop_food_C_LoadData::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_FMax_ReturnValue) == 0x0000D8, "Member 'Prop_food_C_LoadData::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_2) == 0x0000F0, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_3) == 0x0000F8, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_4) == 0x000108, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_5) == 0x00010C, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_LastIndex_ReturnValue) == 0x000110, "Member 'Prop_food_C_LoadData::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_6) == 0x000114, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Array_Get_Item_7) == 0x000118, "Member 'Prop_food_C_LoadData::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_loadData_return) == 0x00011C, "Member 'Prop_food_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000120, "Member 'Prop_food_C_LoadData::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_RandomFloatInRange_ReturnValue) == 0x000124, "Member 'Prop_food_C_LoadData::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_FMax_ReturnValue_1) == 0x000128, "Member 'Prop_food_C_LoadData::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_GetTimeSeconds_ReturnValue) == 0x00012C, "Member 'Prop_food_C_LoadData::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000130, "Member 'Prop_food_C_LoadData::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000134, "Member 'Prop_food_C_LoadData::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000138, "Member 'Prop_food_C_LoadData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000150, "Member 'Prop_food_C_LoadData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000154, "Member 'Prop_food_C_LoadData::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Add_FloatFloat_ReturnValue) == 0x000158, "Member 'Prop_food_C_LoadData::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00015C, "Member 'Prop_food_C_LoadData::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000160, "Member 'Prop_food_C_LoadData::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000164, "Member 'Prop_food_C_LoadData::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Conv_FloatToString_ReturnValue) == 0x000168, "Member 'Prop_food_C_LoadData::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000178, "Member 'Prop_food_C_LoadData::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_food_C_LoadData, CallFunc_Lerp_ReturnValue) == 0x00017C, "Member 'Prop_food_C_LoadData::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function prop_food.prop_food_C.isButtonUsed
// 0x0001 (0x0001 - 0x0000)
struct Prop_food_C_IsButtonUsed final
{
public:
	bool                                          Failed;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_food_C_IsButtonUsed) == 0x000001, "Wrong alignment on Prop_food_C_IsButtonUsed");
static_assert(sizeof(Prop_food_C_IsButtonUsed) == 0x000001, "Wrong size on Prop_food_C_IsButtonUsed");
static_assert(offsetof(Prop_food_C_IsButtonUsed, Failed) == 0x000000, "Member 'Prop_food_C_IsButtonUsed::Failed' has a wrong offset!");

// Function prop_food.prop_food_C.lookAt
// 0x00D8 (0x00D8 - 0x0000)
struct Prop_food_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB3[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
