#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_funGun_stickyLauncher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_funGun_stickyLauncher.prop_funGun_stickyLauncher_C.ExecuteUbergraph_prop_funGun_stickyLauncher
// 0x0030 (0x0030 - 0x0000)
struct Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_stickybomb_C*                     CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher) == 0x000008, "Wrong alignment on Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher");
static_assert(sizeof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher) == 0x000030, "Wrong size on Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, EntryPoint) == 0x000000, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, Temp_int_Variable) == 0x000004, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, CallFunc_Array_Get_Item) == 0x000018, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher, K2Node_Event_player) == 0x000028, "Member 'Prop_funGun_stickyLauncher_C_ExecuteUbergraph_prop_funGun_stickyLauncher::K2Node_Event_player' has a wrong offset!");

// Function prop_funGun_stickyLauncher.prop_funGun_stickyLauncher_C.fireBulletPrimary
// 0x00A0 (0x00A0 - 0x0000)
struct Prop_funGun_stickyLauncher_C_FireBulletPrimary final
{
public:
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AProp_stickybomb_C*               Temp_object_Variable;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_stickybomb_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_stickyLauncher_C_FireBulletPrimary) == 0x000010, "Wrong alignment on Prop_funGun_stickyLauncher_C_FireBulletPrimary");
static_assert(sizeof(Prop_funGun_stickyLauncher_C_FireBulletPrimary) == 0x0000A0, "Wrong size on Prop_funGun_stickyLauncher_C_FireBulletPrimary");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_RandomUnitVector_ReturnValue) == 0x000000, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, Temp_object_Variable) == 0x000010, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000018, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_Array_RemoveItem_ReturnValue) == 0x000024, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_GetForwardVector_ReturnValue) == 0x000028, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000034, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000040, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_FireBulletPrimary, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'Prop_funGun_stickyLauncher_C_FireBulletPrimary::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function prop_funGun_stickyLauncher.prop_funGun_stickyLauncher_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Param_Player;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB, Param_Player) == 0x000000, "Member 'Prop_funGun_stickyLauncher_C_PlayerHandUse_RMB::Param_Player' has a wrong offset!");

}

