#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_shower

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_shower.prop_shower_C.lookAt
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_shower_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43A0[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_shower_C_LookAt) == 0x000008, "Wrong alignment on Prop_shower_C_LookAt");
static_assert(sizeof(Prop_shower_C_LookAt) == 0x0000B0, "Wrong size on Prop_shower_C_LookAt");
static_assert(offsetof(Prop_shower_C_LookAt, Player) == 0x000000, "Member 'Prop_shower_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_shower_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_shower_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_shower_C_LookAt, Return) == 0x000090, "Member 'Prop_shower_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_shower_C_LookAt, Text) == 0x000098, "Member 'Prop_shower_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_shower_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_shower_C_LookAt::boundObjectReplace' has a wrong offset!");

}

