#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_fax

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_fax.prop_fax_C.ExecuteUbergraph_prop_fax
// 0x0060 (0x0060 - 0x0000)
struct Prop_fax_C_ExecuteUbergraph_prop_fax final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_printPhoto;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Original_Index;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F0A[0xF];                                     // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_photo_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fax_C_ExecuteUbergraph_prop_fax) == 0x000010, "Wrong alignment on Prop_fax_C_ExecuteUbergraph_prop_fax");
static_assert(sizeof(Prop_fax_C_ExecuteUbergraph_prop_fax) == 0x000060, "Wrong size on Prop_fax_C_ExecuteUbergraph_prop_fax");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, EntryPoint) == 0x000000, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, K2Node_CustomEvent_printPhoto) == 0x000004, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::K2Node_CustomEvent_printPhoto' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, K2Node_CustomEvent_Original_Index) == 0x000008, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::K2Node_CustomEvent_Original_Index' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00000C, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_ExecuteUbergraph_prop_fax, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Prop_fax_C_ExecuteUbergraph_prop_fax::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_fax.prop_fax_C.print
// 0x0008 (0x0008 - 0x0000)
struct Prop_fax_C_Print final
{
public:
	int32                                         Param_PrintPhoto;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Original_Index;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_fax_C_Print) == 0x000004, "Wrong alignment on Prop_fax_C_Print");
static_assert(sizeof(Prop_fax_C_Print) == 0x000008, "Wrong size on Prop_fax_C_Print");
static_assert(offsetof(Prop_fax_C_Print, Param_PrintPhoto) == 0x000000, "Member 'Prop_fax_C_Print::Param_PrintPhoto' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_Print, Param_Original_Index) == 0x000004, "Member 'Prop_fax_C_Print::Param_Original_Index' has a wrong offset!");

// Function prop_fax.prop_fax_C.setPrintLoc
// 0x0094 (0x0094 - 0x0000)
struct Prop_fax_C_SetPrintLoc final
{
public:
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_fax_C_SetPrintLoc) == 0x000004, "Wrong alignment on Prop_fax_C_SetPrintLoc");
static_assert(sizeof(Prop_fax_C_SetPrintLoc) == 0x000094, "Wrong size on Prop_fax_C_SetPrintLoc");
static_assert(offsetof(Prop_fax_C_SetPrintLoc, CallFunc_VLerp_ReturnValue) == 0x000000, "Member 'Prop_fax_C_SetPrintLoc::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_fax_C_SetPrintLoc, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00000C, "Member 'Prop_fax_C_SetPrintLoc::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

