#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropSpawner_editor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass propSpawner_editor.propSpawner_editor_C
// 0x0050 (0x0270 - 0x0220)
class APropSpawner_editor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Prop;                                              // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Obj;                                               // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          P_static;                                          // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          P_frozen;                                          // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          P_active;                                          // 0x0252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IgnoreSave;                                        // 0x0253(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpawnOnce;                                         // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          AutoSpawn;                                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_propSpawner_editor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Spawn(class AActor** OutputPin);
	void Despawn();
	void Spawn_treehouse(class ATreehouse_C* Treehouse, class AActor** OutputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"propSpawner_editor_C">();
	}
	static class APropSpawner_editor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APropSpawner_editor_C>();
	}
};
static_assert(alignof(APropSpawner_editor_C) == 0x000008, "Wrong alignment on APropSpawner_editor_C");
static_assert(sizeof(APropSpawner_editor_C) == 0x000270, "Wrong size on APropSpawner_editor_C");
static_assert(offsetof(APropSpawner_editor_C, UberGraphFrame) == 0x000220, "Member 'APropSpawner_editor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, StaticMesh) == 0x000228, "Member 'APropSpawner_editor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, DefaultSceneRoot) == 0x000230, "Member 'APropSpawner_editor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, Prop) == 0x000238, "Member 'APropSpawner_editor_C::Prop' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, Obj) == 0x000240, "Member 'APropSpawner_editor_C::Obj' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, Actor) == 0x000248, "Member 'APropSpawner_editor_C::Actor' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, P_static) == 0x000250, "Member 'APropSpawner_editor_C::P_static' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, P_frozen) == 0x000251, "Member 'APropSpawner_editor_C::P_frozen' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, P_active) == 0x000252, "Member 'APropSpawner_editor_C::P_active' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, IgnoreSave) == 0x000253, "Member 'APropSpawner_editor_C::IgnoreSave' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, SpawnOnce) == 0x000258, "Member 'APropSpawner_editor_C::SpawnOnce' has a wrong offset!");
static_assert(offsetof(APropSpawner_editor_C, AutoSpawn) == 0x000268, "Member 'APropSpawner_editor_C::AutoSpawn' has a wrong offset!");

}

