#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_ariralPillow_sus

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_ariralPillow_sus.prop_ariralPillow_sus_C.ExecuteUbergraph_prop_ariralPillow_sus
// 0x0020 (0x0020 - 0x0000)
struct Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A2E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus) == 0x000008, "Wrong alignment on Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus");
static_assert(sizeof(Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus) == 0x000020, "Wrong size on Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus");
static_assert(offsetof(Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus, EntryPoint) == 0x000000, "Member 'Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus, K2Node_DynamicCast_AsPrimitive_Component) == 0x000010, "Member 'Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Prop_ariralPillow_sus_C_ExecuteUbergraph_prop_ariralPillow_sus::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

