#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wireComponent_rozgun

#include "Basic.hpp"

#include "Prop_wireComponent_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_wireComponent_rozgun.prop_wireComponent_rozgun_C
// 0x0020 (0x03A0 - 0x0380)
class AProp_wireComponent_rozgun_C final : public AProp_wireComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_wireComponent_rozgun_C;        // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Reload;                                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fired;                                             // 0x0394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Spread;                                            // 0x0395(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_396[0x2];                                      // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Type;                                              // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_wireComponent_rozgun(int32 EntryPoint);
	void WirePass(class AWire_C* Wire);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_wireComponent_rozgun_C">();
	}
	static class AProp_wireComponent_rozgun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_wireComponent_rozgun_C>();
	}
};
static_assert(alignof(AProp_wireComponent_rozgun_C) == 0x000008, "Wrong alignment on AProp_wireComponent_rozgun_C");
static_assert(sizeof(AProp_wireComponent_rozgun_C) == 0x0003A0, "Wrong size on AProp_wireComponent_rozgun_C");
static_assert(offsetof(AProp_wireComponent_rozgun_C, UberGraphFrame_Prop_wireComponent_rozgun_C) == 0x000380, "Member 'AProp_wireComponent_rozgun_C::UberGraphFrame_Prop_wireComponent_rozgun_C' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_rozgun_C, Arrow) == 0x000388, "Member 'AProp_wireComponent_rozgun_C::Arrow' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_rozgun_C, Reload) == 0x000390, "Member 'AProp_wireComponent_rozgun_C::Reload' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_rozgun_C, Fired) == 0x000394, "Member 'AProp_wireComponent_rozgun_C::Fired' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_rozgun_C, Spread) == 0x000395, "Member 'AProp_wireComponent_rozgun_C::Spread' has a wrong offset!");
static_assert(offsetof(AProp_wireComponent_rozgun_C, Type) == 0x000398, "Member 'AProp_wireComponent_rozgun_C::Type' has a wrong offset!");

}

