#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_sponge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_sponge.prop_sponge_C.ExecuteUbergraph_prop_sponge
// 0x05E0 (0x05E0 - 0x0000)
struct Prop_sponge_C_ExecuteUbergraph_prop_sponge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0144(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_trigger_obj;                          // 0x01D0(0x0010)(ReferenceParm)
	class AD_window_C*                            K2Node_DynamicCast_AsD_Window;                     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0228(0x0010)(ConstParm, ReferenceParm)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0240(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrunge_C*                              K2Node_DynamicCast_AsGrunge;                       // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0278(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_trigger_obj_1;                        // 0x0288(0x0010)(ReferenceParm)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start;                                // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start_1;                              // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end_1;                                // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x02E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_373[0x1];                                      // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_bucket_C*                         K2Node_DynamicCast_AsProp_Bucket;                  // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_DynamicCast_AsWater_Volume;                 // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_dipped_isDipped;                          // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_413[0x1];                                      // 0x0413(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x041C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0430(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0444(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CF[0x1];                                      // 0x04CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0534(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0540(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x054C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0558(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AD_window_C*                            K2Node_DynamicCast_AsD_Window_1;                   // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors_1;          // 0x0580(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue_1;        // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGrunge_C*                              K2Node_DynamicCast_AsGrunge_1;                     // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x2];                                      // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut_1;       // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x05C8(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_sponge_C_ExecuteUbergraph_prop_sponge) == 0x000008, "Wrong alignment on Prop_sponge_C_ExecuteUbergraph_prop_sponge");
static_assert(sizeof(Prop_sponge_C_ExecuteUbergraph_prop_sponge) == 0x0005E0, "Wrong size on Prop_sponge_C_ExecuteUbergraph_prop_sponge");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, EntryPoint) == 0x000000, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_7) == 0x000004, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_6) == 0x00001C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_5) == 0x000034, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_name_Variable) == 0x00004C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_object_Variable) == 0x000058, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_object_Variable_1) == 0x000068, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_4) == 0x000078, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_3) == 0x000090, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_4) == 0x000098, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_2) == 0x0000A8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_1) == 0x0000C0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName) == 0x0000D8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_name_Variable_1) == 0x0000F0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Add_IntInt_ReturnValue) == 0x0000FC, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_8) == 0x000100, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_int_Array_Index_Variable) == 0x000108, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_int_Loop_Counter_Variable_1) == 0x00010C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Add_IntInt_ReturnValue_1) == 0x000110, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_int_Array_Index_Variable_1) == 0x000114, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_Event_water) == 0x000118, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_ComponentBoundEvent_HitComponent) == 0x000120, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_ComponentBoundEvent_OtherActor) == 0x000128, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_ComponentBoundEvent_OtherComp) == 0x000130, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000138, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_ComponentBoundEvent_Hit) == 0x000144, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_obj_trigger_obj) == 0x0001D0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_obj_trigger_obj' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsD_Window) == 0x0001E0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsD_Window' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_GetVelocity_ReturnValue) == 0x0001EC, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_GetComponentBounds_Origin) == 0x0001F8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_GetComponentBounds_BoxExtent) == 0x000204, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_GetComponentBounds_SphereRadius) == 0x000210, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_VSize_ReturnValue) == 0x000214, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000218, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_Event_player_3) == 0x000220, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, Temp_object_Variable_2) == 0x000228, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_Event_player_2) == 0x000238, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_SphereOverlapActors_OutActors) == 0x000240, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_SphereOverlapActors_ReturnValue) == 0x000250, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Array_Get_Item) == 0x000258, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Array_Length_ReturnValue) == 0x000260, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsGrunge) == 0x000268, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsGrunge' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess_1) == 0x000270, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Less_IntInt_ReturnValue) == 0x000271, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_IsValid_ReturnValue) == 0x000272, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_MakeArray_Array) == 0x000278, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_obj_trigger_obj_1) == 0x000288, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_obj_trigger_obj_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000298, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_IsValid_ReturnValue_1) == 0x0002A0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_Event_player_1) == 0x0002A8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_arm_start) == 0x0002B0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_arm_end) == 0x0002BC, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_arm_start_1) == 0x0002C8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_arm_start_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_arm_end_1) == 0x0002D4, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_arm_end_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0002E0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0002E8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000370, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_bBlockingHit) == 0x000371, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_bInitialOverlap) == 0x000372, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Time) == 0x000374, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Distance) == 0x000378, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Location) == 0x00037C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_ImpactPoint) == 0x000388, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Normal) == 0x000394, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_ImpactNormal) == 0x0003A0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_PhysMat) == 0x0003B0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitActor) == 0x0003B8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitComponent) == 0x0003C0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitBoneName) == 0x0003C8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitItem) == 0x0003D0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_ElementIndex) == 0x0003D4, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_FaceIndex) == 0x0003D8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_TraceStart) == 0x0003DC, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_TraceEnd) == 0x0003E8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsProp_Bucket) == 0x0003F8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsProp_Bucket' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess_2) == 0x000400, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsWater_Volume) == 0x000408, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsWater_Volume' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess_3) == 0x000410, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_dipped_isDipped) == 0x000411, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_dipped_isDipped' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_IsValid_ReturnValue_2) == 0x000412, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000414, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000418, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_8) == 0x00041C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00042C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_obj_statDyn_obj) == 0x000430, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000440, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000444, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x0004CC, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0004CD, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0004CE, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Time_1) == 0x0004D0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Distance_1) == 0x0004D4, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Location_1) == 0x0004D8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0004E4, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_Normal_1) == 0x0004F0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0004FC, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_PhysMat_1) == 0x000508, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitActor_1) == 0x000510, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitComponent_1) == 0x000518, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitBoneName_1) == 0x000520, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_HitItem_1) == 0x000528, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_ElementIndex_1) == 0x00052C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_FaceIndex_1) == 0x000530, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_TraceStart_1) == 0x000534, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_BreakHitResult_TraceEnd_1) == 0x000540, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CustomEvent_NotifyName_9) == 0x00054C, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsInt_Objects) == 0x000558, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess_4) == 0x000568, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_DoesImplementInterface_ReturnValue) == 0x000569, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsD_Window_1) == 0x000570, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsD_Window_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess_5) == 0x000578, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_SphereOverlapActors_OutActors_1) == 0x000580, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_SphereOverlapActors_OutActors_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_SphereOverlapActors_ReturnValue_1) == 0x000590, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_SphereOverlapActors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Array_Get_Item_1) == 0x000598, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Array_Length_ReturnValue_1) == 0x0005A0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_AsGrunge_1) == 0x0005A8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_AsGrunge_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_DynamicCast_bSuccess_6) == 0x0005B0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Less_IntInt_ReturnValue_1) == 0x0005B1, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005B4, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_Event_player) == 0x0005B8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_RandomFloatInRange_ReturnValue) == 0x0005C0, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_VictoryFloatMinusEquals_FloatOut_1) == 0x0005C4, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_VictoryFloatMinusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, K2Node_CreateDelegate_OutputDelegate_9) == 0x0005C8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Prop_sponge_C_ExecuteUbergraph_prop_sponge, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0005D8, "Member 'Prop_sponge_C_ExecuteUbergraph_prop_sponge::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function prop_sponge.prop_sponge_C.BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_sponge_C_BndEvt__prop_sponge_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
