#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_auuwoaa

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_auuwoaa.prop_auuwoaa_C
// 0x0018 (0x0380 - 0x0368)
class AProp_auuwoaa_C final : public AProp_C
{
public:
	uint8                                         Pad_39AF[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_auuwoaa_C;                     // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_auuwoaa(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_auuwoaa_C">();
	}
	static class AProp_auuwoaa_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_auuwoaa_C>();
	}
};
static_assert(alignof(AProp_auuwoaa_C) == 0x000008, "Wrong alignment on AProp_auuwoaa_C");
static_assert(sizeof(AProp_auuwoaa_C) == 0x000380, "Wrong size on AProp_auuwoaa_C");
static_assert(offsetof(AProp_auuwoaa_C, UberGraphFrame_Prop_auuwoaa_C) == 0x000368, "Member 'AProp_auuwoaa_C::UberGraphFrame_Prop_auuwoaa_C' has a wrong offset!");
static_assert(offsetof(AProp_auuwoaa_C, Audio) == 0x000370, "Member 'AProp_auuwoaa_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_auuwoaa_C, Arrow) == 0x000378, "Member 'AProp_auuwoaa_C::Arrow' has a wrong offset!");

}

