#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wallbuilder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_wallbuilder.prop_wallbuilder_C.ExecuteUbergraph_prop_wallbuilder
// 0x03F0 (0x03F0 - 0x0000)
struct Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9C[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UNametagComponent_C*                    CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue;         // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9D[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00F0(0x0018)()
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0118(0x0018)()
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9E[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0150(0x0010)(ReferenceParm)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start;                                // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0180(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9F[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0194(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA0[0x1];                                     // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA1[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACustomWall_unfinished_C*               K2Node_DynamicCast_AsCustom_Wall_Unfinished;       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA2[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x02B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA3[0x2];                                     // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0364(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA4[0x4];                                     // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA5[0x3];                                     // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue_1;       // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder) == 0x000010, "Wrong alignment on Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder");
static_assert(sizeof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder) == 0x0003F0, "Wrong size on Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, EntryPoint) == 0x000000, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, Temp_struct_Variable) == 0x000010, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CustomEvent_NotifyName_4) == 0x000058, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CustomEvent_NotifyName_3) == 0x000060, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CustomEvent_NotifyName_2) == 0x000078, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CustomEvent_NotifyName_1) == 0x000090, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CustomEvent_NotifyName) == 0x0000A8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B0, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, Temp_name_Variable) == 0x0000C0, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_Vector_SnappedToGrid_ReturnValue) == 0x0000C8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_Vector_SnappedToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, Temp_bool_Variable) == 0x0000D4, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, Temp_text_Variable) == 0x0000D8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, Temp_text_Variable_1) == 0x0000F0, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_Event_player_2) == 0x000108, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_Event_player_1) == 0x000110, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_Select_Default) == 0x000118, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000130, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_Event_player) == 0x000140, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_getMainPlayer_AsMain_Player) == 0x000148, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_obj_statDyn_obj) == 0x000150, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000160, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_arm_start) == 0x000168, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_arm_end) == 0x000174, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, Temp_object_Variable) == 0x000180, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BooleanAND_ReturnValue) == 0x000190, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000194, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x00021C, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_bBlockingHit) == 0x00021D, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_bInitialOverlap) == 0x00021E, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Time) == 0x000220, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Distance) == 0x000224, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Location) == 0x000228, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_ImpactPoint) == 0x000234, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Normal) == 0x000240, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_ImpactNormal) == 0x00024C, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_PhysMat) == 0x000258, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitActor) == 0x000260, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitComponent) == 0x000268, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitBoneName) == 0x000270, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitItem) == 0x000278, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_ElementIndex) == 0x00027C, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_FaceIndex) == 0x000280, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_TraceStart) == 0x000284, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_TraceEnd) == 0x000290, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_DynamicCast_AsCustom_Wall_Unfinished) == 0x0002A0, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_DynamicCast_AsCustom_Wall_Unfinished' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_DynamicCast_bSuccess) == 0x0002A8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_getMainPlayer_AsMain_Player_2) == 0x0002B0, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0002B8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000340, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000341, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Time_1) == 0x000344, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Distance_1) == 0x000348, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Location_1) == 0x00034C, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000358, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_Normal_1) == 0x000364, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000370, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_PhysMat_1) == 0x000380, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitActor_1) == 0x000388, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitComponent_1) == 0x000390, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitBoneName_1) == 0x000398, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_HitItem_1) == 0x0003A0, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_ElementIndex_1) == 0x0003A4, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_FaceIndex_1) == 0x0003A8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_TraceStart_1) == 0x0003AC, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_BreakHitResult_TraceEnd_1) == 0x0003B8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, K2Node_Event_DeltaSeconds) == 0x0003C4, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_Not_PreBool_ReturnValue) == 0x0003C8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_SelectVector_ReturnValue) == 0x0003CC, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder, CallFunc_Vector_SnappedToGrid_ReturnValue_1) == 0x0003D8, "Member 'Prop_wallbuilder_C_ExecuteUbergraph_prop_wallbuilder::CallFunc_Vector_SnappedToGrid_ReturnValue_1' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_wallbuilder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_wallbuilder_C_ReceiveTick");
static_assert(sizeof(Prop_wallbuilder_C_ReceiveTick) == 0x000004, "Wrong size on Prop_wallbuilder_C_ReceiveTick");
static_assert(offsetof(Prop_wallbuilder_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_wallbuilder_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.OnCompleted_8882420E4F2CF57684C98A8A5539FB1C
// 0x0008 (0x0008 - 0x0000)
struct Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C) == 0x000004, "Wrong alignment on Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(sizeof(Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C) == 0x000008, "Wrong size on Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(offsetof(Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C, NotifyName) == 0x000000, "Member 'Prop_wallbuilder_C_OnCompleted_8882420E4F2CF57684C98A8A5539FB1C::NotifyName' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C
// 0x0008 (0x0008 - 0x0000)
struct Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C) == 0x000004, "Wrong alignment on Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(sizeof(Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C) == 0x000008, "Wrong size on Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(offsetof(Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C, NotifyName) == 0x000000, "Member 'Prop_wallbuilder_C_OnBlendOut_8882420E4F2CF57684C98A8A5539FB1C::NotifyName' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C
// 0x0008 (0x0008 - 0x0000)
struct Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C) == 0x000004, "Wrong alignment on Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(sizeof(Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C) == 0x000008, "Wrong size on Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(offsetof(Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C, NotifyName) == 0x000000, "Member 'Prop_wallbuilder_C_OnInterrupted_8882420E4F2CF57684C98A8A5539FB1C::NotifyName' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C
// 0x0008 (0x0008 - 0x0000)
struct Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C) == 0x000004, "Wrong alignment on Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(sizeof(Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C) == 0x000008, "Wrong size on Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(offsetof(Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C, NotifyName) == 0x000000, "Member 'Prop_wallbuilder_C_OnNotifyBegin_8882420E4F2CF57684C98A8A5539FB1C::NotifyName' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C
// 0x0008 (0x0008 - 0x0000)
struct Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C) == 0x000004, "Wrong alignment on Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(sizeof(Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C) == 0x000008, "Wrong size on Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C");
static_assert(offsetof(Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C, NotifyName) == 0x000000, "Member 'Prop_wallbuilder_C_OnNotifyEnd_8882420E4F2CF57684C98A8A5539FB1C::NotifyName' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.addWall
// 0x0060 (0x0060 - 0x0000)
struct Prop_wallbuilder_C_AddWall final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMinElement_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA7[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA8[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACustomWall_unfinished_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_AddWall) == 0x000010, "Wrong alignment on Prop_wallbuilder_C_AddWall");
static_assert(sizeof(Prop_wallbuilder_C_AddWall) == 0x000060, "Wrong size on Prop_wallbuilder_C_AddWall");
static_assert(offsetof(Prop_wallbuilder_C_AddWall, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'Prop_wallbuilder_C_AddWall::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_AddWall, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Prop_wallbuilder_C_AddWall::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_AddWall, CallFunc_GetMinElement_ReturnValue) == 0x000040, "Member 'Prop_wallbuilder_C_AddWall::CallFunc_GetMinElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_AddWall, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'Prop_wallbuilder_C_AddWall::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_AddWall, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'Prop_wallbuilder_C_AddWall::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_AddWall, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Prop_wallbuilder_C_AddWall::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_wallbuilder.prop_wallbuilder_C.setPivotLoc
// 0x04D0 (0x04D0 - 0x0000)
struct Prop_wallbuilder_C_SetPivotLoc final
{
public:
	bool                                          In;                                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BA9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Loc;                                               // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetSignVector_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BAA[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_customWall_getBricks_ToCeil;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAB[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAC[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0160(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0190(0x0040)(HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAD[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0220(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BAE[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue;         // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x031C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Vector_ComponentMax_ReturnValue;          // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x03B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BAF[0x2];                                     // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BB0[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0498(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wallbuilder_C_SetPivotLoc) == 0x000010, "Wrong alignment on Prop_wallbuilder_C_SetPivotLoc");
static_assert(sizeof(Prop_wallbuilder_C_SetPivotLoc) == 0x0004D0, "Wrong size on Prop_wallbuilder_C_SetPivotLoc");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, In) == 0x000000, "Member 'Prop_wallbuilder_C_SetPivotLoc::In' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, Loc) == 0x000004, "Member 'Prop_wallbuilder_C_SetPivotLoc::Loc' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_Vector_GetSignVector_ReturnValue) == 0x00001C, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_Vector_GetSignVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000040, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000058, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_BooleanAND_ReturnValue) == 0x0000E0, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_K2_GetComponentScale_ReturnValue) == 0x0000E4, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_customWall_getBricks_ToCeil) == 0x0000F0, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_customWall_getBricks_ToCeil' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_FCeil_ReturnValue) == 0x0000F4, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, K2Node_MakeStruct_FormatArgumentData) == 0x0000F8, "Member 'Prop_wallbuilder_C_SetPivotLoc::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000138, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000148, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_BreakVector_X) == 0x000150, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_BreakVector_Y) == 0x000154, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_BreakVector_Z) == 0x000158, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_GetTransform_ReturnValue) == 0x000160, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, K2Node_MakeStruct_FormatArgumentData_1) == 0x000190, "Member 'Prop_wallbuilder_C_SetPivotLoc::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, CallFunc_InverseTransformLocation_ReturnValue) == 0x0001D0, "Member 'Prop_wallbuilder_C_SetPivotLoc::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wallbuilder_C_SetPivotLoc, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001E0, "Member 'Prop_wallbuilder_C_SetPivotLoc::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
