#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_garbageGun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_garbageGun.prop_garbageGun_C.ExecuteUbergraph_prop_garbageGun
// 0x01D0 (0x01D0 - 0x0000)
struct Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3855[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3856[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_4;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_6;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_7;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3857[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x00D0(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3858[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x0108(0x0018)()
	int32                                         Temp_int_Variable_2;                               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0130(0x0018)()
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3859[0xC];                                     // 0x0174(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun) == 0x000010, "Wrong alignment on Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun");
static_assert(sizeof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun) == 0x0001D0, "Wrong size on Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, EntryPoint) == 0x000000, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable) == 0x000008, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_1) == 0x000020, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_2) == 0x000038, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_3) == 0x000050, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_4) == 0x000068, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_int_Variable) == 0x000080, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable) == 0x000088, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_1) == 0x000090, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_2) == 0x000098, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_3) == 0x0000A0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_4) == 0x0000A8, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_5) == 0x0000B0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_6) == 0x0000B8, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_object_Variable_7) == 0x0000C0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_int_Variable_1) == 0x0000C8, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_5) == 0x0000D0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_Percent_IntInt_ReturnValue) == 0x0000E8, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_6) == 0x0000F0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_text_Variable_7) == 0x000108, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, Temp_int_Variable_2) == 0x000120, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_Add_IntInt_ReturnValue) == 0x000124, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, K2Node_Event_player_1) == 0x000128, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, K2Node_Select_Default) == 0x000130, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, K2Node_Event_player) == 0x000148, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_GetForwardVector_ReturnValue) == 0x000150, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00015C, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000168, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, K2Node_Select_Default_1) == 0x0001B8, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C0, "Member 'Prop_garbageGun_C_ExecuteUbergraph_prop_garbageGun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_garbageGun.prop_garbageGun_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_garbageGun_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageGun_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_garbageGun_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_garbageGun_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_garbageGun_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_garbageGun_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_garbageGun_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_garbageGun.prop_garbageGun_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_garbageGun_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_garbageGun_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_garbageGun_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_garbageGun_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_garbageGun_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_garbageGun_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

