#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_argm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_argm.prop_argm_C
// 0x0020 (0x0388 - 0x0368)
class AProp_argm_C final : public AProp_C
{
public:
	uint8                                         Pad_38C7[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_argm_C;                        // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Taken;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C8[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Dynmat_0;                                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_1;                                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_argm(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, int32 Param_Index, Enum_interactionActions Action);
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void Set_ignoreSave_trigger(bool NewParam);
	void CordPlugged(class ACord_C* Cord, class ACordSocket_C* Socket);
	void SetActiveTrigger(class AActor* SentFrom, bool Active);
	void CordUnplugged(class ACord_C* Cord, class ACordSocket_C* Socket);
	void Setmats();
	void IgnoreSave_trigger(bool* Ignore);
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void GetTriggerData(struct FStruct_triggerSave* Data);
	void PropRenderer_finishProps();
	void GamemodeBeginPlay();
	void UserConstructionScript();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_argm_C">();
	}
	static class AProp_argm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_argm_C>();
	}
};
static_assert(alignof(AProp_argm_C) == 0x000008, "Wrong alignment on AProp_argm_C");
static_assert(sizeof(AProp_argm_C) == 0x000388, "Wrong size on AProp_argm_C");
static_assert(offsetof(AProp_argm_C, UberGraphFrame_Prop_argm_C) == 0x000368, "Member 'AProp_argm_C::UberGraphFrame_Prop_argm_C' has a wrong offset!");
static_assert(offsetof(AProp_argm_C, Taken) == 0x000370, "Member 'AProp_argm_C::Taken' has a wrong offset!");
static_assert(offsetof(AProp_argm_C, Dynmat_0) == 0x000378, "Member 'AProp_argm_C::Dynmat_0' has a wrong offset!");
static_assert(offsetof(AProp_argm_C, Dynmat_1) == 0x000380, "Member 'AProp_argm_C::Dynmat_1' has a wrong offset!");

}

