#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_laserMirror_planar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_laserMirror_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_laserMirror_planar.prop_laserMirror_planar_C
// 0x0020 (0x0388 - 0x0368)
class AProp_laserMirror_planar_C final : public AProp_laserMirror_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_laserMirror_planar_C;          // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlanarReflectionComponent*             PlanarReflection;                                  // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_laserMirror_planar(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__prop_laserMirror_planar_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__prop_laserMirror_planar_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_laserMirror_planar_C">();
	}
	static class AProp_laserMirror_planar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_laserMirror_planar_C>();
	}
};
static_assert(alignof(AProp_laserMirror_planar_C) == 0x000008, "Wrong alignment on AProp_laserMirror_planar_C");
static_assert(sizeof(AProp_laserMirror_planar_C) == 0x000388, "Wrong size on AProp_laserMirror_planar_C");
static_assert(offsetof(AProp_laserMirror_planar_C, UberGraphFrame_Prop_laserMirror_planar_C) == 0x000368, "Member 'AProp_laserMirror_planar_C::UberGraphFrame_Prop_laserMirror_planar_C' has a wrong offset!");
static_assert(offsetof(AProp_laserMirror_planar_C, Sphere) == 0x000370, "Member 'AProp_laserMirror_planar_C::Sphere' has a wrong offset!");
static_assert(offsetof(AProp_laserMirror_planar_C, StaticMesh1) == 0x000378, "Member 'AProp_laserMirror_planar_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AProp_laserMirror_planar_C, PlanarReflection) == 0x000380, "Member 'AProp_laserMirror_planar_C::PlanarReflection' has a wrong offset!");

}

