#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_yeeterDeleter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_yeeterDeleter.prop_yeeterDeleter_C.ExecuteUbergraph_prop_yeeterDeleter
// 0x01B8 (0x01B8 - 0x0000)
struct Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPhys_obj;                      // 0x0028(0x0010)(ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0084(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0190(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter) == 0x000008, "Wrong alignment on Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter");
static_assert(sizeof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter) == 0x0001B8, "Wrong size on Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, EntryPoint) == 0x000000, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, Temp_object_Variable) == 0x000008, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, Temp_int_Variable) == 0x000018, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, K2Node_Event_player) == 0x000020, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_obj_statDynPhys_obj) == 0x000028, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_obj_statDynPhys_obj' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000038, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_GetActorForwardVector_ReturnValue) == 0x000040, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, Temp_object_Variable_1) == 0x000068, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000084, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x00010C, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_bBlockingHit) == 0x00010D, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_bInitialOverlap) == 0x00010E, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_Time) == 0x000110, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_Distance) == 0x000114, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_Location) == 0x000118, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_ImpactPoint) == 0x000124, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_Normal) == 0x000130, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_ImpactNormal) == 0x00013C, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_PhysMat) == 0x000148, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_HitActor) == 0x000150, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_HitComponent) == 0x000158, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_HitBoneName) == 0x000160, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_HitItem) == 0x000168, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_ElementIndex) == 0x00016C, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_FaceIndex) == 0x000170, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_TraceStart) == 0x000174, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_BreakHitResult_TraceEnd) == 0x000180, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_SphereOverlapActors_OutActors) == 0x000190, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_SphereOverlapActors_ReturnValue) == 0x0001A0, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_Array_Length_ReturnValue) == 0x0001A4, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter, CallFunc_Less_IntInt_ReturnValue) == 0x0001B0, "Member 'Prop_yeeterDeleter_C_ExecuteUbergraph_prop_yeeterDeleter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function prop_yeeterDeleter.prop_yeeterDeleter_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_yeeterDeleter_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_yeeterDeleter_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_yeeterDeleter_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_yeeterDeleter_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_yeeterDeleter_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_yeeterDeleter_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_yeeterDeleter_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

