#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_wendSkull

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_wendSkull.prop_wendSkull_C.ExecuteUbergraph_prop_wendSkull
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWendigoDreamer_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B0[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B1[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B2[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B3[0xC];                                     // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B4[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B5[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWendussy_C*                            CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x00D0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull) == 0x000010, "Wrong alignment on Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull");
static_assert(sizeof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull) == 0x0000E0, "Wrong size on Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, EntryPoint) == 0x000000, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_bool_Has_Been_Initd_Variable) == 0x000050, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_int_Variable) == 0x000054, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, K2Node_Event_fuel) == 0x000060, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000064, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_MakeTransform_ReturnValue_1) == 0x000080, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B0, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000B8, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_bool_IsClosed_Variable) == 0x0000C0, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000C8, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull, Temp_struct_Variable) == 0x0000D0, "Member 'Prop_wendSkull_C_ExecuteUbergraph_prop_wendSkull::Temp_struct_Variable' has a wrong offset!");

// Function prop_wendSkull.prop_wendSkull_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Prop_wendSkull_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_wendSkull_C_Ignite) == 0x000004, "Wrong alignment on Prop_wendSkull_C_Ignite");
static_assert(sizeof(Prop_wendSkull_C_Ignite) == 0x000004, "Wrong size on Prop_wendSkull_C_Ignite");
static_assert(offsetof(Prop_wendSkull_C_Ignite, Fuel) == 0x000000, "Member 'Prop_wendSkull_C_Ignite::Fuel' has a wrong offset!");

}

