#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_teleportChamber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_teleportChamber.prop_teleportChamber_C.ExecuteUbergraph_prop_teleportChamber
// 0x0090 (0x0090 - 0x0000)
struct Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_gravgun_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_shSign_C*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber) == 0x000010, "Wrong alignment on Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber");
static_assert(sizeof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber) == 0x000090, "Wrong size on Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, EntryPoint) == 0x000000, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000050, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000080, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000088, "Member 'Prop_teleportChamber_C_ExecuteUbergraph_prop_teleportChamber::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

}

