#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_corkboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_corkboard.prop_corkboard_C.ExecuteUbergraph_prop_corkboard
// 0x0440 (0x0440 - 0x0000)
struct Prop_corkboard_C_ExecuteUbergraph_prop_corkboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_tryStick_OutHit;                          // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_tryStick_OutHit_1;                        // 0x0184(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E[0x2];                                      // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x030E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30F[0x1];                                      // 0x030F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue_1;        // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0360(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA[0x2];                                      // 0x03EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0410(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard) == 0x000010, "Wrong alignment on Prop_corkboard_C_ExecuteUbergraph_prop_corkboard");
static_assert(sizeof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard) == 0x000440, "Wrong size on Prop_corkboard_C_ExecuteUbergraph_prop_corkboard");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, EntryPoint) == 0x000000, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_GetActorRightVector_ReturnValue) == 0x000004, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_TLerp_ReturnValue) == 0x000040, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000070, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000F8, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_tryStick_OutHit) == 0x0000FC, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_tryStick_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_tryStick_OutHit_1) == 0x000184, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_tryStick_OutHit_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_bBlockingHit) == 0x00020C, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_bInitialOverlap) == 0x00020D, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Time) == 0x000210, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Distance) == 0x000214, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Location) == 0x000218, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_ImpactPoint) == 0x000224, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Normal) == 0x000230, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_ImpactNormal) == 0x00023C, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_PhysMat) == 0x000248, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitActor) == 0x000250, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitComponent) == 0x000258, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitBoneName) == 0x000260, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitItem) == 0x000268, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_ElementIndex) == 0x00026C, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_FaceIndex) == 0x000270, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_TraceStart) == 0x000274, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_TraceEnd) == 0x000280, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00028C, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00028D, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Time_1) == 0x000290, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Distance_1) == 0x000294, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Location_1) == 0x000298, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0002A4, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_Normal_1) == 0x0002B0, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0002BC, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_PhysMat_1) == 0x0002C8, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitActor_1) == 0x0002D0, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitComponent_1) == 0x0002D8, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitBoneName_1) == 0x0002E0, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_HitItem_1) == 0x0002E8, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_ElementIndex_1) == 0x0002EC, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_FaceIndex_1) == 0x0002F0, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_TraceStart_1) == 0x0002F4, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BreakHitResult_TraceEnd_1) == 0x000300, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_IsValid_ReturnValue) == 0x00030C, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_IsValid_ReturnValue_1) == 0x00030D, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_IsSimulatingPhysics_ReturnValue) == 0x00030E, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_IsSimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Dot_VectorVector_ReturnValue) == 0x000310, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Not_PreBool_ReturnValue) == 0x000314, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_SignOfFloat_ReturnValue) == 0x000318, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BooleanAND_ReturnValue) == 0x00031C, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000320, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_MakeVector_ReturnValue) == 0x000324, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Abs_ReturnValue) == 0x000330, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000334, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000340, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000344, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_IsSimulatingPhysics_ReturnValue_1) == 0x000350, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_IsSimulatingPhysics_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_Not_PreBool_ReturnValue_1) == 0x000351, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_BooleanAND_ReturnValue_1) == 0x000352, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_Event_static) == 0x000353, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_Event_frozen) == 0x000354, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_Event_active) == 0x000355, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_Event_player) == 0x000358, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_Event_hit) == 0x000360, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_Event_action) == 0x0003E8, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, K2Node_SwitchEnum_CmpSuccess) == 0x0003E9, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_GetActorUpVector_ReturnValue) == 0x0003EC, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0003F8, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_SelectRotator_ReturnValue) == 0x000404, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ExecuteUbergraph_prop_corkboard, CallFunc_MakeTransform_ReturnValue) == 0x000410, "Member 'Prop_corkboard_C_ExecuteUbergraph_prop_corkboard::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function prop_corkboard.prop_corkboard_C.tryStick
// 0x0180 (0x0180 - 0x0000)
struct Prop_corkboard_C_TryStick final
{
public:
	struct FHitResult                             OutHit;                                            // 0x0000(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0088(0x0010)(ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x00F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_corkboard_C_TryStick) == 0x000008, "Wrong alignment on Prop_corkboard_C_TryStick");
static_assert(sizeof(Prop_corkboard_C_TryStick) == 0x000180, "Wrong size on Prop_corkboard_C_TryStick");
static_assert(offsetof(Prop_corkboard_C_TryStick, OutHit) == 0x000000, "Member 'Prop_corkboard_C_TryStick::OutHit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_obj_statDyn_obj) == 0x000088, "Member 'Prop_corkboard_C_TryStick::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, Temp_object_Variable) == 0x000098, "Member 'Prop_corkboard_C_TryStick::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'Prop_corkboard_C_TryStick::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_GetForwardVector_ReturnValue) == 0x0000B4, "Member 'Prop_corkboard_C_TryStick::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C0, "Member 'Prop_corkboard_C_TryStick::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000CC, "Member 'Prop_corkboard_C_TryStick::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'Prop_corkboard_C_TryStick::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000E4, "Member 'Prop_corkboard_C_TryStick::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0000F0, "Member 'Prop_corkboard_C_TryStick::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_TryStick, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000178, "Member 'Prop_corkboard_C_TryStick::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function prop_corkboard.prop_corkboard_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_corkboard_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_corkboard_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_corkboard_C_ActionOptionIndex");
static_assert(sizeof(Prop_corkboard_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_corkboard_C_ActionOptionIndex");
static_assert(offsetof(Prop_corkboard_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_corkboard_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_corkboard_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_corkboard_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_corkboard.prop_corkboard_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Prop_corkboard_C_SetPropProps final
{
public:
	bool                                          Param_Static;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_Frozen;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_corkboard_C_SetPropProps) == 0x000001, "Wrong alignment on Prop_corkboard_C_SetPropProps");
static_assert(sizeof(Prop_corkboard_C_SetPropProps) == 0x000003, "Wrong size on Prop_corkboard_C_SetPropProps");
static_assert(offsetof(Prop_corkboard_C_SetPropProps, Param_Static) == 0x000000, "Member 'Prop_corkboard_C_SetPropProps::Param_Static' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_SetPropProps, Param_Frozen) == 0x000001, "Member 'Prop_corkboard_C_SetPropProps::Param_Frozen' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_SetPropProps, Active) == 0x000002, "Member 'Prop_corkboard_C_SetPropProps::Active' has a wrong offset!");

// Function prop_corkboard.prop_corkboard_C.lookAt
// 0x00B8 (0x00B8 - 0x0000)
struct Prop_corkboard_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_corkboard_C_LookAt) == 0x000008, "Wrong alignment on Prop_corkboard_C_LookAt");
static_assert(sizeof(Prop_corkboard_C_LookAt) == 0x0000B8, "Wrong size on Prop_corkboard_C_LookAt");
static_assert(offsetof(Prop_corkboard_C_LookAt, Player) == 0x000000, "Member 'Prop_corkboard_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_corkboard_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_LookAt, Return) == 0x000090, "Member 'Prop_corkboard_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_LookAt, Text) == 0x000098, "Member 'Prop_corkboard_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_corkboard_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_LookAt, Number) == 0x0000B0, "Member 'Prop_corkboard_C_LookAt::Number' has a wrong offset!");

// Function prop_corkboard.prop_corkboard_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_corkboard_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_corkboard_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_corkboard_C_GetActionOptions");
static_assert(sizeof(Prop_corkboard_C_GetActionOptions) == 0x000060, "Wrong size on Prop_corkboard_C_GetActionOptions");
static_assert(offsetof(Prop_corkboard_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_corkboard_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_corkboard_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_corkboard_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_corkboard_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_corkboard_C_GetActionOptions::Options' has a wrong offset!");
