#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_heater

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_heater.prop_heater_C
// 0x0018 (0x0390 - 0x0378)
class AProp_heater_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_heater_C;                      // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USlapperSummoner_C*                     SlapperSummoner;                                   // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_heater(int32 EntryPoint);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, Enum_interactionActions Action);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_heater_C">();
	}
	static class AProp_heater_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_heater_C>();
	}
};
static_assert(alignof(AProp_heater_C) == 0x000008, "Wrong alignment on AProp_heater_C");
static_assert(sizeof(AProp_heater_C) == 0x000390, "Wrong size on AProp_heater_C");
static_assert(offsetof(AProp_heater_C, UberGraphFrame_Prop_heater_C) == 0x000378, "Member 'AProp_heater_C::UberGraphFrame_Prop_heater_C' has a wrong offset!");
static_assert(offsetof(AProp_heater_C, Audio) == 0x000380, "Member 'AProp_heater_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_heater_C, SlapperSummoner) == 0x000388, "Member 'AProp_heater_C::SlapperSummoner' has a wrong offset!");

}

