#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_gascan

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_gascan.prop_gascan_C
// 0x0020 (0x0388 - 0x0368)
class AProp_gascan_C : public AProp_C
{
public:
	uint8                                         Pad_2804[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_gascan_C;                      // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Amount;                                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x037C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_gascan(int32 EntryPoint);
	void BndEvt__prop_gascan_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Param_Hit);
	void broken_fire();
	void broken();
	void PlayerHandUse_LMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Param_Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_gascan_C">();
	}
	static class AProp_gascan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_gascan_C>();
	}
};
static_assert(alignof(AProp_gascan_C) == 0x000008, "Wrong alignment on AProp_gascan_C");
static_assert(sizeof(AProp_gascan_C) == 0x000388, "Wrong size on AProp_gascan_C");
static_assert(offsetof(AProp_gascan_C, UberGraphFrame_Prop_gascan_C) == 0x000368, "Member 'AProp_gascan_C::UberGraphFrame_Prop_gascan_C' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, Billboard) == 0x000370, "Member 'AProp_gascan_C::Billboard' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, Amount) == 0x000378, "Member 'AProp_gascan_C::Amount' has a wrong offset!");
static_assert(offsetof(AProp_gascan_C, Impulse) == 0x00037C, "Member 'AProp_gascan_C::Impulse' has a wrong offset!");

}

