#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_spookyPumpkin

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_spookyPumpkin.prop_spookyPumpkin_C.ExecuteUbergraph_prop_spookyPumpkin
// 0x0108 (0x0108 - 0x0000)
struct Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_check_return;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin) == 0x000008, "Wrong alignment on Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin");
static_assert(sizeof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin) == 0x000108, "Wrong size on Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, EntryPoint) == 0x000000, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, Temp_int_Variable) == 0x000004, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000018, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000060, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, CallFunc_check_return) == 0x000069, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::CallFunc_check_return' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, K2Node_Event_player) == 0x000070, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, K2Node_Event_hit) == 0x000078, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, K2Node_Event_action) == 0x000100, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin, K2Node_SwitchEnum_CmpSuccess) == 0x000101, "Member 'Prop_spookyPumpkin_C_ExecuteUbergraph_prop_spookyPumpkin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function prop_spookyPumpkin.prop_spookyPumpkin_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_spookyPumpkin_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_spookyPumpkin_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_spookyPumpkin_C_ActionOptionIndex");
static_assert(sizeof(Prop_spookyPumpkin_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_spookyPumpkin_C_ActionOptionIndex");
static_assert(offsetof(Prop_spookyPumpkin_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_spookyPumpkin_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_spookyPumpkin_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_spookyPumpkin_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_spookyPumpkin.prop_spookyPumpkin_C.lookAt
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_spookyPumpkin_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_spookyPumpkin_C_LookAt) == 0x000008, "Wrong alignment on Prop_spookyPumpkin_C_LookAt");
static_assert(sizeof(Prop_spookyPumpkin_C_LookAt) == 0x0000E0, "Wrong size on Prop_spookyPumpkin_C_LookAt");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, Player) == 0x000000, "Member 'Prop_spookyPumpkin_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, Param_Hit) == 0x000008, "Member 'Prop_spookyPumpkin_C_LookAt::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, Return) == 0x000090, "Member 'Prop_spookyPumpkin_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, Text) == 0x000098, "Member 'Prop_spookyPumpkin_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Prop_spookyPumpkin_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, Number) == 0x0000B0, "Member 'Prop_spookyPumpkin_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'Prop_spookyPumpkin_C_LookAt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'Prop_spookyPumpkin_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function prop_spookyPumpkin.prop_spookyPumpkin_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_spookyPumpkin_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_spookyPumpkin_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_spookyPumpkin_C_GetActionOptions");
static_assert(sizeof(Prop_spookyPumpkin_C_GetActionOptions) == 0x000060, "Wrong size on Prop_spookyPumpkin_C_GetActionOptions");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_spookyPumpkin_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_spookyPumpkin_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_spookyPumpkin_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_spookyPumpkin_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_spookyPumpkin_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_spookyPumpkin_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_spookyPumpkin_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_spookyPumpkin_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_spookyPumpkin_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

