#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_auuwoaa

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_auuwoaa.prop_auuwoaa_C.ExecuteUbergraph_prop_auuwoaa
// 0x011C (0x011C - 0x0000)
struct Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39B0[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_Constant_ReturnValue;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa) == 0x000004, "Wrong alignment on Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa");
static_assert(sizeof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa) == 0x00011C, "Wrong size on Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, EntryPoint) == 0x000000, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_GetActorUpVector_ReturnValue) == 0x000004, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_GetActorUpVector_ReturnValue_1) == 0x000014, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Dot_VectorVector_ReturnValue) == 0x00002C, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Abs_ReturnValue) == 0x000034, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_SelectRotator_ReturnValue) == 0x000038, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Lerp_ReturnValue) == 0x000044, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_GetForwardVector_ReturnValue) == 0x00004C, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_RInterpTo_Constant_ReturnValue) == 0x000058, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_RInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000064, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_BreakRotator_Roll_1) == 0x000068, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_BreakRotator_Pitch_1) == 0x00006C, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_BreakRotator_Yaw_1) == 0x000070, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000074, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000078, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00007C, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Abs_ReturnValue_1) == 0x000080, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Lerp_ReturnValue_1) == 0x000084, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000088, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_FClamp_ReturnValue) == 0x00008C, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000090, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa, K2Node_Event_DeltaSeconds) == 0x000118, "Member 'Prop_auuwoaa_C_ExecuteUbergraph_prop_auuwoaa::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function prop_auuwoaa.prop_auuwoaa_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_auuwoaa_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_auuwoaa_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_auuwoaa_C_ReceiveTick");
static_assert(sizeof(Prop_auuwoaa_C_ReceiveTick) == 0x000004, "Wrong size on Prop_auuwoaa_C_ReceiveTick");
static_assert(offsetof(Prop_auuwoaa_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_auuwoaa_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

