#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_glowstick_rb

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Prop_glowstick_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_glowstick_rb.prop_glowstick_rb_C
// 0x0020 (0x0410 - 0x03F0)
class AProp_glowstick_rb_C final : public AProp_glowstick_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_glowstick_rb_C;                // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           Color;                                             // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_glowstick_rb(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_glowstick_rb_C">();
	}
	static class AProp_glowstick_rb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_glowstick_rb_C>();
	}
};
static_assert(alignof(AProp_glowstick_rb_C) == 0x000010, "Wrong alignment on AProp_glowstick_rb_C");
static_assert(sizeof(AProp_glowstick_rb_C) == 0x000410, "Wrong size on AProp_glowstick_rb_C");
static_assert(offsetof(AProp_glowstick_rb_C, UberGraphFrame_Prop_glowstick_rb_C) == 0x0003F0, "Member 'AProp_glowstick_rb_C::UberGraphFrame_Prop_glowstick_rb_C' has a wrong offset!");
static_assert(offsetof(AProp_glowstick_rb_C, Color) == 0x0003F8, "Member 'AProp_glowstick_rb_C::Color' has a wrong offset!");
static_assert(offsetof(AProp_glowstick_rb_C, Dynmat) == 0x000408, "Member 'AProp_glowstick_rb_C::Dynmat' has a wrong offset!");

}

