#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_modelmanipulator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_modelmanipulator.prop_modelmanipulator_C.ExecuteUbergraph_prop_modelmanipulator
// 0x0370 (0x0370 - 0x0000)
struct Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F0(0x0018)()
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x019D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component_1;      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EComponentMobility                            K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24B[0x5];                                      // 0x024B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0250(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0268(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02B8(0x0018)()
	class AProp_C*                                K2Node_DynamicCast_AsProp_1;                       // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x02E0(0x0018)()
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0300(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0340(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0350(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator) == 0x000008, "Wrong alignment on Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator");
static_assert(sizeof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator) == 0x000370, "Wrong size on Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, EntryPoint) == 0x000000, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000020, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeArray_Array) == 0x0000B8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Format_ReturnValue_1) == 0x0000F0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_Event_player_1) == 0x000108, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_Event_player) == 0x000110, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Location) == 0x000124, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_ImpactPoint) == 0x000130, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Normal) == 0x00013C, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_ImpactNormal) == 0x000148, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_PhysMat) == 0x000158, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitActor) == 0x000160, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitComponent) == 0x000168, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitBoneName) == 0x000170, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitItem) == 0x000178, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_ElementIndex) == 0x00017C, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_FaceIndex) == 0x000180, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_TraceStart) == 0x000184, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_TraceEnd) == 0x000190, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00019C, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00019D, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Time_1) == 0x0001A0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Distance_1) == 0x0001A4, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Location_1) == 0x0001A8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0001B4, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_Normal_1) == 0x0001C0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0001CC, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_PhysMat_1) == 0x0001D8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitActor_1) == 0x0001E0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitComponent_1) == 0x0001E8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitBoneName_1) == 0x0001F0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_HitItem_1) == 0x0001F8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_ElementIndex_1) == 0x0001FC, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_FaceIndex_1) == 0x000200, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_TraceStart_1) == 0x000204, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_BreakHitResult_TraceEnd_1) == 0x000210, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000220, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_AsStatic_Mesh_Component_1) == 0x000230, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_AsStatic_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_bSuccess_1) == 0x000238, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_AsProp) == 0x000240, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_bSuccess_2) == 0x000248, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000249, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00024A, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000250, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeStruct_FormatArgumentData_2) == 0x000268, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeArray_Array_2) == 0x0002A8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Format_ReturnValue_2) == 0x0002B8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_AsProp_1) == 0x0002D0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_AsProp_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_DynamicCast_bSuccess_3) == 0x0002D8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0002E0, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_SetStaticMesh_ReturnValue) == 0x0002F8, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeStruct_FormatArgumentData_3) == 0x000300, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, K2Node_MakeArray_Array_3) == 0x000340, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_Format_ReturnValue_3) == 0x000350, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator, CallFunc_IsValid_ReturnValue) == 0x000368, "Member 'Prop_modelmanipulator_C_ExecuteUbergraph_prop_modelmanipulator::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function prop_modelmanipulator.prop_modelmanipulator_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_modelmanipulator_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_modelmanipulator_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_modelmanipulator_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_modelmanipulator_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_modelmanipulator_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_modelmanipulator_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_modelmanipulator_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_modelmanipulator.prop_modelmanipulator_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_modelmanipulator_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_modelmanipulator_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_modelmanipulator_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_modelmanipulator_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_modelmanipulator_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_modelmanipulator_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_modelmanipulator_C_PlayerHandUse_RMB::Player' has a wrong offset!");

}

