#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_snack

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_snack.prop_snack_C.ExecuteUbergraph_prop_snack
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_snack_C_ExecuteUbergraph_prop_snack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_ExecuteUbergraph_prop_snack) == 0x000008, "Wrong alignment on Prop_snack_C_ExecuteUbergraph_prop_snack");
static_assert(sizeof(Prop_snack_C_ExecuteUbergraph_prop_snack) == 0x0000A8, "Wrong size on Prop_snack_C_ExecuteUbergraph_prop_snack");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, EntryPoint) == 0x000000, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_player) == 0x000008, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_hit) == 0x000010, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_action) == 0x000098, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_SwitchEnum_CmpSuccess) == 0x000099, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ExecuteUbergraph_prop_snack, K2Node_Event_player_1) == 0x0000A0, "Member 'Prop_snack_C_ExecuteUbergraph_prop_snack::K2Node_Event_player_1' has a wrong offset!");

// Function prop_snack.prop_snack_C.eat
// 0x0080 (0x0080 - 0x0000)
struct Prop_snack_C_Eat final
{
public:
	class AMainPlayer_C*                          P;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bypassNoHunger;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          B;                                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 A;                                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_collectObject_collected;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_addFood_full;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_Eat) == 0x000010, "Wrong alignment on Prop_snack_C_Eat");
static_assert(sizeof(Prop_snack_C_Eat) == 0x000080, "Wrong size on Prop_snack_C_Eat");
static_assert(offsetof(Prop_snack_C_Eat, P) == 0x000000, "Member 'Prop_snack_C_Eat::P' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, bypassNoHunger) == 0x000008, "Member 'Prop_snack_C_Eat::bypassNoHunger' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, B) == 0x000009, "Member 'Prop_snack_C_Eat::B' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, A) == 0x000010, "Member 'Prop_snack_C_Eat::A' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, Temp_int_Variable) == 0x000018, "Member 'Prop_snack_C_Eat::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_getMainPlayer_AsMain_Player) == 0x000020, "Member 'Prop_snack_C_Eat::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'Prop_snack_C_Eat::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_collectObject_collected) == 0x000029, "Member 'Prop_snack_C_Eat::CallFunc_collectObject_collected' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_addFood_full) == 0x00002A, "Member 'Prop_snack_C_Eat::CallFunc_addFood_full' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Prop_snack_C_Eat::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'Prop_snack_C_Eat::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'Prop_snack_C_Eat::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'Prop_snack_C_Eat::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_Eat, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'Prop_snack_C_Eat::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function prop_snack.prop_snack_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Prop_snack_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Prop_snack_C_ActionOptionIndex");
static_assert(sizeof(Prop_snack_C_ActionOptionIndex) == 0x000098, "Wrong size on Prop_snack_C_ActionOptionIndex");
static_assert(offsetof(Prop_snack_C_ActionOptionIndex, Player) == 0x000000, "Member 'Prop_snack_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ActionOptionIndex, Param_Hit) == 0x000008, "Member 'Prop_snack_C_ActionOptionIndex::Param_Hit' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_ActionOptionIndex, Action) == 0x000090, "Member 'Prop_snack_C_ActionOptionIndex::Action' has a wrong offset!");

// Function prop_snack.prop_snack_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_snack_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_snack_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_snack_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_snack_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_snack_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_snack_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_snack.prop_snack_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_snack_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_LoadData) == 0x000010, "Wrong alignment on Prop_snack_C_LoadData");
static_assert(sizeof(Prop_snack_C_LoadData) == 0x0000E0, "Wrong size on Prop_snack_C_LoadData");
static_assert(offsetof(Prop_snack_C_LoadData, Data) == 0x000000, "Member 'Prop_snack_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, Return) == 0x0000C0, "Member 'Prop_snack_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_snack_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_snack_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_snack_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_snack.prop_snack_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_snack_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_snack_C_GetData) == 0x000010, "Wrong alignment on Prop_snack_C_GetData");
static_assert(sizeof(Prop_snack_C_GetData) == 0x000270, "Wrong size on Prop_snack_C_GetData");
static_assert(offsetof(Prop_snack_C_GetData, Data) == 0x000000, "Member 'Prop_snack_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_snack_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_snack_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_snack_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_snack_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_snack_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function prop_snack.prop_snack_C.getActionOptions
// 0x0060 (0x0060 - 0x0000)
struct Prop_snack_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(Prop_snack_C_GetActionOptions) == 0x000008, "Wrong alignment on Prop_snack_C_GetActionOptions");
static_assert(sizeof(Prop_snack_C_GetActionOptions) == 0x000060, "Wrong size on Prop_snack_C_GetActionOptions");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Player) == 0x000000, "Member 'Prop_snack_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Component) == 0x000008, "Member 'Prop_snack_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Actor) == 0x000010, "Member 'Prop_snack_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Options) == 0x000018, "Member 'Prop_snack_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Prop_snack_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Prop_snack_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, Number) == 0x000048, "Member 'Prop_snack_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Prop_snack_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000050, "Member 'Prop_snack_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

}

