#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_erieHold

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_erieHold.prop_erieHold_C
// 0x0028 (0x03A0 - 0x0378)
class AProp_erieHold_C : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_erieHold_C;                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NPC;                                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Throw;                                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rep;                                               // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_erieHold(int32 EntryPoint);
	void ReceiveBeginPlay();
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GetData(struct FStruct_save* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_erieHold_C">();
	}
	static class AProp_erieHold_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_erieHold_C>();
	}
};
static_assert(alignof(AProp_erieHold_C) == 0x000008, "Wrong alignment on AProp_erieHold_C");
static_assert(sizeof(AProp_erieHold_C) == 0x0003A0, "Wrong size on AProp_erieHold_C");
static_assert(offsetof(AProp_erieHold_C, UberGraphFrame_Prop_erieHold_C) == 0x000378, "Member 'AProp_erieHold_C::UberGraphFrame_Prop_erieHold_C' has a wrong offset!");
static_assert(offsetof(AProp_erieHold_C, SkeletalMesh) == 0x000380, "Member 'AProp_erieHold_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AProp_erieHold_C, NPC) == 0x000388, "Member 'AProp_erieHold_C::NPC' has a wrong offset!");
static_assert(offsetof(AProp_erieHold_C, Throw) == 0x000390, "Member 'AProp_erieHold_C::Throw' has a wrong offset!");
static_assert(offsetof(AProp_erieHold_C, Rep) == 0x000398, "Member 'AProp_erieHold_C::Rep' has a wrong offset!");

}

