#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_greenfireStone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_greenfireStone.prop_greenfireStone_C
// 0x0020 (0x0398 - 0x0378)
class AProp_greenfireStone_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_greenfireStone_C;              // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPnormal_C*                             Pnormal;                                           // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_burningC1;                                     // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_greenfireStone(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_greenfireStone_C">();
	}
	static class AProp_greenfireStone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_greenfireStone_C>();
	}
};
static_assert(alignof(AProp_greenfireStone_C) == 0x000008, "Wrong alignment on AProp_greenfireStone_C");
static_assert(sizeof(AProp_greenfireStone_C) == 0x000398, "Wrong size on AProp_greenfireStone_C");
static_assert(offsetof(AProp_greenfireStone_C, UberGraphFrame_Prop_greenfireStone_C) == 0x000378, "Member 'AProp_greenfireStone_C::UberGraphFrame_Prop_greenfireStone_C' has a wrong offset!");
static_assert(offsetof(AProp_greenfireStone_C, Pnormal) == 0x000380, "Member 'AProp_greenfireStone_C::Pnormal' has a wrong offset!");
static_assert(offsetof(AProp_greenfireStone_C, PointLight) == 0x000388, "Member 'AProp_greenfireStone_C::PointLight' has a wrong offset!");
static_assert(offsetof(AProp_greenfireStone_C, Eff_burningC1) == 0x000390, "Member 'AProp_greenfireStone_C::Eff_burningC1' has a wrong offset!");

}

