#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_blueprint_kerfurOmega

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_blueprint_kerfurOmega.prop_blueprint_kerfurOmega_C.ignoreSave
// 0x0001 (0x0001 - 0x0000)
struct Prop_blueprint_kerfurOmega_C_IgnoreSave final
{
public:
	bool                                          Param_IgnoreSave;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_blueprint_kerfurOmega_C_IgnoreSave) == 0x000001, "Wrong alignment on Prop_blueprint_kerfurOmega_C_IgnoreSave");
static_assert(sizeof(Prop_blueprint_kerfurOmega_C_IgnoreSave) == 0x000001, "Wrong size on Prop_blueprint_kerfurOmega_C_IgnoreSave");
static_assert(offsetof(Prop_blueprint_kerfurOmega_C_IgnoreSave, Param_IgnoreSave) == 0x000000, "Member 'Prop_blueprint_kerfurOmega_C_IgnoreSave::Param_IgnoreSave' has a wrong offset!");

// Function prop_blueprint_kerfurOmega.prop_blueprint_kerfurOmega_C.skipPreDelete
// 0x0001 (0x0001 - 0x0000)
struct Prop_blueprint_kerfurOmega_C_SkipPreDelete final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_blueprint_kerfurOmega_C_SkipPreDelete) == 0x000001, "Wrong alignment on Prop_blueprint_kerfurOmega_C_SkipPreDelete");
static_assert(sizeof(Prop_blueprint_kerfurOmega_C_SkipPreDelete) == 0x000001, "Wrong size on Prop_blueprint_kerfurOmega_C_SkipPreDelete");
static_assert(offsetof(Prop_blueprint_kerfurOmega_C_SkipPreDelete, Skip) == 0x000000, "Member 'Prop_blueprint_kerfurOmega_C_SkipPreDelete::Skip' has a wrong offset!");

}

