#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_camera_cursed

#include "Basic.hpp"


namespace SDK::Params
{

// Function prop_camera_cursed.prop_camera_cursed_C.gatherDataFromKey
// 0x0001 (0x0001 - 0x0000)
struct Prop_camera_cursed_C_GatherDataFromKey final
{
public:
	bool                                          Gather;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_camera_cursed_C_GatherDataFromKey) == 0x000001, "Wrong alignment on Prop_camera_cursed_C_GatherDataFromKey");
static_assert(sizeof(Prop_camera_cursed_C_GatherDataFromKey) == 0x000001, "Wrong size on Prop_camera_cursed_C_GatherDataFromKey");
static_assert(offsetof(Prop_camera_cursed_C_GatherDataFromKey, Gather) == 0x000000, "Member 'Prop_camera_cursed_C_GatherDataFromKey::Gather' has a wrong offset!");

// Function prop_camera_cursed.prop_camera_cursed_C.ignoreSave
// 0x0001 (0x0001 - 0x0000)
struct Prop_camera_cursed_C_IgnoreSave final
{
public:
	bool                                          Param_IgnoreSave;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_camera_cursed_C_IgnoreSave) == 0x000001, "Wrong alignment on Prop_camera_cursed_C_IgnoreSave");
static_assert(sizeof(Prop_camera_cursed_C_IgnoreSave) == 0x000001, "Wrong size on Prop_camera_cursed_C_IgnoreSave");
static_assert(offsetof(Prop_camera_cursed_C_IgnoreSave, Param_IgnoreSave) == 0x000000, "Member 'Prop_camera_cursed_C_IgnoreSave::Param_IgnoreSave' has a wrong offset!");

// Function prop_camera_cursed.prop_camera_cursed_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Prop_camera_cursed_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_camera_cursed_C_ReceiveTick) == 0x000004, "Wrong alignment on Prop_camera_cursed_C_ReceiveTick");
static_assert(sizeof(Prop_camera_cursed_C_ReceiveTick) == 0x000004, "Wrong size on Prop_camera_cursed_C_ReceiveTick");
static_assert(offsetof(Prop_camera_cursed_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Prop_camera_cursed_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function prop_camera_cursed.prop_camera_cursed_C.ExecuteUbergraph_prop_camera_cursed
// 0x0068 (0x0068 - 0x0000)
struct Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x0010(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BytesToStringUtf8_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RegexReplace_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed) == 0x000008, "Wrong alignment on Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed");
static_assert(sizeof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed) == 0x000068, "Wrong size on Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, EntryPoint) == 0x000000, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000008, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_GenerateRandomBytes_ByteArray) == 0x000010, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000020, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_BytesToStringUtf8_ReturnValue) == 0x000028, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_BytesToStringUtf8_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_RegexReplace_ReturnValue) == 0x000038, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_RegexReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'Prop_camera_cursed_C_ExecuteUbergraph_prop_camera_cursed::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

