#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_garbageBag

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_garbageBag.prop_garbageBag_C.ExecuteUbergraph_prop_garbageBag
// 0x0060 (0x0060 - 0x0000)
struct Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39DC[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_garbageClump_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag) == 0x000010, "Wrong alignment on Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag");
static_assert(sizeof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag) == 0x000060, "Wrong size on Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag");
static_assert(offsetof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag, EntryPoint) == 0x000000, "Member 'Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag, CallFunc_GetComponentVelocity_ReturnValue) == 0x000004, "Member 'Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Prop_garbageBag_C_ExecuteUbergraph_prop_garbageBag::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_garbageBag.prop_garbageBag_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_garbageBag_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39DD[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBag_C_LoadData) == 0x000010, "Wrong alignment on Prop_garbageBag_C_LoadData");
static_assert(sizeof(Prop_garbageBag_C_LoadData) == 0x0000E0, "Wrong size on Prop_garbageBag_C_LoadData");
static_assert(offsetof(Prop_garbageBag_C_LoadData, Data) == 0x000000, "Member 'Prop_garbageBag_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_LoadData, Return) == 0x0000C0, "Member 'Prop_garbageBag_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_garbageBag_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_garbageBag_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_garbageBag_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_garbageBag.prop_garbageBag_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_garbageBag_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_garbageBag_C_GetData) == 0x000010, "Wrong alignment on Prop_garbageBag_C_GetData");
static_assert(sizeof(Prop_garbageBag_C_GetData) == 0x000270, "Wrong size on Prop_garbageBag_C_GetData");
static_assert(offsetof(Prop_garbageBag_C_GetData, Data) == 0x000000, "Member 'Prop_garbageBag_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_garbageBag_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_garbageBag_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_garbageBag_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_garbageBag_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_garbageBag_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_garbageBag_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

