#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_erieGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_erieGun.prop_erieGun_C
// 0x0018 (0x0390 - 0x0378)
class AProp_erieGun_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_erieGun_C;                     // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Shoot;                                             // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_prop_erieGun(int32 EntryPoint);
	void PlayerHandRelease_RMB(class AMainPlayer_C* Player);
	void PlayerHandUse_RMB(class AMainPlayer_C* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_erieGun_C">();
	}
	static class AProp_erieGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_erieGun_C>();
	}
};
static_assert(alignof(AProp_erieGun_C) == 0x000008, "Wrong alignment on AProp_erieGun_C");
static_assert(sizeof(AProp_erieGun_C) == 0x000390, "Wrong size on AProp_erieGun_C");
static_assert(offsetof(AProp_erieGun_C, UberGraphFrame_Prop_erieGun_C) == 0x000378, "Member 'AProp_erieGun_C::UberGraphFrame_Prop_erieGun_C' has a wrong offset!");
static_assert(offsetof(AProp_erieGun_C, Audio) == 0x000380, "Member 'AProp_erieGun_C::Audio' has a wrong offset!");
static_assert(offsetof(AProp_erieGun_C, Shoot) == 0x000388, "Member 'AProp_erieGun_C::Shoot' has a wrong offset!");

}

