#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_toiletPaperRoll

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_toiletPaperRoll.prop_toiletPaperRoll_C.ExecuteUbergraph_prop_toiletPaperRoll
// 0x0160 (0x0160 - 0x0000)
struct Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0068(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_clipboard_paperSheet_C*           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0154(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll) == 0x000010, "Wrong alignment on Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll");
static_assert(sizeof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll) == 0x000160, "Wrong size on Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, EntryPoint) == 0x000000, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, Temp_int_Variable) == 0x000040, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, K2Node_Event_player) == 0x000060, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, K2Node_Event_hit) == 0x000068, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F0, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_Add_VectorVector_ReturnValue) == 0x0000FC, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000140, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000148, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll, Temp_name_Variable) == 0x000154, "Member 'Prop_toiletPaperRoll_C_ExecuteUbergraph_prop_toiletPaperRoll::Temp_name_Variable' has a wrong offset!");

// Function prop_toiletPaperRoll.prop_toiletPaperRoll_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Prop_toiletPaperRoll_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_toiletPaperRoll_C_Player_use) == 0x000008, "Wrong alignment on Prop_toiletPaperRoll_C_Player_use");
static_assert(sizeof(Prop_toiletPaperRoll_C_Player_use) == 0x000090, "Wrong size on Prop_toiletPaperRoll_C_Player_use");
static_assert(offsetof(Prop_toiletPaperRoll_C_Player_use, Player) == 0x000000, "Member 'Prop_toiletPaperRoll_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_Player_use, Param_Hit) == 0x000008, "Member 'Prop_toiletPaperRoll_C_Player_use::Param_Hit' has a wrong offset!");

// Function prop_toiletPaperRoll.prop_toiletPaperRoll_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Prop_toiletPaperRoll_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mInt                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_toiletPaperRoll_C_LoadData) == 0x000010, "Wrong alignment on Prop_toiletPaperRoll_C_LoadData");
static_assert(sizeof(Prop_toiletPaperRoll_C_LoadData) == 0x0000E0, "Wrong size on Prop_toiletPaperRoll_C_LoadData");
static_assert(offsetof(Prop_toiletPaperRoll_C_LoadData, Data) == 0x000000, "Member 'Prop_toiletPaperRoll_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_LoadData, Return) == 0x0000C0, "Member 'Prop_toiletPaperRoll_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Prop_toiletPaperRoll_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Prop_toiletPaperRoll_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Prop_toiletPaperRoll_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_toiletPaperRoll.prop_toiletPaperRoll_C.getData
// 0x0270 (0x0270 - 0x0000)
struct Prop_toiletPaperRoll_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mInt                           K2Node_MakeStruct_struct_mInt;                     // 0x0190(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mInt>                   K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01B0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_toiletPaperRoll_C_GetData) == 0x000010, "Wrong alignment on Prop_toiletPaperRoll_C_GetData");
static_assert(sizeof(Prop_toiletPaperRoll_C_GetData) == 0x000270, "Wrong size on Prop_toiletPaperRoll_C_GetData");
static_assert(offsetof(Prop_toiletPaperRoll_C_GetData, Data) == 0x000000, "Member 'Prop_toiletPaperRoll_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_toiletPaperRoll_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_toiletPaperRoll_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_GetData, K2Node_MakeStruct_struct_mInt) == 0x000190, "Member 'Prop_toiletPaperRoll_C_GetData::K2Node_MakeStruct_struct_mInt' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_GetData, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'Prop_toiletPaperRoll_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_toiletPaperRoll_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001B0, "Member 'Prop_toiletPaperRoll_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

