#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_stickers

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function prop_stickers.prop_stickers_C.ExecuteUbergraph_prop_stickers
// 0x0260 (0x0260 - 0x0000)
struct Prop_stickers_C_ExecuteUbergraph_prop_stickers final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDynPhys_obj;                      // 0x0010(0x0010)(ReferenceParm)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start;                                // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0084(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_getKey_key;                               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default;                             // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASticker_C*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_stickers_C_ExecuteUbergraph_prop_stickers) == 0x000010, "Wrong alignment on Prop_stickers_C_ExecuteUbergraph_prop_stickers");
static_assert(sizeof(Prop_stickers_C_ExecuteUbergraph_prop_stickers) == 0x000260, "Wrong size on Prop_stickers_C_ExecuteUbergraph_prop_stickers");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, EntryPoint) == 0x000000, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_obj_statDynPhys_obj) == 0x000010, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_obj_statDynPhys_obj' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, K2Node_Event_player_1) == 0x000020, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Array_Get_Item) == 0x000028, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, Temp_object_Variable) == 0x000038, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, Temp_bool_Variable) == 0x000048, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000050, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, K2Node_Event_player) == 0x000058, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_GetActorForwardVector_ReturnValue) == 0x000060, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_arm_start) == 0x00006C, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_arm_end) == 0x000078, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000084, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x00010C, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_bBlockingHit) == 0x00010D, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_bInitialOverlap) == 0x00010E, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_Time) == 0x000110, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_Distance) == 0x000114, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_Location) == 0x000118, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_ImpactPoint) == 0x000124, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_Normal) == 0x000130, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_ImpactNormal) == 0x00013C, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_PhysMat) == 0x000148, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_HitActor) == 0x000150, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_HitComponent) == 0x000158, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_HitBoneName) == 0x000160, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_HitItem) == 0x000168, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_ElementIndex) == 0x00016C, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_FaceIndex) == 0x000170, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_TraceStart) == 0x000174, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BreakHitResult_TraceEnd) == 0x000180, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Dot_VectorVector_ReturnValue) == 0x00018C, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, K2Node_DynamicCast_AsInt_Objects) == 0x000190, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Abs_ReturnValue) == 0x0001A4, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_getKey_key) == 0x0001A8, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001B8, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001BC, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_DoesImplementInterface_ReturnValue) == 0x0001C0, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_MakeVector_ReturnValue) == 0x0001C4, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001D0, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001DC, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Cross_VectorVector_ReturnValue) == 0x0001E8, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001F4, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x000200, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, K2Node_Select_Default) == 0x00020C, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000250, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_ExecuteUbergraph_prop_stickers, CallFunc_FinishSpawningActor_ReturnValue) == 0x000258, "Member 'Prop_stickers_C_ExecuteUbergraph_prop_stickers::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_stickers.prop_stickers_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_stickers_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_stickers_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Prop_stickers_C_PlayerHandUse_LMB");
static_assert(sizeof(Prop_stickers_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Prop_stickers_C_PlayerHandUse_LMB");
static_assert(offsetof(Prop_stickers_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Prop_stickers_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function prop_stickers.prop_stickers_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Prop_stickers_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_stickers_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Prop_stickers_C_PlayerHandUse_RMB");
static_assert(sizeof(Prop_stickers_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Prop_stickers_C_PlayerHandUse_RMB");
static_assert(offsetof(Prop_stickers_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Prop_stickers_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function prop_stickers.prop_stickers_C.loadData
// 0x0110 (0x0110 - 0x0000)
struct Prop_stickers_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x00E0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_loadData_return;                          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_stickers_C_LoadData) == 0x000010, "Wrong alignment on Prop_stickers_C_LoadData");
static_assert(sizeof(Prop_stickers_C_LoadData) == 0x000110, "Wrong size on Prop_stickers_C_LoadData");
static_assert(offsetof(Prop_stickers_C_LoadData, Data) == 0x000000, "Member 'Prop_stickers_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_LoadData, Return) == 0x0000C0, "Member 'Prop_stickers_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_LoadData, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'Prop_stickers_C_LoadData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_LoadData, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'Prop_stickers_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_LoadData, CallFunc_loadData_return) == 0x0000F0, "Member 'Prop_stickers_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'Prop_stickers_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function prop_stickers.prop_stickers_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Prop_stickers_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mString                        K2Node_MakeStruct_struct_mString;                  // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mString                        CallFunc_Array_Get_Item;                           // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mString>                K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Prop_stickers_C_GetData) == 0x000010, "Wrong alignment on Prop_stickers_C_GetData");
static_assert(sizeof(Prop_stickers_C_GetData) == 0x000280, "Wrong size on Prop_stickers_C_GetData");
static_assert(offsetof(Prop_stickers_C_GetData, Data) == 0x000000, "Member 'Prop_stickers_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Prop_stickers_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Prop_stickers_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_GetData, K2Node_MakeStruct_struct_mString) == 0x000190, "Member 'Prop_stickers_C_GetData::K2Node_MakeStruct_struct_mString' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_GetData, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'Prop_stickers_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Prop_stickers_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Prop_stickers_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Prop_stickers_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

