#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_radBarrel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_radBarrel.prop_radBarrel_C
// 0x0018 (0x0390 - 0x0378)
class AProp_radBarrel_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_radBarrel_C;                   // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Droploc;                                           // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_radiation_C*                      RadComp;                                           // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_prop_radBarrel(int32 EntryPoint);
	void broken_fire();
	void broken();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_radBarrel_C">();
	}
	static class AProp_radBarrel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_radBarrel_C>();
	}
};
static_assert(alignof(AProp_radBarrel_C) == 0x000008, "Wrong alignment on AProp_radBarrel_C");
static_assert(sizeof(AProp_radBarrel_C) == 0x000390, "Wrong size on AProp_radBarrel_C");
static_assert(offsetof(AProp_radBarrel_C, UberGraphFrame_Prop_radBarrel_C) == 0x000378, "Member 'AProp_radBarrel_C::UberGraphFrame_Prop_radBarrel_C' has a wrong offset!");
static_assert(offsetof(AProp_radBarrel_C, Droploc) == 0x000380, "Member 'AProp_radBarrel_C::Droploc' has a wrong offset!");
static_assert(offsetof(AProp_radBarrel_C, RadComp) == 0x000388, "Member 'AProp_radBarrel_C::RadComp' has a wrong offset!");

}

