#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_flareGren

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function prop_flareGren.prop_flareGren_C.ExecuteUbergraph_prop_flareGren
// 0x0190 (0x0190 - 0x0000)
struct Prop_flareGren_C_ExecuteUbergraph_prop_flareGren final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x002C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren) == 0x000010, "Wrong alignment on Prop_flareGren_C_ExecuteUbergraph_prop_flareGren");
static_assert(sizeof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren) == 0x000190, "Wrong size on Prop_flareGren_C_ExecuteUbergraph_prop_flareGren");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, EntryPoint) == 0x000000, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, K2Node_ComponentBoundEvent_HitComponent) == 0x000008, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000020, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, K2Node_ComponentBoundEvent_Hit) == 0x00002C, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B4, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B5, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_Time) == 0x0000B8, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_Distance) == 0x0000BC, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_Location) == 0x0000C0, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_ImpactPoint) == 0x0000CC, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_Normal) == 0x0000D8, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E4, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_ElementIndex) == 0x000114, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_FaceIndex) == 0x000118, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_TraceStart) == 0x00011C, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BreakHitResult_TraceEnd) == 0x000128, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000134, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_Add_VectorVector_ReturnValue) == 0x000140, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000150, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_ExecuteUbergraph_prop_flareGren, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'Prop_flareGren_C_ExecuteUbergraph_prop_flareGren::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function prop_flareGren.prop_flareGren_C.BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Param_Hit;                                         // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Param_Hit) == 0x000024, "Member 'Prop_flareGren_C_BndEvt__prop_flareGren_StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Param_Hit' has a wrong offset!");

}

