#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_sitCouchL

#include "Basic.hpp"

#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_sitCouchL.prop_sitCouchL_C
// 0x0018 (0x0390 - 0x0378)
class AProp_sitCouchL_C final : public AProp_C
{
public:
	class UChildActorComponent*                   ChildActor2;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor1;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_sitCouchL_C">();
	}
	static class AProp_sitCouchL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_sitCouchL_C>();
	}
};
static_assert(alignof(AProp_sitCouchL_C) == 0x000008, "Wrong alignment on AProp_sitCouchL_C");
static_assert(sizeof(AProp_sitCouchL_C) == 0x000390, "Wrong size on AProp_sitCouchL_C");
static_assert(offsetof(AProp_sitCouchL_C, ChildActor2) == 0x000378, "Member 'AProp_sitCouchL_C::ChildActor2' has a wrong offset!");
static_assert(offsetof(AProp_sitCouchL_C, ChildActor1) == 0x000380, "Member 'AProp_sitCouchL_C::ChildActor1' has a wrong offset!");
static_assert(offsetof(AProp_sitCouchL_C, ChildActor) == 0x000388, "Member 'AProp_sitCouchL_C::ChildActor' has a wrong offset!");

}

