#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_dingusDies

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass prop_dingusDies.prop_dingusDies_C
// 0x00A0 (0x0418 - 0x0378)
class AProp_dingusDies_C final : public AProp_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_dingusDies_C;                  // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        DUDUDUWU_DUWU;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone17;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone16;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone15;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone14;                                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone13;                                            // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone12;                                            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone11;                                            // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone10;                                            // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone9;                                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone8;                                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone5;                                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   bone4;                                             // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bone3;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bone2;                                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bone1;                                             // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bone;                                              // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Gibs;                                              // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_prop_dingusDies(int32 EntryPoint);
	void BndEvt__prop_dingusDies_DUDUDUWU_DUWU_K2Node_ComponentBoundEvent_0_OnAudioFinished__DelegateSignature();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"prop_dingusDies_C">();
	}
	static class AProp_dingusDies_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_dingusDies_C>();
	}
};
static_assert(alignof(AProp_dingusDies_C) == 0x000008, "Wrong alignment on AProp_dingusDies_C");
static_assert(sizeof(AProp_dingusDies_C) == 0x000418, "Wrong size on AProp_dingusDies_C");
static_assert(offsetof(AProp_dingusDies_C, UberGraphFrame_Prop_dingusDies_C) == 0x000378, "Member 'AProp_dingusDies_C::UberGraphFrame_Prop_dingusDies_C' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, DUDUDUWU_DUWU) == 0x000380, "Member 'AProp_dingusDies_C::DUDUDUWU_DUWU' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone17) == 0x000388, "Member 'AProp_dingusDies_C::bone17' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone16) == 0x000390, "Member 'AProp_dingusDies_C::bone16' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone15) == 0x000398, "Member 'AProp_dingusDies_C::bone15' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone14) == 0x0003A0, "Member 'AProp_dingusDies_C::bone14' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone13) == 0x0003A8, "Member 'AProp_dingusDies_C::bone13' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone12) == 0x0003B0, "Member 'AProp_dingusDies_C::bone12' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone11) == 0x0003B8, "Member 'AProp_dingusDies_C::bone11' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone10) == 0x0003C0, "Member 'AProp_dingusDies_C::bone10' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone9) == 0x0003C8, "Member 'AProp_dingusDies_C::bone9' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone8) == 0x0003D0, "Member 'AProp_dingusDies_C::bone8' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone5) == 0x0003D8, "Member 'AProp_dingusDies_C::bone5' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, bone4) == 0x0003E0, "Member 'AProp_dingusDies_C::bone4' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, Bone3) == 0x0003E8, "Member 'AProp_dingusDies_C::Bone3' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, Bone2) == 0x0003F0, "Member 'AProp_dingusDies_C::Bone2' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, Bone1) == 0x0003F8, "Member 'AProp_dingusDies_C::Bone1' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, Bone) == 0x000400, "Member 'AProp_dingusDies_C::Bone' has a wrong offset!");
static_assert(offsetof(AProp_dingusDies_C, Gibs) == 0x000408, "Member 'AProp_dingusDies_C::Gibs' has a wrong offset!");

}

