#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Puddle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass puddle.puddle_C
// 0x0070 (0x0530 - 0x04C0)
class APuddle_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Detect;                                            // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Assigned;                                          // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Sink;                                              // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lastloc;                                           // 0x0500(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Target;                                            // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0518(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Event;                                             // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_puddle(int32 EntryPoint);
	void BndEvt__puddle_detect_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__puddle_detect_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Despawn();
	void Reset();
	void Move();
	void Jumped(bool Pressed);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnSuccess_DB80B4B54D91A2F3EB02A8911A22715E(EPathFollowingResult MovementResult);
	void OnFail_DB80B4B54D91A2F3EB02A8911A22715E(EPathFollowingResult MovementResult);
	void UserConstructionScript();
	void NewFunction_0();
	void Upd();
	class APawn* GetTarget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"puddle_C">();
	}
	static class APuddle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APuddle_C>();
	}
};
static_assert(alignof(APuddle_C) == 0x000010, "Wrong alignment on APuddle_C");
static_assert(sizeof(APuddle_C) == 0x000530, "Wrong size on APuddle_C");
static_assert(offsetof(APuddle_C, UberGraphFrame) == 0x0004C0, "Member 'APuddle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APuddle_C, Audio) == 0x0004C8, "Member 'APuddle_C::Audio' has a wrong offset!");
static_assert(offsetof(APuddle_C, Cylinder) == 0x0004D0, "Member 'APuddle_C::Cylinder' has a wrong offset!");
static_assert(offsetof(APuddle_C, Detect) == 0x0004D8, "Member 'APuddle_C::Detect' has a wrong offset!");
static_assert(offsetof(APuddle_C, Arrow1) == 0x0004E0, "Member 'APuddle_C::Arrow1' has a wrong offset!");
static_assert(offsetof(APuddle_C, Decal) == 0x0004E8, "Member 'APuddle_C::Decal' has a wrong offset!");
static_assert(offsetof(APuddle_C, Dynmat) == 0x0004F0, "Member 'APuddle_C::Dynmat' has a wrong offset!");
static_assert(offsetof(APuddle_C, Assigned) == 0x0004F8, "Member 'APuddle_C::Assigned' has a wrong offset!");
static_assert(offsetof(APuddle_C, Sink) == 0x0004FC, "Member 'APuddle_C::Sink' has a wrong offset!");
static_assert(offsetof(APuddle_C, Lastloc) == 0x000500, "Member 'APuddle_C::Lastloc' has a wrong offset!");
static_assert(offsetof(APuddle_C, Target) == 0x000510, "Member 'APuddle_C::Target' has a wrong offset!");
static_assert(offsetof(APuddle_C, Loc) == 0x000518, "Member 'APuddle_C::Loc' has a wrong offset!");
static_assert(offsetof(APuddle_C, Event) == 0x000524, "Member 'APuddle_C::Event' has a wrong offset!");

}

