#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PuffballExplosion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function puffballExplosion.puffballExplosion_C.ExecuteUbergraph_puffballExplosion
// 0x00A0 (0x00A0 - 0x0000)
struct PuffballExplosion_C_ExecuteUbergraph_puffballExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMushroomSpore_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion) == 0x000010, "Wrong alignment on PuffballExplosion_C_ExecuteUbergraph_puffballExplosion");
static_assert(sizeof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion) == 0x0000A0, "Wrong size on PuffballExplosion_C_ExecuteUbergraph_puffballExplosion");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, EntryPoint) == 0x000000, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::EntryPoint' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, Temp_int_Variable) == 0x000008, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_RandomUnitVector_ReturnValue) == 0x000020, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_RandomFloatInRange_ReturnValue) == 0x000060, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PuffballExplosion_C_ExecuteUbergraph_puffballExplosion, CallFunc_Add_VectorVector_ReturnValue) == 0x000088, "Member 'PuffballExplosion_C_ExecuteUbergraph_puffballExplosion::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

