#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PuffballExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass puffballExplosion.puffballExplosion_C
// 0x0028 (0x0248 - 0x0220)
class APuffballExplosion_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Flesh;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Far;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Close;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_puffballExplosion(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"puffballExplosion_C">();
	}
	static class APuffballExplosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APuffballExplosion_C>();
	}
};
static_assert(alignof(APuffballExplosion_C) == 0x000008, "Wrong alignment on APuffballExplosion_C");
static_assert(sizeof(APuffballExplosion_C) == 0x000248, "Wrong size on APuffballExplosion_C");
static_assert(offsetof(APuffballExplosion_C, UberGraphFrame) == 0x000220, "Member 'APuffballExplosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APuffballExplosion_C, Flesh) == 0x000228, "Member 'APuffballExplosion_C::Flesh' has a wrong offset!");
static_assert(offsetof(APuffballExplosion_C, Far) == 0x000230, "Member 'APuffballExplosion_C::Far' has a wrong offset!");
static_assert(offsetof(APuffballExplosion_C, Close) == 0x000238, "Member 'APuffballExplosion_C::Close' has a wrong offset!");
static_assert(offsetof(APuffballExplosion_C, ParticleSystem) == 0x000240, "Member 'APuffballExplosion_C::ParticleSystem' has a wrong offset!");

}

