#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadiotowerPoof

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function radiotowerPoof.radiotowerPoof_C.ExecuteUbergraph_radiotowerPoof
// 0x0068 (0x0068 - 0x0000)
struct RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1F84[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F85[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof) == 0x000008, "Wrong alignment on RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof");
static_assert(sizeof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof) == 0x000068, "Wrong size on RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, EntryPoint) == 0x000000, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::EntryPoint' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000020, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000038, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000040, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000048, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000050, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000058, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof, CallFunc_WasRecentlyRendered_ReturnValue_1) == 0x000060, "Member 'RadiotowerPoof_C_ExecuteUbergraph_radiotowerPoof::CallFunc_WasRecentlyRendered_ReturnValue_1' has a wrong offset!");

}

