#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Radiotower

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function radiotower.radiotower_C.ExecuteUbergraph_radiotower
// 0x0618 (0x0618 - 0x0000)
struct Radiotower_C_ExecuteUbergraph_radiotower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A11[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A12[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_damage_4;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A13[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A14[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0104(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A15[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A16[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x02A0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A17[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A18[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A19[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0398(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0430(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1A[0x3];                                     // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x04BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1B[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x04D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0568(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1C[0x2];                                     // 0x05F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1D[0x3];                                     // 0x05FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0600(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1E[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0610(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_ExecuteUbergraph_radiotower) == 0x000008, "Wrong alignment on Radiotower_C_ExecuteUbergraph_radiotower");
static_assert(sizeof(Radiotower_C_ExecuteUbergraph_radiotower) == 0x000618, "Wrong size on Radiotower_C_ExecuteUbergraph_radiotower");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, EntryPoint) == 0x000000, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::EntryPoint' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, Temp_bool_Variable) == 0x000004, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_damage_4) == 0x00002C, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_7) == 0x000030, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_actor_1) == 0x0000B8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_impact_1) == 0x0000C0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_water_3) == 0x0000D0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_water_2) == 0x0000D8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_water_1) == 0x0000E0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_water) == 0x0000E8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_activate) == 0x0000F0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_static) == 0x0000F1, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_frozen) == 0x0000F2, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_active) == 0x0000F3, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_actor) == 0x0000F8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_damage_3) == 0x000100, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_6) == 0x000104, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_impact) == 0x00018C, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_skipSetting) == 0x000198, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_key_1) == 0x0001A0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_14) == 0x0001B0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_5) == 0x0001B8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_damage_2) == 0x000240, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_fuel) == 0x000244, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_13) == 0x000248, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_12) == 0x000250, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_damage_1) == 0x000258, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_location_1) == 0x00025C, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_11) == 0x000268, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_10) == 0x000270, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_9) == 0x000278, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_wheelDelta) == 0x000280, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_8) == 0x000288, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_mouse) == 0x000290, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_7) == 0x000298, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_key) == 0x0002A0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_pressed) == 0x0002B8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_temperature_1) == 0x0002BC, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_temperature) == 0x0002C0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_speed) == 0x0002C4, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_6) == 0x0002C8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_4) == 0x0002D0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_name_1) == 0x000358, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_volume) == 0x000368, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_5) == 0x000370, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_location) == 0x000378, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_damage) == 0x000384, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_clean) == 0x000388, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_4) == 0x000390, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_3) == 0x000398, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hook) == 0x000420, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_3) == 0x000428, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_2) == 0x000430, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_kick) == 0x0004B8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_name) == 0x0004BC, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_2) == 0x0004C8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player_1) == 0x0004D0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit_1) == 0x0004D8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_player) == 0x000560, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_hit) == 0x000568, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_index) == 0x0005F0, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_Event_action) == 0x0005F4, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, K2Node_SwitchEnum_CmpSuccess) == 0x0005F5, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, CallFunc_RandomFloatInRange_ReturnValue) == 0x0005F8, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x0005FC, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000600, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, CallFunc_SelectFloat_ReturnValue) == 0x000608, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ExecuteUbergraph_radiotower, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000610, "Member 'Radiotower_C_ExecuteUbergraph_radiotower::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function radiotower.radiotower_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Radiotower_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Radiotower_C_ActionOptionIndex");
static_assert(sizeof(Radiotower_C_ActionOptionIndex) == 0x000098, "Wrong size on Radiotower_C_ActionOptionIndex");
static_assert(offsetof(Radiotower_C_ActionOptionIndex, Player) == 0x000000, "Member 'Radiotower_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Radiotower_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Radiotower_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ActionOptionIndex, Action) == 0x000094, "Member 'Radiotower_C_ActionOptionIndex::Action' has a wrong offset!");

// Function radiotower.radiotower_C.damageByPlayer
// 0x0090 (0x0090 - 0x0000)
struct Radiotower_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Radiotower_C_DamageByPlayer) == 0x000008, "Wrong alignment on Radiotower_C_DamageByPlayer");
static_assert(sizeof(Radiotower_C_DamageByPlayer) == 0x000090, "Wrong size on Radiotower_C_DamageByPlayer");
static_assert(offsetof(Radiotower_C_DamageByPlayer, Player) == 0x000000, "Member 'Radiotower_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_DamageByPlayer, Hit) == 0x000008, "Member 'Radiotower_C_DamageByPlayer::Hit' has a wrong offset!");

// Function radiotower.radiotower_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_Thrown) == 0x000008, "Wrong alignment on Radiotower_C_Thrown");
static_assert(sizeof(Radiotower_C_Thrown) == 0x000008, "Wrong size on Radiotower_C_Thrown");
static_assert(offsetof(Radiotower_C_Thrown, Player) == 0x000000, "Member 'Radiotower_C_Thrown::Player' has a wrong offset!");

// Function radiotower.radiotower_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_SendName) == 0x000004, "Wrong alignment on Radiotower_C_SendName");
static_assert(sizeof(Radiotower_C_SendName) == 0x000008, "Wrong size on Radiotower_C_SendName");
static_assert(offsetof(Radiotower_C_SendName, Param_Name) == 0x000000, "Member 'Radiotower_C_SendName::Param_Name' has a wrong offset!");

// Function radiotower.radiotower_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct Radiotower_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Radiotower_C_Kicked) == 0x000001, "Wrong alignment on Radiotower_C_Kicked");
static_assert(sizeof(Radiotower_C_Kicked) == 0x000001, "Wrong size on Radiotower_C_Kicked");
static_assert(offsetof(Radiotower_C_Kicked, Kick) == 0x000000, "Member 'Radiotower_C_Kicked::Kick' has a wrong offset!");

// Function radiotower.radiotower_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Radiotower_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Radiotower_C_Player_use) == 0x000008, "Wrong alignment on Radiotower_C_Player_use");
static_assert(sizeof(Radiotower_C_Player_use) == 0x000090, "Wrong size on Radiotower_C_Player_use");
static_assert(offsetof(Radiotower_C_Player_use, Player) == 0x000000, "Member 'Radiotower_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_Player_use, Hit) == 0x000008, "Member 'Radiotower_C_Player_use::Hit' has a wrong offset!");

// Function radiotower.radiotower_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_Hooked) == 0x000008, "Wrong alignment on Radiotower_C_Hooked");
static_assert(sizeof(Radiotower_C_Hooked) == 0x000008, "Wrong size on Radiotower_C_Hooked");
static_assert(offsetof(Radiotower_C_Hooked, Hook) == 0x000000, "Member 'Radiotower_C_Hooked::Hook' has a wrong offset!");

// Function radiotower.radiotower_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Radiotower_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Radiotower_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Radiotower_C_PlayerUsedOn");
static_assert(sizeof(Radiotower_C_PlayerUsedOn) == 0x000090, "Wrong size on Radiotower_C_PlayerUsedOn");
static_assert(offsetof(Radiotower_C_PlayerUsedOn, Player) == 0x000000, "Member 'Radiotower_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Radiotower_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function radiotower.radiotower_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Radiotower_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Radiotower_C_Slice) == 0x000001, "Wrong alignment on Radiotower_C_Slice");
static_assert(sizeof(Radiotower_C_Slice) == 0x000001, "Wrong size on Radiotower_C_Slice");
static_assert(offsetof(Radiotower_C_Slice, Clean) == 0x000000, "Member 'Radiotower_C_Slice::Clean' has a wrong offset!");

// Function radiotower.radiotower_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Radiotower_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Radiotower_C_ReachedByExplosion");
static_assert(sizeof(Radiotower_C_ReachedByExplosion) == 0x000010, "Wrong size on Radiotower_C_ReachedByExplosion");
static_assert(offsetof(Radiotower_C_ReachedByExplosion, Location) == 0x000000, "Member 'Radiotower_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Radiotower_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function radiotower.radiotower_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerLookAway) == 0x000008, "Wrong alignment on Radiotower_C_PlayerLookAway");
static_assert(sizeof(Radiotower_C_PlayerLookAway) == 0x000008, "Wrong size on Radiotower_C_PlayerLookAway");
static_assert(offsetof(Radiotower_C_PlayerLookAway, Player) == 0x000000, "Member 'Radiotower_C_PlayerLookAway::Player' has a wrong offset!");

// Function radiotower.radiotower_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Radiotower_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_Stepped) == 0x000004, "Wrong alignment on Radiotower_C_Stepped");
static_assert(sizeof(Radiotower_C_Stepped) == 0x000004, "Wrong size on Radiotower_C_Stepped");
static_assert(offsetof(Radiotower_C_Stepped, Volume) == 0x000000, "Member 'Radiotower_C_Stepped::Volume' has a wrong offset!");

// Function radiotower.radiotower_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Radiotower_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_ActionName) == 0x000008, "Wrong alignment on Radiotower_C_ActionName");
static_assert(sizeof(Radiotower_C_ActionName) == 0x0000A0, "Wrong size on Radiotower_C_ActionName");
static_assert(offsetof(Radiotower_C_ActionName, Player) == 0x000000, "Member 'Radiotower_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ActionName, Hit) == 0x000008, "Member 'Radiotower_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Radiotower_C_ActionName, Param_Name) == 0x000090, "Member 'Radiotower_C_ActionName::Param_Name' has a wrong offset!");

// Function radiotower.radiotower_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Radiotower_C_AccumulateTemperature");
static_assert(sizeof(Radiotower_C_AccumulateTemperature) == 0x000008, "Wrong size on Radiotower_C_AccumulateTemperature");
static_assert(offsetof(Radiotower_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Radiotower_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Radiotower_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Radiotower_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function radiotower.radiotower_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Radiotower_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_AddTemperature) == 0x000004, "Wrong alignment on Radiotower_C_AddTemperature");
static_assert(sizeof(Radiotower_C_AddTemperature) == 0x000004, "Wrong size on Radiotower_C_AddTemperature");
static_assert(offsetof(Radiotower_C_AddTemperature, Temperature) == 0x000000, "Member 'Radiotower_C_AddTemperature::Temperature' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Radiotower_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Radiotower_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandAnyKey");
static_assert(sizeof(Radiotower_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Radiotower_C_PlayerHandAnyKey");
static_assert(offsetof(Radiotower_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'Radiotower_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(Radiotower_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Radiotower_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Radiotower_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandMouse");
static_assert(sizeof(Radiotower_C_PlayerHandMouse) == 0x000010, "Wrong size on Radiotower_C_PlayerHandMouse");
static_assert(offsetof(Radiotower_C_PlayerHandMouse, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Radiotower_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Radiotower_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandMouseWheel");
static_assert(sizeof(Radiotower_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Radiotower_C_PlayerHandMouseWheel");
static_assert(offsetof(Radiotower_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Radiotower_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandRelease_LMB");
static_assert(sizeof(Radiotower_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Radiotower_C_PlayerHandRelease_LMB");
static_assert(offsetof(Radiotower_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandRelease_RMB");
static_assert(sizeof(Radiotower_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Radiotower_C_PlayerHandRelease_RMB");
static_assert(offsetof(Radiotower_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function radiotower.radiotower_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Radiotower_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_Exploded) == 0x000004, "Wrong alignment on Radiotower_C_Exploded");
static_assert(sizeof(Radiotower_C_Exploded) == 0x000010, "Wrong size on Radiotower_C_Exploded");
static_assert(offsetof(Radiotower_C_Exploded, Damage) == 0x000000, "Member 'Radiotower_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Radiotower_C_Exploded, Location) == 0x000004, "Member 'Radiotower_C_Exploded::Location' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandUse_LMB");
static_assert(sizeof(Radiotower_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Radiotower_C_PlayerHandUse_LMB");
static_assert(offsetof(Radiotower_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function radiotower.radiotower_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Radiotower_C_PlayerHandUse_RMB");
static_assert(sizeof(Radiotower_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Radiotower_C_PlayerHandUse_RMB");
static_assert(offsetof(Radiotower_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Radiotower_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function radiotower.radiotower_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Radiotower_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_Ignite) == 0x000004, "Wrong alignment on Radiotower_C_Ignite");
static_assert(sizeof(Radiotower_C_Ignite) == 0x000004, "Wrong size on Radiotower_C_Ignite");
static_assert(offsetof(Radiotower_C_Ignite, Fuel) == 0x000000, "Member 'Radiotower_C_Ignite::Fuel' has a wrong offset!");

// Function radiotower.radiotower_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Radiotower_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_FireDamage) == 0x000004, "Wrong alignment on Radiotower_C_FireDamage");
static_assert(sizeof(Radiotower_C_FireDamage) == 0x000004, "Wrong size on Radiotower_C_FireDamage");
static_assert(offsetof(Radiotower_C_FireDamage, Damage) == 0x000000, "Member 'Radiotower_C_FireDamage::Damage' has a wrong offset!");

// Function radiotower.radiotower_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Radiotower_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Radiotower_C_SteppedOn) == 0x000008, "Wrong alignment on Radiotower_C_SteppedOn");
static_assert(sizeof(Radiotower_C_SteppedOn) == 0x000090, "Wrong size on Radiotower_C_SteppedOn");
static_assert(offsetof(Radiotower_C_SteppedOn, Player) == 0x000000, "Member 'Radiotower_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Radiotower_C_SteppedOn, Hit) == 0x000008, "Member 'Radiotower_C_SteppedOn::Hit' has a wrong offset!");

// Function radiotower.radiotower_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Radiotower_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_SetKey) == 0x000008, "Wrong alignment on Radiotower_C_SetKey");
static_assert(sizeof(Radiotower_C_SetKey) == 0x000010, "Wrong size on Radiotower_C_SetKey");
static_assert(offsetof(Radiotower_C_SetKey, Key) == 0x000000, "Member 'Radiotower_C_SetKey::Key' has a wrong offset!");

// Function radiotower.radiotower_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Radiotower_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Radiotower_C_AddDamage) == 0x000008, "Wrong alignment on Radiotower_C_AddDamage");
static_assert(sizeof(Radiotower_C_AddDamage) == 0x0000A8, "Wrong size on Radiotower_C_AddDamage");
static_assert(offsetof(Radiotower_C_AddDamage, Actor) == 0x000000, "Member 'Radiotower_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Radiotower_C_AddDamage, Damage) == 0x000008, "Member 'Radiotower_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Radiotower_C_AddDamage, Hit) == 0x00000C, "Member 'Radiotower_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Radiotower_C_AddDamage, Impact) == 0x000094, "Member 'Radiotower_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Radiotower_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Radiotower_C_AddDamage::SkipSetting' has a wrong offset!");

// Function radiotower.radiotower_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Radiotower_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Radiotower_C_SetPropProps) == 0x000001, "Wrong alignment on Radiotower_C_SetPropProps");
static_assert(sizeof(Radiotower_C_SetPropProps) == 0x000003, "Wrong size on Radiotower_C_SetPropProps");
static_assert(offsetof(Radiotower_C_SetPropProps, Static) == 0x000000, "Member 'Radiotower_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Radiotower_C_SetPropProps, Frozen) == 0x000001, "Member 'Radiotower_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Radiotower_C_SetPropProps, Active) == 0x000002, "Member 'Radiotower_C_SetPropProps::Active' has a wrong offset!");

// Function radiotower.radiotower_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Radiotower_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Radiotower_C_Virus) == 0x000001, "Wrong alignment on Radiotower_C_Virus");
static_assert(sizeof(Radiotower_C_Virus) == 0x000001, "Wrong size on Radiotower_C_Virus");
static_assert(offsetof(Radiotower_C_Virus, Activate) == 0x000000, "Member 'Radiotower_C_Virus::Activate' has a wrong offset!");

// Function radiotower.radiotower_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Radiotower_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Radiotower_C_LeaveWaterOrigin");
static_assert(sizeof(Radiotower_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Radiotower_C_LeaveWaterOrigin");
static_assert(offsetof(Radiotower_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Radiotower_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function radiotower.radiotower_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Radiotower_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
