#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadiotowerPoof

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass radiotowerPoof.radiotowerPoof_C
// 0x0020 (0x0240 - 0x0220)
class ARadiotowerPoof_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         D;                                                 // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         D2;                                                // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_radiotowerPoof(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Reappear();
	void Check();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"radiotowerPoof_C">();
	}
	static class ARadiotowerPoof_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARadiotowerPoof_C>();
	}
};
static_assert(alignof(ARadiotowerPoof_C) == 0x000008, "Wrong alignment on ARadiotowerPoof_C");
static_assert(sizeof(ARadiotowerPoof_C) == 0x000240, "Wrong size on ARadiotowerPoof_C");
static_assert(offsetof(ARadiotowerPoof_C, UberGraphFrame) == 0x000220, "Member 'ARadiotowerPoof_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARadiotowerPoof_C, DefaultSceneRoot) == 0x000228, "Member 'ARadiotowerPoof_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARadiotowerPoof_C, Timer) == 0x000230, "Member 'ARadiotowerPoof_C::Timer' has a wrong offset!");
static_assert(offsetof(ARadiotowerPoof_C, D) == 0x000238, "Member 'ARadiotowerPoof_C::D' has a wrong offset!");
static_assert(offsetof(ARadiotowerPoof_C, D2) == 0x00023C, "Member 'ARadiotowerPoof_C::D2' has a wrong offset!");

}

