#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RealTimeImport

#include "Basic.hpp"

#include "RealTimeImport_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RealTimeImport.FileFunctionsRealTimeImport.addBytesToFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_AddBytesToFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F82[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 bytes;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F83[0x7];                                      // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_AddBytesToFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_AddBytesToFile");
static_assert(sizeof(FileFunctionsRealTimeImport_AddBytesToFile) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_AddBytesToFile");
static_assert(offsetof(FileFunctionsRealTimeImport_AddBytesToFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_AddBytesToFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_AddBytesToFile, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_AddBytesToFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_AddBytesToFile, bytes) == 0x000018, "Member 'FileFunctionsRealTimeImport_AddBytesToFile::bytes' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_AddBytesToFile, Success) == 0x000028, "Member 'FileFunctionsRealTimeImport_AddBytesToFile::Success' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.Base64Decode
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_Base64Decode final
{
public:
	class FString                                 base64EncodedString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_Base64Decode) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_Base64Decode");
static_assert(sizeof(FileFunctionsRealTimeImport_Base64Decode) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_Base64Decode");
static_assert(offsetof(FileFunctionsRealTimeImport_Base64Decode, base64EncodedString) == 0x000000, "Member 'FileFunctionsRealTimeImport_Base64Decode::base64EncodedString' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_Base64Decode, ReturnValue) == 0x000010, "Member 'FileFunctionsRealTimeImport_Base64Decode::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.Base64Encode
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_Base64Encode final
{
public:
	TArray<uint8>                                 bytes;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_Base64Encode) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_Base64Encode");
static_assert(sizeof(FileFunctionsRealTimeImport_Base64Encode) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_Base64Encode");
static_assert(offsetof(FileFunctionsRealTimeImport_Base64Encode, bytes) == 0x000000, "Member 'FileFunctionsRealTimeImport_Base64Encode::bytes' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_Base64Encode, ReturnValue) == 0x000010, "Member 'FileFunctionsRealTimeImport_Base64Encode::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.base64StringToBytes
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_base64StringToBytes final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F84[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 base64String;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F85[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_base64StringToBytes) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_base64StringToBytes");
static_assert(sizeof(FileFunctionsRealTimeImport_base64StringToBytes) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_base64StringToBytes");
static_assert(offsetof(FileFunctionsRealTimeImport_base64StringToBytes, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_base64StringToBytes::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_base64StringToBytes, base64String) == 0x000008, "Member 'FileFunctionsRealTimeImport_base64StringToBytes::base64String' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_base64StringToBytes, Success) == 0x000018, "Member 'FileFunctionsRealTimeImport_base64StringToBytes::Success' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_base64StringToBytes, ReturnValue) == 0x000020, "Member 'FileFunctionsRealTimeImport_base64StringToBytes::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.bytesToBase64String
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_bytesToBase64String final
{
public:
	TArray<uint8>                                 bytes;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 base64String;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_bytesToBase64String) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_bytesToBase64String");
static_assert(sizeof(FileFunctionsRealTimeImport_bytesToBase64String) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_bytesToBase64String");
static_assert(offsetof(FileFunctionsRealTimeImport_bytesToBase64String, bytes) == 0x000000, "Member 'FileFunctionsRealTimeImport_bytesToBase64String::bytes' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_bytesToBase64String, base64String) == 0x000010, "Member 'FileFunctionsRealTimeImport_bytesToBase64String::base64String' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.CreateDirectory
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_CreateDirectory final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F86[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F87[0x7];                                      // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_CreateDirectory) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_CreateDirectory");
static_assert(sizeof(FileFunctionsRealTimeImport_CreateDirectory) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_CreateDirectory");
static_assert(offsetof(FileFunctionsRealTimeImport_CreateDirectory, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_CreateDirectory::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_CreateDirectory, Path) == 0x000008, "Member 'FileFunctionsRealTimeImport_CreateDirectory::Path' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_CreateDirectory, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_CreateDirectory::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.DeleteDirectory
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_DeleteDirectory final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F88[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F89[0x7];                                      // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_DeleteDirectory) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_DeleteDirectory");
static_assert(sizeof(FileFunctionsRealTimeImport_DeleteDirectory) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_DeleteDirectory");
static_assert(offsetof(FileFunctionsRealTimeImport_DeleteDirectory, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_DeleteDirectory::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_DeleteDirectory, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_DeleteDirectory::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_DeleteDirectory, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_DeleteDirectory::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.DeleteFile
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_DeleteFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8A[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8B[0x7];                                      // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_DeleteFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_DeleteFile");
static_assert(sizeof(FileFunctionsRealTimeImport_DeleteFile) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_DeleteFile");
static_assert(offsetof(FileFunctionsRealTimeImport_DeleteFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_DeleteFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_DeleteFile, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_DeleteFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_DeleteFile, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_DeleteFile::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.directoryExists
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_DirectoryExists final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8C[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8D[0x7];                                      // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_DirectoryExists) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_DirectoryExists");
static_assert(sizeof(FileFunctionsRealTimeImport_DirectoryExists) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_DirectoryExists");
static_assert(offsetof(FileFunctionsRealTimeImport_DirectoryExists, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_DirectoryExists::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_DirectoryExists, Path) == 0x000008, "Member 'FileFunctionsRealTimeImport_DirectoryExists::Path' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_DirectoryExists, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_DirectoryExists::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.fileExists
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_FileExists final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8E[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8F[0x7];                                      // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_FileExists) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_FileExists");
static_assert(sizeof(FileFunctionsRealTimeImport_FileExists) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_FileExists");
static_assert(offsetof(FileFunctionsRealTimeImport_FileExists, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_FileExists::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileExists, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_FileExists::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileExists, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_FileExists::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.fileSize
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_FileSize final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F90[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_FileSize) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_FileSize");
static_assert(sizeof(FileFunctionsRealTimeImport_FileSize) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_FileSize");
static_assert(offsetof(FileFunctionsRealTimeImport_FileSize, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_FileSize::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileSize, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_FileSize::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileSize, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_FileSize::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.fileToBase64String
// 0x0040 (0x0040 - 0x0000)
struct FileFunctionsRealTimeImport_FileToBase64String final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F91[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F92[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 base64String;                                      // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_FileToBase64String) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_FileToBase64String");
static_assert(sizeof(FileFunctionsRealTimeImport_FileToBase64String) == 0x000040, "Wrong size on FileFunctionsRealTimeImport_FileToBase64String");
static_assert(offsetof(FileFunctionsRealTimeImport_FileToBase64String, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_FileToBase64String::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileToBase64String, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_FileToBase64String::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileToBase64String, Success) == 0x000018, "Member 'FileFunctionsRealTimeImport_FileToBase64String::Success' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileToBase64String, base64String) == 0x000020, "Member 'FileFunctionsRealTimeImport_FileToBase64String::base64String' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_FileToBase64String, Filename) == 0x000030, "Member 'FileFunctionsRealTimeImport_FileToBase64String::Filename' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.getAccessTimeStamp
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_GetAccessTimeStamp final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F93[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_GetAccessTimeStamp) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_GetAccessTimeStamp");
static_assert(sizeof(FileFunctionsRealTimeImport_GetAccessTimeStamp) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_GetAccessTimeStamp");
static_assert(offsetof(FileFunctionsRealTimeImport_GetAccessTimeStamp, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_GetAccessTimeStamp::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetAccessTimeStamp, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_GetAccessTimeStamp::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetAccessTimeStamp, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_GetAccessTimeStamp::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.getFileFunctionsRealTimeImport
// 0x0008 (0x0008 - 0x0000)
struct FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport final
{
public:
	class UFileFunctionsRealTimeImport*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport");
static_assert(sizeof(FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport) == 0x000008, "Wrong size on FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport");
static_assert(offsetof(FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport, ReturnValue) == 0x000000, "Member 'FileFunctionsRealTimeImport_GetFileFunctionsRealTimeImport::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.getFilenameOnDisk
// 0x0028 (0x0028 - 0x0000)
struct FileFunctionsRealTimeImport_GetFilenameOnDisk final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F94[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_GetFilenameOnDisk) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_GetFilenameOnDisk");
static_assert(sizeof(FileFunctionsRealTimeImport_GetFilenameOnDisk) == 0x000028, "Wrong size on FileFunctionsRealTimeImport_GetFilenameOnDisk");
static_assert(offsetof(FileFunctionsRealTimeImport_GetFilenameOnDisk, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_GetFilenameOnDisk::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetFilenameOnDisk, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_GetFilenameOnDisk::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetFilenameOnDisk, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_GetFilenameOnDisk::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.getMD5FromFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_GetMD5FromFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F95[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F96[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Md5;                                               // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_GetMD5FromFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_GetMD5FromFile");
static_assert(sizeof(FileFunctionsRealTimeImport_GetMD5FromFile) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_GetMD5FromFile");
static_assert(offsetof(FileFunctionsRealTimeImport_GetMD5FromFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_GetMD5FromFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetMD5FromFile, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_GetMD5FromFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetMD5FromFile, Success) == 0x000018, "Member 'FileFunctionsRealTimeImport_GetMD5FromFile::Success' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetMD5FromFile, Md5) == 0x000020, "Member 'FileFunctionsRealTimeImport_GetMD5FromFile::Md5' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.getTimeStamp
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_GetTimeStamp final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F97[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_GetTimeStamp) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_GetTimeStamp");
static_assert(sizeof(FileFunctionsRealTimeImport_GetTimeStamp) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_GetTimeStamp");
static_assert(offsetof(FileFunctionsRealTimeImport_GetTimeStamp, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_GetTimeStamp::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetTimeStamp, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_GetTimeStamp::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_GetTimeStamp, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_GetTimeStamp::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.isReadOnly
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_IsReadOnly final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F98[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F99[0x7];                                      // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_IsReadOnly) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_IsReadOnly");
static_assert(sizeof(FileFunctionsRealTimeImport_IsReadOnly) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_IsReadOnly");
static_assert(offsetof(FileFunctionsRealTimeImport_IsReadOnly, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_IsReadOnly::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_IsReadOnly, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_IsReadOnly::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_IsReadOnly, ReturnValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_IsReadOnly::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.moveFile
// 0x0038 (0x0038 - 0x0000)
struct FileFunctionsRealTimeImport_MoveFile final
{
public:
	ERTIDirectoryType                             DirectoryTypeTo;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9A[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePathTo;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTIDirectoryType                             DirectoryTypeFrom;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9B[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePathFrom;                                      // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9C[0x7];                                      // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_MoveFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_MoveFile");
static_assert(sizeof(FileFunctionsRealTimeImport_MoveFile) == 0x000038, "Wrong size on FileFunctionsRealTimeImport_MoveFile");
static_assert(offsetof(FileFunctionsRealTimeImport_MoveFile, DirectoryTypeTo) == 0x000000, "Member 'FileFunctionsRealTimeImport_MoveFile::DirectoryTypeTo' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_MoveFile, FilePathTo) == 0x000008, "Member 'FileFunctionsRealTimeImport_MoveFile::FilePathTo' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_MoveFile, DirectoryTypeFrom) == 0x000018, "Member 'FileFunctionsRealTimeImport_MoveFile::DirectoryTypeFrom' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_MoveFile, FilePathFrom) == 0x000020, "Member 'FileFunctionsRealTimeImport_MoveFile::FilePathFrom' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_MoveFile, ReturnValue) == 0x000030, "Member 'FileFunctionsRealTimeImport_MoveFile::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.ReadBytesFromFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_ReadBytesFromFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9D[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9E[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_ReadBytesFromFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_ReadBytesFromFile");
static_assert(sizeof(FileFunctionsRealTimeImport_ReadBytesFromFile) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_ReadBytesFromFile");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadBytesFromFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_ReadBytesFromFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadBytesFromFile, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_ReadBytesFromFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadBytesFromFile, Success) == 0x000018, "Member 'FileFunctionsRealTimeImport_ReadBytesFromFile::Success' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadBytesFromFile, ReturnValue) == 0x000020, "Member 'FileFunctionsRealTimeImport_ReadBytesFromFile::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.ReadStringFromFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_ReadStringFromFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9F[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA0[0x7];                                      // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_ReadStringFromFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_ReadStringFromFile");
static_assert(sizeof(FileFunctionsRealTimeImport_ReadStringFromFile) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_ReadStringFromFile");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadStringFromFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_ReadStringFromFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadStringFromFile, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_ReadStringFromFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadStringFromFile, Success) == 0x000018, "Member 'FileFunctionsRealTimeImport_ReadStringFromFile::Success' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_ReadStringFromFile, Data) == 0x000020, "Member 'FileFunctionsRealTimeImport_ReadStringFromFile::Data' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.setReadOnly
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_SetReadOnly final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA1[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewReadOnlyValue;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA2[0x6];                                      // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_SetReadOnly) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_SetReadOnly");
static_assert(sizeof(FileFunctionsRealTimeImport_SetReadOnly) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_SetReadOnly");
static_assert(offsetof(FileFunctionsRealTimeImport_SetReadOnly, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_SetReadOnly::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_SetReadOnly, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_SetReadOnly::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_SetReadOnly, bNewReadOnlyValue) == 0x000018, "Member 'FileFunctionsRealTimeImport_SetReadOnly::bNewReadOnlyValue' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_SetReadOnly, ReturnValue) == 0x000019, "Member 'FileFunctionsRealTimeImport_SetReadOnly::ReturnValue' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.setTimeStamp
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsRealTimeImport_SetTimeStamp final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA3[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              DateTime;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsRealTimeImport_SetTimeStamp) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_SetTimeStamp");
static_assert(sizeof(FileFunctionsRealTimeImport_SetTimeStamp) == 0x000020, "Wrong size on FileFunctionsRealTimeImport_SetTimeStamp");
static_assert(offsetof(FileFunctionsRealTimeImport_SetTimeStamp, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_SetTimeStamp::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_SetTimeStamp, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_SetTimeStamp::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_SetTimeStamp, DateTime) == 0x000018, "Member 'FileFunctionsRealTimeImport_SetTimeStamp::DateTime' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.WriteBytesToFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_WriteBytesToFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA4[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 bytes;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA5[0x7];                                      // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_WriteBytesToFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_WriteBytesToFile");
static_assert(sizeof(FileFunctionsRealTimeImport_WriteBytesToFile) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_WriteBytesToFile");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteBytesToFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_WriteBytesToFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteBytesToFile, FilePath) == 0x000008, "Member 'FileFunctionsRealTimeImport_WriteBytesToFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteBytesToFile, bytes) == 0x000018, "Member 'FileFunctionsRealTimeImport_WriteBytesToFile::bytes' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteBytesToFile, Success) == 0x000028, "Member 'FileFunctionsRealTimeImport_WriteBytesToFile::Success' has a wrong offset!");

// Function RealTimeImport.FileFunctionsRealTimeImport.WriteStringToFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsRealTimeImport_WriteStringToFile final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA6[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilePath;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA7[0x7];                                      // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsRealTimeImport_WriteStringToFile) == 0x000008, "Wrong alignment on FileFunctionsRealTimeImport_WriteStringToFile");
static_assert(sizeof(FileFunctionsRealTimeImport_WriteStringToFile) == 0x000030, "Wrong size on FileFunctionsRealTimeImport_WriteStringToFile");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteStringToFile, DirectoryType) == 0x000000, "Member 'FileFunctionsRealTimeImport_WriteStringToFile::DirectoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteStringToFile, Data) == 0x000008, "Member 'FileFunctionsRealTimeImport_WriteStringToFile::Data' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteStringToFile, FilePath) == 0x000018, "Member 'FileFunctionsRealTimeImport_WriteStringToFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsRealTimeImport_WriteStringToFile, Success) == 0x000028, "Member 'FileFunctionsRealTimeImport_WriteStringToFile::Success' has a wrong offset!");

// Function RealTimeImport.RealTimeImportAsyncNodeLoadMesh.LoadMeshFileAsyncNode
// 0x0028 (0x0028 - 0x0000)
struct RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode final
{
public:
	ERTIMeshType                                  FileType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTIDirectoryType                             DirectoryType;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA9[0x6];                                      // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTICoordinateSystem                          CoordinateSystem;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoDetectionNormalMap;                            // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSRGB;                                           // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CreateMipMaps;                                     // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTIERGBFormat                                RgbFormat;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAA[0x3];                                      // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URealTimeImportAsyncNodeLoadMesh*       ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode) == 0x000008, "Wrong alignment on RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode");
static_assert(sizeof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode) == 0x000028, "Wrong size on RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, FileType) == 0x000000, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::FileType' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, DirectoryType) == 0x000001, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::DirectoryType' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, FilePath) == 0x000008, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::FilePath' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, CoordinateSystem) == 0x000018, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::CoordinateSystem' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, AutoDetectionNormalMap) == 0x000019, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::AutoDetectionNormalMap' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, UseSRGB) == 0x00001A, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::UseSRGB' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, CreateMipMaps) == 0x00001B, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::CreateMipMaps' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, RgbFormat) == 0x00001C, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::RgbFormat' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode, ReturnValue) == 0x000020, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshFileAsyncNode::ReturnValue' has a wrong offset!");

// DelegateFunction RealTimeImport.RealTimeImportAsyncNodeLoadMesh.LoadMeshCompleteDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature final
{
public:
	TArray<struct FRTIModelStruct>                ModelStructs;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature) == 0x000008, "Wrong alignment on RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature");
static_assert(sizeof(RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature) == 0x000020, "Wrong size on RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature, ModelStructs) == 0x000000, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature::ModelStructs' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature, ErrorMessage) == 0x000010, "Member 'RealTimeImportAsyncNodeLoadMesh_LoadMeshCompleteDelegate__DelegateSignature::ErrorMessage' has a wrong offset!");

// Function RealTimeImport.RealTimeImportAsyncNodeLoadFile.LoadFileAsyncNode
// 0x0020 (0x0020 - 0x0000)
struct RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode final
{
public:
	ERTIDirectoryType                             DirectoryType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAC[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URealTimeImportAsyncNodeLoadFile*       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode) == 0x000008, "Wrong alignment on RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode");
static_assert(sizeof(RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode) == 0x000020, "Wrong size on RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode");
static_assert(offsetof(RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode, DirectoryType) == 0x000000, "Member 'RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode::DirectoryType' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode, FilePath) == 0x000008, "Member 'RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode::FilePath' has a wrong offset!");
static_assert(offsetof(RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode, ReturnValue) == 0x000018, "Member 'RealTimeImportAsyncNodeLoadFile_LoadFileAsyncNode::ReturnValue' has a wrong offset!");

// DelegateFunction RealTimeImport.RealTimeImportAsyncNodeLoadFile.LoadFileCompleteDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 bytes;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FAD[0x4];                                      // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0028(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature) == 0x000008, "Wrong alignment on RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature");
static_assert(sizeof(RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature) == 0x000038, "Wrong size on RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature");
static_assert(offsetof(RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature, Filename) == 0x000000, "Member 'RealTimeImportAsyncNodeLoadFile_LoadFileCompleteDelegate__DelegateSignature::Filename' has a wrong offset!");
