#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RiverFlow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function riverFlow.riverFlow_C.ExecuteUbergraph_riverFlow
// 0x00D0 (0x00D0 - 0x0000)
struct RiverFlow_C_ExecuteUbergraph_riverFlow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RiverFlow_C_ExecuteUbergraph_riverFlow) == 0x000008, "Wrong alignment on RiverFlow_C_ExecuteUbergraph_riverFlow");
static_assert(sizeof(RiverFlow_C_ExecuteUbergraph_riverFlow) == 0x0000D0, "Wrong size on RiverFlow_C_ExecuteUbergraph_riverFlow");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, EntryPoint) == 0x000000, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::EntryPoint' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x000030, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_VInterpTo_ReturnValue) == 0x00003C, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_ExecuteUbergraph_riverFlow, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000048, "Member 'RiverFlow_C_ExecuteUbergraph_riverFlow::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function riverFlow.riverFlow_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RiverFlow_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RiverFlow_C_ReceiveTick) == 0x000004, "Wrong alignment on RiverFlow_C_ReceiveTick");
static_assert(sizeof(RiverFlow_C_ReceiveTick) == 0x000004, "Wrong size on RiverFlow_C_ReceiveTick");
static_assert(offsetof(RiverFlow_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RiverFlow_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function riverFlow.riverFlow_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct RiverFlow_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetLocationAtTime_ReturnValue;            // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RiverFlow_C_UserConstructionScript) == 0x000004, "Wrong alignment on RiverFlow_C_UserConstructionScript");
static_assert(sizeof(RiverFlow_C_UserConstructionScript) == 0x000094, "Wrong size on RiverFlow_C_UserConstructionScript");
static_assert(offsetof(RiverFlow_C_UserConstructionScript, CallFunc_GetLocationAtTime_ReturnValue) == 0x000000, "Member 'RiverFlow_C_UserConstructionScript::CallFunc_GetLocationAtTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiverFlow_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00000C, "Member 'RiverFlow_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

