#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RockThrower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass rockThrower.rockThrower_C
// 0x0030 (0x0250 - 0x0220)
class ARockThrower_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_rockThrower(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"rockThrower_C">();
	}
	static class ARockThrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARockThrower_C>();
	}
};
static_assert(alignof(ARockThrower_C) == 0x000008, "Wrong alignment on ARockThrower_C");
static_assert(sizeof(ARockThrower_C) == 0x000250, "Wrong size on ARockThrower_C");
static_assert(offsetof(ARockThrower_C, UberGraphFrame) == 0x000220, "Member 'ARockThrower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARockThrower_C, Box) == 0x000228, "Member 'ARockThrower_C::Box' has a wrong offset!");
static_assert(offsetof(ARockThrower_C, Sphere) == 0x000230, "Member 'ARockThrower_C::Sphere' has a wrong offset!");
static_assert(offsetof(ARockThrower_C, Arrow) == 0x000238, "Member 'ARockThrower_C::Arrow' has a wrong offset!");
static_assert(offsetof(ARockThrower_C, DefaultSceneRoot) == 0x000240, "Member 'ARockThrower_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARockThrower_C, Count) == 0x000248, "Member 'ARockThrower_C::Count' has a wrong offset!");

}

