#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoombaBrush_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function roombaBrush_Skeleton_AnimBlueprint.roombaBrush_Skeleton_AnimBlueprint_C.ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint
// 0x0024 (0x0024 - 0x0000)
struct RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint");
static_assert(sizeof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint) == 0x000024, "Wrong size on RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue_1) == 0x000018, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_ExecuteUbergraph_roombaBrush_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

// Function roombaBrush_Skeleton_AnimBlueprint.roombaBrush_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000020, "Wrong size on RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph, InPose) == 0x000000, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'RoombaBrush_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

