#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rope

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_mVector_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function rope.rope_C.ExecuteUbergraph_rope
// 0x09A0 (0x09A0 - 0x0000)
struct Rope_C_ExecuteUbergraph_rope final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_static;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x003C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_key_2;                                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor_1;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                K2Node_DynamicCast_AsProp_1;                       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_ignore;                               // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0344(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_name_1;                               // 0x03E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_kick;                                 // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x03F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_color;                                // 0x0494(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key_1;                                // 0x04A8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x04C8(0x00F0)(HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x05C0(0x0010)(ZeroConstructor, NoDestructor)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean_1;                              // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x05F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0680(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_clean;                                // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x3];                                      // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_location_1;                           // 0x0694(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x06C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0748(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature_1;                        // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0770(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x07C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x07E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_ConstraintIndex;        // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0870(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0880(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0890(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x08C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4[0x4];                                      // 0x08D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARope_broken_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x08E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0910(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91C[0x4];                                      // 0x091C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARope_broken_C*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0938(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0950(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961[0x7];                                      // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_getKey_key;                               // 0x0968(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_getKey_key_1;                             // 0x0978(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0988(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Rope_C_ExecuteUbergraph_rope) == 0x000010, "Wrong alignment on Rope_C_ExecuteUbergraph_rope");
static_assert(sizeof(Rope_C_ExecuteUbergraph_rope) == 0x0009A0, "Wrong size on Rope_C_ExecuteUbergraph_rope");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, EntryPoint) == 0x000000, "Member 'Rope_C_ExecuteUbergraph_rope::EntryPoint' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_static) == 0x000004, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_frozen) == 0x000005, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_active) == 0x000006, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000014, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_Vector_Distance_ReturnValue) == 0x000020, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_actor_1) == 0x000030, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage_6) == 0x000038, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_7) == 0x00003C, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_impact_1) == 0x0000C4, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_skipSetting) == 0x0000D0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_SelectFloat_ReturnValue) == 0x0000D4, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_SelectFloat_ReturnValue_1) == 0x0000D8, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_18) == 0x0000E0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_6) == 0x0000E8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_key_2) == 0x000170, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage_5) == 0x000180, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_fuel) == 0x000184, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_activate) == 0x000188, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_CustomEvent_DestroyedActor_1) == 0x000190, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_CustomEvent_DestroyedActor_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_CustomEvent_DestroyedActor) == 0x000198, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_IsValid_ReturnValue_1) == 0x0001A1, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_water_3) == 0x0001A8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_water_2) == 0x0001B0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_IsValid_ReturnValue_2) == 0x0001B8, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_IsValid_ReturnValue_3) == 0x0001B9, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_AsProp) == 0x0001C0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_AsProp' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_AsProp_1) == 0x0001D0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_AsProp_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_ignore) == 0x0001D9, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_water_1) == 0x0001E0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_17) == 0x0001E8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_16) == 0x0001F0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_15) == 0x0001F8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_14) == 0x000200, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_5) == 0x000208, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_action) == 0x000290, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_13) == 0x000298, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_4) == 0x0002A0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage_4) == 0x000328, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00032C, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_12) == 0x000330, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_water) == 0x000338, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage_3) == 0x000340, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_3) == 0x000344, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_actor) == 0x0003D0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_impact) == 0x0003D8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_name_1) == 0x0003E4, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_kick) == 0x0003EC, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_11) == 0x0003F0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_2) == 0x0003F8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_picker) == 0x000480, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_texture) == 0x000488, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_index) == 0x000490, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_color) == 0x000494, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_key_1) == 0x0004A8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_pressed_1) == 0x0004C0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_settings) == 0x0004C8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_gamemode) == 0x0005B8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_CreateDelegate_OutputDelegate) == 0x0005C0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hook_1) == 0x0005D0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_clean_1) == 0x0005D8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_10) == 0x0005E0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hook) == 0x0005E8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_9) == 0x0005F0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit_1) == 0x0005F8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_CreateDelegate_OutputDelegate_1) == 0x000680, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_clean) == 0x000690, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_location_1) == 0x000694, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage_2) == 0x0006A0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_8) == 0x0006A8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_volume) == 0x0006B0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_7) == 0x0006B8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hit) == 0x0006C0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_name) == 0x000748, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_temperature_1) == 0x000758, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_speed) == 0x00075C, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_temperature) == 0x000760, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_6) == 0x000768, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_key) == 0x000770, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_pressed) == 0x000788, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_5) == 0x000790, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_mouse) == 0x000798, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_4) == 0x0007A0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_wheelDelta) == 0x0007A8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_3) == 0x0007B0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_2) == 0x0007B8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage_1) == 0x0007C0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_location) == 0x0007C4, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player_1) == 0x0007D0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_player) == 0x0007D8, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_damage) == 0x0007E0, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_Event_hot) == 0x0007E4, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_ComponentBoundEvent_ConstraintIndex) == 0x00086C, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_ComponentBoundEvent_ConstraintIndex' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_CreateDelegate_OutputDelegate_2) == 0x000870, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000880, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_MakeTransform_ReturnValue) == 0x000890, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0008C0, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x0008C8, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_FinishSpawningActor_ReturnValue) == 0x0008D8, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_MakeTransform_ReturnValue_1) == 0x0008E0, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_VLerp_ReturnValue) == 0x000910, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000920, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000928, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000930, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_AsInt_Objects) == 0x000938, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_bSuccess_2) == 0x000948, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_AsInt_Objects_1) == 0x000950, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_DynamicCast_bSuccess_3) == 0x000960, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_getKey_key) == 0x000968, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_getKey_key' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, CallFunc_getKey_key_1) == 0x000978, "Member 'Rope_C_ExecuteUbergraph_rope::CallFunc_getKey_key_1' has a wrong offset!");
static_assert(offsetof(Rope_C_ExecuteUbergraph_rope, K2Node_CreateDelegate_OutputDelegate_3) == 0x000988, "Member 'Rope_C_ExecuteUbergraph_rope::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function rope.rope_C.BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature final
{
public:
	int32                                         ConstraintIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong alignment on Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature");
static_assert(sizeof(Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature) == 0x000004, "Wrong size on Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature");
static_assert(offsetof(Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature, ConstraintIndex) == 0x000000, "Member 'Rope_C_BndEvt__rope_PhysicsConstraint_K2Node_ComponentBoundEvent_0_ConstraintBrokenSignature__DelegateSignature::ConstraintIndex' has a wrong offset!");

// Function rope.rope_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct Rope_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Rope_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on Rope_C_ReceivedPhyiscsDamage");
static_assert(sizeof(Rope_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on Rope_C_ReceivedPhyiscsDamage");
static_assert(offsetof(Rope_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'Rope_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(Rope_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'Rope_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function rope.rope_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Rope_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Rope_C_PlayerHandUse_RMB");
static_assert(sizeof(Rope_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Rope_C_PlayerHandUse_RMB");
static_assert(offsetof(Rope_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Rope_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function rope.rope_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Rope_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Rope_C_PlayerHandUse_LMB");
static_assert(sizeof(Rope_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Rope_C_PlayerHandUse_LMB");
static_assert(offsetof(Rope_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Rope_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function rope.rope_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Rope_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_Exploded) == 0x000004, "Wrong alignment on Rope_C_Exploded");
static_assert(sizeof(Rope_C_Exploded) == 0x000010, "Wrong size on Rope_C_Exploded");
static_assert(offsetof(Rope_C_Exploded, Damage) == 0x000000, "Member 'Rope_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Rope_C_Exploded, Location) == 0x000004, "Member 'Rope_C_Exploded::Location' has a wrong offset!");

// Function rope.rope_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Rope_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Rope_C_PlayerHandRelease_RMB");
static_assert(sizeof(Rope_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Rope_C_PlayerHandRelease_RMB");
static_assert(offsetof(Rope_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Rope_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function rope.rope_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Rope_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Rope_C_PlayerHandRelease_LMB");
static_assert(sizeof(Rope_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Rope_C_PlayerHandRelease_LMB");
static_assert(offsetof(Rope_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Rope_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function rope.rope_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Rope_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Rope_C_PlayerHandMouseWheel");
static_assert(sizeof(Rope_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Rope_C_PlayerHandMouseWheel");
static_assert(offsetof(Rope_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Rope_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Rope_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Rope_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function rope.rope_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Rope_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Rope_C_PlayerHandMouse");
static_assert(sizeof(Rope_C_PlayerHandMouse) == 0x000010, "Wrong size on Rope_C_PlayerHandMouse");
static_assert(offsetof(Rope_C_PlayerHandMouse, Player) == 0x000000, "Member 'Rope_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Rope_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Rope_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function rope.rope_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Rope_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Rope_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Rope_C_PlayerHandAnyKey");
static_assert(sizeof(Rope_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Rope_C_PlayerHandAnyKey");
static_assert(offsetof(Rope_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Rope_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Rope_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'Rope_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(Rope_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Rope_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function rope.rope_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Rope_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_AddTemperature) == 0x000004, "Wrong alignment on Rope_C_AddTemperature");
static_assert(sizeof(Rope_C_AddTemperature) == 0x000004, "Wrong size on Rope_C_AddTemperature");
static_assert(offsetof(Rope_C_AddTemperature, Temperature) == 0x000000, "Member 'Rope_C_AddTemperature::Temperature' has a wrong offset!");

// Function rope.rope_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Rope_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Rope_C_AccumulateTemperature");
static_assert(sizeof(Rope_C_AccumulateTemperature) == 0x000008, "Wrong size on Rope_C_AccumulateTemperature");
static_assert(offsetof(Rope_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Rope_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Rope_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Rope_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function rope.rope_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Rope_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Rope_C_ActionName) == 0x000008, "Wrong alignment on Rope_C_ActionName");
static_assert(sizeof(Rope_C_ActionName) == 0x0000A0, "Wrong size on Rope_C_ActionName");
static_assert(offsetof(Rope_C_ActionName, Player) == 0x000000, "Member 'Rope_C_ActionName::Player' has a wrong offset!");
