#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RorGraf

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function rorGraf.rorGraf_C.move
// 0x0178 (0x0178 - 0x0000)
struct RorGraf_C_Move final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0018(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0038(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RorGraf_C_Move) == 0x000008, "Wrong alignment on RorGraf_C_Move");
static_assert(sizeof(RorGraf_C_Move) == 0x000178, "Wrong size on RorGraf_C_Move");
static_assert(offsetof(RorGraf_C_Move, A) == 0x000000, "Member 'RorGraf_C_Move::A' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_RandomUnitVector_ReturnValue) == 0x00000C, "Member 'RorGraf_C_Move::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_obj_static_obj) == 0x000018, "Member 'RorGraf_C_Move::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'RorGraf_C_Move::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, Temp_object_Variable) == 0x000038, "Member 'RorGraf_C_Move::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'RorGraf_C_Move::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000054, "Member 'RorGraf_C_Move::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0000DC, "Member 'RorGraf_C_Move::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0000E0, "Member 'RorGraf_C_Move::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_bBlockingHit) == 0x0000EC, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000ED, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_Time) == 0x0000F0, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_Distance) == 0x0000F4, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_Location) == 0x0000F8, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_ImpactPoint) == 0x000104, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_Normal) == 0x000110, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_ImpactNormal) == 0x00011C, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'RorGraf_C_Move::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Move, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00016C, "Member 'RorGraf_C_Move::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");

// Function rorGraf.rorGraf_C.checkSpawn
// 0x0280 (0x0280 - 0x0000)
struct RorGraf_C_CheckSpawn final
{
public:
	bool                                          Succ;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              B;                                                 // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class UPhysicalMaterial*>              K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x00F8(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RorGraf_C_CheckSpawn) == 0x000010, "Wrong alignment on RorGraf_C_CheckSpawn");
static_assert(sizeof(RorGraf_C_CheckSpawn) == 0x000280, "Wrong size on RorGraf_C_CheckSpawn");
static_assert(offsetof(RorGraf_C_CheckSpawn, Succ) == 0x000000, "Member 'RorGraf_C_CheckSpawn::Succ' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, B) == 0x000008, "Member 'RorGraf_C_CheckSpawn::B' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_GetForwardVector_ReturnValue) == 0x000018, "Member 'RorGraf_C_CheckSpawn::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_GetForwardVector_ReturnValue_1) == 0x000024, "Member 'RorGraf_C_CheckSpawn::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'RorGraf_C_CheckSpawn::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'RorGraf_C_CheckSpawn::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, K2Node_MakeArray_Array) == 0x000070, "Member 'RorGraf_C_CheckSpawn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakTransform_Location) == 0x000080, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakTransform_Rotation) == 0x00008C, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakTransform_Scale) == 0x000098, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'RorGraf_C_CheckSpawn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, Temp_object_Variable) == 0x0000E0, "Member 'RorGraf_C_CheckSpawn::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, Temp_int_Variable) == 0x0000F0, "Member 'RorGraf_C_CheckSpawn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_obj_static_obj) == 0x0000F8, "Member 'RorGraf_C_CheckSpawn::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000108, "Member 'RorGraf_C_CheckSpawn::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00010C, "Member 'RorGraf_C_CheckSpawn::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'RorGraf_C_CheckSpawn::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'RorGraf_C_CheckSpawn::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_RotateAngleAxis_ReturnValue) == 0x000118, "Member 'RorGraf_C_CheckSpawn::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Add_IntInt_ReturnValue) == 0x000124, "Member 'RorGraf_C_CheckSpawn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000128, "Member 'RorGraf_C_CheckSpawn::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_TransformLocation_ReturnValue) == 0x000134, "Member 'RorGraf_C_CheckSpawn::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Add_VectorVector_ReturnValue) == 0x000140, "Member 'RorGraf_C_CheckSpawn::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00014C, "Member 'RorGraf_C_CheckSpawn::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000158, "Member 'RorGraf_C_CheckSpawn::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001E0, "Member 'RorGraf_C_CheckSpawn::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E1, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E2, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_Time) == 0x0001E4, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_Distance) == 0x0001E8, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_Location) == 0x0001EC, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_Normal) == 0x000204, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_ImpactNormal) == 0x000210, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_ElementIndex) == 0x000244, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_FaceIndex) == 0x000248, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_TraceStart) == 0x00024C, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BreakHitResult_TraceEnd) == 0x000258, "Member 'RorGraf_C_CheckSpawn::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000264, "Member 'RorGraf_C_CheckSpawn::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Array_Contains_ReturnValue) == 0x000265, "Member 'RorGraf_C_CheckSpawn::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Dot_VectorVector_ReturnValue) == 0x000268, "Member 'RorGraf_C_CheckSpawn::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Abs_ReturnValue) == 0x00026C, "Member 'RorGraf_C_CheckSpawn::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000270, "Member 'RorGraf_C_CheckSpawn::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BooleanAND_ReturnValue) == 0x000271, "Member 'RorGraf_C_CheckSpawn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_CheckSpawn, CallFunc_BooleanAND_ReturnValue_1) == 0x000272, "Member 'RorGraf_C_CheckSpawn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function rorGraf.rorGraf_C.Init
// 0x0010 (0x0010 - 0x0000)
struct RorGraf_C_Init final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RorGraf_C_Init) == 0x000008, "Wrong alignment on RorGraf_C_Init");
static_assert(sizeof(RorGraf_C_Init) == 0x000010, "Wrong size on RorGraf_C_Init");
static_assert(offsetof(RorGraf_C_Init, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'RorGraf_C_Init::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Init, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'RorGraf_C_Init::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function rorGraf.rorGraf_C.check
// 0x0018 (0x0018 - 0x0000)
struct RorGraf_C_Check final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RorGraf_C_Check) == 0x000004, "Wrong alignment on RorGraf_C_Check");
static_assert(sizeof(RorGraf_C_Check) == 0x000018, "Wrong size on RorGraf_C_Check");
static_assert(offsetof(RorGraf_C_Check, NewLocation) == 0x000000, "Member 'RorGraf_C_Check::NewLocation' has a wrong offset!");
static_assert(offsetof(RorGraf_C_Check, NewRotation) == 0x00000C, "Member 'RorGraf_C_Check::NewRotation' has a wrong offset!");

// Function rorGraf.rorGraf_C.ExecuteUbergraph_rorGraf
// 0x0138 (0x0138 - 0x0000)
struct RorGraf_C_ExecuteUbergraph_rorGraf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_checkSpawn_succ;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewLocation;                    // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_NewRotation;                    // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RorGraf_C_ExecuteUbergraph_rorGraf) == 0x000004, "Wrong alignment on RorGraf_C_ExecuteUbergraph_rorGraf");
static_assert(sizeof(RorGraf_C_ExecuteUbergraph_rorGraf) == 0x000138, "Wrong size on RorGraf_C_ExecuteUbergraph_rorGraf");
static_assert(offsetof(RorGraf_C_ExecuteUbergraph_rorGraf, EntryPoint) == 0x000000, "Member 'RorGraf_C_ExecuteUbergraph_rorGraf::EntryPoint' has a wrong offset!");
static_assert(offsetof(RorGraf_C_ExecuteUbergraph_rorGraf, CallFunc_checkSpawn_succ) == 0x000004, "Member 'RorGraf_C_ExecuteUbergraph_rorGraf::CallFunc_checkSpawn_succ' has a wrong offset!");
static_assert(offsetof(RorGraf_C_ExecuteUbergraph_rorGraf, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000005, "Member 'RorGraf_C_ExecuteUbergraph_rorGraf::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
