#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Roz_anim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function roz_anim.roz_anim_C.ExecuteUbergraph_roz_anim
// 0x0950 (0x0950 - 0x0000)
struct Roz_anim_C_ExecuteUbergraph_roz_anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FCF[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x00B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1FD0[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD1[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active_1;                             // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD2[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x018C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD3[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_2;                                // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0240(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x02D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index_1;                              // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD4[0x3];                                     // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD5[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_1;                                // 0x03C0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD6[0x3];                                     // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x03F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD7[0x4];                                     // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD8[0x7];                                     // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x04B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0550(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD9[0x4];                                     // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x0620(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDA[0x3];                                     // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x063C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_NewParam;                             // 0x064D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDB[0x2];                                     // 0x064E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDC[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FDD[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0698(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x06A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDE[0x3];                                     // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FDF[0x3];                                     // 0x06B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x06C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x06F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x06FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0708(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0718(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE0[0x3];                                     // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0728(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0734(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1FE1[0x4];                                     // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE2[0x3];                                     // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x07E0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE3[0x3];                                     // 0x0871(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE4[0x4];                                     // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x089C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE5[0x3];                                     // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE6[0x3];                                     // 0x08A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x08BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_7;                       // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_8;                       // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_9;                       // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x08E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x08EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x08ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x08EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE7[0x7];                                     // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE8[0x7];                                     // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0910(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0924(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FE9[0x3];                                     // 0x0925(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FEA[0x7];                                     // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Roz_anim_C_ExecuteUbergraph_roz_anim) == 0x000010, "Wrong alignment on Roz_anim_C_ExecuteUbergraph_roz_anim");
static_assert(sizeof(Roz_anim_C_ExecuteUbergraph_roz_anim) == 0x000950, "Wrong size on Roz_anim_C_ExecuteUbergraph_roz_anim");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, EntryPoint) == 0x000000, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CustomEvent_NotifyName_4) == 0x000014, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CustomEvent_NotifyName_3) == 0x00001C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CustomEvent_NotifyName_2) == 0x000034, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CustomEvent_NotifyName_1) == 0x00004C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CustomEvent_NotifyName) == 0x000064, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, Temp_name_Variable) == 0x00007C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Lerp_ReturnValue) == 0x000084, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000088, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Lerp_ReturnValue_1) == 0x00008C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000090, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Lerp_ReturnValue_2) == 0x000094, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Lerp_ReturnValue_3) == 0x000098, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_SwitchName_CmpSuccess) == 0x00009C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2) == 0x0000A0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3) == 0x0000A4, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Lerp_ReturnValue_4) == 0x0000A8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4) == 0x0000AC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_damage_4) == 0x0000B0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hit_5) == 0x0000B4, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_actor_1) == 0x000140, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_impact_1) == 0x000148, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_water_3) == 0x000158, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_water_2) == 0x000160, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_water_1) == 0x000168, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_water) == 0x000170, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_activate) == 0x000178, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_static) == 0x000179, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_frozen) == 0x00017A, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_active_1) == 0x00017B, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_active_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_actor) == 0x000180, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_damage_3) == 0x000188, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hit_4) == 0x00018C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_impact) == 0x000214, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_skipSetting) == 0x000220, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_key_2) == 0x000228, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_11) == 0x000238, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hit_3) == 0x000240, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_damage_2) == 0x0002C8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_fuel) == 0x0002CC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_10) == 0x0002D0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hit_2) == 0x0002D8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_index_1) == 0x000360, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_action) == 0x000364, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_9) == 0x000368, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_8) == 0x000370, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_damage_1) == 0x000378, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_location_1) == 0x00037C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_7) == 0x000388, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_6) == 0x000390, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_5) == 0x000398, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_wheelDelta) == 0x0003A0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_4) == 0x0003A8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_mouse) == 0x0003B0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_3) == 0x0003B8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_key_1) == 0x0003C0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_pressed_1) == 0x0003D8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_temperature_1) == 0x0003DC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_temperature) == 0x0003E0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_speed) == 0x0003E4, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_2) == 0x0003E8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hit_1) == 0x0003F0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_name) == 0x000478, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_volume) == 0x000488, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player_1) == 0x000490, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_location) == 0x000498, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_damage) == 0x0004A4, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_clean) == 0x0004A8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_player) == 0x0004B0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hit) == 0x0004B8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_hook) == 0x000540, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_gamemode) == 0x000548, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_settings) == 0x000550, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_key) == 0x000620, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_pressed) == 0x000638, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_color) == 0x00063C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_ignore) == 0x00064C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_NewParam) == 0x00064D, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_cord_1) == 0x000650, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_socket_1) == 0x000658, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_cord) == 0x000660, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_socket) == 0x000668, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_sentFrom) == 0x000670, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_active) == 0x000678, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000680, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_GetSocketLocation_ReturnValue) == 0x000688, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000698, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0006A0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_IsValid_ReturnValue) == 0x0006A8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_DeltaSeconds) == 0x0006AC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0006B0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0006B4, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0006B8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, Temp_int_Variable) == 0x0006BC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0006C0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_BreakTransform_Location) == 0x0006F0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_BreakTransform_Rotation) == 0x0006FC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_BreakTransform_Scale) == 0x000708, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Add_IntInt_ReturnValue) == 0x000714, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000718, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Round_ReturnValue) == 0x000720, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000724, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000728, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000734, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0007C0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_ComponentBoundEvent_OtherActor) == 0x0007C8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_ComponentBoundEvent_OtherComp) == 0x0007D0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0007D8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_ComponentBoundEvent_bFromSweep) == 0x0007DC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_ComponentBoundEvent_SweepResult) == 0x0007E0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_DynamicCast_AsMain_Player) == 0x000868, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_DynamicCast_bSuccess) == 0x000870, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_GetTimeAlive_ReturnValue) == 0x000874, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Lerp_ReturnValue_5) == 0x000878, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00087C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_DegSin_ReturnValue) == 0x000880, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Add_FloatFloat_ReturnValue) == 0x000884, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000888, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_owner) == 0x000890, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, K2Node_Event_index) == 0x000898, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00089C, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0008A0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0008A4, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0008A8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_RandomFloatInRange_ReturnValue) == 0x0008AC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0008B0, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0008B8, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roz_anim_C_ExecuteUbergraph_roz_anim, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0008BC, "Member 'Roz_anim_C_ExecuteUbergraph_roz_anim::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
