#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RozitBorg

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function rozitBorg.rozitBorg_C.ExecuteUbergraph_rozitBorg
// 0x00DC (0x00DC - 0x0000)
struct RozitBorg_C_ExecuteUbergraph_rozitBorg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D13[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RozitBorg_C_ExecuteUbergraph_rozitBorg) == 0x000004, "Wrong alignment on RozitBorg_C_ExecuteUbergraph_rozitBorg");
static_assert(sizeof(RozitBorg_C_ExecuteUbergraph_rozitBorg) == 0x0000DC, "Wrong size on RozitBorg_C_ExecuteUbergraph_rozitBorg");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, EntryPoint) == 0x000000, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::EntryPoint' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00000C, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_VLerp_ReturnValue) == 0x000010, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_Abs_ReturnValue) == 0x000034, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000038, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_VLerp_ReturnValue_1) == 0x00003C, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RozitBorg_C_ExecuteUbergraph_rozitBorg, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000054, "Member 'RozitBorg_C_ExecuteUbergraph_rozitBorg::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function rozitBorg.rozitBorg_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RozitBorg_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RozitBorg_C_ReceiveTick) == 0x000004, "Wrong alignment on RozitBorg_C_ReceiveTick");
static_assert(sizeof(RozitBorg_C_ReceiveTick) == 0x000004, "Wrong size on RozitBorg_C_ReceiveTick");
static_assert(offsetof(RozitBorg_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RozitBorg_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

