#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rufus_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass rufus_Skeleton_AnimBlueprint.rufus_Skeleton_AnimBlueprint_C
// 0x0BA0 (0x0E60 - 0x02C0)
class URufus_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2A0D[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x02F8(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0400(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_5;                            // 0x0420(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_4;                            // 0x05D0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x0780(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x0930(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0AE0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0C90(0x01B0)()
	float                                         Alpha;                                             // 0x0E40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0E44(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine;                                             // 0x0E50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A0E[0x4];                                     // 0x0E54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Pawn;                                              // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_rufus_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_0A792A764CE1672139CB70AB583D1C3C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_1FD9EC1A4D3448E35EA1C6BB048084A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_3E7450BF4A0B257167D655BBC2063D03();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_605FE054485F454ABE5C93A9AAAADF7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint_AnimGraphNode_LookAt_CB9066314D8E4D6F43597797B1573482();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"rufus_Skeleton_AnimBlueprint_C">();
	}
	static class URufus_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URufus_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(URufus_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on URufus_Skeleton_AnimBlueprint_C");
static_assert(sizeof(URufus_Skeleton_AnimBlueprint_C) == 0x000E60, "Wrong size on URufus_Skeleton_AnimBlueprint_C");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'URufus_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer) == 0x0002F8, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0003E0, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000400, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_5) == 0x000420, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_5' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_4) == 0x0005D0, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_4' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_3) == 0x000780, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_2) == 0x000930, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x000AE0, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000C90, "Member 'URufus_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, Alpha) == 0x000E40, "Member 'URufus_Skeleton_AnimBlueprint_C::Alpha' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, Loc) == 0x000E44, "Member 'URufus_Skeleton_AnimBlueprint_C::Loc' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, Spine) == 0x000E50, "Member 'URufus_Skeleton_AnimBlueprint_C::Spine' has a wrong offset!");
static_assert(offsetof(URufus_Skeleton_AnimBlueprint_C, Pawn) == 0x000E58, "Member 'URufus_Skeleton_AnimBlueprint_C::Pawn' has a wrong offset!");

}

