#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rufus_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function rufus_Skeleton_AnimBlueprint.rufus_Skeleton_AnimBlueprint_C.ExecuteUbergraph_rufus_Skeleton_AnimBlueprint
// 0x0068 (0x0068 - 0x0000)
struct Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A0F[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A10[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint");
static_assert(sizeof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint) == 0x000068, "Wrong size on Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_Lerp_ReturnValue_1) == 0x000018, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue) == 0x00001C, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000028, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000030, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000048, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x000050, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_VSize_ReturnValue) == 0x00005C, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000064, "Member 'Rufus_Skeleton_AnimBlueprint_C_ExecuteUbergraph_rufus_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function rufus_Skeleton_AnimBlueprint.rufus_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Rufus_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function rufus_Skeleton_AnimBlueprint.rufus_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Rufus_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Rufus_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Rufus_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Rufus_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Rufus_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Rufus_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Rufus_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

