#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Saltpile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function saltpile.saltpile_C.dropHeart
// 0x0050 (0x0050 - 0x0000)
struct Saltpile_C_DropHeart final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Saltpile_C_DropHeart) == 0x000010, "Wrong alignment on Saltpile_C_DropHeart");
static_assert(sizeof(Saltpile_C_DropHeart) == 0x000050, "Wrong size on Saltpile_C_DropHeart");
static_assert(offsetof(Saltpile_C_DropHeart, Temp_name_Variable) == 0x000000, "Member 'Saltpile_C_DropHeart::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Saltpile_C_DropHeart, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Saltpile_C_DropHeart::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Saltpile_C_DropHeart, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'Saltpile_C_DropHeart::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Saltpile_C_DropHeart, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'Saltpile_C_DropHeart::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

