#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SedanRiver

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass sedanRiver.sedanRiver_C
// 0x0020 (0x0240 - 0x0220)
class ASedanRiver_C final : public AActor
{
public:
	class UPnormal_C*                             Pnormal;                                           // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_radiation_C*                      RadComp;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"sedanRiver_C">();
	}
	static class ASedanRiver_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASedanRiver_C>();
	}
};
static_assert(alignof(ASedanRiver_C) == 0x000008, "Wrong alignment on ASedanRiver_C");
static_assert(sizeof(ASedanRiver_C) == 0x000240, "Wrong size on ASedanRiver_C");
static_assert(offsetof(ASedanRiver_C, Pnormal) == 0x000220, "Member 'ASedanRiver_C::Pnormal' has a wrong offset!");
static_assert(offsetof(ASedanRiver_C, RadComp) == 0x000228, "Member 'ASedanRiver_C::RadComp' has a wrong offset!");
static_assert(offsetof(ASedanRiver_C, StaticMesh) == 0x000230, "Member 'ASedanRiver_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASedanRiver_C, DefaultSceneRoot) == 0x000238, "Member 'ASedanRiver_C::DefaultSceneRoot' has a wrong offset!");

}

