#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBox

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_settings_structs.hpp"


namespace SDK::Params
{

// Function serverBox.serverBox_C.ExecuteUbergraph_serverBox
// 0x0AA0 (0x0AA0 - 0x0000)
struct ServerBox_C_ExecuteUbergraph_serverBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D88[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D89[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Active_calc, bool Active_downl, bool Active_coords, bool Active_play, bool Active_light)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8A[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D8B[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0170(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8C[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D8D[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0238(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ignore;                               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D8E[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x02D8(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D8F[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key_1;                                // 0x03A8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D90[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x03C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D91[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x03E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D92[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x046C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D93[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0488(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D94[0x4];                                     // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0540(0x0018)()
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x056C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2D95[0x4];                                     // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D96[0x4];                                     // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_serverMinigame_C*                  CallFunc_launchServerMinigame_Output_Get;          // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0620(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D97[0x3];                                     // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0640(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AProp_usb_C*                            K2Node_DynamicCast_AsProp_Usb;                     // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D98[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x06E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D99[0xF];                                     // 0x0711(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0720(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0750(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 K2Node_Event_key;                                  // 0x0780(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0790(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0818(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9A[0x3];                                     // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor;                                // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x08BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0944(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0951(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0952(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0953(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9B[0x3];                                     // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9C[0x3];                                     // 0x0961(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x0964(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x09EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x09ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x09EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_activate;                             // 0x09EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x09F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0A84(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0A85(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isExhausted_exhausted;                    // 0x0A86(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_calc;                    // 0x0A87(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_downl;                   // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_coords;                  // 0x0A89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_play;                    // 0x0A8A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_light;                   // 0x0A8B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9D[0x4];                                     // 0x0A8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0A90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBox_C_ExecuteUbergraph_serverBox) == 0x000010, "Wrong alignment on ServerBox_C_ExecuteUbergraph_serverBox");
static_assert(sizeof(ServerBox_C_ExecuteUbergraph_serverBox) == 0x000AA0, "Wrong size on ServerBox_C_ExecuteUbergraph_serverBox");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, EntryPoint) == 0x000000, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000010, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_Ease_ReturnValue) == 0x000014, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_VLerp_ReturnValue) == 0x000018, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, Temp_bool_Variable) == 0x000024, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, Temp_object_Variable) == 0x000028, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, Temp_object_Variable_1) == 0x000030, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Select_Default) == 0x000048, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_14) == 0x000050, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_7) == 0x000058, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_damage_4) == 0x0000E0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_fuel) == 0x0000E4, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_13) == 0x0000E8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_12) == 0x0000F0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_damage_3) == 0x0000F8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_location_1) == 0x0000FC, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_11) == 0x000108, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_10) == 0x000110, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_9) == 0x000118, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_wheelDelta) == 0x000120, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_8) == 0x000128, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_mouse) == 0x000130, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_7) == 0x000138, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_key_2) == 0x000140, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_pressed_1) == 0x000158, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_temperature_1) == 0x00015C, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_temperature) == 0x000160, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_speed) == 0x000164, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_6) == 0x000168, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_6) == 0x000170, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_name_1) == 0x0001F8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_volume) == 0x000208, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_5) == 0x000210, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_location) == 0x000218, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_damage_2) == 0x000224, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_clean) == 0x000228, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_4) == 0x000230, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_5) == 0x000238, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hook) == 0x0002C0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_ignore) == 0x0002C8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_ignore' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_gamemode) == 0x0002D0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_settings) == 0x0002D8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_key_1) == 0x0003A8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_pressed) == 0x0003C0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_color) == 0x0003C4, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_3) == 0x0003D8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_4) == 0x0003E0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_kick) == 0x000468, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_name) == 0x00046C, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_2) == 0x000478, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player_1) == 0x000480, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_3) == 0x000488, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_RandomFloatInRange_ReturnValue) == 0x000510, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000514, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000518, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000520, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000528, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_SelectFloat_ReturnValue) == 0x00052C, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_water_3) == 0x000530, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_water_2) == 0x000538, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_Conv_StringToText_ReturnValue) == 0x000540, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_water_1) == 0x000558, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_water) == 0x000560, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_damage_1) == 0x000568, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_2) == 0x00056C, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_actor_1) == 0x0005F8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_impact_1) == 0x000600, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000610, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_launchServerMinigame_Output_Get) == 0x000618, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_launchServerMinigame_Output_Get' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000620, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_ComponentBoundEvent_OtherActor) == 0x000628, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_ComponentBoundEvent_OtherComp) == 0x000630, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000638, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_ComponentBoundEvent_bFromSweep) == 0x00063C, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_ComponentBoundEvent_SweepResult) == 0x000640, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_DynamicCast_AsProp_Usb) == 0x0006C8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_DynamicCast_AsProp_Usb' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_DynamicCast_bSuccess) == 0x0006D0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0006D8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0006E0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_BooleanOR_ReturnValue) == 0x000710, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000720, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_TLerp_ReturnValue) == 0x000750, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_key) == 0x000780, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000790, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000818, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_SelectFloat_ReturnValue_1) == 0x0008A0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0008A4, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0008A8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0008AC, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_actor) == 0x0008B0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_damage) == 0x0008B8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit_1) == 0x0008BC, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_impact) == 0x000944, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_skipSetting) == 0x000950, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_SetStaticMesh_ReturnValue) == 0x000951, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_static) == 0x000952, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_frozen) == 0x000953, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_active) == 0x000954, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000958, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000960, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x000964, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_BooleanOR_ReturnValue_1) == 0x0009EC, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_Not_PreBool_ReturnValue) == 0x0009ED, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_BooleanAND_ReturnValue) == 0x0009EE, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_activate) == 0x0009EF, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_player) == 0x0009F0, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_hit) == 0x0009F8, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_index) == 0x000A80, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_Event_action) == 0x000A84, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_SwitchEnum_CmpSuccess) == 0x000A85, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_isExhausted_exhausted) == 0x000A86, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_isExhausted_exhausted' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_CustomEvent_active_calc) == 0x000A87, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_CustomEvent_active_calc' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_CustomEvent_active_downl) == 0x000A88, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_CustomEvent_active_downl' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_CustomEvent_active_coords) == 0x000A89, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_CustomEvent_active_coords' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_CustomEvent_active_play) == 0x000A8A, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_CustomEvent_active_play' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, K2Node_CustomEvent_active_light) == 0x000A8B, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::K2Node_CustomEvent_active_light' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ExecuteUbergraph_serverBox, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000A90, "Member 'ServerBox_C_ExecuteUbergraph_serverBox::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");

// Function serverBox.serverBox_C.powerChanged
// 0x0005 (0x0005 - 0x0000)
struct ServerBox_C_PowerChanged final
{
public:
	bool                                          Active_calc;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_downl;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_coords;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_play;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_light;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBox_C_PowerChanged) == 0x000001, "Wrong alignment on ServerBox_C_PowerChanged");
static_assert(sizeof(ServerBox_C_PowerChanged) == 0x000005, "Wrong size on ServerBox_C_PowerChanged");
static_assert(offsetof(ServerBox_C_PowerChanged, Active_calc) == 0x000000, "Member 'ServerBox_C_PowerChanged::Active_calc' has a wrong offset!");
static_assert(offsetof(ServerBox_C_PowerChanged, Active_downl) == 0x000001, "Member 'ServerBox_C_PowerChanged::Active_downl' has a wrong offset!");
static_assert(offsetof(ServerBox_C_PowerChanged, Active_coords) == 0x000002, "Member 'ServerBox_C_PowerChanged::Active_coords' has a wrong offset!");
static_assert(offsetof(ServerBox_C_PowerChanged, Active_play) == 0x000003, "Member 'ServerBox_C_PowerChanged::Active_play' has a wrong offset!");
static_assert(offsetof(ServerBox_C_PowerChanged, Active_light) == 0x000004, "Member 'ServerBox_C_PowerChanged::Active_light' has a wrong offset!");

// Function serverBox.serverBox_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct ServerBox_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBox_C_ActionOptionIndex) == 0x000008, "Wrong alignment on ServerBox_C_ActionOptionIndex");
static_assert(sizeof(ServerBox_C_ActionOptionIndex) == 0x000098, "Wrong size on ServerBox_C_ActionOptionIndex");
static_assert(offsetof(ServerBox_C_ActionOptionIndex, Player) == 0x000000, "Member 'ServerBox_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ActionOptionIndex, Hit) == 0x000008, "Member 'ServerBox_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'ServerBox_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(ServerBox_C_ActionOptionIndex, Action) == 0x000094, "Member 'ServerBox_C_ActionOptionIndex::Action' has a wrong offset!");

// Function serverBox.serverBox_C.virus
// 0x0001 (0x0001 - 0x0000)
struct ServerBox_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBox_C_Virus) == 0x000001, "Wrong alignment on ServerBox_C_Virus");
static_assert(sizeof(ServerBox_C_Virus) == 0x000001, "Wrong size on ServerBox_C_Virus");
static_assert(offsetof(ServerBox_C_Virus, Activate) == 0x000000, "Member 'ServerBox_C_Virus::Activate' has a wrong offset!");

// Function serverBox.serverBox_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct ServerBox_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_Active;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBox_C_SetPropProps) == 0x000001, "Wrong alignment on ServerBox_C_SetPropProps");
static_assert(sizeof(ServerBox_C_SetPropProps) == 0x000003, "Wrong size on ServerBox_C_SetPropProps");
static_assert(offsetof(ServerBox_C_SetPropProps, Static) == 0x000000, "Member 'ServerBox_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(ServerBox_C_SetPropProps, Frozen) == 0x000001, "Member 'ServerBox_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(ServerBox_C_SetPropProps, Param_Active) == 0x000002, "Member 'ServerBox_C_SetPropProps::Param_Active' has a wrong offset!");

// Function serverBox.serverBox_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct ServerBox_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBox_C_AddDamage) == 0x000008, "Wrong alignment on ServerBox_C_AddDamage");
static_assert(sizeof(ServerBox_C_AddDamage) == 0x0000A8, "Wrong size on ServerBox_C_AddDamage");
static_assert(offsetof(ServerBox_C_AddDamage, Actor) == 0x000000, "Member 'ServerBox_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(ServerBox_C_AddDamage, Damage) == 0x000008, "Member 'ServerBox_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(ServerBox_C_AddDamage, Hit) == 0x00000C, "Member 'ServerBox_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(ServerBox_C_AddDamage, Impact) == 0x000094, "Member 'ServerBox_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(ServerBox_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'ServerBox_C_AddDamage::SkipSetting' has a wrong offset!");

// Function serverBox.serverBox_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct ServerBox_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBox_C_SetKey) == 0x000008, "Wrong alignment on ServerBox_C_SetKey");
static_assert(sizeof(ServerBox_C_SetKey) == 0x000010, "Wrong size on ServerBox_C_SetKey");
static_assert(offsetof(ServerBox_C_SetKey, Key) == 0x000000, "Member 'ServerBox_C_SetKey::Key' has a wrong offset!");

// Function serverBox.serverBox_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct ServerBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
