#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShitDuende

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function shitDuende.shitDuende_C.ExecuteUbergraph_shitDuende
// 0x00E8 (0x00E8 - 0x0000)
struct ShitDuende_C_ExecuteUbergraph_shitDuende final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0028(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShitDuende_C_ExecuteUbergraph_shitDuende) == 0x000008, "Wrong alignment on ShitDuende_C_ExecuteUbergraph_shitDuende");
static_assert(sizeof(ShitDuende_C_ExecuteUbergraph_shitDuende) == 0x0000E8, "Wrong size on ShitDuende_C_ExecuteUbergraph_shitDuende");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, EntryPoint) == 0x000000, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000004, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, Temp_object_Variable) == 0x000008, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_obj_statDyn_obj) == 0x000028, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000048, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_LineTraceSingleForObjects_OutHit) == 0x00005C, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(ShitDuende_C_ExecuteUbergraph_shitDuende, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0000E4, "Member 'ShitDuende_C_ExecuteUbergraph_shitDuende::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function shitDuende.shitDuende_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ShitDuende_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShitDuende_C_ReceiveTick) == 0x000004, "Wrong alignment on ShitDuende_C_ReceiveTick");
static_assert(sizeof(ShitDuende_C_ReceiveTick) == 0x000004, "Wrong size on ShitDuende_C_ReceiveTick");
static_assert(offsetof(ShitDuende_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ShitDuende_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

