#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShitDuende

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass shitDuende.shitDuende_C
// 0x0048 (0x0268 - 0x0220)
class AShitDuende_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Eyes;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_E54BBBF4492F7FDD58AAE083ADD786C4;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_E54BBBF4492F7FDD58AAE083ADD786C4;     // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6D[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Afdsfdgdgd;                                        // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_shitDuende(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Diss();
	void ReceiveBeginPlay();
	void A__UpdateFunc();
	void A__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"shitDuende_C">();
	}
	static class AShitDuende_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShitDuende_C>();
	}
};
static_assert(alignof(AShitDuende_C) == 0x000008, "Wrong alignment on AShitDuende_C");
static_assert(sizeof(AShitDuende_C) == 0x000268, "Wrong size on AShitDuende_C");
static_assert(offsetof(AShitDuende_C, UberGraphFrame) == 0x000220, "Member 'AShitDuende_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, Eyes) == 0x000228, "Member 'AShitDuende_C::Eyes' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, SkeletalMesh) == 0x000230, "Member 'AShitDuende_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, Box) == 0x000238, "Member 'AShitDuende_C::Box' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, DefaultSceneRoot) == 0x000240, "Member 'AShitDuende_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, A_a_E54BBBF4492F7FDD58AAE083ADD786C4) == 0x000248, "Member 'AShitDuende_C::A_a_E54BBBF4492F7FDD58AAE083ADD786C4' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, A__Direction_E54BBBF4492F7FDD58AAE083ADD786C4) == 0x00024C, "Member 'AShitDuende_C::A__Direction_E54BBBF4492F7FDD58AAE083ADD786C4' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, A) == 0x000250, "Member 'AShitDuende_C::A' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, Dynmat) == 0x000258, "Member 'AShitDuende_C::Dynmat' has a wrong offset!");
static_assert(offsetof(AShitDuende_C, Afdsfdgdgd) == 0x000260, "Member 'AShitDuende_C::Afdsfdgdgd' has a wrong offset!");

}

