#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShitDuende_rigged_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass shitDuende_rigged_Skeleton_AnimBlueprint.shitDuende_rigged_Skeleton_AnimBlueprint_C
// 0x02C0 (0x0580 - 0x02C0)
class UShitDuende_rigged_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_7[0x8];                                        // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02F8(0x0020)()
	uint8                                         Pad_8[0x8];                                        // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0320(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04F0(0x0080)()
	struct FVector                                LookAt;                                            // 0x0570(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_shitDuende_rigged_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"shitDuende_rigged_Skeleton_AnimBlueprint_C">();
	}
	static class UShitDuende_rigged_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShitDuende_rigged_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UShitDuende_rigged_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UShitDuende_rigged_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UShitDuende_rigged_Skeleton_AnimBlueprint_C) == 0x000580, "Wrong size on UShitDuende_rigged_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0002F8, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000320, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004D0, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x0004F0, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UShitDuende_rigged_Skeleton_AnimBlueprint_C, LookAt) == 0x000570, "Member 'UShitDuende_rigged_Skeleton_AnimBlueprint_C::LookAt' has a wrong offset!");

}

