#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shredder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function shredder.shredder_C.getPriceMultiplier
// 0x0004 (0x0004 - 0x0000)
struct Shredder_C_GetPriceMultiplier final
{
public:
	float                                         PriceMult;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_GetPriceMultiplier) == 0x000004, "Wrong alignment on Shredder_C_GetPriceMultiplier");
static_assert(sizeof(Shredder_C_GetPriceMultiplier) == 0x000004, "Wrong size on Shredder_C_GetPriceMultiplier");
static_assert(offsetof(Shredder_C_GetPriceMultiplier, PriceMult) == 0x000000, "Member 'Shredder_C_GetPriceMultiplier::PriceMult' has a wrong offset!");

// Function shredder.shredder_C.skipRadial
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_SkipRadial final
{
public:
	bool                                          Skip;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_SkipRadial) == 0x000001, "Wrong alignment on Shredder_C_SkipRadial");
static_assert(sizeof(Shredder_C_SkipRadial) == 0x000001, "Wrong size on Shredder_C_SkipRadial");
static_assert(offsetof(Shredder_C_SkipRadial, Skip) == 0x000000, "Member 'Shredder_C_SkipRadial::Skip' has a wrong offset!");

// Function shredder.shredder_C.gascanFuel
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_GascanFuel final
{
public:
	class AProp_gascan_C*                         Gascan;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Fueled;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_GascanFuel) == 0x000008, "Wrong alignment on Shredder_C_GascanFuel");
static_assert(sizeof(Shredder_C_GascanFuel) == 0x000010, "Wrong size on Shredder_C_GascanFuel");
static_assert(offsetof(Shredder_C_GascanFuel, Gascan) == 0x000000, "Member 'Shredder_C_GascanFuel::Gascan' has a wrong offset!");
static_assert(offsetof(Shredder_C_GascanFuel, Fueled) == 0x000008, "Member 'Shredder_C_GascanFuel::Fueled' has a wrong offset!");

// Function shredder.shredder_C.toolboxFix
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_ToolboxFix final
{
public:
	class AProp_toolbox_C*                        Toolbox;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_ToolboxFix) == 0x000008, "Wrong alignment on Shredder_C_ToolboxFix");
static_assert(sizeof(Shredder_C_ToolboxFix) == 0x000010, "Wrong size on Shredder_C_ToolboxFix");
static_assert(offsetof(Shredder_C_ToolboxFix, Toolbox) == 0x000000, "Member 'Shredder_C_ToolboxFix::Toolbox' has a wrong offset!");
static_assert(offsetof(Shredder_C_ToolboxFix, Return) == 0x000008, "Member 'Shredder_C_ToolboxFix::Return' has a wrong offset!");

// Function shredder.shredder_C.GetKey
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_GetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_GetKey) == 0x000008, "Wrong alignment on Shredder_C_GetKey");
static_assert(sizeof(Shredder_C_GetKey) == 0x000010, "Wrong size on Shredder_C_GetKey");
static_assert(offsetof(Shredder_C_GetKey, Key) == 0x000000, "Member 'Shredder_C_GetKey::Key' has a wrong offset!");

// Function shredder.shredder_C.canBeUsedHold
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_CanBeUsedHold final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_CanBeUsedHold) == 0x000001, "Wrong alignment on Shredder_C_CanBeUsedHold");
static_assert(sizeof(Shredder_C_CanBeUsedHold) == 0x000001, "Wrong size on Shredder_C_CanBeUsedHold");
static_assert(offsetof(Shredder_C_CanBeUsedHold, Return) == 0x000000, "Member 'Shredder_C_CanBeUsedHold::Return' has a wrong offset!");

// Function shredder.shredder_C.processKeys
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_ProcessKeys final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_ProcessKeys) == 0x000001, "Wrong alignment on Shredder_C_ProcessKeys");
static_assert(sizeof(Shredder_C_ProcessKeys) == 0x000001, "Wrong size on Shredder_C_ProcessKeys");
static_assert(offsetof(Shredder_C_ProcessKeys, Return) == 0x000000, "Member 'Shredder_C_ProcessKeys::Return' has a wrong offset!");

// Function shredder.shredder_C.getOnlyKey
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_GetOnlyKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_GetOnlyKey) == 0x000008, "Wrong alignment on Shredder_C_GetOnlyKey");
static_assert(sizeof(Shredder_C_GetOnlyKey) == 0x000010, "Wrong size on Shredder_C_GetOnlyKey");
static_assert(offsetof(Shredder_C_GetOnlyKey, Key) == 0x000000, "Member 'Shredder_C_GetOnlyKey::Key' has a wrong offset!");

// Function shredder.shredder_C.setPath
// 0x0018 (0x0018 - 0x0000)
struct Shredder_C_SetPath final
{
public:
	TArray<struct FVector>                        Path;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Return;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_SetPath) == 0x000008, "Wrong alignment on Shredder_C_SetPath");
static_assert(sizeof(Shredder_C_SetPath) == 0x000018, "Wrong size on Shredder_C_SetPath");
static_assert(offsetof(Shredder_C_SetPath, Path) == 0x000000, "Member 'Shredder_C_SetPath::Path' has a wrong offset!");
static_assert(offsetof(Shredder_C_SetPath, Return) == 0x000010, "Member 'Shredder_C_SetPath::Return' has a wrong offset!");

// Function shredder.shredder_C.getActionOptions
// 0x0088 (0x0088 - 0x0000)
struct Shredder_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	uint8                                         Number;                                            // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               Temp_byte_Variable;                                // 0x0050(0x0010)(ReferenceParm)
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_interactionActions>               K2Node_Select_Default;                             // 0x0078(0x0010)(ReferenceParm)
};
static_assert(alignof(Shredder_C_GetActionOptions) == 0x000008, "Wrong alignment on Shredder_C_GetActionOptions");
static_assert(sizeof(Shredder_C_GetActionOptions) == 0x000088, "Wrong size on Shredder_C_GetActionOptions");
static_assert(offsetof(Shredder_C_GetActionOptions, Player) == 0x000000, "Member 'Shredder_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Component) == 0x000008, "Member 'Shredder_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Actor) == 0x000010, "Member 'Shredder_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Options) == 0x000018, "Member 'Shredder_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Shredder_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Shredder_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Number) == 0x000048, "Member 'Shredder_C_GetActionOptions::Number' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Temp_bool_Variable) == 0x000049, "Member 'Shredder_C_GetActionOptions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, Temp_byte_Variable) == 0x000050, "Member 'Shredder_C_GetActionOptions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000060, "Member 'Shredder_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'Shredder_C_GetActionOptions::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shredder_C_GetActionOptions, K2Node_Select_Default) == 0x000078, "Member 'Shredder_C_GetActionOptions::K2Node_Select_Default' has a wrong offset!");

// Function shredder.shredder_C.landedOn
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_LandedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreFallDamage;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_LandedOn) == 0x000008, "Wrong alignment on Shredder_C_LandedOn");
static_assert(sizeof(Shredder_C_LandedOn) == 0x000010, "Wrong size on Shredder_C_LandedOn");
static_assert(offsetof(Shredder_C_LandedOn, Player) == 0x000000, "Member 'Shredder_C_LandedOn::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_LandedOn, IgnoreFallDamage) == 0x000008, "Member 'Shredder_C_LandedOn::IgnoreFallDamage' has a wrong offset!");

// Function shredder.shredder_C.canBePutInContainer
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_CanBePutInContainer final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_CanBePutInContainer) == 0x000001, "Wrong alignment on Shredder_C_CanBePutInContainer");
static_assert(sizeof(Shredder_C_CanBePutInContainer) == 0x000001, "Wrong size on Shredder_C_CanBePutInContainer");
static_assert(offsetof(Shredder_C_CanBePutInContainer, Return) == 0x000000, "Member 'Shredder_C_CanBePutInContainer::Return' has a wrong offset!");

// Function shredder.shredder_C.isButtonUsed
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_IsButtonUsed final
{
public:
	bool                                          Failed;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_IsButtonUsed) == 0x000001, "Wrong alignment on Shredder_C_IsButtonUsed");
static_assert(sizeof(Shredder_C_IsButtonUsed) == 0x000001, "Wrong size on Shredder_C_IsButtonUsed");
static_assert(offsetof(Shredder_C_IsButtonUsed, Failed) == 0x000000, "Member 'Shredder_C_IsButtonUsed::Failed' has a wrong offset!");

// Function shredder.shredder_C.lookAt
// 0x0120 (0x0120 - 0x0000)
struct Shredder_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Number;                                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00E0(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_LookAt) == 0x000008, "Wrong alignment on Shredder_C_LookAt");
static_assert(sizeof(Shredder_C_LookAt) == 0x000120, "Wrong size on Shredder_C_LookAt");
static_assert(offsetof(Shredder_C_LookAt, Player) == 0x000000, "Member 'Shredder_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, Hit) == 0x000008, "Member 'Shredder_C_LookAt::Hit' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, Return) == 0x000090, "Member 'Shredder_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, Text) == 0x000098, "Member 'Shredder_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Shredder_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, Number) == 0x0000B0, "Member 'Shredder_C_LookAt::Number' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B8, "Member 'Shredder_C_LookAt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'Shredder_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000E0, "Member 'Shredder_C_LookAt::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F8, "Member 'Shredder_C_LookAt::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000100, "Member 'Shredder_C_LookAt::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Shredder_C_LookAt, CallFunc_SelectString_ReturnValue) == 0x000110, "Member 'Shredder_C_LookAt::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function shredder.shredder_C.noRespawn
// 0x0002 (0x0002 - 0x0000)
struct Shredder_C_NoRespawn final
{
public:
	bool                                          Param_NoRespawn;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_NoRespawn) == 0x000001, "Wrong alignment on Shredder_C_NoRespawn");
static_assert(sizeof(Shredder_C_NoRespawn) == 0x000002, "Wrong size on Shredder_C_NoRespawn");
static_assert(offsetof(Shredder_C_NoRespawn, Param_NoRespawn) == 0x000000, "Member 'Shredder_C_NoRespawn::Param_NoRespawn' has a wrong offset!");
static_assert(offsetof(Shredder_C_NoRespawn, Return) == 0x000001, "Member 'Shredder_C_NoRespawn::Return' has a wrong offset!");

// Function shredder.shredder_C.canPickup
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_CanPickup final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_CanPickup) == 0x000001, "Wrong alignment on Shredder_C_CanPickup");
static_assert(sizeof(Shredder_C_CanPickup) == 0x000001, "Wrong size on Shredder_C_CanPickup");
static_assert(offsetof(Shredder_C_CanPickup, Return) == 0x000000, "Member 'Shredder_C_CanPickup::Return' has a wrong offset!");

// Function shredder.shredder_C.asProp
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_AsProp final
{
public:
	class AProp_C*                                Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_AsProp) == 0x000008, "Wrong alignment on Shredder_C_AsProp");
static_assert(sizeof(Shredder_C_AsProp) == 0x000008, "Wrong size on Shredder_C_AsProp");
static_assert(offsetof(Shredder_C_AsProp, Return) == 0x000000, "Member 'Shredder_C_AsProp::Return' has a wrong offset!");

// Function shredder.shredder_C.dreamInv
// 0x0018 (0x0018 - 0x0000)
struct Shredder_C_DreamInv final
{
public:
	TArray<struct FStruct_save>                   Invv;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ADreamBase_C*                           Base;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_DreamInv) == 0x000008, "Wrong alignment on Shredder_C_DreamInv");
static_assert(sizeof(Shredder_C_DreamInv) == 0x000018, "Wrong size on Shredder_C_DreamInv");
static_assert(offsetof(Shredder_C_DreamInv, Invv) == 0x000000, "Member 'Shredder_C_DreamInv::Invv' has a wrong offset!");
static_assert(offsetof(Shredder_C_DreamInv, Base) == 0x000010, "Member 'Shredder_C_DreamInv::Base' has a wrong offset!");

// Function shredder.shredder_C.buttonsVisibility
// 0x0004 (0x0004 - 0x0000)
struct Shredder_C_buttonsVisibility final
{
public:
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_buttonsVisibility) == 0x000004, "Wrong alignment on Shredder_C_buttonsVisibility");
static_assert(sizeof(Shredder_C_buttonsVisibility) == 0x000004, "Wrong size on Shredder_C_buttonsVisibility");
static_assert(offsetof(Shredder_C_buttonsVisibility, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'Shredder_C_buttonsVisibility::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function shredder.shredder_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on Shredder_C_LeaveWaterOrigin");
static_assert(sizeof(Shredder_C_LeaveWaterOrigin) == 0x000008, "Wrong size on Shredder_C_LeaveWaterOrigin");
static_assert(offsetof(Shredder_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'Shredder_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function shredder.shredder_C.virus
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_Virus) == 0x000001, "Wrong alignment on Shredder_C_Virus");
static_assert(sizeof(Shredder_C_Virus) == 0x000001, "Wrong size on Shredder_C_Virus");
static_assert(offsetof(Shredder_C_Virus, Activate) == 0x000000, "Member 'Shredder_C_Virus::Activate' has a wrong offset!");

// Function shredder.shredder_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct Shredder_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_SetPropProps) == 0x000001, "Wrong alignment on Shredder_C_SetPropProps");
static_assert(sizeof(Shredder_C_SetPropProps) == 0x000003, "Wrong size on Shredder_C_SetPropProps");
static_assert(offsetof(Shredder_C_SetPropProps, Static) == 0x000000, "Member 'Shredder_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(Shredder_C_SetPropProps, Frozen) == 0x000001, "Member 'Shredder_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(Shredder_C_SetPropProps, Active) == 0x000002, "Member 'Shredder_C_SetPropProps::Active' has a wrong offset!");

// Function shredder.shredder_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct Shredder_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_AddDamage) == 0x000008, "Wrong alignment on Shredder_C_AddDamage");
static_assert(sizeof(Shredder_C_AddDamage) == 0x0000A8, "Wrong size on Shredder_C_AddDamage");
static_assert(offsetof(Shredder_C_AddDamage, Actor) == 0x000000, "Member 'Shredder_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(Shredder_C_AddDamage, Damage) == 0x000008, "Member 'Shredder_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(Shredder_C_AddDamage, Hit) == 0x00000C, "Member 'Shredder_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(Shredder_C_AddDamage, Impact) == 0x000094, "Member 'Shredder_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(Shredder_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'Shredder_C_AddDamage::SkipSetting' has a wrong offset!");

// Function shredder.shredder_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_SetKey) == 0x000008, "Wrong alignment on Shredder_C_SetKey");
static_assert(sizeof(Shredder_C_SetKey) == 0x000010, "Wrong size on Shredder_C_SetKey");
static_assert(offsetof(Shredder_C_SetKey, Key) == 0x000000, "Member 'Shredder_C_SetKey::Key' has a wrong offset!");

// Function shredder.shredder_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct Shredder_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Shredder_C_SteppedOn) == 0x000008, "Wrong alignment on Shredder_C_SteppedOn");
static_assert(sizeof(Shredder_C_SteppedOn) == 0x000090, "Wrong size on Shredder_C_SteppedOn");
static_assert(offsetof(Shredder_C_SteppedOn, Player) == 0x000000, "Member 'Shredder_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_SteppedOn, Hit) == 0x000008, "Member 'Shredder_C_SteppedOn::Hit' has a wrong offset!");

// Function shredder.shredder_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct Shredder_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_FireDamage) == 0x000004, "Wrong alignment on Shredder_C_FireDamage");
static_assert(sizeof(Shredder_C_FireDamage) == 0x000004, "Wrong size on Shredder_C_FireDamage");
static_assert(offsetof(Shredder_C_FireDamage, Damage) == 0x000000, "Member 'Shredder_C_FireDamage::Damage' has a wrong offset!");

// Function shredder.shredder_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct Shredder_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_Ignite) == 0x000004, "Wrong alignment on Shredder_C_Ignite");
static_assert(sizeof(Shredder_C_Ignite) == 0x000004, "Wrong size on Shredder_C_Ignite");
static_assert(offsetof(Shredder_C_Ignite, Fuel) == 0x000000, "Member 'Shredder_C_Ignite::Fuel' has a wrong offset!");

// Function shredder.shredder_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct Shredder_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Shredder_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on Shredder_C_ReceivedPhyiscsDamage");
static_assert(sizeof(Shredder_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on Shredder_C_ReceivedPhyiscsDamage");
static_assert(offsetof(Shredder_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'Shredder_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(Shredder_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'Shredder_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function shredder.shredder_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandUse_RMB");
static_assert(sizeof(Shredder_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on Shredder_C_PlayerHandUse_RMB");
static_assert(offsetof(Shredder_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'Shredder_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function shredder.shredder_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandUse_LMB");
static_assert(sizeof(Shredder_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on Shredder_C_PlayerHandUse_LMB");
static_assert(offsetof(Shredder_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'Shredder_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function shredder.shredder_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_Exploded) == 0x000004, "Wrong alignment on Shredder_C_Exploded");
static_assert(sizeof(Shredder_C_Exploded) == 0x000010, "Wrong size on Shredder_C_Exploded");
static_assert(offsetof(Shredder_C_Exploded, Damage) == 0x000000, "Member 'Shredder_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(Shredder_C_Exploded, Location) == 0x000004, "Member 'Shredder_C_Exploded::Location' has a wrong offset!");

// Function shredder.shredder_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandRelease_RMB");
static_assert(sizeof(Shredder_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on Shredder_C_PlayerHandRelease_RMB");
static_assert(offsetof(Shredder_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'Shredder_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function shredder.shredder_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandRelease_LMB");
static_assert(sizeof(Shredder_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on Shredder_C_PlayerHandRelease_LMB");
static_assert(offsetof(Shredder_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'Shredder_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function shredder.shredder_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandMouseWheel");
static_assert(sizeof(Shredder_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on Shredder_C_PlayerHandMouseWheel");
static_assert(offsetof(Shredder_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'Shredder_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'Shredder_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function shredder.shredder_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandMouse");
static_assert(sizeof(Shredder_C_PlayerHandMouse) == 0x000010, "Wrong size on Shredder_C_PlayerHandMouse");
static_assert(offsetof(Shredder_C_PlayerHandMouse, Player) == 0x000000, "Member 'Shredder_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Shredder_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function shredder.shredder_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Shredder_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Shredder_C_PlayerHandAnyKey");
static_assert(sizeof(Shredder_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Shredder_C_PlayerHandAnyKey");
static_assert(offsetof(Shredder_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Shredder_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'Shredder_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(Shredder_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Shredder_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function shredder.shredder_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Shredder_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_AddTemperature) == 0x000004, "Wrong alignment on Shredder_C_AddTemperature");
static_assert(sizeof(Shredder_C_AddTemperature) == 0x000004, "Wrong size on Shredder_C_AddTemperature");
static_assert(offsetof(Shredder_C_AddTemperature, Temperature) == 0x000000, "Member 'Shredder_C_AddTemperature::Temperature' has a wrong offset!");

// Function shredder.shredder_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Shredder_C_AccumulateTemperature");
static_assert(sizeof(Shredder_C_AccumulateTemperature) == 0x000008, "Wrong size on Shredder_C_AccumulateTemperature");
static_assert(offsetof(Shredder_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Shredder_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Shredder_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Shredder_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function shredder.shredder_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Shredder_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_ActionName) == 0x000008, "Wrong alignment on Shredder_C_ActionName");
static_assert(sizeof(Shredder_C_ActionName) == 0x0000A0, "Wrong size on Shredder_C_ActionName");
static_assert(offsetof(Shredder_C_ActionName, Player) == 0x000000, "Member 'Shredder_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_ActionName, Hit) == 0x000008, "Member 'Shredder_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Shredder_C_ActionName, Param_Name) == 0x000090, "Member 'Shredder_C_ActionName::Param_Name' has a wrong offset!");

// Function shredder.shredder_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Shredder_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_Stepped) == 0x000004, "Wrong alignment on Shredder_C_Stepped");
static_assert(sizeof(Shredder_C_Stepped) == 0x000004, "Wrong size on Shredder_C_Stepped");
static_assert(offsetof(Shredder_C_Stepped, Volume) == 0x000000, "Member 'Shredder_C_Stepped::Volume' has a wrong offset!");

// Function shredder.shredder_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerLookAway) == 0x000008, "Wrong alignment on Shredder_C_PlayerLookAway");
static_assert(sizeof(Shredder_C_PlayerLookAway) == 0x000008, "Wrong size on Shredder_C_PlayerLookAway");
static_assert(offsetof(Shredder_C_PlayerLookAway, Player) == 0x000000, "Member 'Shredder_C_PlayerLookAway::Player' has a wrong offset!");

// Function shredder.shredder_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Shredder_C_ReachedByExplosion");
static_assert(sizeof(Shredder_C_ReachedByExplosion) == 0x000010, "Wrong size on Shredder_C_ReachedByExplosion");
static_assert(offsetof(Shredder_C_ReachedByExplosion, Location) == 0x000000, "Member 'Shredder_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Shredder_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Shredder_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function shredder.shredder_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_Slice) == 0x000001, "Wrong alignment on Shredder_C_Slice");
static_assert(sizeof(Shredder_C_Slice) == 0x000001, "Wrong size on Shredder_C_Slice");
static_assert(offsetof(Shredder_C_Slice, Clean) == 0x000000, "Member 'Shredder_C_Slice::Clean' has a wrong offset!");

// Function shredder.shredder_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Shredder_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Shredder_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Shredder_C_PlayerUsedOn");
static_assert(sizeof(Shredder_C_PlayerUsedOn) == 0x000090, "Wrong size on Shredder_C_PlayerUsedOn");
static_assert(offsetof(Shredder_C_PlayerUsedOn, Player) == 0x000000, "Member 'Shredder_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Shredder_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function shredder.shredder_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_Hooked) == 0x000008, "Wrong alignment on Shredder_C_Hooked");
static_assert(sizeof(Shredder_C_Hooked) == 0x000008, "Wrong size on Shredder_C_Hooked");
static_assert(offsetof(Shredder_C_Hooked, Hook) == 0x000000, "Member 'Shredder_C_Hooked::Hook' has a wrong offset!");

// Function shredder.shredder_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_CleanSponge) == 0x000008, "Wrong alignment on Shredder_C_CleanSponge");
static_assert(sizeof(Shredder_C_CleanSponge) == 0x000010, "Wrong size on Shredder_C_CleanSponge");
static_assert(offsetof(Shredder_C_CleanSponge, Clean) == 0x000000, "Member 'Shredder_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(Shredder_C_CleanSponge, Player) == 0x000008, "Member 'Shredder_C_CleanSponge::Player' has a wrong offset!");

// Function shredder.shredder_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_HookTension) == 0x000008, "Wrong alignment on Shredder_C_HookTension");
static_assert(sizeof(Shredder_C_HookTension) == 0x000008, "Wrong size on Shredder_C_HookTension");
static_assert(offsetof(Shredder_C_HookTension, Hook) == 0x000000, "Member 'Shredder_C_HookTension::Hook' has a wrong offset!");

// Function shredder.shredder_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Shredder_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Shredder_C_Player_use) == 0x000008, "Wrong alignment on Shredder_C_Player_use");
static_assert(sizeof(Shredder_C_Player_use) == 0x000090, "Wrong size on Shredder_C_Player_use");
static_assert(offsetof(Shredder_C_Player_use, Player) == 0x000000, "Member 'Shredder_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_Player_use, Hit) == 0x000008, "Member 'Shredder_C_Player_use::Hit' has a wrong offset!");

// Function shredder.shredder_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct Shredder_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_Kicked) == 0x000001, "Wrong alignment on Shredder_C_Kicked");
static_assert(sizeof(Shredder_C_Kicked) == 0x000001, "Wrong size on Shredder_C_Kicked");
static_assert(offsetof(Shredder_C_Kicked, Kick) == 0x000000, "Member 'Shredder_C_Kicked::Kick' has a wrong offset!");

// Function shredder.shredder_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_SendName) == 0x000004, "Wrong alignment on Shredder_C_SendName");
static_assert(sizeof(Shredder_C_SendName) == 0x000008, "Wrong size on Shredder_C_SendName");
static_assert(offsetof(Shredder_C_SendName, Param_Name) == 0x000000, "Member 'Shredder_C_SendName::Param_Name' has a wrong offset!");

// Function shredder.shredder_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_Thrown) == 0x000008, "Wrong alignment on Shredder_C_Thrown");
static_assert(sizeof(Shredder_C_Thrown) == 0x000008, "Wrong size on Shredder_C_Thrown");
static_assert(offsetof(Shredder_C_Thrown, Player) == 0x000000, "Member 'Shredder_C_Thrown::Player' has a wrong offset!");

// Function shredder.shredder_C.damageByPlayer
// 0x0098 (0x0098 - 0x0000)
struct Shredder_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Damage;                                            // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_DamageByPlayer) == 0x000008, "Wrong alignment on Shredder_C_DamageByPlayer");
static_assert(sizeof(Shredder_C_DamageByPlayer) == 0x000098, "Wrong size on Shredder_C_DamageByPlayer");
static_assert(offsetof(Shredder_C_DamageByPlayer, Player) == 0x000000, "Member 'Shredder_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Shredder_C_DamageByPlayer, Hit) == 0x000008, "Member 'Shredder_C_DamageByPlayer::Hit' has a wrong offset!");
static_assert(offsetof(Shredder_C_DamageByPlayer, Damage) == 0x000090, "Member 'Shredder_C_DamageByPlayer::Damage' has a wrong offset!");

// Function shredder.shredder_C.playerUnequip
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerUnequip final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerUnequip) == 0x000008, "Wrong alignment on Shredder_C_PlayerUnequip");
static_assert(sizeof(Shredder_C_PlayerUnequip) == 0x000008, "Wrong size on Shredder_C_PlayerUnequip");
static_assert(offsetof(Shredder_C_PlayerUnequip, Player) == 0x000000, "Member 'Shredder_C_PlayerUnequip::Player' has a wrong offset!");

// Function shredder.shredder_C.playerHold
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerHold final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerHold) == 0x000008, "Wrong alignment on Shredder_C_PlayerHold");
static_assert(sizeof(Shredder_C_PlayerHold) == 0x000008, "Wrong size on Shredder_C_PlayerHold");
static_assert(offsetof(Shredder_C_PlayerHold, Player) == 0x000000, "Member 'Shredder_C_PlayerHold::Player' has a wrong offset!");

// Function shredder.shredder_C.playerR
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_PlayerR final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_PlayerR) == 0x000008, "Wrong alignment on Shredder_C_PlayerR");
static_assert(sizeof(Shredder_C_PlayerR) == 0x000008, "Wrong size on Shredder_C_PlayerR");
static_assert(offsetof(Shredder_C_PlayerR, Player) == 0x000000, "Member 'Shredder_C_PlayerR::Player' has a wrong offset!");

// Function shredder.shredder_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Shredder_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_StuffUpgraded) == 0x000008, "Wrong alignment on Shredder_C_StuffUpgraded");
static_assert(sizeof(Shredder_C_StuffUpgraded) == 0x000008, "Wrong size on Shredder_C_StuffUpgraded");
static_assert(offsetof(Shredder_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Shredder_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function shredder.shredder_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct Shredder_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_SettingsApplied) == 0x000008, "Wrong alignment on Shredder_C_SettingsApplied");
static_assert(sizeof(Shredder_C_SettingsApplied) == 0x0000F0, "Wrong size on Shredder_C_SettingsApplied");
static_assert(offsetof(Shredder_C_SettingsApplied, Settings) == 0x000000, "Member 'Shredder_C_SettingsApplied::Settings' has a wrong offset!");

// Function shredder.shredder_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Shredder_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Shredder_C_AnyKey) == 0x000008, "Wrong alignment on Shredder_C_AnyKey");
static_assert(sizeof(Shredder_C_AnyKey) == 0x000020, "Wrong size on Shredder_C_AnyKey");
static_assert(offsetof(Shredder_C_AnyKey, Key) == 0x000000, "Member 'Shredder_C_AnyKey::Key' has a wrong offset!");
static_assert(offsetof(Shredder_C_AnyKey, Pressed) == 0x000018, "Member 'Shredder_C_AnyKey::Pressed' has a wrong offset!");

// Function shredder.shredder_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Shredder_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_ApplyColor) == 0x000004, "Wrong alignment on Shredder_C_ApplyColor");
static_assert(sizeof(Shredder_C_ApplyColor) == 0x000010, "Wrong size on Shredder_C_ApplyColor");
static_assert(offsetof(Shredder_C_ApplyColor, Color) == 0x000000, "Member 'Shredder_C_ApplyColor::Color' has a wrong offset!");

// Function shredder.shredder_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct Shredder_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Shredder_C_TexturePickerApply) == 0x000008, "Wrong alignment on Shredder_C_TexturePickerApply");
static_assert(sizeof(Shredder_C_TexturePickerApply) == 0x000018, "Wrong size on Shredder_C_TexturePickerApply");
static_assert(offsetof(Shredder_C_TexturePickerApply, Picker) == 0x000000, "Member 'Shredder_C_TexturePickerApply::Picker' has a wrong offset!");
static_assert(offsetof(Shredder_C_TexturePickerApply, Texture) == 0x000008, "Member 'Shredder_C_TexturePickerApply::Texture' has a wrong offset!");
static_assert(offsetof(Shredder_C_TexturePickerApply, Param_Index) == 0x000010, "Member 'Shredder_C_TexturePickerApply::Param_Index' has a wrong offset!");

