#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignalSlot

#include "Basic.hpp"

#include "Struct_signalDataDynamic_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass signalSlot.signalSlot_C
// 0x00D8 (0x0338 - 0x0260)
class USignalSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_70;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_135;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_border;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_line;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_sel;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_iscopy;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_signalDate;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_signalDate_1;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStruct_signalDataDynamic              Data;                                              // 0x02B0(0x0070)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class ALaptop_C*                              Laptop;                                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Ind;                                               // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_signalPlay_C*                      PlayInerf;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_signalSlot(int32 EntryPoint);
	void Resume();
	void SetIndex(int32 Param_Index);
	void BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void BndEvt__EditableTextBox_135_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Button_70_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Sett();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void SetPos();
	void UpdName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"signalSlot_C">();
	}
	static class USignalSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignalSlot_C>();
	}
};
static_assert(alignof(USignalSlot_C) == 0x000008, "Wrong alignment on USignalSlot_C");
static_assert(sizeof(USignalSlot_C) == 0x000338, "Wrong size on USignalSlot_C");
static_assert(offsetof(USignalSlot_C, UberGraphFrame) == 0x000260, "Member 'USignalSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Button) == 0x000268, "Member 'USignalSlot_C::Button' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Button_70) == 0x000270, "Member 'USignalSlot_C::Button_70' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, EditableTextBox_135) == 0x000278, "Member 'USignalSlot_C::EditableTextBox_135' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Image_border) == 0x000280, "Member 'USignalSlot_C::Image_border' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Image_line) == 0x000288, "Member 'USignalSlot_C::Image_line' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Image_sel) == 0x000290, "Member 'USignalSlot_C::Image_sel' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Text_iscopy) == 0x000298, "Member 'USignalSlot_C::Text_iscopy' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Text_signalDate) == 0x0002A0, "Member 'USignalSlot_C::Text_signalDate' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Text_signalDate_1) == 0x0002A8, "Member 'USignalSlot_C::Text_signalDate_1' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Data) == 0x0002B0, "Member 'USignalSlot_C::Data' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Laptop) == 0x000320, "Member 'USignalSlot_C::Laptop' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, Ind) == 0x000328, "Member 'USignalSlot_C::Ind' has a wrong offset!");
static_assert(offsetof(USignalSlot_C, PlayInerf) == 0x000330, "Member 'USignalSlot_C::PlayInerf' has a wrong offset!");

}

