#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SingleRoach

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function singleRoach.singleRoach_C.ExecuteUbergraph_singleRoach
// 0x0020 (0x0020 - 0x0000)
struct SingleRoach_C_ExecuteUbergraph_singleRoach final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SingleRoach_C_ExecuteUbergraph_singleRoach) == 0x000008, "Wrong alignment on SingleRoach_C_ExecuteUbergraph_singleRoach");
static_assert(sizeof(SingleRoach_C_ExecuteUbergraph_singleRoach) == 0x000020, "Wrong size on SingleRoach_C_ExecuteUbergraph_singleRoach");
static_assert(offsetof(SingleRoach_C_ExecuteUbergraph_singleRoach, EntryPoint) == 0x000000, "Member 'SingleRoach_C_ExecuteUbergraph_singleRoach::EntryPoint' has a wrong offset!");
static_assert(offsetof(SingleRoach_C_ExecuteUbergraph_singleRoach, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'SingleRoach_C_ExecuteUbergraph_singleRoach::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(SingleRoach_C_ExecuteUbergraph_singleRoach, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'SingleRoach_C_ExecuteUbergraph_singleRoach::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

