#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sink

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass sink.sink_C
// 0x0038 (0x0280 - 0x0248)
class ASink_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Sink_C;                             // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_waterSink;                                     // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clean;                                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CleanVec;                                          // 0x026C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_sink(int32 EntryPoint);
	void PlayerUsedOn(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void CleanSponge(float Param_Clean, class AMainPlayer_C* Player);
	void PlayerR(class AMainPlayer_C* Player);
	void PlayerHold(class AMainPlayer_C* Player);
	void PlayerUnequip(class AMainPlayer_C* Player);
	void UpdateStrAgl();
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Hit, float Damage);
	void Thrown(class AMainPlayer_C* Player);
	void broken_fire();
	void broken();
	void SendName(class FName Param_Name);
	void Kicked(bool Kick);
	void Player_use(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void DriveDetached();
	void Upd();
	void UpdIsOn();
	void AsProp(class AProp_C** Return);
	void CanPickup(bool* Return);
	void NoRespawn(bool Param_NoRespawn, bool* Return);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void IsButtonUsed(bool* Failed);
	void CanBePutInContainer(bool* Return);
	void LandedOn(class AMainPlayer_C* Player, bool* IgnoreFallDamage);
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, Enum_interactionActions Action);
	void UserConstructionScript();
	void GetData(struct FStruct_save* Data);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void GatherDataFromKey(bool* Gather);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"sink_C">();
	}
	static class ASink_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASink_C>();
	}
};
static_assert(alignof(ASink_C) == 0x000008, "Wrong alignment on ASink_C");
static_assert(sizeof(ASink_C) == 0x000280, "Wrong size on ASink_C");
static_assert(offsetof(ASink_C, UberGraphFrame_Sink_C) == 0x000248, "Member 'ASink_C::UberGraphFrame_Sink_C' has a wrong offset!");
static_assert(offsetof(ASink_C, Audio) == 0x000250, "Member 'ASink_C::Audio' has a wrong offset!");
static_assert(offsetof(ASink_C, Eff_waterSink) == 0x000258, "Member 'ASink_C::Eff_waterSink' has a wrong offset!");
static_assert(offsetof(ASink_C, Cube) == 0x000260, "Member 'ASink_C::Cube' has a wrong offset!");
static_assert(offsetof(ASink_C, Clean) == 0x000268, "Member 'ASink_C::Clean' has a wrong offset!");
static_assert(offsetof(ASink_C, CleanVec) == 0x00026C, "Member 'ASink_C::CleanVec' has a wrong offset!");
static_assert(offsetof(ASink_C, IsOn) == 0x000278, "Member 'ASink_C::IsOn' has a wrong offset!");

}

