#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sirenpost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass sirenpost.sirenpost_C
// 0x0030 (0x0250 - 0x0220)
class ASirenpost_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComp_radarPoint_C*                     RadarPoint;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Tangent;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Normal;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_sirenpost(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"sirenpost_C">();
	}
	static class ASirenpost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASirenpost_C>();
	}
};
static_assert(alignof(ASirenpost_C) == 0x000008, "Wrong alignment on ASirenpost_C");
static_assert(sizeof(ASirenpost_C) == 0x000250, "Wrong size on ASirenpost_C");
static_assert(offsetof(ASirenpost_C, UberGraphFrame) == 0x000220, "Member 'ASirenpost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASirenpost_C, RadarPoint) == 0x000228, "Member 'ASirenpost_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(ASirenpost_C, Tangent) == 0x000230, "Member 'ASirenpost_C::Tangent' has a wrong offset!");
static_assert(offsetof(ASirenpost_C, Normal) == 0x000238, "Member 'ASirenpost_C::Normal' has a wrong offset!");
static_assert(offsetof(ASirenpost_C, StaticMesh) == 0x000240, "Member 'ASirenpost_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASirenpost_C, DefaultSceneRoot) == 0x000248, "Member 'ASirenpost_C::DefaultSceneRoot' has a wrong offset!");

}

