#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SitBox

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function sitBox.sitBox_C.ExecuteUbergraph_sitBox
// 0x06C8 (0x06C8 - 0x0000)
struct SitBox_C_ExecuteUbergraph_sitBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0008(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3445[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3446[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x00EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3447[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3448[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0288(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3449[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344A[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344B[0x7];                                     // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0378(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344C[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name_1;                               // 0x0404(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344D[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0420(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_player_C>         K2Node_DynamicCast_AsInt_Player;                   // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344E[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_C*                                CallFunc_asProp_return;                            // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue_1;             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x04E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344F[0x3];                                     // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0590(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0618(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0628(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0638(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_ExecuteUbergraph_sitBox) == 0x000008, "Wrong alignment on SitBox_C_ExecuteUbergraph_sitBox");
static_assert(sizeof(SitBox_C_ExecuteUbergraph_sitBox) == 0x0006C8, "Wrong size on SitBox_C_ExecuteUbergraph_sitBox");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, EntryPoint) == 0x000000, "Member 'SitBox_C_ExecuteUbergraph_sitBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_damage_4) == 0x000004, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_7) == 0x000008, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_actor_1) == 0x000090, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_impact_1) == 0x000098, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_MakeArray_Array) == 0x0000A8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_water_3) == 0x0000B8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_water_2) == 0x0000C0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_water_1) == 0x0000C8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_water) == 0x0000D0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_activate) == 0x0000D8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_static) == 0x0000D9, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_frozen) == 0x0000DA, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_active) == 0x0000DB, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_actor) == 0x0000E0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_damage_3) == 0x0000E8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_6) == 0x0000EC, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_impact) == 0x000174, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_skipSetting) == 0x000180, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_key_1) == 0x000188, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_14) == 0x000198, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_5) == 0x0001A0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_damage_2) == 0x000228, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_fuel) == 0x00022C, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_13) == 0x000230, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_12) == 0x000238, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_damage_1) == 0x000240, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_location_1) == 0x000244, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_11) == 0x000250, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_10) == 0x000258, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_9) == 0x000260, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_wheelDelta) == 0x000268, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_8) == 0x000270, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_mouse) == 0x000278, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_7) == 0x000280, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_key) == 0x000288, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_pressed) == 0x0002A0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_temperature_1) == 0x0002A4, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_temperature) == 0x0002A8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_speed) == 0x0002AC, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_volume) == 0x0002B0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_6) == 0x0002B8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_location) == 0x0002C0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_damage) == 0x0002CC, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_clean) == 0x0002D0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_5) == 0x0002D8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_4) == 0x0002E0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hook) == 0x000368, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_4) == 0x000370, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_3) == 0x000378, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_kick) == 0x000400, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_name_1) == 0x000404, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_3) == 0x000410, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_2) == 0x000418, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_2) == 0x000420, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_GetParentActor_ReturnValue) == 0x0004A8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_DynamicCast_AsInt_Player) == 0x0004B0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_DynamicCast_AsInt_Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_DynamicCast_bSuccess) == 0x0004C0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_asProp_return) == 0x0004C8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_asProp_return' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_GetParentActor_ReturnValue_1) == 0x0004D0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_GetParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player_1) == 0x0004D8, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit_1) == 0x0004E0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_index) == 0x000568, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_action) == 0x00056C, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000570, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00057C, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_player) == 0x000588, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_hit) == 0x000590, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, K2Node_Event_name) == 0x000618, "Member 'SitBox_C_ExecuteUbergraph_sitBox::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_obj_statDyn_obj) == 0x000628, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000638, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(SitBox_C_ExecuteUbergraph_sitBox, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x0006C0, "Member 'SitBox_C_ExecuteUbergraph_sitBox::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");

// Function sitBox.sitBox_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct SitBox_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_ActionName) == 0x000008, "Wrong alignment on SitBox_C_ActionName");
static_assert(sizeof(SitBox_C_ActionName) == 0x0000A0, "Wrong size on SitBox_C_ActionName");
static_assert(offsetof(SitBox_C_ActionName, Player) == 0x000000, "Member 'SitBox_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_ActionName, Hit) == 0x000008, "Member 'SitBox_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(SitBox_C_ActionName, Param_Name) == 0x000090, "Member 'SitBox_C_ActionName::Param_Name' has a wrong offset!");

// Function sitBox.sitBox_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct SitBox_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_ActionOptionIndex) == 0x000008, "Wrong alignment on SitBox_C_ActionOptionIndex");
static_assert(sizeof(SitBox_C_ActionOptionIndex) == 0x000098, "Wrong size on SitBox_C_ActionOptionIndex");
static_assert(offsetof(SitBox_C_ActionOptionIndex, Player) == 0x000000, "Member 'SitBox_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_ActionOptionIndex, Hit) == 0x000008, "Member 'SitBox_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(SitBox_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'SitBox_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(SitBox_C_ActionOptionIndex, Action) == 0x000094, "Member 'SitBox_C_ActionOptionIndex::Action' has a wrong offset!");

// Function sitBox.sitBox_C.damageByPlayer
// 0x0090 (0x0090 - 0x0000)
struct SitBox_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SitBox_C_DamageByPlayer) == 0x000008, "Wrong alignment on SitBox_C_DamageByPlayer");
static_assert(sizeof(SitBox_C_DamageByPlayer) == 0x000090, "Wrong size on SitBox_C_DamageByPlayer");
static_assert(offsetof(SitBox_C_DamageByPlayer, Player) == 0x000000, "Member 'SitBox_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_DamageByPlayer, Hit) == 0x000008, "Member 'SitBox_C_DamageByPlayer::Hit' has a wrong offset!");

// Function sitBox.sitBox_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_Thrown) == 0x000008, "Wrong alignment on SitBox_C_Thrown");
static_assert(sizeof(SitBox_C_Thrown) == 0x000008, "Wrong size on SitBox_C_Thrown");
static_assert(offsetof(SitBox_C_Thrown, Player) == 0x000000, "Member 'SitBox_C_Thrown::Player' has a wrong offset!");

// Function sitBox.sitBox_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_SendName) == 0x000004, "Wrong alignment on SitBox_C_SendName");
static_assert(sizeof(SitBox_C_SendName) == 0x000008, "Wrong size on SitBox_C_SendName");
static_assert(offsetof(SitBox_C_SendName, Param_Name) == 0x000000, "Member 'SitBox_C_SendName::Param_Name' has a wrong offset!");

// Function sitBox.sitBox_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct SitBox_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_Kicked) == 0x000001, "Wrong alignment on SitBox_C_Kicked");
static_assert(sizeof(SitBox_C_Kicked) == 0x000001, "Wrong size on SitBox_C_Kicked");
static_assert(offsetof(SitBox_C_Kicked, Kick) == 0x000000, "Member 'SitBox_C_Kicked::Kick' has a wrong offset!");

// Function sitBox.sitBox_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct SitBox_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SitBox_C_Player_use) == 0x000008, "Wrong alignment on SitBox_C_Player_use");
static_assert(sizeof(SitBox_C_Player_use) == 0x000090, "Wrong size on SitBox_C_Player_use");
static_assert(offsetof(SitBox_C_Player_use, Player) == 0x000000, "Member 'SitBox_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_Player_use, Hit) == 0x000008, "Member 'SitBox_C_Player_use::Hit' has a wrong offset!");

// Function sitBox.sitBox_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_Hooked) == 0x000008, "Wrong alignment on SitBox_C_Hooked");
static_assert(sizeof(SitBox_C_Hooked) == 0x000008, "Wrong size on SitBox_C_Hooked");
static_assert(offsetof(SitBox_C_Hooked, Hook) == 0x000000, "Member 'SitBox_C_Hooked::Hook' has a wrong offset!");

// Function sitBox.sitBox_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct SitBox_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SitBox_C_PlayerUsedOn) == 0x000008, "Wrong alignment on SitBox_C_PlayerUsedOn");
static_assert(sizeof(SitBox_C_PlayerUsedOn) == 0x000090, "Wrong size on SitBox_C_PlayerUsedOn");
static_assert(offsetof(SitBox_C_PlayerUsedOn, Player) == 0x000000, "Member 'SitBox_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_PlayerUsedOn, Hit) == 0x000008, "Member 'SitBox_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function sitBox.sitBox_C.slice
// 0x0001 (0x0001 - 0x0000)
struct SitBox_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_Slice) == 0x000001, "Wrong alignment on SitBox_C_Slice");
static_assert(sizeof(SitBox_C_Slice) == 0x000001, "Wrong size on SitBox_C_Slice");
static_assert(offsetof(SitBox_C_Slice, Clean) == 0x000000, "Member 'SitBox_C_Slice::Clean' has a wrong offset!");

// Function sitBox.sitBox_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct SitBox_C_ReachedByExplosion final
{
public:
	struct FVector                                Param_Location;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_ReachedByExplosion) == 0x000004, "Wrong alignment on SitBox_C_ReachedByExplosion");
static_assert(sizeof(SitBox_C_ReachedByExplosion) == 0x000010, "Wrong size on SitBox_C_ReachedByExplosion");
static_assert(offsetof(SitBox_C_ReachedByExplosion, Param_Location) == 0x000000, "Member 'SitBox_C_ReachedByExplosion::Param_Location' has a wrong offset!");
static_assert(offsetof(SitBox_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'SitBox_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function sitBox.sitBox_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerLookAway) == 0x000008, "Wrong alignment on SitBox_C_PlayerLookAway");
static_assert(sizeof(SitBox_C_PlayerLookAway) == 0x000008, "Wrong size on SitBox_C_PlayerLookAway");
static_assert(offsetof(SitBox_C_PlayerLookAway, Player) == 0x000000, "Member 'SitBox_C_PlayerLookAway::Player' has a wrong offset!");

// Function sitBox.sitBox_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct SitBox_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_Stepped) == 0x000004, "Wrong alignment on SitBox_C_Stepped");
static_assert(sizeof(SitBox_C_Stepped) == 0x000004, "Wrong size on SitBox_C_Stepped");
static_assert(offsetof(SitBox_C_Stepped, Volume) == 0x000000, "Member 'SitBox_C_Stepped::Volume' has a wrong offset!");

// Function sitBox.sitBox_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_AccumulateTemperature) == 0x000004, "Wrong alignment on SitBox_C_AccumulateTemperature");
static_assert(sizeof(SitBox_C_AccumulateTemperature) == 0x000008, "Wrong size on SitBox_C_AccumulateTemperature");
static_assert(offsetof(SitBox_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'SitBox_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(SitBox_C_AccumulateTemperature, Speed) == 0x000004, "Member 'SitBox_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function sitBox.sitBox_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct SitBox_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_AddTemperature) == 0x000004, "Wrong alignment on SitBox_C_AddTemperature");
static_assert(sizeof(SitBox_C_AddTemperature) == 0x000004, "Wrong size on SitBox_C_AddTemperature");
static_assert(offsetof(SitBox_C_AddTemperature, Temperature) == 0x000000, "Member 'SitBox_C_AddTemperature::Temperature' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct SitBox_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandAnyKey");
static_assert(sizeof(SitBox_C_PlayerHandAnyKey) == 0x000028, "Wrong size on SitBox_C_PlayerHandAnyKey");
static_assert(offsetof(SitBox_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'SitBox_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'SitBox_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(SitBox_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'SitBox_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct SitBox_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerHandMouse) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandMouse");
static_assert(sizeof(SitBox_C_PlayerHandMouse) == 0x000010, "Wrong size on SitBox_C_PlayerHandMouse");
static_assert(offsetof(SitBox_C_PlayerHandMouse, Player) == 0x000000, "Member 'SitBox_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'SitBox_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct SitBox_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandMouseWheel");
static_assert(sizeof(SitBox_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on SitBox_C_PlayerHandMouseWheel");
static_assert(offsetof(SitBox_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'SitBox_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'SitBox_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandRelease_LMB");
static_assert(sizeof(SitBox_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on SitBox_C_PlayerHandRelease_LMB");
static_assert(offsetof(SitBox_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'SitBox_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandRelease_RMB");
static_assert(sizeof(SitBox_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on SitBox_C_PlayerHandRelease_RMB");
static_assert(offsetof(SitBox_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'SitBox_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function sitBox.sitBox_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct SitBox_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Param_Location;                                    // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_Exploded) == 0x000004, "Wrong alignment on SitBox_C_Exploded");
static_assert(sizeof(SitBox_C_Exploded) == 0x000010, "Wrong size on SitBox_C_Exploded");
static_assert(offsetof(SitBox_C_Exploded, Damage) == 0x000000, "Member 'SitBox_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(SitBox_C_Exploded, Param_Location) == 0x000004, "Member 'SitBox_C_Exploded::Param_Location' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandUse_LMB");
static_assert(sizeof(SitBox_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on SitBox_C_PlayerHandUse_LMB");
static_assert(offsetof(SitBox_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'SitBox_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function sitBox.sitBox_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on SitBox_C_PlayerHandUse_RMB");
static_assert(sizeof(SitBox_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on SitBox_C_PlayerHandUse_RMB");
static_assert(offsetof(SitBox_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'SitBox_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function sitBox.sitBox_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct SitBox_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_Ignite) == 0x000004, "Wrong alignment on SitBox_C_Ignite");
static_assert(sizeof(SitBox_C_Ignite) == 0x000004, "Wrong size on SitBox_C_Ignite");
static_assert(offsetof(SitBox_C_Ignite, Fuel) == 0x000000, "Member 'SitBox_C_Ignite::Fuel' has a wrong offset!");

// Function sitBox.sitBox_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct SitBox_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_FireDamage) == 0x000004, "Wrong alignment on SitBox_C_FireDamage");
static_assert(sizeof(SitBox_C_FireDamage) == 0x000004, "Wrong size on SitBox_C_FireDamage");
static_assert(offsetof(SitBox_C_FireDamage, Damage) == 0x000000, "Member 'SitBox_C_FireDamage::Damage' has a wrong offset!");

// Function sitBox.sitBox_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct SitBox_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SitBox_C_SteppedOn) == 0x000008, "Wrong alignment on SitBox_C_SteppedOn");
static_assert(sizeof(SitBox_C_SteppedOn) == 0x000090, "Wrong size on SitBox_C_SteppedOn");
static_assert(offsetof(SitBox_C_SteppedOn, Player) == 0x000000, "Member 'SitBox_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(SitBox_C_SteppedOn, Hit) == 0x000008, "Member 'SitBox_C_SteppedOn::Hit' has a wrong offset!");

// Function sitBox.sitBox_C.setKey
// 0x0010 (0x0010 - 0x0000)
struct SitBox_C_SetKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_SetKey) == 0x000008, "Wrong alignment on SitBox_C_SetKey");
static_assert(sizeof(SitBox_C_SetKey) == 0x000010, "Wrong size on SitBox_C_SetKey");
static_assert(offsetof(SitBox_C_SetKey, Key) == 0x000000, "Member 'SitBox_C_SetKey::Key' has a wrong offset!");

// Function sitBox.sitBox_C.addDamage
// 0x00A8 (0x00A8 - 0x0000)
struct SitBox_C_AddDamage final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x000C(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Impact;                                            // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipSetting;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_AddDamage) == 0x000008, "Wrong alignment on SitBox_C_AddDamage");
static_assert(sizeof(SitBox_C_AddDamage) == 0x0000A8, "Wrong size on SitBox_C_AddDamage");
static_assert(offsetof(SitBox_C_AddDamage, Actor) == 0x000000, "Member 'SitBox_C_AddDamage::Actor' has a wrong offset!");
static_assert(offsetof(SitBox_C_AddDamage, Damage) == 0x000008, "Member 'SitBox_C_AddDamage::Damage' has a wrong offset!");
static_assert(offsetof(SitBox_C_AddDamage, Hit) == 0x00000C, "Member 'SitBox_C_AddDamage::Hit' has a wrong offset!");
static_assert(offsetof(SitBox_C_AddDamage, Impact) == 0x000094, "Member 'SitBox_C_AddDamage::Impact' has a wrong offset!");
static_assert(offsetof(SitBox_C_AddDamage, SkipSetting) == 0x0000A0, "Member 'SitBox_C_AddDamage::SkipSetting' has a wrong offset!");

// Function sitBox.sitBox_C.setPropProps
// 0x0003 (0x0003 - 0x0000)
struct SitBox_C_SetPropProps final
{
public:
	bool                                          Static;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Frozen;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_SetPropProps) == 0x000001, "Wrong alignment on SitBox_C_SetPropProps");
static_assert(sizeof(SitBox_C_SetPropProps) == 0x000003, "Wrong size on SitBox_C_SetPropProps");
static_assert(offsetof(SitBox_C_SetPropProps, Static) == 0x000000, "Member 'SitBox_C_SetPropProps::Static' has a wrong offset!");
static_assert(offsetof(SitBox_C_SetPropProps, Frozen) == 0x000001, "Member 'SitBox_C_SetPropProps::Frozen' has a wrong offset!");
static_assert(offsetof(SitBox_C_SetPropProps, Active) == 0x000002, "Member 'SitBox_C_SetPropProps::Active' has a wrong offset!");

// Function sitBox.sitBox_C.virus
// 0x0001 (0x0001 - 0x0000)
struct SitBox_C_Virus final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SitBox_C_Virus) == 0x000001, "Wrong alignment on SitBox_C_Virus");
static_assert(sizeof(SitBox_C_Virus) == 0x000001, "Wrong size on SitBox_C_Virus");
static_assert(offsetof(SitBox_C_Virus, Activate) == 0x000000, "Member 'SitBox_C_Virus::Activate' has a wrong offset!");

// Function sitBox.sitBox_C.leaveWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_LeaveWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_LeaveWaterOrigin) == 0x000008, "Wrong alignment on SitBox_C_LeaveWaterOrigin");
static_assert(sizeof(SitBox_C_LeaveWaterOrigin) == 0x000008, "Wrong size on SitBox_C_LeaveWaterOrigin");
static_assert(offsetof(SitBox_C_LeaveWaterOrigin, Water) == 0x000000, "Member 'SitBox_C_LeaveWaterOrigin::Water' has a wrong offset!");

// Function sitBox.sitBox_C.enterWaterOrigin
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_EnterWaterOrigin final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_EnterWaterOrigin) == 0x000008, "Wrong alignment on SitBox_C_EnterWaterOrigin");
static_assert(sizeof(SitBox_C_EnterWaterOrigin) == 0x000008, "Wrong size on SitBox_C_EnterWaterOrigin");
static_assert(offsetof(SitBox_C_EnterWaterOrigin, Water) == 0x000000, "Member 'SitBox_C_EnterWaterOrigin::Water' has a wrong offset!");

// Function sitBox.sitBox_C.leaveWater
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_LeaveWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_LeaveWater) == 0x000008, "Wrong alignment on SitBox_C_LeaveWater");
static_assert(sizeof(SitBox_C_LeaveWater) == 0x000008, "Wrong size on SitBox_C_LeaveWater");
static_assert(offsetof(SitBox_C_LeaveWater, Water) == 0x000000, "Member 'SitBox_C_LeaveWater::Water' has a wrong offset!");

// Function sitBox.sitBox_C.enterWater
// 0x0008 (0x0008 - 0x0000)
struct SitBox_C_EnterWater final
{
public:
	class AWaterVolume_C*                         Water;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SitBox_C_EnterWater) == 0x000008, "Wrong alignment on SitBox_C_EnterWater");
static_assert(sizeof(SitBox_C_EnterWater) == 0x000008, "Wrong size on SitBox_C_EnterWater");
static_assert(offsetof(SitBox_C_EnterWater, Water) == 0x000000, "Member 'SitBox_C_EnterWater::Water' has a wrong offset!");

// Function sitBox.sitBox_C.ImpactDamage
// 0x00A8 (0x00A8 - 0x0000)
struct SitBox_C_ImpactDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3450[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
