#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKELEON

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SKELEON.SKELEON_C.setPos
// 0x0030 (0x0030 - 0x0000)
struct SKELEON_C_SetPos final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKELEON_C_SetPos) == 0x000008, "Wrong alignment on SKELEON_C_SetPos");
static_assert(sizeof(SKELEON_C_SetPos) == 0x000030, "Wrong size on SKELEON_C_SetPos");
static_assert(offsetof(SKELEON_C_SetPos, WorldLocation) == 0x000000, "Member 'SKELEON_C_SetPos::WorldLocation' has a wrong offset!");
static_assert(offsetof(SKELEON_C_SetPos, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'SKELEON_C_SetPos::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKELEON_C_SetPos, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x000018, "Member 'SKELEON_C_SetPos::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(SKELEON_C_SetPos, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000020, "Member 'SKELEON_C_SetPos::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKELEON_C_SetPos, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'SKELEON_C_SetPos::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

}

