#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKEL

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SKEL.SKEL_C.ExecuteUbergraph_SKEL
// 0x00D0 (0x00D0 - 0x0000)
struct SKEL_C_ExecuteUbergraph_SKEL final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USKELEON_C*                             CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKEL_C_ExecuteUbergraph_SKEL) == 0x000008, "Wrong alignment on SKEL_C_ExecuteUbergraph_SKEL");
static_assert(sizeof(SKEL_C_ExecuteUbergraph_SKEL) == 0x0000D0, "Wrong size on SKEL_C_ExecuteUbergraph_SKEL");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, EntryPoint) == 0x000000, "Member 'SKEL_C_ExecuteUbergraph_SKEL::EntryPoint' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Lerp_ReturnValue_1) == 0x000008, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_BreakVector2D_X) == 0x000020, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_BreakVector2D_X_1) == 0x000030, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_BreakVector2D_Y_1) == 0x000034, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Lerp_ReturnValue_2) == 0x000038, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Lerp_ReturnValue_3) == 0x00003C, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_MakeVector2D_ReturnValue_1) == 0x000040, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_SetGamePaused_ReturnValue) == 0x000048, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, K2Node_Event_DeltaSeconds) == 0x00004C, "Member 'SKEL_C_ExecuteUbergraph_SKEL::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000050, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Create_ReturnValue) == 0x000058, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_GetPlayerController_ReturnValue_1) == 0x000068, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_SetGamePaused_ReturnValue_1) == 0x000070, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, Temp_bool_Has_Been_Initd_Variable) == 0x000071, "Member 'SKEL_C_ExecuteUbergraph_SKEL::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, Temp_bool_IsClosed_Variable) == 0x000072, "Member 'SKEL_C_ExecuteUbergraph_SKEL::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000078, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00008C, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_GetActorForwardVector_ReturnValue) == 0x000098, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A4, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Normal_ReturnValue) == 0x0000B0, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000BC, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKEL_C_ExecuteUbergraph_SKEL, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000C8, "Member 'SKEL_C_ExecuteUbergraph_SKEL::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");

// Function SKEL.SKEL_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SKEL_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SKEL_C_ReceiveTick) == 0x000004, "Wrong alignment on SKEL_C_ReceiveTick");
static_assert(sizeof(SKEL_C_ReceiveTick) == 0x000004, "Wrong size on SKEL_C_ReceiveTick");
static_assert(offsetof(SKEL_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SKEL_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

