#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkyUfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function skyUfo.skyUfo_C.ExecuteUbergraph_skyUfo
// 0x0450 (0x0450 - 0x0000)
struct SkyUfo_C_ExecuteUbergraph_skyUfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_2;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_3;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue_1;       // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF9[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFA[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0140(0x0010)(ReferenceParm)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DFB[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DFC[0x1];                                     // 0x0223(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DFD[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0314(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DFE[0x3];                                     // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x03B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkyUfo_C_ExecuteUbergraph_skyUfo) == 0x000008, "Wrong alignment on SkyUfo_C_ExecuteUbergraph_skyUfo");
static_assert(sizeof(SkyUfo_C_ExecuteUbergraph_skyUfo) == 0x000450, "Wrong size on SkyUfo_C_ExecuteUbergraph_skyUfo");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, EntryPoint) == 0x000000, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue) == 0x00001C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000024, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_GetForwardVector_ReturnValue) == 0x000030, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000048, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000054, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue) == 0x00006C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x000078, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue_2) == 0x000084, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Cross_VectorVector_ReturnValue_3) == 0x000090, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Cross_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x00009C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeRotationFromAxes_ReturnValue_1) == 0x0000A8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeRotationFromAxes_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000B4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_VSize_ReturnValue) == 0x0000C0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Normal_ReturnValue_1) == 0x0000C4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000D0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000D4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeVector_ReturnValue) == 0x0000D8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_GetForwardVector_ReturnValue_1) == 0x0000E4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000F0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0000FC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Normal_ReturnValue_2) == 0x000108, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000114, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Dot_VectorVector_ReturnValue) == 0x000118, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeVector_ReturnValue_1) == 0x00011C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_FMax_ReturnValue) == 0x000128, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Add_VectorVector_ReturnValue) == 0x00012C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000138, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_obj_static_obj) == 0x000140, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Lerp_ReturnValue) == 0x000150, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000154, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000160, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector2D_X) == 0x00016C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector2D_Y) == 0x000170, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000174, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000178, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000180, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, K2Node_MakeArray_Array) == 0x000188, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000198, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000220, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_bBlockingHit) == 0x000221, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_bInitialOverlap) == 0x000222, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Time) == 0x000224, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Distance) == 0x000228, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Location) == 0x00022C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_ImpactPoint) == 0x000238, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_Normal) == 0x000244, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_ImpactNormal) == 0x000250, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_PhysMat) == 0x000260, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitActor) == 0x000268, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitComponent) == 0x000270, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitBoneName) == 0x000278, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_HitItem) == 0x000280, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_ElementIndex) == 0x000284, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_FaceIndex) == 0x000288, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_TraceStart) == 0x00028C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakHitResult_TraceEnd) == 0x000298, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002A4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002B0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002BC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002C8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SelectVector_ReturnValue) == 0x0002D4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Vector_Distance_ReturnValue) == 0x0002E0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector_X) == 0x0002E4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector_Y) == 0x0002E8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BreakVector_Z) == 0x0002EC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002F0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_FClamp_ReturnValue) == 0x0002F4, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_FClamp_ReturnValue_1) == 0x0002F8, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_MakeVector_ReturnValue_2) == 0x0002FC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RLerp_ReturnValue) == 0x000308, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000314, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00039C, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_SelectRotator_ReturnValue) == 0x0003A0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0003AC, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0003B0, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000438, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_Vector_Distance_ReturnValue_1) == 0x000444, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000448, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_BooleanOR_ReturnValue) == 0x000449, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkyUfo_C_ExecuteUbergraph_skyUfo, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00044A, "Member 'SkyUfo_C_ExecuteUbergraph_skyUfo::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function skyUfo.skyUfo_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SkyUfo_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkyUfo_C_ReceiveTick) == 0x000004, "Wrong alignment on SkyUfo_C_ReceiveTick");
static_assert(sizeof(SkyUfo_C_ReceiveTick) == 0x000004, "Wrong size on SkyUfo_C_ReceiveTick");
static_assert(offsetof(SkyUfo_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SkyUfo_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

