#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkyUfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Actor_save_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass skyUfo.skyUfo_C
// 0x0058 (0x02A0 - 0x0248)
class ASkyUfo_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SkyUfo_C;                           // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 GrayUfoSk;                                         // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ClampHeight;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rendered;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_skyUfo(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"skyUfo_C">();
	}
	static class ASkyUfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkyUfo_C>();
	}
};
static_assert(alignof(ASkyUfo_C) == 0x000008, "Wrong alignment on ASkyUfo_C");
static_assert(sizeof(ASkyUfo_C) == 0x0002A0, "Wrong size on ASkyUfo_C");
static_assert(offsetof(ASkyUfo_C, UberGraphFrame_SkyUfo_C) == 0x000248, "Member 'ASkyUfo_C::UberGraphFrame_SkyUfo_C' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, ParticleSystem) == 0x000250, "Member 'ASkyUfo_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, SpotLight1) == 0x000258, "Member 'ASkyUfo_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, Audio) == 0x000260, "Member 'ASkyUfo_C::Audio' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, Arrow) == 0x000268, "Member 'ASkyUfo_C::Arrow' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, GrayUfoSk) == 0x000270, "Member 'ASkyUfo_C::GrayUfoSk' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, SpringArm) == 0x000278, "Member 'ASkyUfo_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, PointLight) == 0x000280, "Member 'ASkyUfo_C::PointLight' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, SpotLight) == 0x000288, "Member 'ASkyUfo_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, ClampHeight) == 0x000290, "Member 'ASkyUfo_C::ClampHeight' has a wrong offset!");
static_assert(offsetof(ASkyUfo_C, Rendered) == 0x000298, "Member 'ASkyUfo_C::Rendered' has a wrong offset!");

}

