#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlapperSummoner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass slapperSummoner.slapperSummoner_C
// 0x0020 (0x00D0 - 0x00B0)
class USlapperSummoner_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                Start;                                             // 0x00B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawned;                                           // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rep;                                               // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_slapperSummoner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"slapperSummoner_C">();
	}
	static class USlapperSummoner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlapperSummoner_C>();
	}
};
static_assert(alignof(USlapperSummoner_C) == 0x000008, "Wrong alignment on USlapperSummoner_C");
static_assert(sizeof(USlapperSummoner_C) == 0x0000D0, "Wrong size on USlapperSummoner_C");
static_assert(offsetof(USlapperSummoner_C, UberGraphFrame) == 0x0000B0, "Member 'USlapperSummoner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USlapperSummoner_C, Start) == 0x0000B8, "Member 'USlapperSummoner_C::Start' has a wrong offset!");
static_assert(offsetof(USlapperSummoner_C, Radius) == 0x0000C4, "Member 'USlapperSummoner_C::Radius' has a wrong offset!");
static_assert(offsetof(USlapperSummoner_C, Spawned) == 0x0000C8, "Member 'USlapperSummoner_C::Spawned' has a wrong offset!");
static_assert(offsetof(USlapperSummoner_C, Rep) == 0x0000CC, "Member 'USlapperSummoner_C::Rep' has a wrong offset!");

}

