#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoltomiaCleaning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function soltomiaCleaning.soltomiaCleaning_C.ExecuteUbergraph_soltomiaCleaning
// 0x0300 (0x0300 - 0x0000)
struct SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_sponge_solto_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_1;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoor_C*                                K2Node_DynamicCast_AsDoor_1;                       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01A0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ACar1_C*                                CallFunc_GetActorOfClass_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0250(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APasswordLock_C*                        CallFunc_Array_Get_Item;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_2;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoor_C*                                K2Node_DynamicCast_AsDoor_2;                       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output_3;                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoor_C*                                K2Node_DynamicCast_AsDoor_3;                       // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning) == 0x000010, "Wrong alignment on SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning");
static_assert(sizeof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning) == 0x000300, "Wrong size on SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, EntryPoint) == 0x000000, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CustomEvent_NotifyName_2) == 0x000004, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CustomEvent_NotifyName_1) == 0x00001C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CustomEvent_NotifyName) == 0x000034, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, Temp_name_Variable) == 0x00004C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_SwitchName_CmpSuccess) == 0x000054, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate_4) == 0x000068, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, Temp_bool_Has_Been_Initd_Variable) == 0x000078, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CustomEvent_NotifyName_4) == 0x00007C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CustomEvent_NotifyName_3) == 0x000084, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, Temp_int_Variable) == 0x00008C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, Temp_bool_IsClosed_Variable) == 0x000090, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate_5) == 0x000094, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000C0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000D0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_Event_DeltaSeconds) == 0x000100, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000108, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_FinishSpawningActor_ReturnValue) == 0x000110, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000124, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_SetVectorLength_ReturnValue) == 0x000130, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000140, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getObjectFromKey_Output) == 0x000148, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_AsDoor) == 0x000150, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_AsDoor' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000160, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getObjectFromKey_Output_1) == 0x000168, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getObjectFromKey_Output_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_AsDoor_1) == 0x000170, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_AsDoor_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000180, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_ComponentBoundEvent_OtherActor) == 0x000188, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_ComponentBoundEvent_OtherComp) == 0x000190, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000198, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_ComponentBoundEvent_bFromSweep) == 0x00019C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_ComponentBoundEvent_SweepResult) == 0x0001A0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_GetActorOfClass_ReturnValue) == 0x000228, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Greater_IntInt_ReturnValue) == 0x000230, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Subtract_IntInt_ReturnValue) == 0x000234, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_RandomFloatInRange_ReturnValue) == 0x000238, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00023C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000240, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000248, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_GetTransform_ReturnValue) == 0x000250, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_BreakTransform_Location) == 0x000280, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_BreakTransform_Rotation) == 0x00028C, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_BreakTransform_Scale) == 0x000298, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Array_Get_Item) == 0x0002A8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Array_Length_ReturnValue) == 0x0002B0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_Less_IntInt_ReturnValue) == 0x0002B4, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x0002B8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getObjectFromKey_Output_2) == 0x0002C0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getObjectFromKey_Output_2' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_AsDoor_2) == 0x0002C8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_AsDoor_2' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_bSuccess_2) == 0x0002D0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x0002D8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, CallFunc_getObjectFromKey_Output_3) == 0x0002E0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::CallFunc_getObjectFromKey_Output_3' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_AsDoor_3) == 0x0002E8, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_AsDoor_3' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning, K2Node_DynamicCast_bSuccess_3) == 0x0002F0, "Member 'SoltomiaCleaning_C_ExecuteUbergraph_soltomiaCleaning::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'SoltomiaCleaning_C_BndEvt__soltomiaCleaning_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SoltomiaCleaning_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_ReceiveTick) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_ReceiveTick");
static_assert(sizeof(SoltomiaCleaning_C_ReceiveTick) == 0x000004, "Wrong size on SoltomiaCleaning_C_ReceiveTick");
static_assert(offsetof(SoltomiaCleaning_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SoltomiaCleaning_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.OnCompleted_CC1C802A418B8136B4D73DA13F1FA965
// 0x0008 (0x0008 - 0x0000)
struct SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(sizeof(SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965) == 0x000008, "Wrong size on SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(offsetof(SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965, NotifyName) == 0x000000, "Member 'SoltomiaCleaning_C_OnCompleted_CC1C802A418B8136B4D73DA13F1FA965::NotifyName' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965
// 0x0008 (0x0008 - 0x0000)
struct SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(sizeof(SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965) == 0x000008, "Wrong size on SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(offsetof(SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965, NotifyName) == 0x000000, "Member 'SoltomiaCleaning_C_OnBlendOut_CC1C802A418B8136B4D73DA13F1FA965::NotifyName' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965
// 0x0008 (0x0008 - 0x0000)
struct SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(sizeof(SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965) == 0x000008, "Wrong size on SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(offsetof(SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965, NotifyName) == 0x000000, "Member 'SoltomiaCleaning_C_OnInterrupted_CC1C802A418B8136B4D73DA13F1FA965::NotifyName' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965
// 0x0008 (0x0008 - 0x0000)
struct SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(sizeof(SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965) == 0x000008, "Wrong size on SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(offsetof(SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965, NotifyName) == 0x000000, "Member 'SoltomiaCleaning_C_OnNotifyBegin_CC1C802A418B8136B4D73DA13F1FA965::NotifyName' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965
// 0x0008 (0x0008 - 0x0000)
struct SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(sizeof(SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965) == 0x000008, "Wrong size on SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965");
static_assert(offsetof(SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965, NotifyName) == 0x000000, "Member 'SoltomiaCleaning_C_OnNotifyEnd_CC1C802A418B8136B4D73DA13F1FA965::NotifyName' has a wrong offset!");

// Function soltomiaCleaning.soltomiaCleaning_C.talk
// 0x0004 (0x0004 - 0x0000)
struct SoltomiaCleaning_C_Talk final
{
public:
	int32                                         Param_ITalk;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoltomiaCleaning_C_Talk) == 0x000004, "Wrong alignment on SoltomiaCleaning_C_Talk");
static_assert(sizeof(SoltomiaCleaning_C_Talk) == 0x000004, "Wrong size on SoltomiaCleaning_C_Talk");
static_assert(offsetof(SoltomiaCleaning_C_Talk, Param_ITalk) == 0x000000, "Member 'SoltomiaCleaning_C_Talk::Param_ITalk' has a wrong offset!");

}

