#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpaceRenderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_signal_spawn_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function spaceRenderer.spaceRenderer_C.ExecuteUbergraph_spaceRenderer
// 0x01D0 (0x01D0 - 0x0000)
struct SpaceRenderer_C_ExecuteUbergraph_spaceRenderer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbs2D_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_3;     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer) == 0x000008, "Wrong alignment on SpaceRenderer_C_ExecuteUbergraph_spaceRenderer");
static_assert(sizeof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer) == 0x0001D0, "Wrong size on SpaceRenderer_C_ExecuteUbergraph_spaceRenderer");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, EntryPoint) == 0x000000, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000004, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000020, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanOR_ReturnValue) == 0x0000A8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A9, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanOR_ReturnValue_2) == 0x0000AA, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x0000AB, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanAND_ReturnValue) == 0x0000AC, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, K2Node_Event_DeltaSeconds) == 0x0000B0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000C0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000C8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000CC, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanOR_ReturnValue_3) == 0x0000D4, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanOR_ReturnValue_4) == 0x0000D5, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0000D8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BooleanOR_ReturnValue_5) == 0x0000DC, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000E0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000E8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_FInterpTo_Constant_ReturnValue) == 0x0000F0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_SelectFloat_ReturnValue) == 0x0000F4, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BreakVector2D_X_1) == 0x0000F8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_BreakVector2D_Y_1) == 0x0000FC, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_FClamp_ReturnValue) == 0x000100, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_FClamp_ReturnValue_1) == 0x000104, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_RandomFloatInRange_ReturnValue) == 0x000108, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_MakeVector2D_ReturnValue) == 0x00010C, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000114, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000128, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_GetAbs2D_ReturnValue) == 0x000130, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_GetAbs2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000138, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000140, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00014C, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Subtract_IntInt_ReturnValue) == 0x00015C, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000160, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, K2Node_DynamicCast_AsInt_Ttrigger) == 0x000168, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00017C, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Lerp_ReturnValue) == 0x000180, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000184, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000188, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00018C, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000190, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000198, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x0001A0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x0001A8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_Vector2DFloat_ReturnValue_2) == 0x0001B0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x0001B8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Multiply_Vector2DFloat_ReturnValue_3) == 0x0001C0, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Multiply_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ExecuteUbergraph_spaceRenderer, CallFunc_Add_Vector2DVector2D_ReturnValue_3) == 0x0001C8, "Member 'SpaceRenderer_C_ExecuteUbergraph_spaceRenderer::CallFunc_Add_Vector2DVector2D_ReturnValue_3' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SpaceRenderer_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpaceRenderer_C_ReceiveTick) == 0x000004, "Wrong alignment on SpaceRenderer_C_ReceiveTick");
static_assert(sizeof(SpaceRenderer_C_ReceiveTick) == 0x000004, "Wrong size on SpaceRenderer_C_ReceiveTick");
static_assert(offsetof(SpaceRenderer_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SpaceRenderer_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.getCoords
// 0x0040 (0x0040 - 0x0000)
struct SpaceRenderer_C_GetCoords final
{
public:
	struct FVector2D                              InVec;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return;                                            // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpaceRenderer_C_GetCoords) == 0x000004, "Wrong alignment on SpaceRenderer_C_GetCoords");
static_assert(sizeof(SpaceRenderer_C_GetCoords) == 0x000040, "Wrong size on SpaceRenderer_C_GetCoords");
static_assert(offsetof(SpaceRenderer_C_GetCoords, InVec) == 0x000000, "Member 'SpaceRenderer_C_GetCoords::InVec' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GetCoords, Return) == 0x000008, "Member 'SpaceRenderer_C_GetCoords::Return' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GetCoords, CallFunc_BreakVector2D_X) == 0x000014, "Member 'SpaceRenderer_C_GetCoords::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GetCoords, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'SpaceRenderer_C_GetCoords::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GetCoords, CallFunc_RotateAngleAxis_ReturnValue) == 0x00001C, "Member 'SpaceRenderer_C_GetCoords::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GetCoords, CallFunc_Cross_VectorVector_ReturnValue) == 0x000028, "Member 'SpaceRenderer_C_GetCoords::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GetCoords, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000034, "Member 'SpaceRenderer_C_GetCoords::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.generate
// 0x00A8 (0x00A8 - 0x0000)
struct SpaceRenderer_C_Generate final
{
public:
	class UUmg_signal_C*                          CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_signal_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_spawn                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x002C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpaceRenderer_C_Generate) == 0x000008, "Wrong alignment on SpaceRenderer_C_Generate");
static_assert(sizeof(SpaceRenderer_C_Generate) == 0x0000A8, "Wrong size on SpaceRenderer_C_Generate");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Create_ReturnValue) == 0x000000, "Member 'SpaceRenderer_C_Generate::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SpaceRenderer_C_Generate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'SpaceRenderer_C_Generate::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'SpaceRenderer_C_Generate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, Temp_int_Variable) == 0x00001C, "Member 'SpaceRenderer_C_Generate::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'SpaceRenderer_C_Generate::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Array_Get_Item) == 0x000028, "Member 'SpaceRenderer_C_Generate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'SpaceRenderer_C_Generate::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'SpaceRenderer_C_Generate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'SpaceRenderer_C_Generate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'SpaceRenderer_C_Generate::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000040, "Member 'SpaceRenderer_C_Generate::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'SpaceRenderer_C_Generate::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'SpaceRenderer_C_Generate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'SpaceRenderer_C_Generate::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'SpaceRenderer_C_Generate::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Lerp_ReturnValue) == 0x000084, "Member 'SpaceRenderer_C_Generate::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000088, "Member 'SpaceRenderer_C_Generate::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_MakeVector2D_ReturnValue) == 0x000098, "Member 'SpaceRenderer_C_Generate::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_Generate, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000A0, "Member 'SpaceRenderer_C_Generate::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.convertCoords
// 0x0040 (0x0040 - 0x0000)
struct SpaceRenderer_C_ConvertCoords final
{
public:
	struct FVector2D                              InVec;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return;                                            // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpaceRenderer_C_ConvertCoords) == 0x000004, "Wrong alignment on SpaceRenderer_C_ConvertCoords");
static_assert(sizeof(SpaceRenderer_C_ConvertCoords) == 0x000040, "Wrong size on SpaceRenderer_C_ConvertCoords");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, InVec) == 0x000000, "Member 'SpaceRenderer_C_ConvertCoords::InVec' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, Return) == 0x000008, "Member 'SpaceRenderer_C_ConvertCoords::Return' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, CallFunc_BreakVector2D_X) == 0x000014, "Member 'SpaceRenderer_C_ConvertCoords::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'SpaceRenderer_C_ConvertCoords::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, CallFunc_RotateAngleAxis_ReturnValue) == 0x00001C, "Member 'SpaceRenderer_C_ConvertCoords::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, CallFunc_Cross_VectorVector_ReturnValue) == 0x000028, "Member 'SpaceRenderer_C_ConvertCoords::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_ConvertCoords, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000034, "Member 'SpaceRenderer_C_ConvertCoords::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.gatherSignal
// 0x0108 (0x0108 - 0x0000)
struct SpaceRenderer_C_GatherSignal final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_spawn                   Data;                                              // 0x0008(0x002C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_spawn                   SignalData;                                        // 0x0034(0x002C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         I;                                                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbs2D_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbs2D_ReturnValue_1;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_spawn                   CallFunc_Array_Get_Item_1;                         // 0x00C8(0x002C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance2D_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpaceRenderer_C_GatherSignal) == 0x000008, "Wrong alignment on SpaceRenderer_C_GatherSignal");
static_assert(sizeof(SpaceRenderer_C_GatherSignal) == 0x000108, "Wrong size on SpaceRenderer_C_GatherSignal");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, Return) == 0x000000, "Member 'SpaceRenderer_C_GatherSignal::Return' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, Param_Index) == 0x000004, "Member 'SpaceRenderer_C_GatherSignal::Param_Index' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, Data) == 0x000008, "Member 'SpaceRenderer_C_GatherSignal::Data' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, SignalData) == 0x000034, "Member 'SpaceRenderer_C_GatherSignal::SignalData' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, I) == 0x000060, "Member 'SpaceRenderer_C_GatherSignal::I' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, Temp_int_Array_Index_Variable) == 0x000064, "Member 'SpaceRenderer_C_GatherSignal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'SpaceRenderer_C_GatherSignal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_getMainSave_save_main) == 0x000070, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000078, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000088, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Array_Get_Item) == 0x000090, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000098, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, Temp_int_Variable) == 0x00009C, "Member 'SpaceRenderer_C_GatherSignal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A0, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000A4, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Lerp_ReturnValue) == 0x0000AC, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000B0, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_GetAbs2D_ReturnValue) == 0x0000B8, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_GetAbs2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_GetAbs2D_ReturnValue_1) == 0x0000C0, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_GetAbs2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Distance2D_ReturnValue) == 0x0000F4, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000F8, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_GatherSignal, CallFunc_Less_IntInt_ReturnValue) == 0x000100, "Member 'SpaceRenderer_C_GatherSignal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.addSignal
// 0x0094 (0x0094 - 0x0000)
struct SpaceRenderer_C_AddSignal final
{
public:
	struct FVector                                InVec;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_getWeightedObject_Output;                 // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_spawn                   K2Node_MakeStruct_struct_signal_spawn;             // 0x0064(0x002C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpaceRenderer_C_AddSignal) == 0x000004, "Wrong alignment on SpaceRenderer_C_AddSignal");
static_assert(sizeof(SpaceRenderer_C_AddSignal) == 0x000094, "Wrong size on SpaceRenderer_C_AddSignal");
static_assert(offsetof(SpaceRenderer_C_AddSignal, InVec) == 0x000000, "Member 'SpaceRenderer_C_AddSignal::InVec' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, Temp_bool_Variable) == 0x00000C, "Member 'SpaceRenderer_C_AddSignal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_BreakVector_X) == 0x000010, "Member 'SpaceRenderer_C_AddSignal::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_BreakVector_Y) == 0x000014, "Member 'SpaceRenderer_C_AddSignal::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_BreakVector_Z) == 0x000018, "Member 'SpaceRenderer_C_AddSignal::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, Temp_name_Variable) == 0x00001C, "Member 'SpaceRenderer_C_AddSignal::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'SpaceRenderer_C_AddSignal::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_FClamp_ReturnValue_1) == 0x000028, "Member 'SpaceRenderer_C_AddSignal::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_getWeightedObject_Output) == 0x00002C, "Member 'SpaceRenderer_C_AddSignal::CallFunc_getWeightedObject_Output' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'SpaceRenderer_C_AddSignal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'SpaceRenderer_C_AddSignal::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000044, "Member 'SpaceRenderer_C_AddSignal::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000048, "Member 'SpaceRenderer_C_AddSignal::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00004C, "Member 'SpaceRenderer_C_AddSignal::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000050, "Member 'SpaceRenderer_C_AddSignal::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000054, "Member 'SpaceRenderer_C_AddSignal::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000058, "Member 'SpaceRenderer_C_AddSignal::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, K2Node_Select_Default) == 0x00005C, "Member 'SpaceRenderer_C_AddSignal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, K2Node_MakeStruct_struct_signal_spawn) == 0x000064, "Member 'SpaceRenderer_C_AddSignal::K2Node_MakeStruct_struct_signal_spawn' has a wrong offset!");
static_assert(offsetof(SpaceRenderer_C_AddSignal, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'SpaceRenderer_C_AddSignal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function spaceRenderer.spaceRenderer_C.addSignal_cursor
// 0x0018 (0x0018 - 0x0000)
struct SpaceRenderer_C_AddSignal_cursor final
{
public:
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_GetAbs_ReturnValue;                // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
