#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spooker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function spooker.spooker_C.Launch
// 0x0128 (0x0128 - 0x0000)
struct Spooker_C_Launch final
{
public:
	TArray<EObjectTypeQuery>                      A;                                                 // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0110(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Spooker_C_Launch) == 0x000008, "Wrong alignment on Spooker_C_Launch");
static_assert(sizeof(Spooker_C_Launch) == 0x000128, "Wrong size on Spooker_C_Launch");
static_assert(offsetof(Spooker_C_Launch, A) == 0x000000, "Member 'Spooker_C_Launch::A' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, Temp_object_Variable) == 0x000010, "Member 'Spooker_C_Launch::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, K2Node_MakeArray_Array) == 0x000020, "Member 'Spooker_C_Launch::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000030, "Member 'Spooker_C_Launch::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Array_LastIndex_ReturnValue) == 0x000034, "Member 'Spooker_C_Launch::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000038, "Member 'Spooker_C_Launch::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000040, "Member 'Spooker_C_Launch::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'Spooker_C_Launch::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_RandomFloat_ReturnValue) == 0x000050, "Member 'Spooker_C_Launch::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000058, "Member 'Spooker_C_Launch::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Ease_ReturnValue) == 0x000060, "Member 'Spooker_C_Launch::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000064, "Member 'Spooker_C_Launch::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000070, "Member 'Spooker_C_Launch::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000078, "Member 'Spooker_C_Launch::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Array_Get_Item) == 0x000080, "Member 'Spooker_C_Launch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, K2Node_DynamicCast_AsPrimitive_Component) == 0x000088, "Member 'Spooker_C_Launch::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'Spooker_C_Launch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000091, "Member 'Spooker_C_Launch::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_GetComponentBounds_Origin) == 0x000094, "Member 'Spooker_C_Launch::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_GetComponentBounds_BoxExtent) == 0x0000A0, "Member 'Spooker_C_Launch::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_GetComponentBounds_SphereRadius) == 0x0000AC, "Member 'Spooker_C_Launch::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'Spooker_C_Launch::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_MakeVector_ReturnValue) == 0x0000B4, "Member 'Spooker_C_Launch::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_BooleanOR_ReturnValue) == 0x0000C0, "Member 'Spooker_C_Launch::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_BreakVector_X) == 0x0000C4, "Member 'Spooker_C_Launch::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'Spooker_C_Launch::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_BreakVector_Z) == 0x0000CC, "Member 'Spooker_C_Launch::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_FMax_ReturnValue) == 0x0000D0, "Member 'Spooker_C_Launch::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000D4, "Member 'Spooker_C_Launch::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_FMax_ReturnValue_1) == 0x0000E0, "Member 'Spooker_C_Launch::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E4, "Member 'Spooker_C_Launch::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000F0, "Member 'Spooker_C_Launch::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_SetVectorLength_ReturnValue) == 0x0000F4, "Member 'Spooker_C_Launch::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'Spooker_C_Launch::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_SphereOverlapActors_OutActors) == 0x000110, "Member 'Spooker_C_Launch::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Spooker_C_Launch, CallFunc_SphereOverlapActors_ReturnValue) == 0x000120, "Member 'Spooker_C_Launch::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");

// Function spooker.spooker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Spooker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spooker_C_ReceiveTick) == 0x000004, "Wrong alignment on Spooker_C_ReceiveTick");
static_assert(sizeof(Spooker_C_ReceiveTick) == 0x000004, "Wrong size on Spooker_C_ReceiveTick");
static_assert(offsetof(Spooker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Spooker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function spooker.spooker_C.ExecuteUbergraph_spooker
// 0x0030 (0x0030 - 0x0000)
struct Spooker_C_ExecuteUbergraph_spooker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spooker_C_ExecuteUbergraph_spooker) == 0x000008, "Wrong alignment on Spooker_C_ExecuteUbergraph_spooker");
static_assert(sizeof(Spooker_C_ExecuteUbergraph_spooker) == 0x000030, "Wrong size on Spooker_C_ExecuteUbergraph_spooker");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, EntryPoint) == 0x000000, "Member 'Spooker_C_ExecuteUbergraph_spooker::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000004, "Member 'Spooker_C_ExecuteUbergraph_spooker::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Spooker_C_ExecuteUbergraph_spooker::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'Spooker_C_ExecuteUbergraph_spooker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'Spooker_C_ExecuteUbergraph_spooker::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'Spooker_C_ExecuteUbergraph_spooker::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, CallFunc_VSize_ReturnValue) == 0x000024, "Member 'Spooker_C_ExecuteUbergraph_spooker::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spooker_C_ExecuteUbergraph_spooker, CallFunc_FInterpTo_ReturnValue) == 0x000028, "Member 'Spooker_C_ExecuteUbergraph_spooker::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

}

