#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StepperSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function stepperSpline.stepperSpline_C.UserConstructionScript
// 0x0058 (0x0058 - 0x0000)
struct StepperSpline_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_setPath_return;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StepperSpline_C_UserConstructionScript) == 0x000008, "Wrong alignment on StepperSpline_C_UserConstructionScript");
static_assert(sizeof(StepperSpline_C_UserConstructionScript) == 0x000058, "Wrong size on StepperSpline_C_UserConstructionScript");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'StepperSpline_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, K2Node_DynamicCast_AsInt_Objects) == 0x000010, "Member 'StepperSpline_C_UserConstructionScript::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'StepperSpline_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000024, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_setPath_return) == 0x000028, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_setPath_return' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000034, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x00003C, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Lerp_ReturnValue) == 0x000040, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000044, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'StepperSpline_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function stepperSpline.stepperSpline_C.ExecuteUbergraph_stepperSpline
// 0x0020 (0x0020 - 0x0000)
struct StepperSpline_C_ExecuteUbergraph_stepperSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_setPath_return;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StepperSpline_C_ExecuteUbergraph_stepperSpline) == 0x000008, "Wrong alignment on StepperSpline_C_ExecuteUbergraph_stepperSpline");
static_assert(sizeof(StepperSpline_C_ExecuteUbergraph_stepperSpline) == 0x000020, "Wrong size on StepperSpline_C_ExecuteUbergraph_stepperSpline");
static_assert(offsetof(StepperSpline_C_ExecuteUbergraph_stepperSpline, EntryPoint) == 0x000000, "Member 'StepperSpline_C_ExecuteUbergraph_stepperSpline::EntryPoint' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_ExecuteUbergraph_stepperSpline, K2Node_DynamicCast_AsInt_Objects) == 0x000008, "Member 'StepperSpline_C_ExecuteUbergraph_stepperSpline::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_ExecuteUbergraph_stepperSpline, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StepperSpline_C_ExecuteUbergraph_stepperSpline::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StepperSpline_C_ExecuteUbergraph_stepperSpline, CallFunc_setPath_return) == 0x000019, "Member 'StepperSpline_C_ExecuteUbergraph_stepperSpline::CallFunc_setPath_return' has a wrong offset!");

}

