#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StepperSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass stepperSpline.stepperSpline_C
// 0x0038 (0x0258 - 0x0220)
class AStepperSpline_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Upd;                                               // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Points;                                            // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        PointsSPawn;                                       // 0x0240(0x0010)(Edit, BlueprintVisible)
	class AActor*                                 Stepper;                                           // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_stepperSpline(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"stepperSpline_C">();
	}
	static class AStepperSpline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStepperSpline_C>();
	}
};
static_assert(alignof(AStepperSpline_C) == 0x000008, "Wrong alignment on AStepperSpline_C");
static_assert(sizeof(AStepperSpline_C) == 0x000258, "Wrong size on AStepperSpline_C");
static_assert(offsetof(AStepperSpline_C, UberGraphFrame) == 0x000220, "Member 'AStepperSpline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AStepperSpline_C, Spline) == 0x000228, "Member 'AStepperSpline_C::Spline' has a wrong offset!");
static_assert(offsetof(AStepperSpline_C, DefaultSceneRoot) == 0x000230, "Member 'AStepperSpline_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AStepperSpline_C, Upd) == 0x000238, "Member 'AStepperSpline_C::Upd' has a wrong offset!");
static_assert(offsetof(AStepperSpline_C, Points) == 0x00023C, "Member 'AStepperSpline_C::Points' has a wrong offset!");
static_assert(offsetof(AStepperSpline_C, PointsSPawn) == 0x000240, "Member 'AStepperSpline_C::PointsSPawn' has a wrong offset!");
static_assert(offsetof(AStepperSpline_C, Stepper) == 0x000250, "Member 'AStepperSpline_C::Stepper' has a wrong offset!");

}

