#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SignalEmailResponse

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_SignalEmailResponse.struct_SignalEmailResponse
// 0x0028 (0x0028 - 0x0000)
struct FStruct_SignalEmailResponse final
{
public:
	TArray<class FText>                           Topics_13_1D17D0B0484E52225DCDB5937D69CE2B;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Responses_4_39E9A09E442B620574F248AE409DC7A7;      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Priority_9_B6E7589E4A0FB58E56F1AB9754851F69;       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_SignalEmailResponse) == 0x000008, "Wrong alignment on FStruct_SignalEmailResponse");
static_assert(sizeof(FStruct_SignalEmailResponse) == 0x000028, "Wrong size on FStruct_SignalEmailResponse");
static_assert(offsetof(FStruct_SignalEmailResponse, Topics_13_1D17D0B0484E52225DCDB5937D69CE2B) == 0x000000, "Member 'FStruct_SignalEmailResponse::Topics_13_1D17D0B0484E52225DCDB5937D69CE2B' has a wrong offset!");
static_assert(offsetof(FStruct_SignalEmailResponse, Responses_4_39E9A09E442B620574F248AE409DC7A7) == 0x000010, "Member 'FStruct_SignalEmailResponse::Responses_4_39E9A09E442B620574F248AE409DC7A7' has a wrong offset!");
static_assert(offsetof(FStruct_SignalEmailResponse, Priority_9_B6E7589E4A0FB58E56F1AB9754851F69) == 0x000020, "Member 'FStruct_SignalEmailResponse::Priority_9_B6E7589E4A0FB58E56F1AB9754851F69' has a wrong offset!");

}

