#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_dangerProp

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_dangerProp.struct_dangerProp
// 0x0010 (0x0010 - 0x0000)
struct FStruct_dangerProp final
{
public:
	float                                         Health_2_80884EAE4E7532BF46D018AFF84225C1;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage_4_D125B61E4176D707A058B39791E142F3;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpactResistance_7_36B4BA2643EB3447C401D0AB97F6017E; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageResistance_9_C46D3A404292344A11DA379671238E6C; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_dangerProp) == 0x000004, "Wrong alignment on FStruct_dangerProp");
static_assert(sizeof(FStruct_dangerProp) == 0x000010, "Wrong size on FStruct_dangerProp");
static_assert(offsetof(FStruct_dangerProp, Health_2_80884EAE4E7532BF46D018AFF84225C1) == 0x000000, "Member 'FStruct_dangerProp::Health_2_80884EAE4E7532BF46D018AFF84225C1' has a wrong offset!");
static_assert(offsetof(FStruct_dangerProp, Damage_4_D125B61E4176D707A058B39791E142F3) == 0x000004, "Member 'FStruct_dangerProp::Damage_4_D125B61E4176D707A058B39791E142F3' has a wrong offset!");
static_assert(offsetof(FStruct_dangerProp, ImpactResistance_7_36B4BA2643EB3447C401D0AB97F6017E) == 0x000008, "Member 'FStruct_dangerProp::ImpactResistance_7_36B4BA2643EB3447C401D0AB97F6017E' has a wrong offset!");
static_assert(offsetof(FStruct_dangerProp, DamageResistance_9_C46D3A404292344A11DA379671238E6C) == 0x00000C, "Member 'FStruct_dangerProp::DamageResistance_9_C46D3A404292344A11DA379671238E6C' has a wrong offset!");

}

