#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_object

#include "Basic.hpp"

#include "Struct_signalDataDynamic_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mClass_structs.hpp"
#include "Struct_mVector_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_object.struct_object
// 0x0088 (0x0088 - 0x0000)
struct FStruct_object final
{
public:
	class UClass*                                 Class_3_CEFFC3F341A6347A0F6430AFAF33DF89;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_signalDataDynamic>      Signals_39_A694C49D49A6ACDAAC6776889F4AA1B3;       // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mBool>                  bools_24_0C721D2543594E8CBFB45AA408560F0D;         // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mInt>                   Ints_25_2C3AA60348E9BA2BC7BAB6B76AF5E464;          // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mFloat>                 Floats_26_8F196D55441307CDC22F8AB9895CF731;        // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mString>                Strings_27_3F00B24E45E75EA9AD6CB6A49082CC54;       // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mClass>                 Classes_31_1F32A6B843BB553F921EF59ED04991B0;       // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mVector>                Vectors_42_8803FFCB4715CBC078DBF299336F2EC1;       // 0x0068(0x0010)(Edit, BlueprintVisible)
	class FString                                 Key_38_34DD1D8F47067B26F87B72B67E8BA025;           // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_object) == 0x000008, "Wrong alignment on FStruct_object");
static_assert(sizeof(FStruct_object) == 0x000088, "Wrong size on FStruct_object");
static_assert(offsetof(FStruct_object, Class_3_CEFFC3F341A6347A0F6430AFAF33DF89) == 0x000000, "Member 'FStruct_object::Class_3_CEFFC3F341A6347A0F6430AFAF33DF89' has a wrong offset!");
static_assert(offsetof(FStruct_object, Signals_39_A694C49D49A6ACDAAC6776889F4AA1B3) == 0x000008, "Member 'FStruct_object::Signals_39_A694C49D49A6ACDAAC6776889F4AA1B3' has a wrong offset!");
static_assert(offsetof(FStruct_object, bools_24_0C721D2543594E8CBFB45AA408560F0D) == 0x000018, "Member 'FStruct_object::bools_24_0C721D2543594E8CBFB45AA408560F0D' has a wrong offset!");
static_assert(offsetof(FStruct_object, Ints_25_2C3AA60348E9BA2BC7BAB6B76AF5E464) == 0x000028, "Member 'FStruct_object::Ints_25_2C3AA60348E9BA2BC7BAB6B76AF5E464' has a wrong offset!");
static_assert(offsetof(FStruct_object, Floats_26_8F196D55441307CDC22F8AB9895CF731) == 0x000038, "Member 'FStruct_object::Floats_26_8F196D55441307CDC22F8AB9895CF731' has a wrong offset!");
static_assert(offsetof(FStruct_object, Strings_27_3F00B24E45E75EA9AD6CB6A49082CC54) == 0x000048, "Member 'FStruct_object::Strings_27_3F00B24E45E75EA9AD6CB6A49082CC54' has a wrong offset!");
static_assert(offsetof(FStruct_object, Classes_31_1F32A6B843BB553F921EF59ED04991B0) == 0x000058, "Member 'FStruct_object::Classes_31_1F32A6B843BB553F921EF59ED04991B0' has a wrong offset!");
static_assert(offsetof(FStruct_object, Vectors_42_8803FFCB4715CBC078DBF299336F2EC1) == 0x000068, "Member 'FStruct_object::Vectors_42_8803FFCB4715CBC078DBF299336F2EC1' has a wrong offset!");
static_assert(offsetof(FStruct_object, Key_38_34DD1D8F47067B26F87B72B67E8BA025) == 0x000078, "Member 'FStruct_object::Key_38_34DD1D8F47067B26F87B72B67E8BA025' has a wrong offset!");

}

