#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_scientistSpecialResponse

#include "Basic.hpp"

#include "Enum_emailChars_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_scientistSpecialResponse.struct_scientistSpecialResponse
// 0x0028 (0x0028 - 0x0000)
struct FStruct_scientistSpecialResponse final
{
public:
	Enum_emailChars                               Character_4_FEE61152409B1BE51BE8E4BE30CAE48A;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Topics_8_068439474C483CFC2A6658B1C5A8163A;         // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Messages_10_30F66A3D47E12D2DA28897B0F7191EC4;      // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_scientistSpecialResponse) == 0x000008, "Wrong alignment on FStruct_scientistSpecialResponse");
static_assert(sizeof(FStruct_scientistSpecialResponse) == 0x000028, "Wrong size on FStruct_scientistSpecialResponse");
static_assert(offsetof(FStruct_scientistSpecialResponse, Character_4_FEE61152409B1BE51BE8E4BE30CAE48A) == 0x000000, "Member 'FStruct_scientistSpecialResponse::Character_4_FEE61152409B1BE51BE8E4BE30CAE48A' has a wrong offset!");
static_assert(offsetof(FStruct_scientistSpecialResponse, Topics_8_068439474C483CFC2A6658B1C5A8163A) == 0x000008, "Member 'FStruct_scientistSpecialResponse::Topics_8_068439474C483CFC2A6658B1C5A8163A' has a wrong offset!");
static_assert(offsetof(FStruct_scientistSpecialResponse, Messages_10_30F66A3D47E12D2DA28897B0F7191EC4) == 0x000018, "Member 'FStruct_scientistSpecialResponse::Messages_10_30F66A3D47E12D2DA28897B0F7191EC4' has a wrong offset!");

}

