#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_tv

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_tv.struct_tv
// 0x0028 (0x0028 - 0x0000)
struct FStruct_tv final
{
public:
	class FString                                 Name_2_AFBEF17B412C528C122223A2DE2E4BF0;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Link_4_B66EE4124079103E5E15E7B765EF9EDE;           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsUrl_7_1FB3BE1A435CF2A9593612ADD941B949;          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_tv) == 0x000008, "Wrong alignment on FStruct_tv");
static_assert(sizeof(FStruct_tv) == 0x000028, "Wrong size on FStruct_tv");
static_assert(offsetof(FStruct_tv, Name_2_AFBEF17B412C528C122223A2DE2E4BF0) == 0x000000, "Member 'FStruct_tv::Name_2_AFBEF17B412C528C122223A2DE2E4BF0' has a wrong offset!");
static_assert(offsetof(FStruct_tv, Link_4_B66EE4124079103E5E15E7B765EF9EDE) == 0x000010, "Member 'FStruct_tv::Link_4_B66EE4124079103E5E15E7B765EF9EDE' has a wrong offset!");
static_assert(offsetof(FStruct_tv, IsUrl_7_1FB3BE1A435CF2A9593612ADD941B949) == 0x000020, "Member 'FStruct_tv::IsUrl_7_1FB3BE1A435CF2A9593612ADD941B949' has a wrong offset!");

}

