#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_loan

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_loan.struct_loan
// 0x0020 (0x0020 - 0x0000)
struct FStruct_loan final
{
public:
	class FString                                 Type_7_E607B22D47CFA4F752D1B6B710684810;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Points_2_752CFBBD4EB5B6000C2BC79885237755;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Return_4_9A9190A14D8C3980124094971FDF7DD3;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Days_10_AACAB8A44B4D702C90A29AAD10449F2D;          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_loan) == 0x000008, "Wrong alignment on FStruct_loan");
static_assert(sizeof(FStruct_loan) == 0x000020, "Wrong size on FStruct_loan");
static_assert(offsetof(FStruct_loan, Type_7_E607B22D47CFA4F752D1B6B710684810) == 0x000000, "Member 'FStruct_loan::Type_7_E607B22D47CFA4F752D1B6B710684810' has a wrong offset!");
static_assert(offsetof(FStruct_loan, Points_2_752CFBBD4EB5B6000C2BC79885237755) == 0x000010, "Member 'FStruct_loan::Points_2_752CFBBD4EB5B6000C2BC79885237755' has a wrong offset!");
static_assert(offsetof(FStruct_loan, Return_4_9A9190A14D8C3980124094971FDF7DD3) == 0x000014, "Member 'FStruct_loan::Return_4_9A9190A14D8C3980124094971FDF7DD3' has a wrong offset!");
static_assert(offsetof(FStruct_loan, Days_10_AACAB8A44B4D702C90A29AAD10449F2D) == 0x000018, "Member 'FStruct_loan::Days_10_AACAB8A44B4D702C90A29AAD10449F2D' has a wrong offset!");

}

