#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_propDynamic

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_propDynamic.struct_propDynamic
// 0x0028 (0x0028 - 0x0000)
struct FStruct_propDynamic final
{
public:
	class FName                                   Name_3_8A6CE23C409B32F80BE3C2AE0D0B36F2;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Properties_7_4F35F9C8481CA82BA9833E8F5A36BA63;     // 0x0008(0x0010)(Edit, BlueprintVisible)
	class FString                                 Key_12_DBE1E12D47A10F90DDE0F19C7E2FDAD5;           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_propDynamic) == 0x000008, "Wrong alignment on FStruct_propDynamic");
static_assert(sizeof(FStruct_propDynamic) == 0x000028, "Wrong size on FStruct_propDynamic");
static_assert(offsetof(FStruct_propDynamic, Name_3_8A6CE23C409B32F80BE3C2AE0D0B36F2) == 0x000000, "Member 'FStruct_propDynamic::Name_3_8A6CE23C409B32F80BE3C2AE0D0B36F2' has a wrong offset!");
static_assert(offsetof(FStruct_propDynamic, Properties_7_4F35F9C8481CA82BA9833E8F5A36BA63) == 0x000008, "Member 'FStruct_propDynamic::Properties_7_4F35F9C8481CA82BA9833E8F5A36BA63' has a wrong offset!");
static_assert(offsetof(FStruct_propDynamic, Key_12_DBE1E12D47A10F90DDE0F19C7E2FDAD5) == 0x000018, "Member 'FStruct_propDynamic::Key_12_DBE1E12D47A10F90DDE0F19C7E2FDAD5' has a wrong offset!");

}

