#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_achievement

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_achievement.struct_achievement
// 0x0050 (0x0050 - 0x0000)
struct FStruct_achievement final
{
public:
	class FName                                   Name_4_0534A17545E554F4B68649B89423EB76;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Image_20_0E252F6A4A1A655ECB0689A250A2EB57;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName_5_B400DAF547199398CDA692B5B2D6A599;    // 0x0010(0x0018)(Edit, BlueprintVisible)
	int32                                         ProgressTarget_11_43B369D14FAD25B027282CAFFC2C3879; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Progress_8_16978C8F431AF43A377F3BA52100DF7A;       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Desc_14_416AEAFF42C88E5C34C4DA9EC2040435;          // 0x0030(0x0018)(Edit, BlueprintVisible)
	int32                                         Award_17_BF5ED5C148773720D6813BB3F829CC90;         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_achievement) == 0x000008, "Wrong alignment on FStruct_achievement");
static_assert(sizeof(FStruct_achievement) == 0x000050, "Wrong size on FStruct_achievement");
static_assert(offsetof(FStruct_achievement, Name_4_0534A17545E554F4B68649B89423EB76) == 0x000000, "Member 'FStruct_achievement::Name_4_0534A17545E554F4B68649B89423EB76' has a wrong offset!");
static_assert(offsetof(FStruct_achievement, Image_20_0E252F6A4A1A655ECB0689A250A2EB57) == 0x000008, "Member 'FStruct_achievement::Image_20_0E252F6A4A1A655ECB0689A250A2EB57' has a wrong offset!");
static_assert(offsetof(FStruct_achievement, DisplayName_5_B400DAF547199398CDA692B5B2D6A599) == 0x000010, "Member 'FStruct_achievement::DisplayName_5_B400DAF547199398CDA692B5B2D6A599' has a wrong offset!");
static_assert(offsetof(FStruct_achievement, ProgressTarget_11_43B369D14FAD25B027282CAFFC2C3879) == 0x000028, "Member 'FStruct_achievement::ProgressTarget_11_43B369D14FAD25B027282CAFFC2C3879' has a wrong offset!");
static_assert(offsetof(FStruct_achievement, Progress_8_16978C8F431AF43A377F3BA52100DF7A) == 0x00002C, "Member 'FStruct_achievement::Progress_8_16978C8F431AF43A377F3BA52100DF7A' has a wrong offset!");
static_assert(offsetof(FStruct_achievement, Desc_14_416AEAFF42C88E5C34C4DA9EC2040435) == 0x000030, "Member 'FStruct_achievement::Desc_14_416AEAFF42C88E5C34C4DA9EC2040435' has a wrong offset!");
static_assert(offsetof(FStruct_achievement, Award_17_BF5ED5C148773720D6813BB3F829CC90) == 0x000048, "Member 'FStruct_achievement::Award_17_BF5ED5C148773720D6813BB3F829CC90' has a wrong offset!");

}

