#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_sound

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_sound.struct_sound
// 0x0018 (0x0018 - 0x0000)
struct FStruct_sound final
{
public:
	class USoundBase*                             Sound_2_44199FBB4521DB9BE62F5C89E3EB1255;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volume_5_FDDCDEAF4F829C1D550A27A9FF6DD42D;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch_7_C1C836AF4A3C5474D84431BE59898CDF;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      Attenuation_11_F6E2E3D7491864E28758AD8E319B40BD;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_sound) == 0x000008, "Wrong alignment on FStruct_sound");
static_assert(sizeof(FStruct_sound) == 0x000018, "Wrong size on FStruct_sound");
static_assert(offsetof(FStruct_sound, Sound_2_44199FBB4521DB9BE62F5C89E3EB1255) == 0x000000, "Member 'FStruct_sound::Sound_2_44199FBB4521DB9BE62F5C89E3EB1255' has a wrong offset!");
static_assert(offsetof(FStruct_sound, Volume_5_FDDCDEAF4F829C1D550A27A9FF6DD42D) == 0x000008, "Member 'FStruct_sound::Volume_5_FDDCDEAF4F829C1D550A27A9FF6DD42D' has a wrong offset!");
static_assert(offsetof(FStruct_sound, Pitch_7_C1C836AF4A3C5474D84431BE59898CDF) == 0x00000C, "Member 'FStruct_sound::Pitch_7_C1C836AF4A3C5474D84431BE59898CDF' has a wrong offset!");
static_assert(offsetof(FStruct_sound, Attenuation_11_F6E2E3D7491864E28758AD8E319B40BD) == 0x000010, "Member 'FStruct_sound::Attenuation_11_F6E2E3D7491864E28758AD8E319B40BD' has a wrong offset!");

}

