#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_multisectionCustomMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_customMesh_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_multisectionCustomMesh.struct_multisectionCustomMesh
// 0x0118 (0x0118 - 0x0000)
struct FStruct_multisectionCustomMesh final
{
public:
	TArray<struct FStruct_customMesh>             Geometry_4_CA5ADDA34263C93881C48E8FC97CCCAF;       // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         SectionNames_7_1ED9F65C45C16DAB4475DB91FC868C20;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     Textures_diffuse_13_A750D5AD4AF155F685402FA739EF0224; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     Textures_pbr_15_8D8D771B474A659BF02BCF8142A321A1;  // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     Textures_normal_17_361862C944F5A45004ACB7A467AFF2C8; // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     Textures_emissive_21_9FEA928B45FDB34A66D45190D3DFFAE0; // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 Filters_diffuse_34_FBBA752E41C5DA9F91510A88555A6F84; // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 Filters_pbr_35_DBA0C4DE4D9980C050F52FB6E9F1B5F4;   // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 Filters_normal_36_2FC8FCD941E5419C567D29AF35C59872; // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 Filters_emissive_38_F7134C8D40001B6CB4BA0F8E87EC373A; // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Names_diffuse_44_BF87E8264C0D9684953D9DB2DDF62B86; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Names_pbr_46_E8D812204C86E1CBC05CC293FE9D88E2;     // 0x00B0(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Names_normal_48_235807024784D0F4F8FF42A5BB68AB0A;  // 0x00C0(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Names_emissive_50_A93DDAAB4CD5EED7ABD0B8AEDF1F4051; // 0x00D0(0x0010)(Edit, BlueprintVisible)
	float                                         EmissiveStrength_24_93B0F0F34A9818A9C082AEB6B8784817; // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLamp_52_AEF0123147FA9F29B11B44861A7A9021;        // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LampColor_59_7753EA5040097CC7ED7527B1CEDB524B;     // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LampOffset_58_F33D2CA84084EAB6DB9CA1B441ABD7B7;    // 0x00F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PhysicalMaterial_63_964AA8D14051A5C564595C9428201AED; // 0x0104(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LampIntensity_67_CEC7F09D45396B3523A02883CD13ECB8; // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LampAttenuation_69_5ED773D748CAFB6603F2C989A39E33D0; // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lamp_shadows_72_3EA690B84A3A64BE0A3D168963102D09;  // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_multisectionCustomMesh) == 0x000008, "Wrong alignment on FStruct_multisectionCustomMesh");
static_assert(sizeof(FStruct_multisectionCustomMesh) == 0x000118, "Wrong size on FStruct_multisectionCustomMesh");
static_assert(offsetof(FStruct_multisectionCustomMesh, Geometry_4_CA5ADDA34263C93881C48E8FC97CCCAF) == 0x000000, "Member 'FStruct_multisectionCustomMesh::Geometry_4_CA5ADDA34263C93881C48E8FC97CCCAF' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, SectionNames_7_1ED9F65C45C16DAB4475DB91FC868C20) == 0x000010, "Member 'FStruct_multisectionCustomMesh::SectionNames_7_1ED9F65C45C16DAB4475DB91FC868C20' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Textures_diffuse_13_A750D5AD4AF155F685402FA739EF0224) == 0x000020, "Member 'FStruct_multisectionCustomMesh::Textures_diffuse_13_A750D5AD4AF155F685402FA739EF0224' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Textures_pbr_15_8D8D771B474A659BF02BCF8142A321A1) == 0x000030, "Member 'FStruct_multisectionCustomMesh::Textures_pbr_15_8D8D771B474A659BF02BCF8142A321A1' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Textures_normal_17_361862C944F5A45004ACB7A467AFF2C8) == 0x000040, "Member 'FStruct_multisectionCustomMesh::Textures_normal_17_361862C944F5A45004ACB7A467AFF2C8' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Textures_emissive_21_9FEA928B45FDB34A66D45190D3DFFAE0) == 0x000050, "Member 'FStruct_multisectionCustomMesh::Textures_emissive_21_9FEA928B45FDB34A66D45190D3DFFAE0' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Filters_diffuse_34_FBBA752E41C5DA9F91510A88555A6F84) == 0x000060, "Member 'FStruct_multisectionCustomMesh::Filters_diffuse_34_FBBA752E41C5DA9F91510A88555A6F84' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Filters_pbr_35_DBA0C4DE4D9980C050F52FB6E9F1B5F4) == 0x000070, "Member 'FStruct_multisectionCustomMesh::Filters_pbr_35_DBA0C4DE4D9980C050F52FB6E9F1B5F4' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Filters_normal_36_2FC8FCD941E5419C567D29AF35C59872) == 0x000080, "Member 'FStruct_multisectionCustomMesh::Filters_normal_36_2FC8FCD941E5419C567D29AF35C59872' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Filters_emissive_38_F7134C8D40001B6CB4BA0F8E87EC373A) == 0x000090, "Member 'FStruct_multisectionCustomMesh::Filters_emissive_38_F7134C8D40001B6CB4BA0F8E87EC373A' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Names_diffuse_44_BF87E8264C0D9684953D9DB2DDF62B86) == 0x0000A0, "Member 'FStruct_multisectionCustomMesh::Names_diffuse_44_BF87E8264C0D9684953D9DB2DDF62B86' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Names_pbr_46_E8D812204C86E1CBC05CC293FE9D88E2) == 0x0000B0, "Member 'FStruct_multisectionCustomMesh::Names_pbr_46_E8D812204C86E1CBC05CC293FE9D88E2' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Names_normal_48_235807024784D0F4F8FF42A5BB68AB0A) == 0x0000C0, "Member 'FStruct_multisectionCustomMesh::Names_normal_48_235807024784D0F4F8FF42A5BB68AB0A' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Names_emissive_50_A93DDAAB4CD5EED7ABD0B8AEDF1F4051) == 0x0000D0, "Member 'FStruct_multisectionCustomMesh::Names_emissive_50_A93DDAAB4CD5EED7ABD0B8AEDF1F4051' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, EmissiveStrength_24_93B0F0F34A9818A9C082AEB6B8784817) == 0x0000E0, "Member 'FStruct_multisectionCustomMesh::EmissiveStrength_24_93B0F0F34A9818A9C082AEB6B8784817' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, IsLamp_52_AEF0123147FA9F29B11B44861A7A9021) == 0x0000E4, "Member 'FStruct_multisectionCustomMesh::IsLamp_52_AEF0123147FA9F29B11B44861A7A9021' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, LampColor_59_7753EA5040097CC7ED7527B1CEDB524B) == 0x0000E8, "Member 'FStruct_multisectionCustomMesh::LampColor_59_7753EA5040097CC7ED7527B1CEDB524B' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, LampOffset_58_F33D2CA84084EAB6DB9CA1B441ABD7B7) == 0x0000F8, "Member 'FStruct_multisectionCustomMesh::LampOffset_58_F33D2CA84084EAB6DB9CA1B441ABD7B7' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, PhysicalMaterial_63_964AA8D14051A5C564595C9428201AED) == 0x000104, "Member 'FStruct_multisectionCustomMesh::PhysicalMaterial_63_964AA8D14051A5C564595C9428201AED' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, LampIntensity_67_CEC7F09D45396B3523A02883CD13ECB8) == 0x000108, "Member 'FStruct_multisectionCustomMesh::LampIntensity_67_CEC7F09D45396B3523A02883CD13ECB8' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, LampAttenuation_69_5ED773D748CAFB6603F2C989A39E33D0) == 0x00010C, "Member 'FStruct_multisectionCustomMesh::LampAttenuation_69_5ED773D748CAFB6603F2C989A39E33D0' has a wrong offset!");
static_assert(offsetof(FStruct_multisectionCustomMesh, Lamp_shadows_72_3EA690B84A3A64BE0A3D168963102D09) == 0x000110, "Member 'FStruct_multisectionCustomMesh::Lamp_shadows_72_3EA690B84A3A64BE0A3D168963102D09' has a wrong offset!");

}

