#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_task

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_task.struct_task
// 0x0070 (0x0070 - 0x0000)
struct FStruct_task final
{
public:
	bool                                          Active_31_240F3F9E4F17346B449C3F81FC81AEA8;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Points_7_6DD8FF16419714EB5D548B976F625F36;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level_0_16_88D206694129CF344988FCBE97D2746D;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level_1_17_DA0C9B2A415A9C3965B9CE94924FA2BF;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level_2_18_DA69C40F460C07F8F36EA9903A8616A4;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level_3_19_025F3E1E4D5816711A15A88F08F7C298;       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pr_level_0_22_6F755B9B4A891014FDCFD9A21465EE40;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pr_level_1_24_AFAD2026496CAE54AF64C7836EAE0406;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pr_level_2_26_1D0983874395EE83333203B43085BCCF;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Pr_level_3_28_704A7A03492B930F8A1E4EA2959996CB;    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         DishesCode_41_1322AB5A47727AFCA04BB18608331B82;    // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Dishes_42_6ABFC4574850DF1150C87FB633EB19D7;        // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         CheckedDishes_44_A5C4DE844DAAE9551A6CDD8A8BE6EBC1; // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         Completed_55_59373DAE4879C220F1CD918227B6F25A;     // 0x0058(0x0010)(Edit, BlueprintVisible)
	bool                                          SignalsCompleted_47_4B7E5DDC4743C673697C9C826EF0DA7C; // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReportCompleted_48_CBA311754F4EEF5950721CB961EE4DA2; // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Fails_51_26566E3641B156F3F6AB08B9355882ED;         // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_task) == 0x000008, "Wrong alignment on FStruct_task");
static_assert(sizeof(FStruct_task) == 0x000070, "Wrong size on FStruct_task");
static_assert(offsetof(FStruct_task, Active_31_240F3F9E4F17346B449C3F81FC81AEA8) == 0x000000, "Member 'FStruct_task::Active_31_240F3F9E4F17346B449C3F81FC81AEA8' has a wrong offset!");
static_assert(offsetof(FStruct_task, Points_7_6DD8FF16419714EB5D548B976F625F36) == 0x000004, "Member 'FStruct_task::Points_7_6DD8FF16419714EB5D548B976F625F36' has a wrong offset!");
static_assert(offsetof(FStruct_task, Level_0_16_88D206694129CF344988FCBE97D2746D) == 0x000008, "Member 'FStruct_task::Level_0_16_88D206694129CF344988FCBE97D2746D' has a wrong offset!");
static_assert(offsetof(FStruct_task, Level_1_17_DA0C9B2A415A9C3965B9CE94924FA2BF) == 0x00000C, "Member 'FStruct_task::Level_1_17_DA0C9B2A415A9C3965B9CE94924FA2BF' has a wrong offset!");
static_assert(offsetof(FStruct_task, Level_2_18_DA69C40F460C07F8F36EA9903A8616A4) == 0x000010, "Member 'FStruct_task::Level_2_18_DA69C40F460C07F8F36EA9903A8616A4' has a wrong offset!");
static_assert(offsetof(FStruct_task, Level_3_19_025F3E1E4D5816711A15A88F08F7C298) == 0x000014, "Member 'FStruct_task::Level_3_19_025F3E1E4D5816711A15A88F08F7C298' has a wrong offset!");
static_assert(offsetof(FStruct_task, Pr_level_0_22_6F755B9B4A891014FDCFD9A21465EE40) == 0x000018, "Member 'FStruct_task::Pr_level_0_22_6F755B9B4A891014FDCFD9A21465EE40' has a wrong offset!");
static_assert(offsetof(FStruct_task, Pr_level_1_24_AFAD2026496CAE54AF64C7836EAE0406) == 0x00001C, "Member 'FStruct_task::Pr_level_1_24_AFAD2026496CAE54AF64C7836EAE0406' has a wrong offset!");
static_assert(offsetof(FStruct_task, Pr_level_2_26_1D0983874395EE83333203B43085BCCF) == 0x000020, "Member 'FStruct_task::Pr_level_2_26_1D0983874395EE83333203B43085BCCF' has a wrong offset!");
static_assert(offsetof(FStruct_task, Pr_level_3_28_704A7A03492B930F8A1E4EA2959996CB) == 0x000024, "Member 'FStruct_task::Pr_level_3_28_704A7A03492B930F8A1E4EA2959996CB' has a wrong offset!");
static_assert(offsetof(FStruct_task, DishesCode_41_1322AB5A47727AFCA04BB18608331B82) == 0x000028, "Member 'FStruct_task::DishesCode_41_1322AB5A47727AFCA04BB18608331B82' has a wrong offset!");
static_assert(offsetof(FStruct_task, Dishes_42_6ABFC4574850DF1150C87FB633EB19D7) == 0x000038, "Member 'FStruct_task::Dishes_42_6ABFC4574850DF1150C87FB633EB19D7' has a wrong offset!");
static_assert(offsetof(FStruct_task, CheckedDishes_44_A5C4DE844DAAE9551A6CDD8A8BE6EBC1) == 0x000048, "Member 'FStruct_task::CheckedDishes_44_A5C4DE844DAAE9551A6CDD8A8BE6EBC1' has a wrong offset!");
static_assert(offsetof(FStruct_task, Completed_55_59373DAE4879C220F1CD918227B6F25A) == 0x000058, "Member 'FStruct_task::Completed_55_59373DAE4879C220F1CD918227B6F25A' has a wrong offset!");
static_assert(offsetof(FStruct_task, SignalsCompleted_47_4B7E5DDC4743C673697C9C826EF0DA7C) == 0x000068, "Member 'FStruct_task::SignalsCompleted_47_4B7E5DDC4743C673697C9C826EF0DA7C' has a wrong offset!");
static_assert(offsetof(FStruct_task, ReportCompleted_48_CBA311754F4EEF5950721CB961EE4DA2) == 0x000069, "Member 'FStruct_task::ReportCompleted_48_CBA311754F4EEF5950721CB961EE4DA2' has a wrong offset!");
static_assert(offsetof(FStruct_task, Fails_51_26566E3641B156F3F6AB08B9355882ED) == 0x00006C, "Member 'FStruct_task::Fails_51_26566E3641B156F3F6AB08B9355882ED' has a wrong offset!");

}

