#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_characterResponse_v21

#include "Basic.hpp"

#include "Struct_SignalEmailResponse_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_characterResponse_v21.struct_characterResponse_v21
// 0x0118 (0x0118 - 0x0000)
struct FStruct_characterResponse_v21 final
{
public:
	struct FStruct_SignalEmailResponse            Normal_raw_15_611725B04930374145E646A87B5E4360;    // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_SignalEmailResponse            Normal_low_16_37B5F9A941EE78D112D36ABF74B2A86D;    // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_SignalEmailResponse            Normal_noisy_17_7A41F79D43A1339C10B46DB79A1D8E50;  // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_SignalEmailResponse            Normal_clear_18_21CB0D5C4928A64B027A51AB2F045CA1;  // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_SignalEmailResponse            Interest_noisy_19_F748CF0B4583D667F437CDB67A8294A9; // 0x00A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_SignalEmailResponse            Interest_clear_20_0E06806C4E643D342FBC39963711F6D0; // 0x00C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_SignalEmailResponse            Spooky_clear_21_01E63332476D3C365946A88FDD944987;  // 0x00F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_characterResponse_v21) == 0x000008, "Wrong alignment on FStruct_characterResponse_v21");
static_assert(sizeof(FStruct_characterResponse_v21) == 0x000118, "Wrong size on FStruct_characterResponse_v21");
static_assert(offsetof(FStruct_characterResponse_v21, Normal_raw_15_611725B04930374145E646A87B5E4360) == 0x000000, "Member 'FStruct_characterResponse_v21::Normal_raw_15_611725B04930374145E646A87B5E4360' has a wrong offset!");
static_assert(offsetof(FStruct_characterResponse_v21, Normal_low_16_37B5F9A941EE78D112D36ABF74B2A86D) == 0x000028, "Member 'FStruct_characterResponse_v21::Normal_low_16_37B5F9A941EE78D112D36ABF74B2A86D' has a wrong offset!");
static_assert(offsetof(FStruct_characterResponse_v21, Normal_noisy_17_7A41F79D43A1339C10B46DB79A1D8E50) == 0x000050, "Member 'FStruct_characterResponse_v21::Normal_noisy_17_7A41F79D43A1339C10B46DB79A1D8E50' has a wrong offset!");
static_assert(offsetof(FStruct_characterResponse_v21, Normal_clear_18_21CB0D5C4928A64B027A51AB2F045CA1) == 0x000078, "Member 'FStruct_characterResponse_v21::Normal_clear_18_21CB0D5C4928A64B027A51AB2F045CA1' has a wrong offset!");
static_assert(offsetof(FStruct_characterResponse_v21, Interest_noisy_19_F748CF0B4583D667F437CDB67A8294A9) == 0x0000A0, "Member 'FStruct_characterResponse_v21::Interest_noisy_19_F748CF0B4583D667F437CDB67A8294A9' has a wrong offset!");
static_assert(offsetof(FStruct_characterResponse_v21, Interest_clear_20_0E06806C4E643D342FBC39963711F6D0) == 0x0000C8, "Member 'FStruct_characterResponse_v21::Interest_clear_20_0E06806C4E643D342FBC39963711F6D0' has a wrong offset!");
static_assert(offsetof(FStruct_characterResponse_v21, Spooky_clear_21_01E63332476D3C365946A88FDD944987) == 0x0000F0, "Member 'FStruct_characterResponse_v21::Spooky_clear_21_01E63332476D3C365946A88FDD944987' has a wrong offset!");

}

