#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_store

#include "Basic.hpp"

#include "Enum_shopCats_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_store.struct_store
// 0x0048 (0x0048 - 0x0000)
struct FStruct_store final
{
public:
	int32                                         Price_11_BE3AF83E446D1C3BDEA63BA50CFE096C;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_14_B3814BBE478D1FA0AB005BB6386C1541;          // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CCA[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Object_18_519B13C4426D465A5A4A80A9FFFBB161;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AsProp_21_D3F8D96740005CA84664FBAD4E0F5F48;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_shopCats                                 Category_24_257ED6AB4855F44C55FFC98ECEA1F511;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CCB[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Subcategory_35_BC2B1FF94CA9FC340ADDC78FFA014589;   // 0x0028(0x0018)(Edit, BlueprintVisible)
	int32                                         Size_30_C3131BE84D89E0C389F1DB9557E08D74;          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_store) == 0x000008, "Wrong alignment on FStruct_store");
static_assert(sizeof(FStruct_store) == 0x000048, "Wrong size on FStruct_store");
static_assert(offsetof(FStruct_store, Price_11_BE3AF83E446D1C3BDEA63BA50CFE096C) == 0x000000, "Member 'FStruct_store::Price_11_BE3AF83E446D1C3BDEA63BA50CFE096C' has a wrong offset!");
static_assert(offsetof(FStruct_store, Name_14_B3814BBE478D1FA0AB005BB6386C1541) == 0x000004, "Member 'FStruct_store::Name_14_B3814BBE478D1FA0AB005BB6386C1541' has a wrong offset!");
static_assert(offsetof(FStruct_store, Object_18_519B13C4426D465A5A4A80A9FFFBB161) == 0x000010, "Member 'FStruct_store::Object_18_519B13C4426D465A5A4A80A9FFFBB161' has a wrong offset!");
static_assert(offsetof(FStruct_store, AsProp_21_D3F8D96740005CA84664FBAD4E0F5F48) == 0x000018, "Member 'FStruct_store::AsProp_21_D3F8D96740005CA84664FBAD4E0F5F48' has a wrong offset!");
static_assert(offsetof(FStruct_store, Category_24_257ED6AB4855F44C55FFC98ECEA1F511) == 0x000020, "Member 'FStruct_store::Category_24_257ED6AB4855F44C55FFC98ECEA1F511' has a wrong offset!");
static_assert(offsetof(FStruct_store, Subcategory_35_BC2B1FF94CA9FC340ADDC78FFA014589) == 0x000028, "Member 'FStruct_store::Subcategory_35_BC2B1FF94CA9FC340ADDC78FFA014589' has a wrong offset!");
static_assert(offsetof(FStruct_store, Size_30_C3131BE84D89E0C389F1DB9557E08D74) == 0x000040, "Member 'FStruct_store::Size_30_C3131BE84D89E0C389F1DB9557E08D74' has a wrong offset!");

}

