#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_save

#include "Basic.hpp"

#include "Struct_mVector_structs.hpp"
#include "Struct_mBool_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_mFloat_structs.hpp"
#include "Struct_mInt_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_signalDataDynamic_structs.hpp"
#include "Struct_mClass_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_save.struct_save
// 0x00C0 (0x00C0 - 0x0000)
struct FStruct_save final
{
public:
	class UClass*                                 Class_3_5267A5ED44C89294283B8CBBEC685F8A;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_8_9DFFF09E48141807687A338593998A8A;      // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FString                                 Key_44_B7A233344901C6E374869B97AEC5A257;           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FStruct_mBool>                  bools_12_1EE56AD54E30A7ED1CB618AA037E80B4;         // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mFloat>                 Floats_31_D6C466A44741391D1041468F43632D7F;        // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mInt>                   Ints_30_E691B1324599D17904E03BB5084DEBA0;          // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mString>                Strings_22_EDF921F74EB73C4C7A6A5F996A8C8A91;       // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_signalDataDynamic>      Signals_45_CE5AB8DE4026B6660BF9A28FA6690AD5;       // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mClass>                 Classes_35_758B67A44C6C3C7BC8E2DB9FE951A49D;       // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FStruct_mVector>                Vecors_41_EC45327F47AD66E2F05ABFA4594BE8C6;        // 0x00B0(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_save) == 0x000010, "Wrong alignment on FStruct_save");
static_assert(sizeof(FStruct_save) == 0x0000C0, "Wrong size on FStruct_save");
static_assert(offsetof(FStruct_save, Class_3_5267A5ED44C89294283B8CBBEC685F8A) == 0x000000, "Member 'FStruct_save::Class_3_5267A5ED44C89294283B8CBBEC685F8A' has a wrong offset!");
static_assert(offsetof(FStruct_save, Transform_8_9DFFF09E48141807687A338593998A8A) == 0x000010, "Member 'FStruct_save::Transform_8_9DFFF09E48141807687A338593998A8A' has a wrong offset!");
static_assert(offsetof(FStruct_save, Key_44_B7A233344901C6E374869B97AEC5A257) == 0x000040, "Member 'FStruct_save::Key_44_B7A233344901C6E374869B97AEC5A257' has a wrong offset!");
static_assert(offsetof(FStruct_save, bools_12_1EE56AD54E30A7ED1CB618AA037E80B4) == 0x000050, "Member 'FStruct_save::bools_12_1EE56AD54E30A7ED1CB618AA037E80B4' has a wrong offset!");
static_assert(offsetof(FStruct_save, Floats_31_D6C466A44741391D1041468F43632D7F) == 0x000060, "Member 'FStruct_save::Floats_31_D6C466A44741391D1041468F43632D7F' has a wrong offset!");
static_assert(offsetof(FStruct_save, Ints_30_E691B1324599D17904E03BB5084DEBA0) == 0x000070, "Member 'FStruct_save::Ints_30_E691B1324599D17904E03BB5084DEBA0' has a wrong offset!");
static_assert(offsetof(FStruct_save, Strings_22_EDF921F74EB73C4C7A6A5F996A8C8A91) == 0x000080, "Member 'FStruct_save::Strings_22_EDF921F74EB73C4C7A6A5F996A8C8A91' has a wrong offset!");
static_assert(offsetof(FStruct_save, Signals_45_CE5AB8DE4026B6660BF9A28FA6690AD5) == 0x000090, "Member 'FStruct_save::Signals_45_CE5AB8DE4026B6660BF9A28FA6690AD5' has a wrong offset!");
static_assert(offsetof(FStruct_save, Classes_35_758B67A44C6C3C7BC8E2DB9FE951A49D) == 0x0000A0, "Member 'FStruct_save::Classes_35_758B67A44C6C3C7BC8E2DB9FE951A49D' has a wrong offset!");
static_assert(offsetof(FStruct_save, Vecors_41_EC45327F47AD66E2F05ABFA4594BE8C6) == 0x0000B0, "Member 'FStruct_save::Vecors_41_EC45327F47AD66E2F05ABFA4594BE8C6' has a wrong offset!");

}

