#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_signal_spawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_signal_spawn.struct_signal_spawn
// 0x002C (0x002C - 0x0000)
struct FStruct_signal_spawn final
{
public:
	struct FVector                                Coordinates_3_CC71E41641D5BF71E529DC93D8E25C0C;    // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type_7_8C7F11F6455724A81B84009F819752AD;           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Strength_12_6FE4914B4A0A67004B7DA5B2263E082A;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Frequency_14_72A60B72484E32DEBBE6D085C9C71EAF;     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrequencySpread_24_1E40B9D84BAA876E04668297FA903317; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Polarity_16_E2F417354213B97BD10F8BB658425121;      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PolaritySPread_26_FBF524EA4887A234F94C708647191B5B; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectName_67_2225AECF4FE4496BC1042DA4478A04A2;    // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_signal_spawn) == 0x000004, "Wrong alignment on FStruct_signal_spawn");
static_assert(sizeof(FStruct_signal_spawn) == 0x00002C, "Wrong size on FStruct_signal_spawn");
static_assert(offsetof(FStruct_signal_spawn, Coordinates_3_CC71E41641D5BF71E529DC93D8E25C0C) == 0x000000, "Member 'FStruct_signal_spawn::Coordinates_3_CC71E41641D5BF71E529DC93D8E25C0C' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, Type_7_8C7F11F6455724A81B84009F819752AD) == 0x00000C, "Member 'FStruct_signal_spawn::Type_7_8C7F11F6455724A81B84009F819752AD' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, Strength_12_6FE4914B4A0A67004B7DA5B2263E082A) == 0x000010, "Member 'FStruct_signal_spawn::Strength_12_6FE4914B4A0A67004B7DA5B2263E082A' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, Frequency_14_72A60B72484E32DEBBE6D085C9C71EAF) == 0x000014, "Member 'FStruct_signal_spawn::Frequency_14_72A60B72484E32DEBBE6D085C9C71EAF' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, FrequencySpread_24_1E40B9D84BAA876E04668297FA903317) == 0x000018, "Member 'FStruct_signal_spawn::FrequencySpread_24_1E40B9D84BAA876E04668297FA903317' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, Polarity_16_E2F417354213B97BD10F8BB658425121) == 0x00001C, "Member 'FStruct_signal_spawn::Polarity_16_E2F417354213B97BD10F8BB658425121' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, PolaritySPread_26_FBF524EA4887A234F94C708647191B5B) == 0x000020, "Member 'FStruct_signal_spawn::PolaritySPread_26_FBF524EA4887A234F94C708647191B5B' has a wrong offset!");
static_assert(offsetof(FStruct_signal_spawn, ObjectName_67_2225AECF4FE4496BC1042DA4478A04A2) == 0x000024, "Member 'FStruct_signal_spawn::ObjectName_67_2225AECF4FE4496BC1042DA4478A04A2' has a wrong offset!");

}

