#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_picturesDim

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_picturesDim.struct_picturesDim
// 0x0018 (0x0018 - 0x0000)
struct FStruct_picturesDim final
{
public:
	class UTexture2D*                             H_6_CD6448334E8DE19F419947A061B4A32F;              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             S_8_B7C573144963D843D9AEEDBF7F93DFC7;              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             V_7_37CC2EAA4F89D9B3D3880996FA2E0881;              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_picturesDim) == 0x000008, "Wrong alignment on FStruct_picturesDim");
static_assert(sizeof(FStruct_picturesDim) == 0x000018, "Wrong size on FStruct_picturesDim");
static_assert(offsetof(FStruct_picturesDim, H_6_CD6448334E8DE19F419947A061B4A32F) == 0x000000, "Member 'FStruct_picturesDim::H_6_CD6448334E8DE19F419947A061B4A32F' has a wrong offset!");
static_assert(offsetof(FStruct_picturesDim, S_8_B7C573144963D843D9AEEDBF7F93DFC7) == 0x000008, "Member 'FStruct_picturesDim::S_8_B7C573144963D843D9AEEDBF7F93DFC7' has a wrong offset!");
static_assert(offsetof(FStruct_picturesDim, V_7_37CC2EAA4F89D9B3D3880996FA2E0881) == 0x000010, "Member 'FStruct_picturesDim::V_7_37CC2EAA4F89D9B3D3880996FA2E0881' has a wrong offset!");

}

