#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_lootWeighted

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_lootWeighted.struct_lootWeighted
// 0x0010 (0x0010 - 0x0000)
struct FStruct_lootWeighted final
{
public:
	class FName                                   Object_13_586493D44E02762D9E01F582F91826F8;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount_14_41A49A4F496B88785E7C5594901E413B;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Weight_7_1B94BE08403E22625BF7D5AD3F97CC55;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_lootWeighted) == 0x000004, "Wrong alignment on FStruct_lootWeighted");
static_assert(sizeof(FStruct_lootWeighted) == 0x000010, "Wrong size on FStruct_lootWeighted");
static_assert(offsetof(FStruct_lootWeighted, Object_13_586493D44E02762D9E01F582F91826F8) == 0x000000, "Member 'FStruct_lootWeighted::Object_13_586493D44E02762D9E01F582F91826F8' has a wrong offset!");
static_assert(offsetof(FStruct_lootWeighted, Amount_14_41A49A4F496B88785E7C5594901E413B) == 0x000008, "Member 'FStruct_lootWeighted::Amount_14_41A49A4F496B88785E7C5594901E413B' has a wrong offset!");
static_assert(offsetof(FStruct_lootWeighted, Weight_7_1B94BE08403E22625BF7D5AD3F97CC55) == 0x00000C, "Member 'FStruct_lootWeighted::Weight_7_1B94BE08403E22625BF7D5AD3F97CC55' has a wrong offset!");

}

