#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_subtitle

#include "Basic.hpp"

#include "Enum_char_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_subtitle.struct_subtitle
// 0x0028 (0x0028 - 0x0000)
struct FStruct_subtitle final
{
public:
	Enum_char                                     Character_2_C183393D473B3F53F8AA318AC077A7E8;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_5_D68BDDFE4DFC2A88B0903986FAA78FE8;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text_8_93842A6142E23EC456AF06AF63B52A9A;           // 0x0010(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_subtitle) == 0x000008, "Wrong alignment on FStruct_subtitle");
static_assert(sizeof(FStruct_subtitle) == 0x000028, "Wrong size on FStruct_subtitle");
static_assert(offsetof(FStruct_subtitle, Character_2_C183393D473B3F53F8AA318AC077A7E8) == 0x000000, "Member 'FStruct_subtitle::Character_2_C183393D473B3F53F8AA318AC077A7E8' has a wrong offset!");
static_assert(offsetof(FStruct_subtitle, Sound_5_D68BDDFE4DFC2A88B0903986FAA78FE8) == 0x000008, "Member 'FStruct_subtitle::Sound_5_D68BDDFE4DFC2A88B0903986FAA78FE8' has a wrong offset!");
static_assert(offsetof(FStruct_subtitle, Text_8_93842A6142E23EC456AF06AF63B52A9A) == 0x000010, "Member 'FStruct_subtitle::Text_8_93842A6142E23EC456AF06AF63B52A9A' has a wrong offset!");

}

