#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_shroom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct struct_shroom.struct_shroom
// 0x0058 (0x0058 - 0x0000)
struct FStruct_shroom final
{
public:
	float                                         Weight_16_0A33BC3C452BBDFD8B5959877A5B126F;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size_2_CB66BB464114AA7C91385D983EE2218E;           // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              SpawnSurface_6_7D42EC29484C1640C248B0BD45E07144;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          SpawnWallOnly_11_E1D9B6024EFCA9EF58FA68A946368386; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              UseWallSpawn_27_C783D2DC45C29BEFB68EA8A62DD85421;  // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FName                                   Prop_19_655235944B5F75060024C1BBF41E4459;          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnOnWallOnly_26_AD87C3D949131965827659BECD133CDE; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              ClusterSize_37_E9F04744473526589FA6C7A548617282;   // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClusterRadius_33_9E3AC3C54ABC558EED1D1C93B7A968E7; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EffectObject_36_B778996F47435F27DE4E9B9C63381DD5;  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_shroom) == 0x000008, "Wrong alignment on FStruct_shroom");
static_assert(sizeof(FStruct_shroom) == 0x000058, "Wrong size on FStruct_shroom");
static_assert(offsetof(FStruct_shroom, Weight_16_0A33BC3C452BBDFD8B5959877A5B126F) == 0x000000, "Member 'FStruct_shroom::Weight_16_0A33BC3C452BBDFD8B5959877A5B126F' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, Size_2_CB66BB464114AA7C91385D983EE2218E) == 0x000004, "Member 'FStruct_shroom::Size_2_CB66BB464114AA7C91385D983EE2218E' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, SpawnSurface_6_7D42EC29484C1640C248B0BD45E07144) == 0x000010, "Member 'FStruct_shroom::SpawnSurface_6_7D42EC29484C1640C248B0BD45E07144' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, SpawnWallOnly_11_E1D9B6024EFCA9EF58FA68A946368386) == 0x000020, "Member 'FStruct_shroom::SpawnWallOnly_11_E1D9B6024EFCA9EF58FA68A946368386' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, UseWallSpawn_27_C783D2DC45C29BEFB68EA8A62DD85421) == 0x000028, "Member 'FStruct_shroom::UseWallSpawn_27_C783D2DC45C29BEFB68EA8A62DD85421' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, Prop_19_655235944B5F75060024C1BBF41E4459) == 0x000038, "Member 'FStruct_shroom::Prop_19_655235944B5F75060024C1BBF41E4459' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, SpawnOnWallOnly_26_AD87C3D949131965827659BECD133CDE) == 0x000040, "Member 'FStruct_shroom::SpawnOnWallOnly_26_AD87C3D949131965827659BECD133CDE' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, ClusterSize_37_E9F04744473526589FA6C7A548617282) == 0x000044, "Member 'FStruct_shroom::ClusterSize_37_E9F04744473526589FA6C7A548617282' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, ClusterRadius_33_9E3AC3C54ABC558EED1D1C93B7A968E7) == 0x00004C, "Member 'FStruct_shroom::ClusterRadius_33_9E3AC3C54ABC558EED1D1C93B7A968E7' has a wrong offset!");
static_assert(offsetof(FStruct_shroom, EffectObject_36_B778996F47435F27DE4E9B9C63381DD5) == 0x000050, "Member 'FStruct_shroom::EffectObject_36_B778996F47435F27DE4E9B9C63381DD5' has a wrong offset!");

}

