#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_stats

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct struct_stats.struct_stats
// 0x005C (0x005C - 0x0000)
struct FStruct_stats final
{
public:
	int32                                         Food_eaten_2_973D5EE644193E65158B8E8064634AD0;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Days_total_4_B21A445D449FFAFF37B54F9F5FB9FFE5;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Object_broken_6_4526E3A34A85DC9367D9CB93D1D16C29;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Falls_8_DEDAC713420EE692AD3972A5B2F796C9;          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Signals_found_10_0DFA5A30426EDB4E3F862399E9F958F5; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Signals_processed_12_764011164B8ADB4D458508BC56AC5375; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Total_playtime_15_956306CC41B536E4B1C44EBBE3E1C740; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Items_bought_20_877F027545E2131991DD88A9AD8D57D6;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_dreams_21_5ADCDE2745B5522C08C638B2392B1A70;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         beaten_dreams_24_3D832F5F4ABC67915CC29EB84FE90108; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_walked_27_AD13F1214475206F19351498F8830654; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_driven_29_DF7486D44DB3A084B60EAE8E5FBA3BC1; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_jumps_32_EC1614C4404D1A44A5C1DC90FE898AC7;   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Servers_repaired_34_28F75AE041E24190D1A8AB94DCC07B1F; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sleep_time_37_C3396F5C463A5828D8B906A515F1CF60;    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_points_42_5882D7C84CDB852804872490B83B3C93;  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Points_spent_43_4BF053D14B7B6F7D2F323DA89706DDB2;  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Reports_48_860856E740B0C6003F623E9C4DD701F8;       // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Successful_reports_47_51D0CEA34FD185BBE5EC2AB6CE48754B; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Save_count_50_E739BC874ADE780098290D940E92D2A1;    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Toilet_uses_52_71C895C442F987D72A1963B662F19CEE;   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Steps_55_2F7814254C4ABE42E4E2289590DE837A;         // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TreasureFound_57_4DEDDE874E51B5447B6997BA83A0D6DE; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_stats) == 0x000004, "Wrong alignment on FStruct_stats");
static_assert(sizeof(FStruct_stats) == 0x00005C, "Wrong size on FStruct_stats");
static_assert(offsetof(FStruct_stats, Food_eaten_2_973D5EE644193E65158B8E8064634AD0) == 0x000000, "Member 'FStruct_stats::Food_eaten_2_973D5EE644193E65158B8E8064634AD0' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Days_total_4_B21A445D449FFAFF37B54F9F5FB9FFE5) == 0x000004, "Member 'FStruct_stats::Days_total_4_B21A445D449FFAFF37B54F9F5FB9FFE5' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Object_broken_6_4526E3A34A85DC9367D9CB93D1D16C29) == 0x000008, "Member 'FStruct_stats::Object_broken_6_4526E3A34A85DC9367D9CB93D1D16C29' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Falls_8_DEDAC713420EE692AD3972A5B2F796C9) == 0x00000C, "Member 'FStruct_stats::Falls_8_DEDAC713420EE692AD3972A5B2F796C9' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Signals_found_10_0DFA5A30426EDB4E3F862399E9F958F5) == 0x000010, "Member 'FStruct_stats::Signals_found_10_0DFA5A30426EDB4E3F862399E9F958F5' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Signals_processed_12_764011164B8ADB4D458508BC56AC5375) == 0x000014, "Member 'FStruct_stats::Signals_processed_12_764011164B8ADB4D458508BC56AC5375' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Total_playtime_15_956306CC41B536E4B1C44EBBE3E1C740) == 0x000018, "Member 'FStruct_stats::Total_playtime_15_956306CC41B536E4B1C44EBBE3E1C740' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Items_bought_20_877F027545E2131991DD88A9AD8D57D6) == 0x00001C, "Member 'FStruct_stats::Items_bought_20_877F027545E2131991DD88A9AD8D57D6' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Total_dreams_21_5ADCDE2745B5522C08C638B2392B1A70) == 0x000020, "Member 'FStruct_stats::Total_dreams_21_5ADCDE2745B5522C08C638B2392B1A70' has a wrong offset!");
static_assert(offsetof(FStruct_stats, beaten_dreams_24_3D832F5F4ABC67915CC29EB84FE90108) == 0x000024, "Member 'FStruct_stats::beaten_dreams_24_3D832F5F4ABC67915CC29EB84FE90108' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Distance_walked_27_AD13F1214475206F19351498F8830654) == 0x000028, "Member 'FStruct_stats::Distance_walked_27_AD13F1214475206F19351498F8830654' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Distance_driven_29_DF7486D44DB3A084B60EAE8E5FBA3BC1) == 0x00002C, "Member 'FStruct_stats::Distance_driven_29_DF7486D44DB3A084B60EAE8E5FBA3BC1' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Total_jumps_32_EC1614C4404D1A44A5C1DC90FE898AC7) == 0x000030, "Member 'FStruct_stats::Total_jumps_32_EC1614C4404D1A44A5C1DC90FE898AC7' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Servers_repaired_34_28F75AE041E24190D1A8AB94DCC07B1F) == 0x000034, "Member 'FStruct_stats::Servers_repaired_34_28F75AE041E24190D1A8AB94DCC07B1F' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Sleep_time_37_C3396F5C463A5828D8B906A515F1CF60) == 0x000038, "Member 'FStruct_stats::Sleep_time_37_C3396F5C463A5828D8B906A515F1CF60' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Total_points_42_5882D7C84CDB852804872490B83B3C93) == 0x00003C, "Member 'FStruct_stats::Total_points_42_5882D7C84CDB852804872490B83B3C93' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Points_spent_43_4BF053D14B7B6F7D2F323DA89706DDB2) == 0x000040, "Member 'FStruct_stats::Points_spent_43_4BF053D14B7B6F7D2F323DA89706DDB2' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Reports_48_860856E740B0C6003F623E9C4DD701F8) == 0x000044, "Member 'FStruct_stats::Reports_48_860856E740B0C6003F623E9C4DD701F8' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Successful_reports_47_51D0CEA34FD185BBE5EC2AB6CE48754B) == 0x000048, "Member 'FStruct_stats::Successful_reports_47_51D0CEA34FD185BBE5EC2AB6CE48754B' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Save_count_50_E739BC874ADE780098290D940E92D2A1) == 0x00004C, "Member 'FStruct_stats::Save_count_50_E739BC874ADE780098290D940E92D2A1' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Toilet_uses_52_71C895C442F987D72A1963B662F19CEE) == 0x000050, "Member 'FStruct_stats::Toilet_uses_52_71C895C442F987D72A1963B662F19CEE' has a wrong offset!");
static_assert(offsetof(FStruct_stats, Steps_55_2F7814254C4ABE42E4E2289590DE837A) == 0x000054, "Member 'FStruct_stats::Steps_55_2F7814254C4ABE42E4E2289590DE837A' has a wrong offset!");
static_assert(offsetof(FStruct_stats, TreasureFound_57_4DEDDE874E51B5447B6997BA83A0D6DE) == 0x000058, "Member 'FStruct_stats::TreasureFound_57_4DEDDE874E51B5447B6997BA83A0D6DE' has a wrong offset!");

}

