#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubPawn

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function subPawn.subPawn_C.ExecuteUbergraph_subPawn
// 0x0048 (0x0048 - 0x0000)
struct SubPawn_C_ExecuteUbergraph_subPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubPawn_C_ExecuteUbergraph_subPawn) == 0x000008, "Wrong alignment on SubPawn_C_ExecuteUbergraph_subPawn");
static_assert(sizeof(SubPawn_C_ExecuteUbergraph_subPawn) == 0x000048, "Wrong size on SubPawn_C_ExecuteUbergraph_subPawn");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, EntryPoint) == 0x000000, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, K2Node_CustomEvent_MovementResult_1) == 0x000004, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, K2Node_CustomEvent_MovementResult) == 0x000018, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, Temp_byte_Variable) == 0x00002C, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000038, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubPawn_C_ExecuteUbergraph_subPawn, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'SubPawn_C_ExecuteUbergraph_subPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function subPawn.subPawn_C.OnSuccess_5855052741EFBC3D0EA637A2B93F62CD
// 0x0001 (0x0001 - 0x0000)
struct SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD) == 0x000001, "Wrong alignment on SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD");
static_assert(sizeof(SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD) == 0x000001, "Wrong size on SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD");
static_assert(offsetof(SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD, MovementResult) == 0x000000, "Member 'SubPawn_C_OnSuccess_5855052741EFBC3D0EA637A2B93F62CD::MovementResult' has a wrong offset!");

// Function subPawn.subPawn_C.OnFail_5855052741EFBC3D0EA637A2B93F62CD
// 0x0001 (0x0001 - 0x0000)
struct SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD) == 0x000001, "Wrong alignment on SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD");
static_assert(sizeof(SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD) == 0x000001, "Wrong size on SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD");
static_assert(offsetof(SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD, MovementResult) == 0x000000, "Member 'SubPawn_C_OnFail_5855052741EFBC3D0EA637A2B93F62CD::MovementResult' has a wrong offset!");

}

