#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperEgger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function superEgger.superEgger_C.ExecuteUbergraph_superEgger
// 0x00D0 (0x00D0 - 0x0000)
struct SuperEgger_C_ExecuteUbergraph_superEgger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEg_C*                                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuperEgger_C_ExecuteUbergraph_superEgger) == 0x000010, "Wrong alignment on SuperEgger_C_ExecuteUbergraph_superEgger");
static_assert(sizeof(SuperEgger_C_ExecuteUbergraph_superEgger) == 0x0000D0, "Wrong size on SuperEgger_C_ExecuteUbergraph_superEgger");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, EntryPoint) == 0x000000, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::EntryPoint' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, Temp_int_Variable) == 0x000004, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, Temp_int_Variable_1) == 0x000010, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000014, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000028, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000030, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_MakeVector_ReturnValue_1) == 0x000034, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000040, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00004C, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Array_Get_Item) == 0x000068, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000080, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SuperEgger_C_ExecuteUbergraph_superEgger, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C8, "Member 'SuperEgger_C_ExecuteUbergraph_superEgger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

