#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SusDirtHole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass susDirtHole.susDirtHole_C
// 0x0018 (0x0238 - 0x0220)
class ASusDirtHole_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Hole;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_susDirtHole(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"susDirtHole_C">();
	}
	static class ASusDirtHole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASusDirtHole_C>();
	}
};
static_assert(alignof(ASusDirtHole_C) == 0x000008, "Wrong alignment on ASusDirtHole_C");
static_assert(sizeof(ASusDirtHole_C) == 0x000238, "Wrong size on ASusDirtHole_C");
static_assert(offsetof(ASusDirtHole_C, UberGraphFrame) == 0x000220, "Member 'ASusDirtHole_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASusDirtHole_C, Hole) == 0x000228, "Member 'ASusDirtHole_C::Hole' has a wrong offset!");
static_assert(offsetof(ASusDirtHole_C, DefaultSceneRoot) == 0x000230, "Member 'ASusDirtHole_C::DefaultSceneRoot' has a wrong offset!");

}

