#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SusDirtHole

#include "Basic.hpp"


namespace SDK::Params
{

// Function susDirtHole.susDirtHole_C.ExecuteUbergraph_susDirtHole
// 0x0018 (0x0018 - 0x0000)
struct SusDirtHole_C_ExecuteUbergraph_susDirtHole final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SusDirtHole_C_ExecuteUbergraph_susDirtHole) == 0x000008, "Wrong alignment on SusDirtHole_C_ExecuteUbergraph_susDirtHole");
static_assert(sizeof(SusDirtHole_C_ExecuteUbergraph_susDirtHole) == 0x000018, "Wrong size on SusDirtHole_C_ExecuteUbergraph_susDirtHole");
static_assert(offsetof(SusDirtHole_C_ExecuteUbergraph_susDirtHole, EntryPoint) == 0x000000, "Member 'SusDirtHole_C_ExecuteUbergraph_susDirtHole::EntryPoint' has a wrong offset!");
static_assert(offsetof(SusDirtHole_C_ExecuteUbergraph_susDirtHole, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'SusDirtHole_C_ExecuteUbergraph_susDirtHole::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SusDirtHole_C_ExecuteUbergraph_susDirtHole, CallFunc_GetDistanceTo_ReturnValue) == 0x000010, "Member 'SusDirtHole_C_ExecuteUbergraph_susDirtHole::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SusDirtHole_C_ExecuteUbergraph_susDirtHole, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000014, "Member 'SusDirtHole_C_ExecuteUbergraph_susDirtHole::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(SusDirtHole_C_ExecuteUbergraph_susDirtHole, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000015, "Member 'SusDirtHole_C_ExecuteUbergraph_susDirtHole::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SusDirtHole_C_ExecuteUbergraph_susDirtHole, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'SusDirtHole_C_ExecuteUbergraph_susDirtHole::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

