#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TableclockArrows_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function tableclockArrows_Skeleton_AnimBlueprint.tableclockArrows_Skeleton_AnimBlueprint_C.ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint
// 0x002C (0x002C - 0x0000)
struct TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint");
static_assert(sizeof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint) == 0x00002C, "Wrong size on TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000018, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00001C, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue_1) == 0x000020, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_ExecuteUbergraph_tableclockArrows_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

// Function tableclockArrows_Skeleton_AnimBlueprint.tableclockArrows_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000020, "Wrong size on TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph, InPose) == 0x000000, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000010, "Member 'TableclockArrows_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

