#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tardis

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function tardis.tardis_C.ExecuteUbergraph_tardis
// 0x0700 (0x0700 - 0x0000)
struct Tardis_C_ExecuteUbergraph_tardis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D72[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_damage_4;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2D73[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D74[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D75[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x010C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D76[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x01C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_2;                             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D77[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x02A8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D78[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x02D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D79[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D7A[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x03A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0438(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D7B[0x3];                                     // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x04C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7C[0x4];                                     // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x04E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D7D[0x7];                                     // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0580(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x060D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x060E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D7E[0x1];                                     // 0x060F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeAlive_ReturnValue;                 // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0614(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7F[0x4];                                     // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4; // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0658(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0668(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D80[0x3];                                     // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0678(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tardis_C_ExecuteUbergraph_tardis) == 0x000008, "Wrong alignment on Tardis_C_ExecuteUbergraph_tardis");
static_assert(sizeof(Tardis_C_ExecuteUbergraph_tardis) == 0x000700, "Wrong size on Tardis_C_ExecuteUbergraph_tardis");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, EntryPoint) == 0x000000, "Member 'Tardis_C_ExecuteUbergraph_tardis::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Abs_ReturnValue) == 0x000018, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000020, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2) == 0x000024, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3) == 0x000028, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_damage_4) == 0x000030, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_7) == 0x000034, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_actor_1) == 0x0000C0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_impact_1) == 0x0000C8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_water_3) == 0x0000D8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_water_2) == 0x0000E0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_water_1) == 0x0000E8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_water) == 0x0000F0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_activate) == 0x0000F8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_static) == 0x0000F9, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_frozen) == 0x0000FA, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_active) == 0x0000FB, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_actor) == 0x000100, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_damage_3) == 0x000108, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_6) == 0x00010C, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_impact) == 0x000194, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_skipSetting) == 0x0001A0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_key_1) == 0x0001A8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_14) == 0x0001B8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_5) == 0x0001C0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_damage_2) == 0x000248, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_fuel) == 0x00024C, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_13) == 0x000250, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_12) == 0x000258, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_damage_1) == 0x000260, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_location_1) == 0x000264, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_11) == 0x000270, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_10) == 0x000278, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_9) == 0x000280, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_wheelDelta) == 0x000288, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_8) == 0x000290, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_mouse) == 0x000298, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_7) == 0x0002A0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_key) == 0x0002A8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_pressed) == 0x0002C0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_temperature_1) == 0x0002C4, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_temperature) == 0x0002C8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_speed) == 0x0002CC, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_6) == 0x0002D0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_4) == 0x0002D8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_name_1) == 0x000360, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_volume) == 0x000370, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_5) == 0x000378, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_location) == 0x000380, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_damage) == 0x00038C, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_clean) == 0x000390, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_4) == 0x000398, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_3) == 0x0003A0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hook) == 0x000428, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_3) == 0x000430, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_2) == 0x000438, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_kick) == 0x0004C0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_name) == 0x0004C4, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_2) == 0x0004D0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player_1) == 0x0004D8, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit_1) == 0x0004E0, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_CustomEvent_Condition) == 0x000568, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_CustomEvent_Condition' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000570, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_player) == 0x000578, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_hit) == 0x000580, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_index) == 0x000608, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_Event_action) == 0x00060C, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, Temp_bool_Has_Been_Initd_Variable) == 0x00060D, "Member 'Tardis_C_ExecuteUbergraph_tardis::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, Temp_bool_IsClosed_Variable) == 0x00060E, "Member 'Tardis_C_ExecuteUbergraph_tardis::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_GetTimeAlive_ReturnValue) == 0x000610, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_GetTimeAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000614, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000620, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000628, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_DegCos_ReturnValue) == 0x000630, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Add_FloatFloat_ReturnValue) == 0x000634, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000638, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00063C, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000640, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000644, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4) == 0x000648, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Lerp_ReturnValue) == 0x00064C, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Lerp_ReturnValue_1) == 0x000650, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, CallFunc_Lerp_ReturnValue_2) == 0x000654, "Member 'Tardis_C_ExecuteUbergraph_tardis::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000658, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_ComponentBoundEvent_OtherActor) == 0x000660, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_ComponentBoundEvent_OtherComp) == 0x000668, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000670, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_ComponentBoundEvent_bFromSweep) == 0x000674, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Tardis_C_ExecuteUbergraph_tardis, K2Node_ComponentBoundEvent_SweepResult) == 0x000678, "Member 'Tardis_C_ExecuteUbergraph_tardis::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");

// Function tardis.tardis_C.BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D81[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Tardis_C_BndEvt__tardis_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function tardis.tardis_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Tardis_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Tardis_C_ActionOptionIndex");
static_assert(sizeof(Tardis_C_ActionOptionIndex) == 0x000098, "Wrong size on Tardis_C_ActionOptionIndex");
static_assert(offsetof(Tardis_C_ActionOptionIndex, Player) == 0x000000, "Member 'Tardis_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Tardis_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Tardis_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Tardis_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Tardis_C_ActionOptionIndex, Action) == 0x000094, "Member 'Tardis_C_ActionOptionIndex::Action' has a wrong offset!");

// Function tardis.tardis_C.appear
// 0x0001 (0x0001 - 0x0000)
struct Tardis_C_Appear final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tardis_C_Appear) == 0x000001, "Wrong alignment on Tardis_C_Appear");
static_assert(sizeof(Tardis_C_Appear) == 0x000001, "Wrong size on Tardis_C_Appear");
static_assert(offsetof(Tardis_C_Appear, Condition) == 0x000000, "Member 'Tardis_C_Appear::Condition' has a wrong offset!");

// Function tardis.tardis_C.damageByPlayer
// 0x0090 (0x0090 - 0x0000)
struct Tardis_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tardis_C_DamageByPlayer) == 0x000008, "Wrong alignment on Tardis_C_DamageByPlayer");
static_assert(sizeof(Tardis_C_DamageByPlayer) == 0x000090, "Wrong size on Tardis_C_DamageByPlayer");
static_assert(offsetof(Tardis_C_DamageByPlayer, Player) == 0x000000, "Member 'Tardis_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_DamageByPlayer, Hit) == 0x000008, "Member 'Tardis_C_DamageByPlayer::Hit' has a wrong offset!");

// Function tardis.tardis_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Tardis_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_Thrown) == 0x000008, "Wrong alignment on Tardis_C_Thrown");
static_assert(sizeof(Tardis_C_Thrown) == 0x000008, "Wrong size on Tardis_C_Thrown");
static_assert(offsetof(Tardis_C_Thrown, Player) == 0x000000, "Member 'Tardis_C_Thrown::Player' has a wrong offset!");

// Function tardis.tardis_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Tardis_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_SendName) == 0x000004, "Wrong alignment on Tardis_C_SendName");
static_assert(sizeof(Tardis_C_SendName) == 0x000008, "Wrong size on Tardis_C_SendName");
static_assert(offsetof(Tardis_C_SendName, Param_Name) == 0x000000, "Member 'Tardis_C_SendName::Param_Name' has a wrong offset!");

// Function tardis.tardis_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct Tardis_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tardis_C_Kicked) == 0x000001, "Wrong alignment on Tardis_C_Kicked");
static_assert(sizeof(Tardis_C_Kicked) == 0x000001, "Wrong size on Tardis_C_Kicked");
static_assert(offsetof(Tardis_C_Kicked, Kick) == 0x000000, "Member 'Tardis_C_Kicked::Kick' has a wrong offset!");

// Function tardis.tardis_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Tardis_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tardis_C_Player_use) == 0x000008, "Wrong alignment on Tardis_C_Player_use");
static_assert(sizeof(Tardis_C_Player_use) == 0x000090, "Wrong size on Tardis_C_Player_use");
static_assert(offsetof(Tardis_C_Player_use, Player) == 0x000000, "Member 'Tardis_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_Player_use, Hit) == 0x000008, "Member 'Tardis_C_Player_use::Hit' has a wrong offset!");

// Function tardis.tardis_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct Tardis_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_Hooked) == 0x000008, "Wrong alignment on Tardis_C_Hooked");
static_assert(sizeof(Tardis_C_Hooked) == 0x000008, "Wrong size on Tardis_C_Hooked");
static_assert(offsetof(Tardis_C_Hooked, Hook) == 0x000000, "Member 'Tardis_C_Hooked::Hook' has a wrong offset!");

// Function tardis.tardis_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct Tardis_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Tardis_C_PlayerUsedOn) == 0x000008, "Wrong alignment on Tardis_C_PlayerUsedOn");
static_assert(sizeof(Tardis_C_PlayerUsedOn) == 0x000090, "Wrong size on Tardis_C_PlayerUsedOn");
static_assert(offsetof(Tardis_C_PlayerUsedOn, Player) == 0x000000, "Member 'Tardis_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_PlayerUsedOn, Hit) == 0x000008, "Member 'Tardis_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function tardis.tardis_C.slice
// 0x0001 (0x0001 - 0x0000)
struct Tardis_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tardis_C_Slice) == 0x000001, "Wrong alignment on Tardis_C_Slice");
static_assert(sizeof(Tardis_C_Slice) == 0x000001, "Wrong size on Tardis_C_Slice");
static_assert(offsetof(Tardis_C_Slice, Clean) == 0x000000, "Member 'Tardis_C_Slice::Clean' has a wrong offset!");

// Function tardis.tardis_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct Tardis_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_ReachedByExplosion) == 0x000004, "Wrong alignment on Tardis_C_ReachedByExplosion");
static_assert(sizeof(Tardis_C_ReachedByExplosion) == 0x000010, "Wrong size on Tardis_C_ReachedByExplosion");
static_assert(offsetof(Tardis_C_ReachedByExplosion, Location) == 0x000000, "Member 'Tardis_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(Tardis_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'Tardis_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function tardis.tardis_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct Tardis_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_PlayerLookAway) == 0x000008, "Wrong alignment on Tardis_C_PlayerLookAway");
static_assert(sizeof(Tardis_C_PlayerLookAway) == 0x000008, "Wrong size on Tardis_C_PlayerLookAway");
static_assert(offsetof(Tardis_C_PlayerLookAway, Player) == 0x000000, "Member 'Tardis_C_PlayerLookAway::Player' has a wrong offset!");

// Function tardis.tardis_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct Tardis_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_Stepped) == 0x000004, "Wrong alignment on Tardis_C_Stepped");
static_assert(sizeof(Tardis_C_Stepped) == 0x000004, "Wrong size on Tardis_C_Stepped");
static_assert(offsetof(Tardis_C_Stepped, Volume) == 0x000000, "Member 'Tardis_C_Stepped::Volume' has a wrong offset!");

// Function tardis.tardis_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct Tardis_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_ActionName) == 0x000008, "Wrong alignment on Tardis_C_ActionName");
static_assert(sizeof(Tardis_C_ActionName) == 0x0000A0, "Wrong size on Tardis_C_ActionName");
static_assert(offsetof(Tardis_C_ActionName, Player) == 0x000000, "Member 'Tardis_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_ActionName, Hit) == 0x000008, "Member 'Tardis_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(Tardis_C_ActionName, Param_Name) == 0x000090, "Member 'Tardis_C_ActionName::Param_Name' has a wrong offset!");

// Function tardis.tardis_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct Tardis_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_AccumulateTemperature) == 0x000004, "Wrong alignment on Tardis_C_AccumulateTemperature");
static_assert(sizeof(Tardis_C_AccumulateTemperature) == 0x000008, "Wrong size on Tardis_C_AccumulateTemperature");
static_assert(offsetof(Tardis_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'Tardis_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(Tardis_C_AccumulateTemperature, Speed) == 0x000004, "Member 'Tardis_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function tardis.tardis_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct Tardis_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_AddTemperature) == 0x000004, "Wrong alignment on Tardis_C_AddTemperature");
static_assert(sizeof(Tardis_C_AddTemperature) == 0x000004, "Wrong size on Tardis_C_AddTemperature");
static_assert(offsetof(Tardis_C_AddTemperature, Temperature) == 0x000000, "Member 'Tardis_C_AddTemperature::Temperature' has a wrong offset!");

// Function tardis.tardis_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct Tardis_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Tardis_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on Tardis_C_PlayerHandAnyKey");
static_assert(sizeof(Tardis_C_PlayerHandAnyKey) == 0x000028, "Wrong size on Tardis_C_PlayerHandAnyKey");
static_assert(offsetof(Tardis_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'Tardis_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_PlayerHandAnyKey, Key) == 0x000008, "Member 'Tardis_C_PlayerHandAnyKey::Key' has a wrong offset!");
static_assert(offsetof(Tardis_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'Tardis_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function tardis.tardis_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct Tardis_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tardis_C_PlayerHandMouse) == 0x000008, "Wrong alignment on Tardis_C_PlayerHandMouse");
static_assert(sizeof(Tardis_C_PlayerHandMouse) == 0x000010, "Wrong size on Tardis_C_PlayerHandMouse");
static_assert(offsetof(Tardis_C_PlayerHandMouse, Player) == 0x000000, "Member 'Tardis_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(Tardis_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'Tardis_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function tardis.tardis_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct Tardis_C_PlayerHandMouseWheel final
{
public:
