#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TelescopeObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function telescopeObject.telescopeObject_C.ExecuteUbergraph_telescopeObject
// 0x0270 (0x0270 - 0x0000)
struct TelescopeObject_C_ExecuteUbergraph_telescopeObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_1;     // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_2;     // 0x0154(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult_3;     // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TelescopeObject_C_ExecuteUbergraph_telescopeObject) == 0x000004, "Wrong alignment on TelescopeObject_C_ExecuteUbergraph_telescopeObject");
static_assert(sizeof(TelescopeObject_C_ExecuteUbergraph_telescopeObject) == 0x000270, "Wrong size on TelescopeObject_C_ExecuteUbergraph_telescopeObject");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, EntryPoint) == 0x000000, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000018, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000020, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_MakeRotator_ReturnValue_1) == 0x000024, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000030, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000034, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_MakeRotator_ReturnValue_2) == 0x0000BC, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_K2_AddLocalRotation_SweepHitResult_1) == 0x0000C8, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_K2_AddLocalRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000150, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_K2_AddLocalRotation_SweepHitResult_2) == 0x000154, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_K2_AddLocalRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_MakeRotator_ReturnValue_3) == 0x0001DC, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_ExecuteUbergraph_telescopeObject, CallFunc_K2_AddLocalRotation_SweepHitResult_3) == 0x0001E8, "Member 'TelescopeObject_C_ExecuteUbergraph_telescopeObject::CallFunc_K2_AddLocalRotation_SweepHitResult_3' has a wrong offset!");

// Function telescopeObject.telescopeObject_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TelescopeObject_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TelescopeObject_C_ReceiveTick) == 0x000004, "Wrong alignment on TelescopeObject_C_ReceiveTick");
static_assert(sizeof(TelescopeObject_C_ReceiveTick) == 0x000004, "Wrong size on TelescopeObject_C_ReceiveTick");
static_assert(offsetof(TelescopeObject_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TelescopeObject_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function telescopeObject.telescopeObject_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct TelescopeObject_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TelescopeObject_C_UserConstructionScript) == 0x000004, "Wrong alignment on TelescopeObject_C_UserConstructionScript");
static_assert(sizeof(TelescopeObject_C_UserConstructionScript) == 0x000094, "Wrong size on TelescopeObject_C_UserConstructionScript");
static_assert(offsetof(TelescopeObject_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'TelescopeObject_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TelescopeObject_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00000C, "Member 'TelescopeObject_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

