#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TelescopeMars

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TelescopeObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass telescopeMars.telescopeMars_C
// 0x0060 (0x02B8 - 0x0258)
class ATelescopeMars_C final : public ATelescopeObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_TelescopeMars_C;                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 MarsStruct_test1;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_lights_1;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_lights_2;                                   // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_deco;                                       // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat_body;                                       // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         buildStatus_1;                                     // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         buildStatus_2;                                     // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         buildStatus_3;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         A;                                                 // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         B;                                                 // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarsStruct_build_Skeleton_AnimBlueprint_C* Anim;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot_0;                                             // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Looking;                                           // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Fast;                                              // 0x02AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Reset;                                             // 0x02AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF[0x1];                                      // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ATelescope_C*                           Telescope;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_telescopeMars(int32 EntryPoint);
	void broken();
	void broken_fire();
	void LookAtCam(bool Play);
	void Thrown(class AMainPlayer_C* Player);
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Hit, float Damage);
	void UpdateStrAgl();
	void DriveDetached();
	void PlayerUnequip(class AMainPlayer_C* Player);
	void PlayerHold(class AMainPlayer_C* Player);
	void LaunchBuild(bool Param_Fast);
	void PlayerR(class AMainPlayer_C* Player);
	void ReceiveTick(float DeltaSeconds);
	void SendName(class FName Param_Name);
	void ReceiveBeginPlay();
	void Player_use(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void Kicked(bool Kick);
	void UpdMats();
	void CreateDynmats();
	void CanBePutInContainer(bool* Return);
	void AsProp(class AProp_C** Return);
	void CanPickup(bool* Return);
	void NoRespawn(bool Param_NoRespawn, bool* Return);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void IsButtonUsed(bool* Failed);
	void LandedOn(class AMainPlayer_C* Player, bool* IgnoreFallDamage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"telescopeMars_C">();
	}
	static class ATelescopeMars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATelescopeMars_C>();
	}
};
static_assert(alignof(ATelescopeMars_C) == 0x000008, "Wrong alignment on ATelescopeMars_C");
static_assert(sizeof(ATelescopeMars_C) == 0x0002B8, "Wrong size on ATelescopeMars_C");
static_assert(offsetof(ATelescopeMars_C, UberGraphFrame_TelescopeMars_C) == 0x000258, "Member 'ATelescopeMars_C::UberGraphFrame_TelescopeMars_C' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, MarsStruct_test1) == 0x000260, "Member 'ATelescopeMars_C::MarsStruct_test1' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Dynmat_lights_1) == 0x000268, "Member 'ATelescopeMars_C::Dynmat_lights_1' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Dynmat_lights_2) == 0x000270, "Member 'ATelescopeMars_C::Dynmat_lights_2' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Dynmat_deco) == 0x000278, "Member 'ATelescopeMars_C::Dynmat_deco' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Dynmat_body) == 0x000280, "Member 'ATelescopeMars_C::Dynmat_body' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, buildStatus_1) == 0x000288, "Member 'ATelescopeMars_C::buildStatus_1' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, buildStatus_2) == 0x00028C, "Member 'ATelescopeMars_C::buildStatus_2' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, buildStatus_3) == 0x000290, "Member 'ATelescopeMars_C::buildStatus_3' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, A) == 0x000294, "Member 'ATelescopeMars_C::A' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, B) == 0x000298, "Member 'ATelescopeMars_C::B' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Anim) == 0x0002A0, "Member 'ATelescopeMars_C::Anim' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Rot_0) == 0x0002A8, "Member 'ATelescopeMars_C::Rot_0' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Looking) == 0x0002AC, "Member 'ATelescopeMars_C::Looking' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Fast) == 0x0002AD, "Member 'ATelescopeMars_C::Fast' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Reset) == 0x0002AE, "Member 'ATelescopeMars_C::Reset' has a wrong offset!");
static_assert(offsetof(ATelescopeMars_C, Telescope) == 0x0002B0, "Member 'ATelescopeMars_C::Telescope' has a wrong offset!");

}

