#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeleBooth

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass teleBooth.teleBooth_C
// 0x0068 (0x0288 - 0x0220)
class ATeleBooth_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight1;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CheckRender;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Telebooth;                                         // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UComp_radarPoint_C*                     RadarPoint;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPnormal_C*                             Pnormal;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UPhysicalMaterial*>              Mats;                                              // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Box;                                               // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tp(bool* Return, struct FVector* Location, float* Angle);
	void ReceiveBeginPlay();
	void Timer();
	void ExecuteUbergraph_teleBooth(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"teleBooth_C">();
	}
	static class ATeleBooth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATeleBooth_C>();
	}
};
static_assert(alignof(ATeleBooth_C) == 0x000008, "Wrong alignment on ATeleBooth_C");
static_assert(sizeof(ATeleBooth_C) == 0x000288, "Wrong size on ATeleBooth_C");
static_assert(offsetof(ATeleBooth_C, UberGraphFrame) == 0x000220, "Member 'ATeleBooth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, RectLight1) == 0x000228, "Member 'ATeleBooth_C::RectLight1' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, RectLight) == 0x000230, "Member 'ATeleBooth_C::RectLight' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, CheckRender) == 0x000238, "Member 'ATeleBooth_C::CheckRender' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, Billboard) == 0x000240, "Member 'ATeleBooth_C::Billboard' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, Telebooth) == 0x000248, "Member 'ATeleBooth_C::Telebooth' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, RadarPoint) == 0x000250, "Member 'ATeleBooth_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, Pnormal) == 0x000258, "Member 'ATeleBooth_C::Pnormal' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, DefaultSceneRoot) == 0x000260, "Member 'ATeleBooth_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, Mats) == 0x000268, "Member 'ATeleBooth_C::Mats' has a wrong offset!");
static_assert(offsetof(ATeleBooth_C, Box) == 0x000278, "Member 'ATeleBooth_C::Box' has a wrong offset!");

}

