#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TelescopeObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass telescopeObject.telescopeObject_C
// 0x0038 (0x0258 - 0x0220)
class ATelescopeObject_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Top1;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Top;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Base;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Orbit;                                             // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rot;                                               // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_telescopeObject(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"telescopeObject_C">();
	}
	static class ATelescopeObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATelescopeObject_C>();
	}
};
static_assert(alignof(ATelescopeObject_C) == 0x000008, "Wrong alignment on ATelescopeObject_C");
static_assert(sizeof(ATelescopeObject_C) == 0x000258, "Wrong size on ATelescopeObject_C");
static_assert(offsetof(ATelescopeObject_C, UberGraphFrame) == 0x000220, "Member 'ATelescopeObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Top1) == 0x000228, "Member 'ATelescopeObject_C::Top1' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Top) == 0x000230, "Member 'ATelescopeObject_C::Top' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Base) == 0x000238, "Member 'ATelescopeObject_C::Base' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Arrow) == 0x000240, "Member 'ATelescopeObject_C::Arrow' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Distance) == 0x000248, "Member 'ATelescopeObject_C::Distance' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Orbit) == 0x00024C, "Member 'ATelescopeObject_C::Orbit' has a wrong offset!");
static_assert(offsetof(ATelescopeObject_C, Rot) == 0x000250, "Member 'ATelescopeObject_C::Rot' has a wrong offset!");

}

