#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Telescope

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function telescope.telescope_C.ExecuteUbergraph_telescope
// 0x0890 (0x0890 - 0x0000)
struct Telescope_C_ExecuteUbergraph_telescope final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25FE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25FF[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x00B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2600[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0168(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2601[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0250(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2602[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0280(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2603[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean;                                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2604[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0348(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x03E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2605[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x046C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2606[0x4];                                     // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0488(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_telescope_C*                       CallFunc_Create_ReturnValue;                       // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2607[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2608[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATelescopeMars_C*                       K2Node_DynamicCast_AsTelescope_Mars;               // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2609[0x3];                                     // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x056C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260A[0x4];                                     // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_5;       // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_2;        // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_3;        // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_4;        // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_16;       // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_5;        // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260B[0x4];                                     // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x06A0(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_6;       // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_2;                // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_7;       // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x06F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0780(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor;                                // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x0810(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260C[0x4];                                     // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_260D[0x3];                                     // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260E[0x4];                                     // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0858(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0868(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_260F[0x4];                                     // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_DynamicCast_AsChild_Actor_Component;        // 0x0878(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0881(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2610[0x2];                                     // 0x0882(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0884(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Telescope_C_ExecuteUbergraph_telescope) == 0x000008, "Wrong alignment on Telescope_C_ExecuteUbergraph_telescope");
static_assert(sizeof(Telescope_C_ExecuteUbergraph_telescope) == 0x000890, "Wrong size on Telescope_C_ExecuteUbergraph_telescope");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, EntryPoint) == 0x000000, "Member 'Telescope_C_ExecuteUbergraph_telescope::EntryPoint' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player) == 0x000008, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit) == 0x000010, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_index) == 0x000098, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_action) == 0x00009C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_activate) == 0x00009D, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_static) == 0x00009E, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_frozen) == 0x00009F, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_active) == 0x0000A0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_actor_1) == 0x0000A8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_4) == 0x0000B0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_7) == 0x0000B4, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_impact_1) == 0x00013C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_skipSetting) == 0x000148, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_key_1) == 0x000150, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_14) == 0x000160, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_6) == 0x000168, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_3) == 0x0001F0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_fuel) == 0x0001F4, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_13) == 0x0001F8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_12) == 0x000200, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_2) == 0x000208, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_location_1) == 0x00020C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_11) == 0x000218, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_10) == 0x000220, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_9) == 0x000228, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_wheelDelta) == 0x000230, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_8) == 0x000238, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_mouse) == 0x000240, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_7) == 0x000248, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_key) == 0x000250, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_pressed) == 0x000268, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_temperature_1) == 0x00026C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_temperature) == 0x000270, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_speed) == 0x000274, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_6) == 0x000278, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_5) == 0x000280, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_name_1) == 0x000308, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_volume) == 0x000318, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_5) == 0x000320, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_location) == 0x000328, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_1) == 0x000334, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_clean) == 0x000338, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_4) == 0x000340, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_4) == 0x000348, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hook) == 0x0003D0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_3) == 0x0003D8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_3) == 0x0003E0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_kick) == 0x000468, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_name) == 0x00046C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_2) == 0x000478, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_1) == 0x000480, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_2) == 0x000488, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000510, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Create_ReturnValue) == 0x000518, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_SetGamePaused_ReturnValue) == 0x000520, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water) == 0x000528, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetPlayerController_ReturnValue) == 0x000530, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water_1) == 0x000538, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_RandomFloat_ReturnValue) == 0x000540, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_DynamicCast_AsTelescope_Mars) == 0x000548, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_DynamicCast_AsTelescope_Mars' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_DynamicCast_bSuccess) == 0x000550, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_DeltaSeconds) == 0x000554, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000558, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00055C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_MakeRotator_ReturnValue) == 0x000560, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00056C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0005F4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_DegSin_ReturnValue) == 0x0005F8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0005FC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue) == 0x000600, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000604, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water_2) == 0x000608, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000610, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water_3) == 0x000618, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FClamp_ReturnValue) == 0x000620, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000624, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FClamp_ReturnValue_1) == 0x000628, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00062C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000630, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000634, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000638, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x00063C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000640, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x000644, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000648, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_5) == 0x00064C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000650, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakVector_X) == 0x000654, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakVector_Y) == 0x000658, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakVector_Z) == 0x00065C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x000660, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue_1) == 0x000664, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000668, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x00066C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x000670, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_12) == 0x000674, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_13) == 0x000678, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x00067C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_2) == 0x000680, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_14) == 0x000684, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_15) == 0x000688, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_3) == 0x00068C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_4) == 0x000690, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_16) == 0x000694, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_5) == 0x000698, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_MakeArray_Array) == 0x0006A0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_RandomFloat_ReturnValue_1) == 0x0006B0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Array_Length_ReturnValue) == 0x0006B4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Ease_ReturnValue) == 0x0006B8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue_2) == 0x0006BC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_6) == 0x0006C0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakRotator_Roll) == 0x0006C4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakRotator_Pitch) == 0x0006C8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakRotator_Yaw) == 0x0006CC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_RandomFloat_ReturnValue_2) == 0x0006D0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_RandomFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FInterpTo_ReturnValue) == 0x0006D4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Ease_ReturnValue_1) == 0x0006D8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_7) == 0x0006DC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue_3) == 0x0006E0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FInterpTo_ReturnValue_1) == 0x0006E4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_MakeRotator_ReturnValue_1) == 0x0006E8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0006F4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage) == 0x00077C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_1) == 0x000780, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_actor) == 0x000808, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_impact) == 0x000810, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000820, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, Temp_int_Array_Index_Variable) == 0x000828, "Member 'Telescope_C_ExecuteUbergraph_telescope::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, Temp_int_Loop_Counter_Variable) == 0x00082C, "Member 'Telescope_C_ExecuteUbergraph_telescope::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Less_IntInt_ReturnValue) == 0x000830, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Add_IntInt_ReturnValue) == 0x000834, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, Temp_int_Loop_Counter_Variable_1) == 0x000838, "Member 'Telescope_C_ExecuteUbergraph_telescope::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Add_IntInt_ReturnValue_1) == 0x00083C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, Temp_int_Array_Index_Variable_1) == 0x000840, "Member 'Telescope_C_ExecuteUbergraph_telescope::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Array_Get_Item) == 0x000848, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000850, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetChildrenComponents_Children) == 0x000858, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Array_Get_Item_1) == 0x000868, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Array_Length_ReturnValue_1) == 0x000870, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_DynamicCast_AsChild_Actor_Component) == 0x000878, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_DynamicCast_AsChild_Actor_Component' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_DynamicCast_bSuccess_1) == 0x000880, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
