#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Telescope

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function telescope.telescope_C.ExecuteUbergraph_telescope
// 0x0950 (0x0950 - 0x0000)
struct Telescope_C_ExecuteUbergraph_telescope final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_6;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_7;                                // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_18;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_6;                                // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_5;                             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x01F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_17;                            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_16;                            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_15;                            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_14;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_13;                            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x02D8(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0308(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name_1;                               // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x03D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0480(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x050C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0528(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_1;                             // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_telescope_C*                       CallFunc_Create_ReturnValue;                       // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATelescopeMars_C*                       K2Node_DynamicCast_AsTelescope_Mars;               // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x062C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_5;       // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_2;        // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_3;        // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_4;        // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_16;       // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_5;        // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0760(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_6;       // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_2;                // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_7;       // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x07B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage;                               // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0840(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor;                                // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x08D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DC[0x4];                                      // 0x08DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x3];                                      // 0x08F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_904[0x4];                                      // 0x0904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0918(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0928(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_934[0x4];                                      // 0x0934(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_DynamicCast_AsChild_Actor_Component;        // 0x0938(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0941(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942[0x2];                                      // 0x0942(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Telescope_C_ExecuteUbergraph_telescope) == 0x000008, "Wrong alignment on Telescope_C_ExecuteUbergraph_telescope");
static_assert(sizeof(Telescope_C_ExecuteUbergraph_telescope) == 0x000950, "Wrong size on Telescope_C_ExecuteUbergraph_telescope");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, EntryPoint) == 0x000000, "Member 'Telescope_C_ExecuteUbergraph_telescope::EntryPoint' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player) == 0x000008, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit) == 0x000010, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_action) == 0x000098, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_activate) == 0x000099, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_static) == 0x00009A, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_frozen) == 0x00009B, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_active) == 0x00009C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_actor_1) == 0x0000A0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_6) == 0x0000A8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_7) == 0x0000AC, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_impact_1) == 0x000134, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_skipSetting) == 0x000140, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_key_1) == 0x000148, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_18) == 0x000158, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_18' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_6) == 0x000160, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_5) == 0x0001E8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_fuel) == 0x0001EC, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_4) == 0x0001F0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hot) == 0x0001F4, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_17) == 0x000280, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_17' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_16) == 0x000288, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_16' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_3) == 0x000290, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_location_1) == 0x000294, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_15) == 0x0002A0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_15' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_14) == 0x0002A8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_14' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_13) == 0x0002B0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_13' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_wheelDelta) == 0x0002B8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_12) == 0x0002C0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_mouse) == 0x0002C8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_11) == 0x0002D0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_key) == 0x0002D8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_pressed) == 0x0002F0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_temperature_1) == 0x0002F4, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_temperature) == 0x0002F8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_speed) == 0x0002FC, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_10) == 0x000300, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_5) == 0x000308, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_name_1) == 0x000390, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_name_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_volume) == 0x0003A0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_9) == 0x0003A8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_location) == 0x0003B0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_2) == 0x0003BC, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_clean_1) == 0x0003C0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_8) == 0x0003C8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_4) == 0x0003D0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hook_1) == 0x000458, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_clean) == 0x000460, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_7) == 0x000468, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hook) == 0x000470, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_6) == 0x000478, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_3) == 0x000480, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_kick) == 0x000508, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_kick' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_name) == 0x00050C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_5) == 0x000518, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_4) == 0x000520, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_2) == 0x000528, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage_1) == 0x0005B0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_3) == 0x0005B8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_2) == 0x0005C0, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_player_1) == 0x0005C8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x0005D0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Create_ReturnValue) == 0x0005D8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_SetGamePaused_ReturnValue) == 0x0005E0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water) == 0x0005E8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetPlayerController_ReturnValue) == 0x0005F0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water_1) == 0x0005F8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_RandomFloat_ReturnValue) == 0x000600, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_DynamicCast_AsTelescope_Mars) == 0x000608, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_DynamicCast_AsTelescope_Mars' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_DynamicCast_bSuccess) == 0x000610, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_DeltaSeconds) == 0x000614, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000618, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00061C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_MakeRotator_ReturnValue) == 0x000620, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00062C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0006B4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_DegSin_ReturnValue) == 0x0006B8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0006BC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue) == 0x0006C0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0006C4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water_2) == 0x0006C8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0006D0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_water_3) == 0x0006D8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FClamp_ReturnValue) == 0x0006E0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0006E4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FClamp_ReturnValue_1) == 0x0006E8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0006EC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0006F0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x0006F4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x0006F8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x0006FC, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000700, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x000704, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000708, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_5) == 0x00070C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000710, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakVector_X) == 0x000714, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakVector_Y) == 0x000718, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakVector_Z) == 0x00071C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x000720, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue_1) == 0x000724, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000728, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x00072C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x000730, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_12) == 0x000734, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_13) == 0x000738, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x00073C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_2) == 0x000740, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_14) == 0x000744, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_15) == 0x000748, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_3) == 0x00074C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_4) == 0x000750, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_4' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Multiply_FloatFloat_ReturnValue_16) == 0x000754, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Multiply_FloatFloat_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_VictoryFloatPlusEquals_FloatOut_5) == 0x000758, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_VictoryFloatPlusEquals_FloatOut_5' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_MakeArray_Array) == 0x000760, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_RandomFloat_ReturnValue_1) == 0x000770, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Array_Length_ReturnValue) == 0x000774, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Ease_ReturnValue) == 0x000778, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue_2) == 0x00077C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_6) == 0x000780, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakRotator_Roll) == 0x000784, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakRotator_Pitch) == 0x000788, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_BreakRotator_Yaw) == 0x00078C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_RandomFloat_ReturnValue_2) == 0x000790, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_RandomFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FInterpTo_ReturnValue) == 0x000794, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Ease_ReturnValue_1) == 0x000798, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_GetWorldDeltaSeconds_ReturnValue_7) == 0x00079C, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_GetWorldDeltaSeconds_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_Lerp_ReturnValue_3) == 0x0007A0, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_FInterpTo_ReturnValue_1) == 0x0007A4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_MakeRotator_ReturnValue_1) == 0x0007A8, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0007B4, "Member 'Telescope_C_ExecuteUbergraph_telescope::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_damage) == 0x00083C, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_hit_1) == 0x000840, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Telescope_C_ExecuteUbergraph_telescope, K2Node_Event_actor) == 0x0008C8, "Member 'Telescope_C_ExecuteUbergraph_telescope::K2Node_Event_actor' has a wrong offset!");
