#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TentacleBallsFollower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function tentacleBallsFollower.tentacleBallsFollower_C.ExecuteUbergraph_tentacleBallsFollower
// 0x02D0 (0x02D0 - 0x0000)
struct TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewParam;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorArrayBounds_Center;               // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorArrayBounds_BoxExtent;            // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindLocationClosestToWorldLocation_ReturnValue; // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATentacleBall_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0114(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_FindDirectionClosestToWorldLocation_ReturnValue; // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATentacleBall_C*                        CallFunc_Array_Get_Item;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATentacleBall_C*                        CallFunc_Array_Get_Item_1;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceAlongSplineAtSplineInputKey_ReturnValue; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0244(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower) == 0x000010, "Wrong alignment on TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower");
static_assert(sizeof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower) == 0x0002D0, "Wrong size on TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, EntryPoint) == 0x000000, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::EntryPoint' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, Temp_int_Variable) == 0x000004, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, Temp_int_Variable_1) == 0x000028, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_NewParam) == 0x000030, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_cord_1) == 0x000038, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_socket_1) == 0x000040, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_cord) == 0x000048, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_socket) == 0x000050, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_sentFrom) == 0x000058, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_active) == 0x000060, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_RandomFloatInRange_ReturnValue) == 0x000064, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000068, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_MakeVector_ReturnValue) == 0x00006C, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_RotateAngleAxis_ReturnValue) == 0x00007C, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_GetActorArrayBounds_Center) == 0x000094, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_GetActorArrayBounds_Center' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_GetActorArrayBounds_BoxExtent) == 0x0000A0, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_GetActorArrayBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Add_VectorVector_ReturnValue) == 0x0000AC, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_FindLocationClosestToWorldLocation_ReturnValue) == 0x0000F8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_FindLocationClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_FinishSpawningActor_ReturnValue) == 0x000108, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Array_Add_ReturnValue) == 0x000110, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000114, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_FindDirectionClosestToWorldLocation_ReturnValue) == 0x00019C, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_FindDirectionClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Dot_VectorVector_ReturnValue) == 0x0001B4, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001B8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001BC, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_GetSplineLength_ReturnValue) == 0x0001C8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0001CC, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001D8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Vector_Distance_ReturnValue) == 0x0001E4, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001E8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Array_Get_Item) == 0x0001F0, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Array_Length_ReturnValue) == 0x0001F8, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Less_IntInt_ReturnValue) == 0x0001FC, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Array_Get_Item_1) == 0x000200, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Array_Length_ReturnValue_1) == 0x000208, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Less_IntInt_ReturnValue_1) == 0x00020C, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, Temp_int_Variable_2) == 0x000210, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000214, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue) == 0x000220, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_FindInputKeyClosestToWorldLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000224, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_GetDistanceAlongSplineAtSplineInputKey_ReturnValue) == 0x000228, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_GetDistanceAlongSplineAtSplineInputKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Add_IntInt_ReturnValue_2) == 0x00022C, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000230, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_owner) == 0x000238, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, K2Node_Event_index) == 0x000240, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000244, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower, CallFunc_BooleanAND_ReturnValue) == 0x0002CC, "Member 'TentacleBallsFollower_C_ExecuteUbergraph_tentacleBallsFollower::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct TentacleBallsFollower_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TentacleBallsFollower_C_RunTrigger) == 0x000008, "Wrong alignment on TentacleBallsFollower_C_RunTrigger");
static_assert(sizeof(TentacleBallsFollower_C_RunTrigger) == 0x000010, "Wrong size on TentacleBallsFollower_C_RunTrigger");
static_assert(offsetof(TentacleBallsFollower_C_RunTrigger, Param_Owner) == 0x000000, "Member 'TentacleBallsFollower_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_RunTrigger, Param_Index) == 0x000008, "Member 'TentacleBallsFollower_C_RunTrigger::Param_Index' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct TentacleBallsFollower_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TentacleBallsFollower_C_ReceiveTick) == 0x000004, "Wrong alignment on TentacleBallsFollower_C_ReceiveTick");
static_assert(sizeof(TentacleBallsFollower_C_ReceiveTick) == 0x000004, "Wrong size on TentacleBallsFollower_C_ReceiveTick");
static_assert(offsetof(TentacleBallsFollower_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'TentacleBallsFollower_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.setActiveTrigger
// 0x0010 (0x0010 - 0x0000)
struct TentacleBallsFollower_C_SetActiveTrigger final
{
public:
	class AActor*                                 SentFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TentacleBallsFollower_C_SetActiveTrigger) == 0x000008, "Wrong alignment on TentacleBallsFollower_C_SetActiveTrigger");
static_assert(sizeof(TentacleBallsFollower_C_SetActiveTrigger) == 0x000010, "Wrong size on TentacleBallsFollower_C_SetActiveTrigger");
static_assert(offsetof(TentacleBallsFollower_C_SetActiveTrigger, SentFrom) == 0x000000, "Member 'TentacleBallsFollower_C_SetActiveTrigger::SentFrom' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_SetActiveTrigger, Active) == 0x000008, "Member 'TentacleBallsFollower_C_SetActiveTrigger::Active' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.cordUnplugged
// 0x0010 (0x0010 - 0x0000)
struct TentacleBallsFollower_C_CordUnplugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TentacleBallsFollower_C_CordUnplugged) == 0x000008, "Wrong alignment on TentacleBallsFollower_C_CordUnplugged");
static_assert(sizeof(TentacleBallsFollower_C_CordUnplugged) == 0x000010, "Wrong size on TentacleBallsFollower_C_CordUnplugged");
static_assert(offsetof(TentacleBallsFollower_C_CordUnplugged, Cord) == 0x000000, "Member 'TentacleBallsFollower_C_CordUnplugged::Cord' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_CordUnplugged, Socket) == 0x000008, "Member 'TentacleBallsFollower_C_CordUnplugged::Socket' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.cordPlugged
// 0x0010 (0x0010 - 0x0000)
struct TentacleBallsFollower_C_CordPlugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TentacleBallsFollower_C_CordPlugged) == 0x000008, "Wrong alignment on TentacleBallsFollower_C_CordPlugged");
static_assert(sizeof(TentacleBallsFollower_C_CordPlugged) == 0x000010, "Wrong size on TentacleBallsFollower_C_CordPlugged");
static_assert(offsetof(TentacleBallsFollower_C_CordPlugged, Cord) == 0x000000, "Member 'TentacleBallsFollower_C_CordPlugged::Cord' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_CordPlugged, Socket) == 0x000008, "Member 'TentacleBallsFollower_C_CordPlugged::Socket' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.set_ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct TentacleBallsFollower_C_Set_ignoreSave_trigger final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TentacleBallsFollower_C_Set_ignoreSave_trigger) == 0x000001, "Wrong alignment on TentacleBallsFollower_C_Set_ignoreSave_trigger");
static_assert(sizeof(TentacleBallsFollower_C_Set_ignoreSave_trigger) == 0x000001, "Wrong size on TentacleBallsFollower_C_Set_ignoreSave_trigger");
static_assert(offsetof(TentacleBallsFollower_C_Set_ignoreSave_trigger, NewParam) == 0x000000, "Member 'TentacleBallsFollower_C_Set_ignoreSave_trigger::NewParam' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct TentacleBallsFollower_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TentacleBallsFollower_C_UserConstructionScript) == 0x000004, "Wrong alignment on TentacleBallsFollower_C_UserConstructionScript");
static_assert(sizeof(TentacleBallsFollower_C_UserConstructionScript) == 0x000094, "Wrong size on TentacleBallsFollower_C_UserConstructionScript");
static_assert(offsetof(TentacleBallsFollower_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000000, "Member 'TentacleBallsFollower_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_UserConstructionScript, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00000C, "Member 'TentacleBallsFollower_C_UserConstructionScript::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct TentacleBallsFollower_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TentacleBallsFollower_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on TentacleBallsFollower_C_IgnoreSave_trigger");
static_assert(sizeof(TentacleBallsFollower_C_IgnoreSave_trigger) == 0x000001, "Wrong size on TentacleBallsFollower_C_IgnoreSave_trigger");
static_assert(offsetof(TentacleBallsFollower_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'TentacleBallsFollower_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.loadTriggerData
// 0x0100 (0x0100 - 0x0000)
struct TentacleBallsFollower_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TentacleBallsFollower_C_LoadTriggerData) == 0x000010, "Wrong alignment on TentacleBallsFollower_C_LoadTriggerData");
static_assert(sizeof(TentacleBallsFollower_C_LoadTriggerData) == 0x000100, "Wrong size on TentacleBallsFollower_C_LoadTriggerData");
static_assert(offsetof(TentacleBallsFollower_C_LoadTriggerData, Data) == 0x000000, "Member 'TentacleBallsFollower_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(TentacleBallsFollower_C_LoadTriggerData, Return) == 0x0000F0, "Member 'TentacleBallsFollower_C_LoadTriggerData::Return' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.getTriggerData
// 0x00F0 (0x00F0 - 0x0000)
struct TentacleBallsFollower_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(TentacleBallsFollower_C_GetTriggerData) == 0x000010, "Wrong alignment on TentacleBallsFollower_C_GetTriggerData");
static_assert(sizeof(TentacleBallsFollower_C_GetTriggerData) == 0x0000F0, "Wrong size on TentacleBallsFollower_C_GetTriggerData");
static_assert(offsetof(TentacleBallsFollower_C_GetTriggerData, Data) == 0x000000, "Member 'TentacleBallsFollower_C_GetTriggerData::Data' has a wrong offset!");

// Function tentacleBallsFollower.tentacleBallsFollower_C.gatherDataFromKeyT
// 0x0001 (0x0001 - 0x0000)
struct TentacleBallsFollower_C_GatherDataFromKeyT final
{
public:
	bool                                          Gather;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TentacleBallsFollower_C_GatherDataFromKeyT) == 0x000001, "Wrong alignment on TentacleBallsFollower_C_GatherDataFromKeyT");
static_assert(sizeof(TentacleBallsFollower_C_GatherDataFromKeyT) == 0x000001, "Wrong size on TentacleBallsFollower_C_GatherDataFromKeyT");
static_assert(offsetof(TentacleBallsFollower_C_GatherDataFromKeyT, Gather) == 0x000000, "Member 'TentacleBallsFollower_C_GatherDataFromKeyT::Gather' has a wrong offset!");

}

