#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TentacleBallsFollower

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass tentacleBallsFollower.tentacleBallsFollower_C
// 0x0078 (0x0298 - 0x0220)
class ATentacleBallsFollower_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Resume;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Follow;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Spline;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ATentacleBall_C*>                balls;                                             // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                Point;                                             // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastPoint;                                         // 0x0270(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dir;                                               // 0x027C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Passed;                                            // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResumeEvent;                                       // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowFollow;                                       // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_tentacleBallsFollower(int32 EntryPoint);
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void Finish();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetActiveTrigger(class AActor* SentFrom, bool Active);
	void CordUnplugged(class ACord_C* Cord, class ACordSocket_C* Socket);
	void CordPlugged(class ACord_C* Cord, class ACordSocket_C* Socket);
	void Set_ignoreSave_trigger(bool NewParam);
	void UserConstructionScript();
	void IgnoreSave_trigger(bool* Ignore);
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void GetTriggerData(struct FStruct_triggerSave* Data);
	void GatherDataFromKeyT(bool* Gather);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"tentacleBallsFollower_C">();
	}
	static class ATentacleBallsFollower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATentacleBallsFollower_C>();
	}
};
static_assert(alignof(ATentacleBallsFollower_C) == 0x000008, "Wrong alignment on ATentacleBallsFollower_C");
static_assert(sizeof(ATentacleBallsFollower_C) == 0x000298, "Wrong size on ATentacleBallsFollower_C");
static_assert(offsetof(ATentacleBallsFollower_C, UberGraphFrame) == 0x000220, "Member 'ATentacleBallsFollower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Resume) == 0x000228, "Member 'ATentacleBallsFollower_C::Resume' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Follow) == 0x000230, "Member 'ATentacleBallsFollower_C::Follow' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Spline) == 0x000238, "Member 'ATentacleBallsFollower_C::Spline' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, DefaultSceneRoot) == 0x000240, "Member 'ATentacleBallsFollower_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, balls) == 0x000248, "Member 'ATentacleBallsFollower_C::balls' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Point) == 0x000258, "Member 'ATentacleBallsFollower_C::Point' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Loc) == 0x000264, "Member 'ATentacleBallsFollower_C::Loc' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, LastPoint) == 0x000270, "Member 'ATentacleBallsFollower_C::LastPoint' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Dir) == 0x00027C, "Member 'ATentacleBallsFollower_C::Dir' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, Passed) == 0x000288, "Member 'ATentacleBallsFollower_C::Passed' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, ResumeEvent) == 0x00028C, "Member 'ATentacleBallsFollower_C::ResumeEvent' has a wrong offset!");
static_assert(offsetof(ATentacleBallsFollower_C, AllowFollow) == 0x000290, "Member 'ATentacleBallsFollower_C::AllowFollow' has a wrong offset!");

}

