#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_wispSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Ticker_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ticker_wispSpawner.ticker_wispSpawner_C
// 0x0060 (0x0298 - 0x0238)
class ATicker_wispSpawner_C final : public ATicker_base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Ticker_wispSpawner_C;               // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UClass*, float>                    Wisps;                                             // 0x0240(0x0050)(Edit, BlueprintVisible)
	bool                                          SkipFirst;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ticker_wispSpawner(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ticker_wispSpawner_C">();
	}
	static class ATicker_wispSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATicker_wispSpawner_C>();
	}
};
static_assert(alignof(ATicker_wispSpawner_C) == 0x000008, "Wrong alignment on ATicker_wispSpawner_C");
static_assert(sizeof(ATicker_wispSpawner_C) == 0x000298, "Wrong size on ATicker_wispSpawner_C");
static_assert(offsetof(ATicker_wispSpawner_C, UberGraphFrame_Ticker_wispSpawner_C) == 0x000238, "Member 'ATicker_wispSpawner_C::UberGraphFrame_Ticker_wispSpawner_C' has a wrong offset!");
static_assert(offsetof(ATicker_wispSpawner_C, Wisps) == 0x000240, "Member 'ATicker_wispSpawner_C::Wisps' has a wrong offset!");
static_assert(offsetof(ATicker_wispSpawner_C, SkipFirst) == 0x000290, "Member 'ATicker_wispSpawner_C::SkipFirst' has a wrong offset!");

}

