#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_disher

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ticker_disher.ticker_disher_C.ExecuteUbergraph_ticker_disher
// 0x0088 (0x0088 - 0x0000)
struct Ticker_disher_C_ExecuteUbergraph_ticker_disher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5F[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADish_C*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F60[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F61[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F62[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_disher_C_ExecuteUbergraph_ticker_disher) == 0x000008, "Wrong alignment on Ticker_disher_C_ExecuteUbergraph_ticker_disher");
static_assert(sizeof(Ticker_disher_C_ExecuteUbergraph_ticker_disher) == 0x000088, "Wrong size on Ticker_disher_C_ExecuteUbergraph_ticker_disher");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, EntryPoint) == 0x000000, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, Temp_int_Variable) == 0x000004, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, Temp_bool_Variable) == 0x000008, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000020, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000028, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Array_Get_Item) == 0x000038, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000044, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_BooleanOR_ReturnValue) == 0x000046, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Normal_ReturnValue) == 0x000048, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000058, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Add_VectorVector_ReturnValue) == 0x00006C, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_Array_Contains_ReturnValue) == 0x000078, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000079, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_RandomFloatInRange_ReturnValue) == 0x00007C, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_disher_C_ExecuteUbergraph_ticker_disher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'Ticker_disher_C_ExecuteUbergraph_ticker_disher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

