#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_deerSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ticker_deerSpawner.ticker_deerSpawner_C.ExecuteUbergraph_ticker_deerSpawner
// 0x00B0 (0x00B0 - 0x0000)
struct Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeer_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner) == 0x000010, "Wrong alignment on Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner");
static_assert(sizeof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner) == 0x0000B0, "Wrong size on Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, EntryPoint) == 0x000000, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000D, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_RandomBool_ReturnValue) == 0x000015, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_RandomBool_ReturnValue_1) == 0x000020, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_SelectFloat_ReturnValue_1) == 0x000028, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00002C, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000030, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000044, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000050, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000058, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A8, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A9, "Member 'Ticker_deerSpawner_C_ExecuteUbergraph_ticker_deerSpawner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function ticker_deerSpawner.ticker_deerSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_deerSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_deerSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_deerSpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_deerSpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_deerSpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_deerSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_deerSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

