#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_egSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ticker_egSpawner.ticker_egSpawner_C.ExecuteUbergraph_ticker_egSpawner
// 0x00A0 (0x00A0 - 0x0000)
struct Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F48[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F49[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F4A[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F4B[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4C[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F4D[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEg_C*                                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner) == 0x000010, "Wrong alignment on Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner");
static_assert(sizeof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner) == 0x0000A0, "Wrong size on Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, EntryPoint) == 0x000000, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000D, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000010, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00001C, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000021, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_RandomBool_ReturnValue) == 0x000022, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_BooleanOR_ReturnValue_1) == 0x000023, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_SelectFloat_ReturnValue) == 0x000024, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00002C, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_RandomBool_ReturnValue_1) == 0x000030, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000031, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_SelectFloat_ReturnValue_1) == 0x000034, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'Ticker_egSpawner_C_ExecuteUbergraph_ticker_egSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ticker_egSpawner.ticker_egSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_egSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_egSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_egSpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_egSpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_egSpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_egSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_egSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

