#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_susHoleSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ticker_susHoleSpawner.ticker_susHoleSpawner_C.ExecuteUbergraph_ticker_susHoleSpawner
// 0x0210 (0x0210 - 0x0000)
struct Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x009C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0xF];                                      // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASusDirtHole_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner) == 0x000010, "Wrong alignment on Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner");
static_assert(sizeof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner) == 0x000210, "Wrong size on Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, EntryPoint) == 0x000000, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000010, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, Temp_object_Variable) == 0x000018, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_obj_static_obj) == 0x000028, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00003C, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000044, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x000060, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000084, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000090, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_LineTraceSingleForObjects_OutHit) == 0x00009C, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000124, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_bBlockingHit) == 0x000125, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x000126, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_Time) == 0x000128, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_Distance) == 0x00012C, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_Location) == 0x000130, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_ImpactPoint) == 0x00013C, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_Normal) == 0x000148, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_ImpactNormal) == 0x000154, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_HitItem) == 0x000180, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_ElementIndex) == 0x000184, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_FaceIndex) == 0x000188, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_TraceStart) == 0x00018C, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BreakHitResult_TraceEnd) == 0x000198, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001A4, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001B0, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0001C0, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BooleanAND_ReturnValue) == 0x0001F0, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001F8, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000200, "Member 'Ticker_susHoleSpawner_C_ExecuteUbergraph_ticker_susHoleSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ticker_susHoleSpawner.ticker_susHoleSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_susHoleSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_susHoleSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_susHoleSpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_susHoleSpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_susHoleSpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_susHoleSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_susHoleSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

