#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_insomniacSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ticker_insomniacSpawner.ticker_insomniacSpawner_C.ExecuteUbergraph_ticker_insomniacSpawner
// 0x00D0 (0x00D0 - 0x0000)
struct Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_trySpawnInsomniac_canSpawn;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_trySpawnInsomniac_loc;                    // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInsomniac_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInsomniac_Child_C*                     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner) == 0x000010, "Wrong alignment on Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner");
static_assert(sizeof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner) == 0x0000D0, "Wrong size on Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, EntryPoint) == 0x000000, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000020, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, K2Node_CustomEvent_DestroyedActor) == 0x000028, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000031, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_IsValid_ReturnValue) == 0x000033, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_trySpawnInsomniac_canSpawn) == 0x000034, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_trySpawnInsomniac_canSpawn' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_trySpawnInsomniac_loc) == 0x000038, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_trySpawnInsomniac_loc' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_MakeTransform_ReturnValue_1) == 0x000090, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C0, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000C8, "Member 'Ticker_insomniacSpawner_C_ExecuteUbergraph_ticker_insomniacSpawner::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function ticker_insomniacSpawner.ticker_insomniacSpawner_C.insomniacDest
// 0x0008 (0x0008 - 0x0000)
struct Ticker_insomniacSpawner_C_InsomniacDest final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_insomniacSpawner_C_InsomniacDest) == 0x000008, "Wrong alignment on Ticker_insomniacSpawner_C_InsomniacDest");
static_assert(sizeof(Ticker_insomniacSpawner_C_InsomniacDest) == 0x000008, "Wrong size on Ticker_insomniacSpawner_C_InsomniacDest");
static_assert(offsetof(Ticker_insomniacSpawner_C_InsomniacDest, DestroyedActor) == 0x000000, "Member 'Ticker_insomniacSpawner_C_InsomniacDest::DestroyedActor' has a wrong offset!");

// Function ticker_insomniacSpawner.ticker_insomniacSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_insomniacSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_insomniacSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_insomniacSpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_insomniacSpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_insomniacSpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_insomniacSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_insomniacSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

