#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_roachSummoner

#include "Basic.hpp"


namespace SDK::Params
{

// Function ticker_roachSummoner.ticker_roachSummoner_C.ExecuteUbergraph_ticker_roachSummoner
// 0x0018 (0x0018 - 0x0000)
struct Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F16[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner) == 0x000008, "Wrong alignment on Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner");
static_assert(sizeof(Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner) == 0x000018, "Wrong size on Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner");
static_assert(offsetof(Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner, EntryPoint) == 0x000000, "Member 'Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'Ticker_roachSummoner_C_ExecuteUbergraph_ticker_roachSummoner::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function ticker_roachSummoner.ticker_roachSummoner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_roachSummoner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_roachSummoner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_roachSummoner_C_ReceiveTick");
static_assert(sizeof(Ticker_roachSummoner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_roachSummoner_C_ReceiveTick");
static_assert(offsetof(Ticker_roachSummoner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_roachSummoner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

