#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_fireflySpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ticker_fireflySpawner.ticker_fireflySpawner_C.ExecuteUbergraph_ticker_fireflySpawner
// 0x01C0 (0x01C0 - 0x0000)
struct Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F3C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3D[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F3E[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0098(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3F[0x1];                                     // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F40[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F41[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner) == 0x000008, "Wrong alignment on Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner");
static_assert(sizeof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner) == 0x0001C0, "Wrong size on Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, EntryPoint) == 0x000000, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, Temp_object_Variable) == 0x000010, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000034, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x000048, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_FClamp_ReturnValue) == 0x000054, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000064, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000068, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000074, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000084, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000088, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_obj_static_obj) == 0x000098, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000A8, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000130, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_bBlockingHit) == 0x000131, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x000132, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_Time) == 0x000134, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_Distance) == 0x000138, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_Location) == 0x00013C, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_ImpactPoint) == 0x000148, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_Normal) == 0x000154, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_ImpactNormal) == 0x000160, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_PhysMat) == 0x000170, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_HitActor) == 0x000178, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_HitComponent) == 0x000180, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_HitBoneName) == 0x000188, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_HitItem) == 0x000190, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_ElementIndex) == 0x000194, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_FaceIndex) == 0x000198, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_TraceStart) == 0x00019C, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_BreakHitResult_TraceEnd) == 0x0001A8, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001B4, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001B8, "Member 'Ticker_fireflySpawner_C_ExecuteUbergraph_ticker_fireflySpawner::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function ticker_fireflySpawner.ticker_fireflySpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_fireflySpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_fireflySpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_fireflySpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_fireflySpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_fireflySpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_fireflySpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_fireflySpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

