#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_hexahiveSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ticker_hexahiveSpawner.ticker_hexahiveSpawner_C.ExecuteUbergraph_ticker_hexahiveSpawner
// 0x00C0 (0x00C0 - 0x0000)
struct Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F29[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2B[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2C[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2D[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2E[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2F[0xC];                                     // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHexahiveSPawner_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner) == 0x000010, "Wrong alignment on Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner");
static_assert(sizeof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner) == 0x0000C0, "Wrong size on Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, EntryPoint) == 0x000000, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00001C, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000020, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000029, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_BooleanOR_ReturnValue) == 0x00002A, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002B, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000030, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_BooleanOR_ReturnValue_1) == 0x000034, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x000038, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000048, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000054, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000058, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000064, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'Ticker_hexahiveSpawner_C_ExecuteUbergraph_ticker_hexahiveSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ticker_hexahiveSpawner.ticker_hexahiveSpawner_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_hexahiveSpawner_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_hexahiveSpawner_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_hexahiveSpawner_C_ReceiveTick");
static_assert(sizeof(Ticker_hexahiveSpawner_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_hexahiveSpawner_C_ReceiveTick");
static_assert(offsetof(Ticker_hexahiveSpawner_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_hexahiveSpawner_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

