#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_yellowWispSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Ticker_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ticker_yellowWispSpawner.ticker_yellowWispSpawner_C
// 0x0038 (0x0270 - 0x0238)
class ATicker_yellowWispSpawner_C final : public ATicker_base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Ticker_yellowWispSpawner_C;         // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                P;                                                 // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE5[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              Mats;                                              // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         Deer;                                              // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ticker_yellowWispSpawner(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ticker_yellowWispSpawner_C">();
	}
	static class ATicker_yellowWispSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATicker_yellowWispSpawner_C>();
	}
};
static_assert(alignof(ATicker_yellowWispSpawner_C) == 0x000008, "Wrong alignment on ATicker_yellowWispSpawner_C");
static_assert(sizeof(ATicker_yellowWispSpawner_C) == 0x000270, "Wrong size on ATicker_yellowWispSpawner_C");
static_assert(offsetof(ATicker_yellowWispSpawner_C, UberGraphFrame_Ticker_yellowWispSpawner_C) == 0x000238, "Member 'ATicker_yellowWispSpawner_C::UberGraphFrame_Ticker_yellowWispSpawner_C' has a wrong offset!");
static_assert(offsetof(ATicker_yellowWispSpawner_C, P) == 0x000240, "Member 'ATicker_yellowWispSpawner_C::P' has a wrong offset!");
static_assert(offsetof(ATicker_yellowWispSpawner_C, Mats) == 0x000250, "Member 'ATicker_yellowWispSpawner_C::Mats' has a wrong offset!");
static_assert(offsetof(ATicker_yellowWispSpawner_C, Deer) == 0x000260, "Member 'ATicker_yellowWispSpawner_C::Deer' has a wrong offset!");

}

