#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_foodHall

#include "Basic.hpp"


namespace SDK::Params
{

// Function ticker_foodHall.ticker_foodHall_C.ExecuteUbergraph_ticker_foodHall
// 0x0008 (0x0008 - 0x0000)
struct Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall) == 0x000004, "Wrong alignment on Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall");
static_assert(sizeof(Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall) == 0x000008, "Wrong size on Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall");
static_assert(offsetof(Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall, EntryPoint) == 0x000000, "Member 'Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Ticker_foodHall_C_ExecuteUbergraph_ticker_foodHall::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function ticker_foodHall.ticker_foodHall_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Ticker_foodHall_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ticker_foodHall_C_ReceiveTick) == 0x000004, "Wrong alignment on Ticker_foodHall_C_ReceiveTick");
static_assert(sizeof(Ticker_foodHall_C_ReceiveTick) == 0x000004, "Wrong size on Ticker_foodHall_C_ReceiveTick");
static_assert(offsetof(Ticker_foodHall_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Ticker_foodHall_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

