#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ticker_base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ticker_base.ticker_base_C
// 0x0018 (0x0238 - 0x0220)
class ATicker_base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        GameMode;                                          // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ticker_base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ticker_base_C">();
	}
	static class ATicker_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATicker_base_C>();
	}
};
static_assert(alignof(ATicker_base_C) == 0x000008, "Wrong alignment on ATicker_base_C");
static_assert(sizeof(ATicker_base_C) == 0x000238, "Wrong size on ATicker_base_C");
static_assert(offsetof(ATicker_base_C, UberGraphFrame) == 0x000220, "Member 'ATicker_base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATicker_base_C, DefaultSceneRoot) == 0x000228, "Member 'ATicker_base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATicker_base_C, GameMode) == 0x000230, "Member 'ATicker_base_C::GameMode' has a wrong offset!");

}

