#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Toilet

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_mFloat_structs.hpp"


namespace SDK::Params
{

// Function toilet.toilet_C.canBePutInContainer
// 0x0001 (0x0001 - 0x0000)
struct Toilet_C_CanBePutInContainer final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Toilet_C_CanBePutInContainer) == 0x000001, "Wrong alignment on Toilet_C_CanBePutInContainer");
static_assert(sizeof(Toilet_C_CanBePutInContainer) == 0x000001, "Wrong size on Toilet_C_CanBePutInContainer");
static_assert(offsetof(Toilet_C_CanBePutInContainer, Return) == 0x000000, "Member 'Toilet_C_CanBePutInContainer::Return' has a wrong offset!");

// Function toilet.toilet_C.asProp
// 0x0008 (0x0008 - 0x0000)
struct Toilet_C_AsProp final
{
public:
	class AProp_C*                                Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_AsProp) == 0x000008, "Wrong alignment on Toilet_C_AsProp");
static_assert(sizeof(Toilet_C_AsProp) == 0x000008, "Wrong size on Toilet_C_AsProp");
static_assert(offsetof(Toilet_C_AsProp, Return) == 0x000000, "Member 'Toilet_C_AsProp::Return' has a wrong offset!");

// Function toilet.toilet_C.canPickup
// 0x0001 (0x0001 - 0x0000)
struct Toilet_C_CanPickup final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Toilet_C_CanPickup) == 0x000001, "Wrong alignment on Toilet_C_CanPickup");
static_assert(sizeof(Toilet_C_CanPickup) == 0x000001, "Wrong size on Toilet_C_CanPickup");
static_assert(offsetof(Toilet_C_CanPickup, Return) == 0x000000, "Member 'Toilet_C_CanPickup::Return' has a wrong offset!");

// Function toilet.toilet_C.noRespawn
// 0x0002 (0x0002 - 0x0000)
struct Toilet_C_NoRespawn final
{
public:
	bool                                          Param_NoRespawn;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Return;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Toilet_C_NoRespawn) == 0x000001, "Wrong alignment on Toilet_C_NoRespawn");
static_assert(sizeof(Toilet_C_NoRespawn) == 0x000002, "Wrong size on Toilet_C_NoRespawn");
static_assert(offsetof(Toilet_C_NoRespawn, Param_NoRespawn) == 0x000000, "Member 'Toilet_C_NoRespawn::Param_NoRespawn' has a wrong offset!");
static_assert(offsetof(Toilet_C_NoRespawn, Return) == 0x000001, "Member 'Toilet_C_NoRespawn::Return' has a wrong offset!");

// Function toilet.toilet_C.lookAt
// 0x00D8 (0x00D8 - 0x0000)
struct Toilet_C_LookAt final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Return;                                            // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431A[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    boundObjectReplace;                                // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_LookAt) == 0x000008, "Wrong alignment on Toilet_C_LookAt");
static_assert(sizeof(Toilet_C_LookAt) == 0x0000D8, "Wrong size on Toilet_C_LookAt");
static_assert(offsetof(Toilet_C_LookAt, Player) == 0x000000, "Member 'Toilet_C_LookAt::Player' has a wrong offset!");
static_assert(offsetof(Toilet_C_LookAt, Hit) == 0x000008, "Member 'Toilet_C_LookAt::Hit' has a wrong offset!");
static_assert(offsetof(Toilet_C_LookAt, Return) == 0x000090, "Member 'Toilet_C_LookAt::Return' has a wrong offset!");
static_assert(offsetof(Toilet_C_LookAt, Text) == 0x000098, "Member 'Toilet_C_LookAt::Text' has a wrong offset!");
static_assert(offsetof(Toilet_C_LookAt, boundObjectReplace) == 0x0000A8, "Member 'Toilet_C_LookAt::boundObjectReplace' has a wrong offset!");
static_assert(offsetof(Toilet_C_LookAt, CallFunc_MakeLiteralText_ReturnValue) == 0x0000B0, "Member 'Toilet_C_LookAt::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Toilet_C_LookAt, CallFunc_Conv_TextToString_ReturnValue) == 0x0000C8, "Member 'Toilet_C_LookAt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function toilet.toilet_C.isButtonUsed
// 0x0001 (0x0001 - 0x0000)
struct Toilet_C_IsButtonUsed final
{
public:
	bool                                          Failed;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Toilet_C_IsButtonUsed) == 0x000001, "Wrong alignment on Toilet_C_IsButtonUsed");
static_assert(sizeof(Toilet_C_IsButtonUsed) == 0x000001, "Wrong size on Toilet_C_IsButtonUsed");
static_assert(offsetof(Toilet_C_IsButtonUsed, Failed) == 0x000000, "Member 'Toilet_C_IsButtonUsed::Failed' has a wrong offset!");

// Function toilet.toilet_C.getActionOptions
// 0x0058 (0x0058 - 0x0000)
struct Toilet_C_GetActionOptions final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               Options_enum;                                      // 0x0028(0x0010)(Parm, OutParm)
	TArray<class FText>                           OptionsNamesOverlay;                               // 0x0038(0x0010)(Parm, OutParm)
	TArray<Enum_interactionActions>               K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
};
static_assert(alignof(Toilet_C_GetActionOptions) == 0x000008, "Wrong alignment on Toilet_C_GetActionOptions");
static_assert(sizeof(Toilet_C_GetActionOptions) == 0x000058, "Wrong size on Toilet_C_GetActionOptions");
static_assert(offsetof(Toilet_C_GetActionOptions, Player) == 0x000000, "Member 'Toilet_C_GetActionOptions::Player' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetActionOptions, Component) == 0x000008, "Member 'Toilet_C_GetActionOptions::Component' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetActionOptions, Actor) == 0x000010, "Member 'Toilet_C_GetActionOptions::Actor' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetActionOptions, Options) == 0x000018, "Member 'Toilet_C_GetActionOptions::Options' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetActionOptions, Options_enum) == 0x000028, "Member 'Toilet_C_GetActionOptions::Options_enum' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetActionOptions, OptionsNamesOverlay) == 0x000038, "Member 'Toilet_C_GetActionOptions::OptionsNamesOverlay' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetActionOptions, K2Node_MakeArray_Array) == 0x000048, "Member 'Toilet_C_GetActionOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function toilet.toilet_C.getData
// 0x0280 (0x0280 - 0x0000)
struct Toilet_C_GetData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_save                           CallFunc_getData_data;                             // 0x00C0(0x00C0)(HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x0190(0x0010)(HasGetValueTypeHash)
	struct FStruct_mFloat                         K2Node_MakeStruct_struct_mFloat;                   // 0x01A0(0x0010)(HasGetValueTypeHash)
	TArray<struct FStruct_mFloat>                 K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FStruct_save                           K2Node_SetFieldsInStruct_StructOut;                // 0x01C0(0x00C0)(HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_GetData) == 0x000010, "Wrong alignment on Toilet_C_GetData");
static_assert(sizeof(Toilet_C_GetData) == 0x000280, "Wrong size on Toilet_C_GetData");
static_assert(offsetof(Toilet_C_GetData, Data) == 0x000000, "Member 'Toilet_C_GetData::Data' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetData, CallFunc_getData_data) == 0x0000C0, "Member 'Toilet_C_GetData::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetData, K2Node_MakeArray_Array) == 0x000180, "Member 'Toilet_C_GetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetData, CallFunc_Array_Get_Item) == 0x000190, "Member 'Toilet_C_GetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetData, K2Node_MakeStruct_struct_mFloat) == 0x0001A0, "Member 'Toilet_C_GetData::K2Node_MakeStruct_struct_mFloat' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetData, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'Toilet_C_GetData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Toilet_C_GetData, K2Node_SetFieldsInStruct_StructOut) == 0x0001C0, "Member 'Toilet_C_GetData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function toilet.toilet_C.loadData
// 0x00E0 (0x00E0 - 0x0000)
struct Toilet_C_LoadData final
{
public:
	struct FStruct_save                           Data;                                              // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadData_return;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431B[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_mFloat                         CallFunc_Array_Get_Item;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_LoadData) == 0x000010, "Wrong alignment on Toilet_C_LoadData");
static_assert(sizeof(Toilet_C_LoadData) == 0x0000E0, "Wrong size on Toilet_C_LoadData");
static_assert(offsetof(Toilet_C_LoadData, Data) == 0x000000, "Member 'Toilet_C_LoadData::Data' has a wrong offset!");
static_assert(offsetof(Toilet_C_LoadData, Return) == 0x0000C0, "Member 'Toilet_C_LoadData::Return' has a wrong offset!");
static_assert(offsetof(Toilet_C_LoadData, CallFunc_loadData_return) == 0x0000C1, "Member 'Toilet_C_LoadData::CallFunc_loadData_return' has a wrong offset!");
static_assert(offsetof(Toilet_C_LoadData, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Toilet_C_LoadData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Toilet_C_LoadData, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'Toilet_C_LoadData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function toilet.toilet_C.ignoreSave
// 0x0001 (0x0001 - 0x0000)
struct Toilet_C_IgnoreSave final
{
public:
	bool                                          Param_IgnoreSave;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Toilet_C_IgnoreSave) == 0x000001, "Wrong alignment on Toilet_C_IgnoreSave");
static_assert(sizeof(Toilet_C_IgnoreSave) == 0x000001, "Wrong size on Toilet_C_IgnoreSave");
static_assert(offsetof(Toilet_C_IgnoreSave, Param_IgnoreSave) == 0x000000, "Member 'Toilet_C_IgnoreSave::Param_IgnoreSave' has a wrong offset!");

// Function toilet.toilet_C.player_use
// 0x0090 (0x0090 - 0x0000)
struct Toilet_C_Player_use final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Toilet_C_Player_use) == 0x000008, "Wrong alignment on Toilet_C_Player_use");
static_assert(sizeof(Toilet_C_Player_use) == 0x000090, "Wrong size on Toilet_C_Player_use");
static_assert(offsetof(Toilet_C_Player_use, Player) == 0x000000, "Member 'Toilet_C_Player_use::Player' has a wrong offset!");
static_assert(offsetof(Toilet_C_Player_use, Hit) == 0x000008, "Member 'Toilet_C_Player_use::Hit' has a wrong offset!");

// Function toilet.toilet_C.kicked
// 0x0001 (0x0001 - 0x0000)
struct Toilet_C_Kicked final
{
public:
	bool                                          Kick;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Toilet_C_Kicked) == 0x000001, "Wrong alignment on Toilet_C_Kicked");
static_assert(sizeof(Toilet_C_Kicked) == 0x000001, "Wrong size on Toilet_C_Kicked");
static_assert(offsetof(Toilet_C_Kicked, Kick) == 0x000000, "Member 'Toilet_C_Kicked::Kick' has a wrong offset!");

// Function toilet.toilet_C.sendName
// 0x0008 (0x0008 - 0x0000)
struct Toilet_C_SendName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_SendName) == 0x000004, "Wrong alignment on Toilet_C_SendName");
static_assert(sizeof(Toilet_C_SendName) == 0x000008, "Wrong size on Toilet_C_SendName");
static_assert(offsetof(Toilet_C_SendName, Param_Name) == 0x000000, "Member 'Toilet_C_SendName::Param_Name' has a wrong offset!");

// Function toilet.toilet_C.thrown
// 0x0008 (0x0008 - 0x0000)
struct Toilet_C_Thrown final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_Thrown) == 0x000008, "Wrong alignment on Toilet_C_Thrown");
static_assert(sizeof(Toilet_C_Thrown) == 0x000008, "Wrong size on Toilet_C_Thrown");
static_assert(offsetof(Toilet_C_Thrown, Player) == 0x000000, "Member 'Toilet_C_Thrown::Player' has a wrong offset!");

// Function toilet.toilet_C.damageByPlayer
// 0x0090 (0x0090 - 0x0000)
struct Toilet_C_DamageByPlayer final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Toilet_C_DamageByPlayer) == 0x000008, "Wrong alignment on Toilet_C_DamageByPlayer");
static_assert(sizeof(Toilet_C_DamageByPlayer) == 0x000090, "Wrong size on Toilet_C_DamageByPlayer");
static_assert(offsetof(Toilet_C_DamageByPlayer, Player) == 0x000000, "Member 'Toilet_C_DamageByPlayer::Player' has a wrong offset!");
static_assert(offsetof(Toilet_C_DamageByPlayer, Hit) == 0x000008, "Member 'Toilet_C_DamageByPlayer::Hit' has a wrong offset!");

// Function toilet.toilet_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct Toilet_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       Action;                                            // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_ActionOptionIndex) == 0x000008, "Wrong alignment on Toilet_C_ActionOptionIndex");
static_assert(sizeof(Toilet_C_ActionOptionIndex) == 0x000098, "Wrong size on Toilet_C_ActionOptionIndex");
static_assert(offsetof(Toilet_C_ActionOptionIndex, Player) == 0x000000, "Member 'Toilet_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(Toilet_C_ActionOptionIndex, Hit) == 0x000008, "Member 'Toilet_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(Toilet_C_ActionOptionIndex, Param_Index) == 0x000090, "Member 'Toilet_C_ActionOptionIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Toilet_C_ActionOptionIndex, Action) == 0x000094, "Member 'Toilet_C_ActionOptionIndex::Action' has a wrong offset!");

// Function toilet.toilet_C.ExecuteUbergraph_toilet
// 0x0260 (0x0260 - 0x0000)
struct Toilet_C_ExecuteUbergraph_toilet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_kick;                                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431D[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_name;                                 // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431E[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431F[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4320[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4321[0xA];                                     // 0x0176(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0180(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4322[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWendussy_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x01D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Toilet_C_ExecuteUbergraph_toilet) == 0x000010, "Wrong alignment on Toilet_C_ExecuteUbergraph_toilet");
static_assert(sizeof(Toilet_C_ExecuteUbergraph_toilet) == 0x000260, "Wrong size on Toilet_C_ExecuteUbergraph_toilet");
static_assert(offsetof(Toilet_C_ExecuteUbergraph_toilet, EntryPoint) == 0x000000, "Member 'Toilet_C_ExecuteUbergraph_toilet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Toilet_C_ExecuteUbergraph_toilet, CallFunc_getSaveSlot_saveSlot) == 0x000008, "Member 'Toilet_C_ExecuteUbergraph_toilet::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Toilet_C_ExecuteUbergraph_toilet, Temp_int_Variable) == 0x000010, "Member 'Toilet_C_ExecuteUbergraph_toilet::Temp_int_Variable' has a wrong offset!");
