#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Toilet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Actor_save_classes.hpp"
#include "Enum_interactionActions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass toilet.toilet_C
// 0x0030 (0x0278 - 0x0248)
class AToilet_C final : public AActor_save_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Toilet_C;                           // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Yoilet;                                            // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Used;                                              // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Ime;                                               // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Clean;                                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CleanVec;                                          // 0x026C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LandedOn(class AMainPlayer_C* Player, bool* IgnoreFallDamage);
	void CanBePutInContainer(bool* Return);
	void AsProp(class AProp_C** Return);
	void CanPickup(bool* Return);
	void NoRespawn(bool Param_NoRespawn, bool* Return);
	void LookAt(class AMainPlayer_C* Player, const struct FHitResult& Hit, bool* Return, class FString* Text, class UPrimitiveComponent** boundObjectReplace, uint8* Number);
	void IsButtonUsed(bool* Failed);
	void Upd();
	void GatherDataFromKey(bool* Gather);
	void GetActionOptions(class AMainPlayer_C* Player, class UPrimitiveComponent* Component, class AActor* Actor, TArray<class FString>* Options, TArray<Enum_interactionActions>* Options_enum, TArray<class FText>* OptionsNamesOverlay, uint8* Number);
	void GetData(struct FStruct_save* Data);
	void LoadData(const struct FStruct_save& Data, bool* Return);
	void IgnoreSave(bool* Param_IgnoreSave);
	void UserConstructionScript();
	void DriveDetached();
	void Player_use(class AMainPlayer_C* Player, const struct FHitResult& Hit);
	void Kicked(bool Kick);
	void SendName(class FName Param_Name);
	void broken();
	void broken_fire();
	void Thrown(class AMainPlayer_C* Player);
	void DamageByPlayer(class AMainPlayer_C* Player, const struct FHitResult& Hit, float Damage);
	void UpdateStrAgl();
	void PlayerUnequip(class AMainPlayer_C* Player);
	void PlayerHold(class AMainPlayer_C* Player);
	void PlayerR(class AMainPlayer_C* Player);
	void Tick();
	void ActionOptionIndex(class AMainPlayer_C* Player, const struct FHitResult& Hit, Enum_interactionActions Action);
	void CleanSponge(float Param_Clean, class AMainPlayer_C* Player);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_toilet(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"toilet_C">();
	}
	static class AToilet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AToilet_C>();
	}
};
static_assert(alignof(AToilet_C) == 0x000008, "Wrong alignment on AToilet_C");
static_assert(sizeof(AToilet_C) == 0x000278, "Wrong size on AToilet_C");
static_assert(offsetof(AToilet_C, UberGraphFrame_Toilet_C) == 0x000248, "Member 'AToilet_C::UberGraphFrame_Toilet_C' has a wrong offset!");
static_assert(offsetof(AToilet_C, Yoilet) == 0x000250, "Member 'AToilet_C::Yoilet' has a wrong offset!");
static_assert(offsetof(AToilet_C, Cube) == 0x000258, "Member 'AToilet_C::Cube' has a wrong offset!");
static_assert(offsetof(AToilet_C, Used) == 0x000260, "Member 'AToilet_C::Used' has a wrong offset!");
static_assert(offsetof(AToilet_C, Ime) == 0x000264, "Member 'AToilet_C::Ime' has a wrong offset!");
static_assert(offsetof(AToilet_C, Clean) == 0x000268, "Member 'AToilet_C::Clean' has a wrong offset!");
static_assert(offsetof(AToilet_C, CleanVec) == 0x00026C, "Member 'AToilet_C::CleanVec' has a wrong offset!");

}

