#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_destroyInRadius

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_destroyInRadius.trigger_destroyInRadius_C
// 0x0038 (0x02C0 - 0x0288)
class ATrigger_destroyInRadius_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_destroyInRadius_C;          // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Filter;                                            // 0x0298(0x0010)(Edit, BlueprintVisible)
	float                                         Radius;                                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5D[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x02B0(0x0010)(Edit, BlueprintVisible)

public:
	void GetTriggerData(struct FStruct_triggerSave* Data);
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void UserConstructionScript();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_trigger_destroyInRadius(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_destroyInRadius_C">();
	}
	static class ATrigger_destroyInRadius_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_destroyInRadius_C>();
	}
};
static_assert(alignof(ATrigger_destroyInRadius_C) == 0x000008, "Wrong alignment on ATrigger_destroyInRadius_C");
static_assert(sizeof(ATrigger_destroyInRadius_C) == 0x0002C0, "Wrong size on ATrigger_destroyInRadius_C");
static_assert(offsetof(ATrigger_destroyInRadius_C, UberGraphFrame_Trigger_destroyInRadius_C) == 0x000288, "Member 'ATrigger_destroyInRadius_C::UberGraphFrame_Trigger_destroyInRadius_C' has a wrong offset!");
static_assert(offsetof(ATrigger_destroyInRadius_C, Sphere) == 0x000290, "Member 'ATrigger_destroyInRadius_C::Sphere' has a wrong offset!");
static_assert(offsetof(ATrigger_destroyInRadius_C, Filter) == 0x000298, "Member 'ATrigger_destroyInRadius_C::Filter' has a wrong offset!");
static_assert(offsetof(ATrigger_destroyInRadius_C, Radius) == 0x0002A8, "Member 'ATrigger_destroyInRadius_C::Radius' has a wrong offset!");
static_assert(offsetof(ATrigger_destroyInRadius_C, Obj) == 0x0002B0, "Member 'ATrigger_destroyInRadius_C::Obj' has a wrong offset!");

}

