#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_bigmRoar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_bigmRoar.trigger_bigmRoar_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_bigmRoar_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_bigmRoar_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_bigmRoar_C_RunTrigger");
static_assert(sizeof(Trigger_bigmRoar_C_RunTrigger) == 0x000010, "Wrong size on Trigger_bigmRoar_C_RunTrigger");
static_assert(offsetof(Trigger_bigmRoar_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_bigmRoar_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_bigmRoar_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_bigmRoar_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_bigmRoar.trigger_bigmRoar_C.ExecuteUbergraph_trigger_bigmRoar
// 0x0038 (0x0038 - 0x0000)
struct Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar) == 0x000008, "Wrong alignment on Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar");
static_assert(sizeof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar) == 0x000038, "Wrong size on Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar");
static_assert(offsetof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar, EntryPoint) == 0x000000, "Member 'Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar, K2Node_Event_owner) == 0x000020, "Member 'Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar, K2Node_Event_index) == 0x000028, "Member 'Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000030, "Member 'Trigger_bigmRoar_C_ExecuteUbergraph_trigger_bigmRoar::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

}

