#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_box.trigger_box_C
// 0x0038 (0x02C0 - 0x0288)
class ATrigger_box_C : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_box_C;                      // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<ECollisionChannel>                     Colls;                                             // 0x0298(0x0010)(Edit, BlueprintVisible)
	bool                                          IsActive;                                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         Filter;                                            // 0x02B0(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_trigger_box(int32 EntryPoint);
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void SetColls();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void GamemodeBeginPlay();
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void GetTriggerData(struct FStruct_triggerSave* Data);
	void DreamInv(TArray<struct FStruct_save>& Invv, class ADreamBase_C** Base);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_box_C">();
	}
	static class ATrigger_box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_box_C>();
	}
};
static_assert(alignof(ATrigger_box_C) == 0x000008, "Wrong alignment on ATrigger_box_C");
static_assert(sizeof(ATrigger_box_C) == 0x0002C0, "Wrong size on ATrigger_box_C");
static_assert(offsetof(ATrigger_box_C, UberGraphFrame_Trigger_box_C) == 0x000288, "Member 'ATrigger_box_C::UberGraphFrame_Trigger_box_C' has a wrong offset!");
static_assert(offsetof(ATrigger_box_C, Box) == 0x000290, "Member 'ATrigger_box_C::Box' has a wrong offset!");
static_assert(offsetof(ATrigger_box_C, Colls) == 0x000298, "Member 'ATrigger_box_C::Colls' has a wrong offset!");
static_assert(offsetof(ATrigger_box_C, IsActive) == 0x0002A8, "Member 'ATrigger_box_C::IsActive' has a wrong offset!");
static_assert(offsetof(ATrigger_box_C, Filter) == 0x0002B0, "Member 'ATrigger_box_C::Filter' has a wrong offset!");

}

