#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TriggerFallingSky

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function triggerFallingSky.triggerFallingSky_C.BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'TriggerFallingSky_C_BndEvt__triggerFallingSky_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function triggerFallingSky.triggerFallingSky_C.ExecuteUbergraph_triggerFallingSky
// 0x0110 (0x0110 - 0x0000)
struct TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_hasAchievement_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkyFallingEvent_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky) == 0x000010, "Wrong alignment on TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky");
static_assert(sizeof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky) == 0x000110, "Wrong size on TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, EntryPoint) == 0x000000, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::EntryPoint' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_hasAchievement_ReturnValue) == 0x0000B0, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_hasAchievement_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000B8, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000100, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000101, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000102, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_BooleanOR_ReturnValue) == 0x000103, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky, CallFunc_BooleanAND_ReturnValue) == 0x000104, "Member 'TriggerFallingSky_C_ExecuteUbergraph_triggerFallingSky::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

