#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_eventer

#include "Basic.hpp"

#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_store_structs.hpp"
#include "Struct_storeOrder1_structs.hpp"


namespace SDK::Params
{

// Function trigger_eventer.trigger_eventer_C.ExecuteUbergraph_trigger_eventer
// 0x0850 (0x0850 - 0x0000)
struct Trigger_eventer_C_ExecuteUbergraph_trigger_eventer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_event;                          // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_special;                        // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAriralThrowStuff_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	class AAriralThrowStuff_C*                    CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUfoDropper_car_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUfoDropper_tank_C*                     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrayEventController_C*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x00F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMorningUfo_C*                          CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASoltomiaCleaning_C*                    CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FStruct_store                          K2Node_MakeStruct_struct_store;                    // 0x01C0(0x0050)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_store                          K2Node_MakeStruct_struct_store_1;                  // 0x0218(0x0050)(HasGetValueTypeHash)
	class ARozitBorg_C*                           CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_store>                  K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_storeOrder1                    K2Node_MakeStruct_struct_storeOrder1;              // 0x0288(0x0018)(HasGetValueTypeHash)
	struct FStruct_store                          K2Node_MakeStruct_struct_store_2;                  // 0x02A0(0x0050)(HasGetValueTypeHash)
	struct FStruct_store                          K2Node_MakeStruct_struct_store_3;                  // 0x02F0(0x0050)(HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_store>                  K2Node_MakeArray_Array_1;                          // 0x0348(0x0010)(ReferenceParm)
	struct FStruct_storeOrder1                    K2Node_MakeStruct_struct_storeOrder1_1;            // 0x0358(0x0018)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_5;              // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_6;              // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	class AArirBusterSpawner_C*                   CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_7;              // 0x03F0(0x0030)(IsPlainOldData, NoDestructor)
	class ASaltpile_C*                            CallFunc_FinishSpawningActor_ReturnValue_6;        // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASuperEgger_C*                          CallFunc_FinishSpawningActor_ReturnValue_7;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGenerator_C*                           CallFunc_Array_Get_Item_1;                         // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATentacleBallsFollower_C*               CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput;                // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_1;              // 0x0480(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_2;              // 0x0490(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_3;              // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_4;              // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_5;              // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_6;              // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_7;              // 0x04E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_8;              // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_9;              // 0x0508(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_10;             // 0x0518(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_11;             // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_538[0x8];                                      // 0x0538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_8;              // 0x0540(0x0030)(IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_12;             // 0x0570(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_8; // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_9;              // 0x0590(0x0030)(IsPlainOldData, NoDestructor)
	class AEvent_bottomHoleController_C*          CallFunc_FinishSpawningActor_ReturnValue_8;        // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_9; // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_10;             // 0x05D0(0x0030)(IsPlainOldData, NoDestructor)
	class AVentCrawler_C*                         CallFunc_FinishSpawningActor_ReturnValue_9;        // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_10; // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_11;             // 0x0610(0x0030)(IsPlainOldData, NoDestructor)
	class AKocker_C*                              CallFunc_FinishSpawningActor_ReturnValue_10;       // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_11; // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_12;             // 0x0650(0x0030)(IsPlainOldData, NoDestructor)
	class AUfoDropper_body_C*                     CallFunc_FinishSpawningActor_ReturnValue_11;       // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_12; // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUfoDropper_body_C*                     CallFunc_FinishSpawningActor_ReturnValue_12;       // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_13;             // 0x0698(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_14;             // 0x06A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_15;             // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_16;             // 0x06D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x3];                                      // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_17;             // 0x06E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_18;             // 0x06F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_19;             // 0x0708(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_20;             // 0x0718(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_21;             // 0x0728(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_22;             // 0x0738(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_23;             // 0x0748(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_24;             // 0x0758(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_25;             // 0x0768(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_26;             // 0x0778(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_27;             // 0x0788(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_28;             // 0x0798(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_29;             // 0x07A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_30;             // 0x07B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_31;             // 0x07C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x07D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_32;             // 0x07E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_33;             // 0x07F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_34;             // 0x0800(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_35;             // 0x0810(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_36;             // 0x0820(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_37;             // 0x0830(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IInt_ttrigger_C>       CallFunc_runTrigger_self_CastInput_38;             // 0x0840(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer) == 0x000010, "Wrong alignment on Trigger_eventer_C_ExecuteUbergraph_trigger_eventer");
static_assert(sizeof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer) == 0x000850, "Wrong size on Trigger_eventer_C_ExecuteUbergraph_trigger_eventer");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, EntryPoint) == 0x000000, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_name_Variable) == 0x000004, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_name_Variable_1) == 0x00000C, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_CustomEvent_event) == 0x000014, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_CustomEvent_event' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_CustomEvent_special) == 0x00001C, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_CustomEvent_special' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000024, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_SwitchName_CmpSuccess) == 0x000025, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_SwitchName_CmpSuccess_1) == 0x000026, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_name_Variable_2) == 0x000028, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_int_Array_Index_Variable) == 0x000030, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Get_Item) == 0x000048, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue_1) == 0x000058, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_1) == 0x000090, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_GetActorOfClass_ReturnValue) == 0x0000E0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_name_Variable_3) == 0x0000E8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_name_Variable_4) == 0x0000F0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_2) == 0x000100, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000130, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_3) == 0x000140, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000170, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000178, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000180, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_4) == 0x000190, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeStruct_struct_store) == 0x0001C0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeStruct_struct_store' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000210, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeStruct_struct_store_1) == 0x000218, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeStruct_struct_store_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x000268, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeArray_Array) == 0x000270, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000280, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeStruct_struct_storeOrder1) == 0x000288, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeStruct_struct_storeOrder1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeStruct_struct_store_2) == 0x0002A0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeStruct_struct_store_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeStruct_struct_store_3) == 0x0002F0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeStruct_struct_store_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000340, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeArray_Array_1) == 0x000348, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, K2Node_MakeStruct_struct_storeOrder1_1) == 0x000358, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::K2Node_MakeStruct_struct_storeOrder1_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_5) == 0x000370, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x0003A0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_6) == 0x0003B0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x0003E0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6) == 0x0003E8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_7) == 0x0003F0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_6) == 0x000420, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7) == 0x000428, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_7) == 0x000430, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000438, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000440, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Get_Item_1) == 0x000448, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue_2) == 0x000450, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue_3) == 0x000454, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue_4) == 0x000458, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue_5) == 0x00045C, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Array_Add_ReturnValue_6) == 0x000460, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000468, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput) == 0x000470, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_1) == 0x000480, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_2) == 0x000490, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_3) == 0x0004A0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_4) == 0x0004B0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_5) == 0x0004C0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_6) == 0x0004D0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_7) == 0x0004E0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_7' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x0004F0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_8) == 0x0004F8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_8' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_9) == 0x000508, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_9' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_10) == 0x000518, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_10' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_11) == 0x000528, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_11' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_8) == 0x000540, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_12) == 0x000570, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_12' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_8) == 0x000580, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_9) == 0x000590, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_8) == 0x0005C0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_9) == 0x0005C8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_10) == 0x0005D0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_9) == 0x000600, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_10) == 0x000608, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_11) == 0x000610, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_10) == 0x000640, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_11) == 0x000648, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_MakeTransform_ReturnValue_12) == 0x000650, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_MakeTransform_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_11) == 0x000680, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_12) == 0x000688, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_FinishSpawningActor_ReturnValue_12) == 0x000690, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_FinishSpawningActor_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_13) == 0x000698, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_13' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_14) == 0x0006A8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_14' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_15) == 0x0006B8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_15' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, Temp_int_Loop_Counter_Variable) == 0x0006C8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_16) == 0x0006D0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_16' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Less_IntInt_ReturnValue) == 0x0006E0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_Add_IntInt_ReturnValue) == 0x0006E4, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_17) == 0x0006E8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_17' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_18) == 0x0006F8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_18' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_19) == 0x000708, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_19' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_20) == 0x000718, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_20' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_21) == 0x000728, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_21' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_22) == 0x000738, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_22' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_23) == 0x000748, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_23' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_24) == 0x000758, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_24' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_25) == 0x000768, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_25' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_26) == 0x000778, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_26' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_27) == 0x000788, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_27' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_28) == 0x000798, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_28' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_29) == 0x0007A8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_29' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_30) == 0x0007B8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_30' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_31) == 0x0007C8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_31' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0007D8, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_32) == 0x0007E0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_32' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_33) == 0x0007F0, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_33' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_34) == 0x000800, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_34' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_35) == 0x000810, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_35' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_36) == 0x000820, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_36' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_37) == 0x000830, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_37' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_ExecuteUbergraph_trigger_eventer, CallFunc_runTrigger_self_CastInput_38) == 0x000840, "Member 'Trigger_eventer_C_ExecuteUbergraph_trigger_eventer::CallFunc_runTrigger_self_CastInput_38' has a wrong offset!");

// Function trigger_eventer.trigger_eventer_C.runEvent
// 0x0010 (0x0010 - 0x0000)
struct Trigger_eventer_C_RunEvent final
{
public:
	class FName                                   Event;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Special;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_eventer_C_RunEvent) == 0x000004, "Wrong alignment on Trigger_eventer_C_RunEvent");
static_assert(sizeof(Trigger_eventer_C_RunEvent) == 0x000010, "Wrong size on Trigger_eventer_C_RunEvent");
static_assert(offsetof(Trigger_eventer_C_RunEvent, Event) == 0x000000, "Member 'Trigger_eventer_C_RunEvent::Event' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_RunEvent, Special) == 0x000008, "Member 'Trigger_eventer_C_RunEvent::Special' has a wrong offset!");

// Function trigger_eventer.trigger_eventer_C.summonArirPrank
// 0x0050 (0x0050 - 0x0000)
struct Trigger_eventer_C_SummonArirPrank final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EventInd;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_calcRep_ReturnValue;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Select_Default;                             // 0x0028(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_eventer_C_SummonArirPrank) == 0x000008, "Wrong alignment on Trigger_eventer_C_SummonArirPrank");
static_assert(sizeof(Trigger_eventer_C_SummonArirPrank) == 0x000050, "Wrong size on Trigger_eventer_C_SummonArirPrank");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, EventName) == 0x000000, "Member 'Trigger_eventer_C_SummonArirPrank::EventName' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, EventInd) == 0x000008, "Member 'Trigger_eventer_C_SummonArirPrank::EventInd' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, Temp_int_Variable) == 0x00000C, "Member 'Trigger_eventer_C_SummonArirPrank::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_getSaveSlot_saveSlot) == 0x000010, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000018, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_calcRep_ReturnValue) == 0x000020, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_calcRep_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, K2Node_Select_Default) == 0x000028, "Member 'Trigger_eventer_C_SummonArirPrank::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_Array_Get_Item) == 0x000038, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_Array_Random_OutItem) == 0x000044, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Trigger_eventer_C_SummonArirPrank, CallFunc_Array_Random_OutIndex) == 0x00004C, "Member 'Trigger_eventer_C_SummonArirPrank::CallFunc_Array_Random_OutIndex' has a wrong offset!");

// Function trigger_eventer.trigger_eventer_C.runSpecialEvent
// 0x0AE0 (0x0AE0 - 0x0000)
struct Trigger_eventer_C_RunSpecialEvent final
{
public:
	class FName                                   EventName1;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EventName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Finish;                                            // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
