#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_agrav

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_agrav.trigger_agrav_C.gaher
// 0x0090 (0x0090 - 0x0000)
struct Trigger_agrav_C_Gaher final
{
public:
	TArray<EObjectTypeQuery>                      A;                                                 // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_agrav_C_Gaher) == 0x000008, "Wrong alignment on Trigger_agrav_C_Gaher");
static_assert(sizeof(Trigger_agrav_C_Gaher) == 0x000090, "Wrong size on Trigger_agrav_C_Gaher");
static_assert(offsetof(Trigger_agrav_C_Gaher, A) == 0x000000, "Member 'Trigger_agrav_C_Gaher::A' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, K2Node_MakeArray_Array) == 0x000010, "Member 'Trigger_agrav_C_Gaher::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Trigger_agrav_C_Gaher::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, Temp_object_Variable) == 0x000028, "Member 'Trigger_agrav_C_Gaher::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_Array_Get_Item) == 0x000038, "Member 'Trigger_agrav_C_Gaher::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Trigger_agrav_C_Gaher::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'Trigger_agrav_C_Gaher::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000050, "Member 'Trigger_agrav_C_Gaher::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, K2Node_DynamicCast_AsPrimitive_Component) == 0x000058, "Member 'Trigger_agrav_C_Gaher::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Trigger_agrav_C_Gaher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'Trigger_agrav_C_Gaher::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'Trigger_agrav_C_Gaher::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'Trigger_agrav_C_Gaher::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_SphereOverlapActors_OutActors) == 0x000078, "Member 'Trigger_agrav_C_Gaher::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_SphereOverlapActors_ReturnValue) == 0x000088, "Member 'Trigger_agrav_C_Gaher::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_Less_IntInt_ReturnValue) == 0x000089, "Member 'Trigger_agrav_C_Gaher::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_Gaher, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'Trigger_agrav_C_Gaher::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function trigger_agrav.trigger_agrav_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_agrav_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_agrav_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_agrav_C_RunTrigger");
static_assert(sizeof(Trigger_agrav_C_RunTrigger) == 0x000010, "Wrong size on Trigger_agrav_C_RunTrigger");
static_assert(offsetof(Trigger_agrav_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_agrav_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_agrav_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_agrav.trigger_agrav_C.cloak
// 0x0001 (0x0001 - 0x0000)
struct Trigger_agrav_C_Cloak final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_agrav_C_Cloak) == 0x000001, "Wrong alignment on Trigger_agrav_C_Cloak");
static_assert(sizeof(Trigger_agrav_C_Cloak) == 0x000001, "Wrong size on Trigger_agrav_C_Cloak");
static_assert(offsetof(Trigger_agrav_C_Cloak, Forward) == 0x000000, "Member 'Trigger_agrav_C_Cloak::Forward' has a wrong offset!");

// Function trigger_agrav.trigger_agrav_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Trigger_agrav_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_agrav_C_ReceiveTick) == 0x000004, "Wrong alignment on Trigger_agrav_C_ReceiveTick");
static_assert(sizeof(Trigger_agrav_C_ReceiveTick) == 0x000004, "Wrong size on Trigger_agrav_C_ReceiveTick");
static_assert(offsetof(Trigger_agrav_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Trigger_agrav_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function trigger_agrav.trigger_agrav_C.ExecuteUbergraph_trigger_agrav
// 0x0118 (0x0118 - 0x0000)
struct Trigger_agrav_C_ExecuteUbergraph_trigger_agrav final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_forward;                        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav) == 0x000008, "Wrong alignment on Trigger_agrav_C_ExecuteUbergraph_trigger_agrav");
static_assert(sizeof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav) == 0x000118, "Wrong size on Trigger_agrav_C_ExecuteUbergraph_trigger_agrav");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, EntryPoint) == 0x000000, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_RandomUnitVector_ReturnValue) == 0x00001C, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_RandomFloatInRange_ReturnValue) == 0x000028, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00002C, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Array_Get_Item) == 0x000040, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000048, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00004C, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000050, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000054, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000060, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000070, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, K2Node_Event_owner) == 0x000078, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, K2Node_Event_index) == 0x000080, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, K2Node_CustomEvent_forward) == 0x000084, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::K2Node_CustomEvent_forward' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000088, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000094, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000098, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000A0, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0000A8, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Lerp_ReturnValue) == 0x0000B0, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B8, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0000BC, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0000C0, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C8, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D4, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000E0, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000EC, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Normal_ReturnValue) == 0x0000F8, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Dot_VectorVector_ReturnValue) == 0x000104, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_FClamp_ReturnValue) == 0x000108, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00010C, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_agrav_C_ExecuteUbergraph_trigger_agrav, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000110, "Member 'Trigger_agrav_C_ExecuteUbergraph_trigger_agrav::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

}

