#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_lockerLooker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_lockerLooker.trigger_lockerLooker_C
// 0x0018 (0x02A0 - 0x0288)
class ATrigger_lockerLooker_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_lockerLooker_C;             // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Run;                                               // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void IgnoreSave_trigger(bool* Ignore);
	void ReceiveTick(float DeltaSeconds);
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void ExecuteUbergraph_trigger_lockerLooker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_lockerLooker_C">();
	}
	static class ATrigger_lockerLooker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_lockerLooker_C>();
	}
};
static_assert(alignof(ATrigger_lockerLooker_C) == 0x000008, "Wrong alignment on ATrigger_lockerLooker_C");
static_assert(sizeof(ATrigger_lockerLooker_C) == 0x0002A0, "Wrong size on ATrigger_lockerLooker_C");
static_assert(offsetof(ATrigger_lockerLooker_C, UberGraphFrame_Trigger_lockerLooker_C) == 0x000288, "Member 'ATrigger_lockerLooker_C::UberGraphFrame_Trigger_lockerLooker_C' has a wrong offset!");
static_assert(offsetof(ATrigger_lockerLooker_C, Cube) == 0x000290, "Member 'ATrigger_lockerLooker_C::Cube' has a wrong offset!");
static_assert(offsetof(ATrigger_lockerLooker_C, Run) == 0x000298, "Member 'ATrigger_lockerLooker_C::Run' has a wrong offset!");

}

