#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_arirEgg

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_arirEgg.trigger_arirEgg_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_arirEgg_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_arirEgg_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_arirEgg_C_RunTrigger");
static_assert(sizeof(Trigger_arirEgg_C_RunTrigger) == 0x000010, "Wrong size on Trigger_arirEgg_C_RunTrigger");
static_assert(offsetof(Trigger_arirEgg_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_arirEgg_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_arirEgg_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_arirEgg.trigger_arirEgg_C.ExecuteUbergraph_trigger_arirEgg
// 0x0080 (0x0080 - 0x0000)
struct Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D88[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D89[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8A[0xC];                                     // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_arirEgg_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg) == 0x000010, "Wrong alignment on Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg");
static_assert(sizeof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg) == 0x000080, "Wrong size on Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, EntryPoint) == 0x000000, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, Temp_bool_Has_Been_Initd_Variable) == 0x000008, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, Temp_int_Variable) == 0x00000C, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, Temp_bool_IsClosed_Variable) == 0x000015, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, K2Node_Event_owner) == 0x000018, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, K2Node_Event_index) == 0x000020, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000068, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'Trigger_arirEgg_C_ExecuteUbergraph_trigger_arirEgg::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

