#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_teleporter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_teleporter.trigger_teleporter_C.BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4388[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Trigger_teleporter_C_BndEvt__trigger_teleporter_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function trigger_teleporter.trigger_teleporter_C.ExecuteUbergraph_trigger_teleporter
// 0x0150 (0x0150 - 0x0000)
struct Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4389[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_438A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0030(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter) == 0x000008, "Wrong alignment on Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter");
static_assert(sizeof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter) == 0x000150, "Wrong size on Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, EntryPoint) == 0x000000, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, CallFunc_Array_Get_Item) == 0x000008, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000010, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, K2Node_ComponentBoundEvent_OtherActor) == 0x000018, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, K2Node_ComponentBoundEvent_OtherComp) == 0x000020, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000028, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, K2Node_ComponentBoundEvent_bFromSweep) == 0x00002C, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, K2Node_ComponentBoundEvent_SweepResult) == 0x000030, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000C4, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00014C, "Member 'Trigger_teleporter_C_ExecuteUbergraph_trigger_teleporter::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

