#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_solarBoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_solarBoom.trigger_solarBoom_C
// 0x0028 (0x02B0 - 0x0288)
class ATrigger_solarBoom_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_solarBoom_C;                // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ATrigger_lightRoot_C*>           Roots;                                             // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class FString>                         Roots_keys;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void ExecuteUbergraph_trigger_solarBoom(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_solarBoom_C">();
	}
	static class ATrigger_solarBoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_solarBoom_C>();
	}
};
static_assert(alignof(ATrigger_solarBoom_C) == 0x000008, "Wrong alignment on ATrigger_solarBoom_C");
static_assert(sizeof(ATrigger_solarBoom_C) == 0x0002B0, "Wrong size on ATrigger_solarBoom_C");
static_assert(offsetof(ATrigger_solarBoom_C, UberGraphFrame_Trigger_solarBoom_C) == 0x000288, "Member 'ATrigger_solarBoom_C::UberGraphFrame_Trigger_solarBoom_C' has a wrong offset!");
static_assert(offsetof(ATrigger_solarBoom_C, Roots) == 0x000290, "Member 'ATrigger_solarBoom_C::Roots' has a wrong offset!");
static_assert(offsetof(ATrigger_solarBoom_C, Roots_keys) == 0x0002A0, "Member 'ATrigger_solarBoom_C::Roots_keys' has a wrong offset!");

}

