#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_destroyInRadius

#include "Basic.hpp"

#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_destroyInRadius.trigger_destroyInRadius_C.getTriggerData
// 0x02E0 (0x02E0 - 0x0000)
struct Trigger_destroyInRadius_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	struct FStruct_triggerSave                    CallFunc_getTriggerData_data;                      // 0x0100(0x00F0)(HasGetValueTypeHash)
	struct FStruct_triggerSave                    K2Node_SetFieldsInStruct_StructOut;                // 0x01F0(0x00F0)(HasGetValueTypeHash)
};
static_assert(alignof(Trigger_destroyInRadius_C_GetTriggerData) == 0x000010, "Wrong alignment on Trigger_destroyInRadius_C_GetTriggerData");
static_assert(sizeof(Trigger_destroyInRadius_C_GetTriggerData) == 0x0002E0, "Wrong size on Trigger_destroyInRadius_C_GetTriggerData");
static_assert(offsetof(Trigger_destroyInRadius_C_GetTriggerData, Data) == 0x000000, "Member 'Trigger_destroyInRadius_C_GetTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_GetTriggerData, K2Node_MakeArray_Array) == 0x0000F0, "Member 'Trigger_destroyInRadius_C_GetTriggerData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_GetTriggerData, CallFunc_getTriggerData_data) == 0x000100, "Member 'Trigger_destroyInRadius_C_GetTriggerData::CallFunc_getTriggerData_data' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_GetTriggerData, K2Node_SetFieldsInStruct_StructOut) == 0x0001F0, "Member 'Trigger_destroyInRadius_C_GetTriggerData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function trigger_destroyInRadius.trigger_destroyInRadius_C.loadTriggerData
// 0x0110 (0x0110 - 0x0000)
struct Trigger_destroyInRadius_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_loadTriggerData_return;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5E[0x2];                                     // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Array_Get_Item_1;                         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5F[0x1];                                     // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_destroyInRadius_C_LoadTriggerData) == 0x000010, "Wrong alignment on Trigger_destroyInRadius_C_LoadTriggerData");
static_assert(sizeof(Trigger_destroyInRadius_C_LoadTriggerData) == 0x000110, "Wrong size on Trigger_destroyInRadius_C_LoadTriggerData");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, Data) == 0x000000, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, Return) == 0x0000F0, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::Return' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_loadTriggerData_return) == 0x0000F1, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_loadTriggerData_return' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_Array_Get_Item) == 0x0000F4, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, Temp_int_Array_Index_Variable) == 0x0000FC, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, Temp_int_Loop_Counter_Variable) == 0x000100, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_Array_Get_Item_1) == 0x000104, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_GetValidValue_ReturnValue) == 0x000105, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_Less_IntInt_ReturnValue) == 0x000106, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_Add_IntInt_ReturnValue) == 0x000108, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_LoadTriggerData, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'Trigger_destroyInRadius_C_LoadTriggerData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function trigger_destroyInRadius.trigger_destroyInRadius_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_destroyInRadius_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_destroyInRadius_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_destroyInRadius_C_RunTrigger");
static_assert(sizeof(Trigger_destroyInRadius_C_RunTrigger) == 0x000010, "Wrong size on Trigger_destroyInRadius_C_RunTrigger");
static_assert(offsetof(Trigger_destroyInRadius_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_destroyInRadius_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_destroyInRadius_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_destroyInRadius.trigger_destroyInRadius_C.ExecuteUbergraph_trigger_destroyInRadius
// 0x0078 (0x0078 - 0x0000)
struct Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_Event_owner;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A60[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A61[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius) == 0x000008, "Wrong alignment on Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius");
static_assert(sizeof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius) == 0x000078, "Wrong size on Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, EntryPoint) == 0x000000, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, Temp_int_Variable) == 0x000004, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, Temp_object_Variable) == 0x000010, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, K2Node_Event_owner) == 0x000020, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, K2Node_Event_index) == 0x000028, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Array_Get_Item) == 0x000040, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_SphereOverlapActors_OutActors) == 0x000050, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_SphereOverlapActors_ReturnValue) == 0x000060, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius, CallFunc_Less_IntInt_ReturnValue_1) == 0x000074, "Member 'Trigger_destroyInRadius_C_ExecuteUbergraph_trigger_destroyInRadius::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

