#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_TBoxActivator

#include "Basic.hpp"

#include "Struct_triggerSave_structs.hpp"


namespace SDK::Params
{

// Function trigger_TBoxActivator.trigger_TBoxActivator_C.getTriggerData
// 0x02E0 (0x02E0 - 0x0000)
struct Trigger_TBoxActivator_C_GetTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(Parm, OutParm, HasGetValueTypeHash)
	struct FStruct_triggerSave                    CallFunc_getTriggerData_data;                      // 0x00F0(0x00F0)(HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	struct FStruct_triggerSave                    K2Node_SetFieldsInStruct_StructOut;                // 0x01F0(0x00F0)(HasGetValueTypeHash)
};
static_assert(alignof(Trigger_TBoxActivator_C_GetTriggerData) == 0x000010, "Wrong alignment on Trigger_TBoxActivator_C_GetTriggerData");
static_assert(sizeof(Trigger_TBoxActivator_C_GetTriggerData) == 0x0002E0, "Wrong size on Trigger_TBoxActivator_C_GetTriggerData");
static_assert(offsetof(Trigger_TBoxActivator_C_GetTriggerData, Data) == 0x000000, "Member 'Trigger_TBoxActivator_C_GetTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_GetTriggerData, CallFunc_getTriggerData_data) == 0x0000F0, "Member 'Trigger_TBoxActivator_C_GetTriggerData::CallFunc_getTriggerData_data' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_GetTriggerData, K2Node_MakeArray_Array) == 0x0001E0, "Member 'Trigger_TBoxActivator_C_GetTriggerData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_GetTriggerData, K2Node_SetFieldsInStruct_StructOut) == 0x0001F0, "Member 'Trigger_TBoxActivator_C_GetTriggerData::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

// Function trigger_TBoxActivator.trigger_TBoxActivator_C.loadTriggerData
// 0x0130 (0x0130 - 0x0000)
struct Trigger_TBoxActivator_C_LoadTriggerData final
{
public:
	struct FStruct_triggerSave                    Data;                                              // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_loadTriggerData_return;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrigger_box_C*                         K2Node_DynamicCast_AsTrigger_Box;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_TBoxActivator_C_LoadTriggerData) == 0x000010, "Wrong alignment on Trigger_TBoxActivator_C_LoadTriggerData");
static_assert(sizeof(Trigger_TBoxActivator_C_LoadTriggerData) == 0x000130, "Wrong size on Trigger_TBoxActivator_C_LoadTriggerData");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, Data) == 0x000000, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::Data' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, Return) == 0x0000F0, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::Return' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000F8, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, CallFunc_loadTriggerData_return) == 0x000100, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::CallFunc_loadTriggerData_return' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, CallFunc_Array_Get_Item) == 0x000108, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, CallFunc_getObjectFromKey_Output) == 0x000118, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, K2Node_DynamicCast_AsTrigger_Box) == 0x000120, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::K2Node_DynamicCast_AsTrigger_Box' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_LoadTriggerData, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'Trigger_TBoxActivator_C_LoadTriggerData::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function trigger_TBoxActivator.trigger_TBoxActivator_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct Trigger_TBoxActivator_C_UserConstructionScript final
{
public:
	TScriptInterface<class IInt_objects_C>        CallFunc_getKey_self_CastInput;                    // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_getKey_key;                               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_TBoxActivator_C_UserConstructionScript) == 0x000008, "Wrong alignment on Trigger_TBoxActivator_C_UserConstructionScript");
static_assert(sizeof(Trigger_TBoxActivator_C_UserConstructionScript) == 0x000020, "Wrong size on Trigger_TBoxActivator_C_UserConstructionScript");
static_assert(offsetof(Trigger_TBoxActivator_C_UserConstructionScript, CallFunc_getKey_self_CastInput) == 0x000000, "Member 'Trigger_TBoxActivator_C_UserConstructionScript::CallFunc_getKey_self_CastInput' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_UserConstructionScript, CallFunc_getKey_key) == 0x000010, "Member 'Trigger_TBoxActivator_C_UserConstructionScript::CallFunc_getKey_key' has a wrong offset!");

// Function trigger_TBoxActivator.trigger_TBoxActivator_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_TBoxActivator_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_TBoxActivator_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_TBoxActivator_C_RunTrigger");
static_assert(sizeof(Trigger_TBoxActivator_C_RunTrigger) == 0x000010, "Wrong size on Trigger_TBoxActivator_C_RunTrigger");
static_assert(offsetof(Trigger_TBoxActivator_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_TBoxActivator_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_TBoxActivator_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_TBoxActivator.trigger_TBoxActivator_C.ExecuteUbergraph_trigger_TBoxActivator
// 0x0038 (0x0038 - 0x0000)
struct Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrigger_box_C*                         K2Node_DynamicCast_AsTrigger_Box;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator) == 0x000008, "Wrong alignment on Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator");
static_assert(sizeof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator) == 0x000038, "Wrong size on Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, EntryPoint) == 0x000000, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, K2Node_Event_owner) == 0x000010, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, K2Node_Event_index) == 0x000018, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, CallFunc_getObjectFromKey_Output) == 0x000020, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, K2Node_DynamicCast_AsTrigger_Box) == 0x000028, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::K2Node_DynamicCast_AsTrigger_Box' has a wrong offset!");
static_assert(offsetof(Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Trigger_TBoxActivator_C_ExecuteUbergraph_trigger_TBoxActivator::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

