#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_spawnProp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_spawnProp.trigger_spawnProp_C
// 0x0088 (0x0310 - 0x0288)
class ATrigger_spawnProp_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_spawnProp_C;                // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Des;                                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Prop;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         OnSpawned_trigger;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OnSpawned_key;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CheckRendered;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43B9[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoor_C*                                Door;                                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Door_key;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Frozen;                                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Static;                                            // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43BA[0x5];                                     // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomKey;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 Spawned;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Spawned_key;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ProcessKeys(bool* Return);
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void GetTriggerData(struct FStruct_triggerSave* Data);
	void UserConstructionScript();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_trigger_spawnProp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_spawnProp_C">();
	}
	static class ATrigger_spawnProp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_spawnProp_C>();
	}
};
static_assert(alignof(ATrigger_spawnProp_C) == 0x000008, "Wrong alignment on ATrigger_spawnProp_C");
static_assert(sizeof(ATrigger_spawnProp_C) == 0x000310, "Wrong size on ATrigger_spawnProp_C");
static_assert(offsetof(ATrigger_spawnProp_C, UberGraphFrame_Trigger_spawnProp_C) == 0x000288, "Member 'ATrigger_spawnProp_C::UberGraphFrame_Trigger_spawnProp_C' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, StaticMesh) == 0x000290, "Member 'ATrigger_spawnProp_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Des) == 0x000298, "Member 'ATrigger_spawnProp_C::Des' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Prop) == 0x0002A0, "Member 'ATrigger_spawnProp_C::Prop' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, OnSpawned_trigger) == 0x0002A8, "Member 'ATrigger_spawnProp_C::OnSpawned_trigger' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, OnSpawned_key) == 0x0002B0, "Member 'ATrigger_spawnProp_C::OnSpawned_key' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, CheckRendered) == 0x0002C0, "Member 'ATrigger_spawnProp_C::CheckRendered' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Door) == 0x0002C8, "Member 'ATrigger_spawnProp_C::Door' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Door_key) == 0x0002D0, "Member 'ATrigger_spawnProp_C::Door_key' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Frozen) == 0x0002E0, "Member 'ATrigger_spawnProp_C::Frozen' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Static) == 0x0002E1, "Member 'ATrigger_spawnProp_C::Static' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Active) == 0x0002E2, "Member 'ATrigger_spawnProp_C::Active' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, CustomKey) == 0x0002E8, "Member 'ATrigger_spawnProp_C::CustomKey' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Spawned) == 0x0002F8, "Member 'ATrigger_spawnProp_C::Spawned' has a wrong offset!");
static_assert(offsetof(ATrigger_spawnProp_C, Spawned_key) == 0x000300, "Member 'ATrigger_spawnProp_C::Spawned_key' has a wrong offset!");

}

