#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_wispSwarm

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_wispSwarm.trigger_wispSwarm_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_wispSwarm_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_wispSwarm_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_wispSwarm_C_RunTrigger");
static_assert(sizeof(Trigger_wispSwarm_C_RunTrigger) == 0x000010, "Wrong size on Trigger_wispSwarm_C_RunTrigger");
static_assert(offsetof(Trigger_wispSwarm_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_wispSwarm_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_wispSwarm_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_wispSwarm.trigger_wispSwarm_C.ExecuteUbergraph_trigger_wispSwarm
// 0x0090 (0x0090 - 0x0000)
struct Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D2[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D3[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWisp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm) == 0x000010, "Wrong alignment on Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm");
static_assert(sizeof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm) == 0x000090, "Wrong size on Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, EntryPoint) == 0x000000, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, Temp_bool_Has_Been_Initd_Variable) == 0x000008, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, Temp_int_Variable) == 0x00000C, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, Temp_bool_IsClosed_Variable) == 0x000015, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00001C, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, K2Node_Event_owner) == 0x000020, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, K2Node_Event_index) == 0x000028, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_RotateAngleAxis_ReturnValue) == 0x000038, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_Add_VectorVector_ReturnValue) == 0x000044, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Trigger_wispSwarm_C_ExecuteUbergraph_trigger_wispSwarm::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

