#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_ambientSound

#include "Basic.hpp"


namespace SDK::Params
{

// Function trigger_ambientSound.trigger_ambientSound_C.upd
// 0x000C (0x000C - 0x0000)
struct Trigger_ambientSound_C_Upd final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_ambientSound_C_Upd) == 0x000004, "Wrong alignment on Trigger_ambientSound_C_Upd");
static_assert(sizeof(Trigger_ambientSound_C_Upd) == 0x00000C, "Wrong size on Trigger_ambientSound_C_Upd");
static_assert(offsetof(Trigger_ambientSound_C_Upd, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'Trigger_ambientSound_C_Upd::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_ambientSound_C_Upd, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000004, "Member 'Trigger_ambientSound_C_Upd::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_ambientSound_C_Upd, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000008, "Member 'Trigger_ambientSound_C_Upd::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function trigger_ambientSound.trigger_ambientSound_C.setVol2
// 0x0004 (0x0004 - 0x0000)
struct Trigger_ambientSound_C_SetVol2 final
{
public:
	float                                         Param_Volume_2;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_ambientSound_C_SetVol2) == 0x000004, "Wrong alignment on Trigger_ambientSound_C_SetVol2");
static_assert(sizeof(Trigger_ambientSound_C_SetVol2) == 0x000004, "Wrong size on Trigger_ambientSound_C_SetVol2");
static_assert(offsetof(Trigger_ambientSound_C_SetVol2, Param_Volume_2) == 0x000000, "Member 'Trigger_ambientSound_C_SetVol2::Param_Volume_2' has a wrong offset!");

// Function trigger_ambientSound.trigger_ambientSound_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Trigger_ambientSound_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_ambientSound_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on Trigger_ambientSound_C_IgnoreSave_trigger");
static_assert(sizeof(Trigger_ambientSound_C_IgnoreSave_trigger) == 0x000001, "Wrong size on Trigger_ambientSound_C_IgnoreSave_trigger");
static_assert(offsetof(Trigger_ambientSound_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'Trigger_ambientSound_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

}

