#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_tpChamberSpawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_tpChamberSpawn.trigger_tpChamberSpawn_C
// 0x0058 (0x02E0 - 0x0288)
class ATrigger_tpChamberSpawn_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_tpChamberSpawn_C;           // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight1;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ChamberAppear;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Lig_b_AC12800D44E26935E05D849CB645F745;            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lig_a_AC12800D44E26935E05D849CB645F745;            // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Lig__Direction_AC12800D44E26935E05D849CB645F745;   // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4331[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Lig;                                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUmg_blur_C*                            blur;                                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Lig__FinishedFunc();
	void Lig__UpdateFunc();
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void ExecuteUbergraph_trigger_tpChamberSpawn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_tpChamberSpawn_C">();
	}
	static class ATrigger_tpChamberSpawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_tpChamberSpawn_C>();
	}
};
static_assert(alignof(ATrigger_tpChamberSpawn_C) == 0x000008, "Wrong alignment on ATrigger_tpChamberSpawn_C");
static_assert(sizeof(ATrigger_tpChamberSpawn_C) == 0x0002E0, "Wrong size on ATrigger_tpChamberSpawn_C");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, UberGraphFrame_Trigger_tpChamberSpawn_C) == 0x000288, "Member 'ATrigger_tpChamberSpawn_C::UberGraphFrame_Trigger_tpChamberSpawn_C' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, PointLight1) == 0x000290, "Member 'ATrigger_tpChamberSpawn_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, ChamberAppear) == 0x000298, "Member 'ATrigger_tpChamberSpawn_C::ChamberAppear' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, PointLight) == 0x0002A0, "Member 'ATrigger_tpChamberSpawn_C::PointLight' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, StaticMesh) == 0x0002A8, "Member 'ATrigger_tpChamberSpawn_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, Lig_b_AC12800D44E26935E05D849CB645F745) == 0x0002B0, "Member 'ATrigger_tpChamberSpawn_C::Lig_b_AC12800D44E26935E05D849CB645F745' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, Lig_a_AC12800D44E26935E05D849CB645F745) == 0x0002B4, "Member 'ATrigger_tpChamberSpawn_C::Lig_a_AC12800D44E26935E05D849CB645F745' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, Lig__Direction_AC12800D44E26935E05D849CB645F745) == 0x0002B8, "Member 'ATrigger_tpChamberSpawn_C::Lig__Direction_AC12800D44E26935E05D849CB645F745' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, Lig) == 0x0002C0, "Member 'ATrigger_tpChamberSpawn_C::Lig' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, Obj) == 0x0002C8, "Member 'ATrigger_tpChamberSpawn_C::Obj' has a wrong offset!");
static_assert(offsetof(ATrigger_tpChamberSpawn_C, blur) == 0x0002D8, "Member 'ATrigger_tpChamberSpawn_C::blur' has a wrong offset!");

}

