#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_jamDoor

#include "Basic.hpp"


namespace SDK::Params
{

// Function trigger_jamDoor.trigger_jamDoor_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_jamDoor_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_jamDoor_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_jamDoor_C_RunTrigger");
static_assert(sizeof(Trigger_jamDoor_C_RunTrigger) == 0x000010, "Wrong size on Trigger_jamDoor_C_RunTrigger");
static_assert(offsetof(Trigger_jamDoor_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_jamDoor_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_jamDoor_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_jamDoor.trigger_jamDoor_C.ExecuteUbergraph_trigger_jamDoor
// 0x0040 (0x0040 - 0x0000)
struct Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_owner;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1D[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor) == 0x000008, "Wrong alignment on Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor");
static_assert(sizeof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor) == 0x000040, "Wrong size on Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, EntryPoint) == 0x000000, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, K2Node_Event_owner) == 0x000010, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, K2Node_Event_index) == 0x000018, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, CallFunc_Array_Get_Item) == 0x000020, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, K2Node_DynamicCast_AsDoor) == 0x000030, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::K2Node_DynamicCast_AsDoor' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'Trigger_jamDoor_C_ExecuteUbergraph_trigger_jamDoor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

