#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_lockerLooker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function trigger_lockerLooker.trigger_lockerLooker_C.ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct Trigger_lockerLooker_C_IgnoreSave_trigger final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_lockerLooker_C_IgnoreSave_trigger) == 0x000001, "Wrong alignment on Trigger_lockerLooker_C_IgnoreSave_trigger");
static_assert(sizeof(Trigger_lockerLooker_C_IgnoreSave_trigger) == 0x000001, "Wrong size on Trigger_lockerLooker_C_IgnoreSave_trigger");
static_assert(offsetof(Trigger_lockerLooker_C_IgnoreSave_trigger, Ignore) == 0x000000, "Member 'Trigger_lockerLooker_C_IgnoreSave_trigger::Ignore' has a wrong offset!");

// Function trigger_lockerLooker.trigger_lockerLooker_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Trigger_lockerLooker_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_lockerLooker_C_ReceiveTick) == 0x000004, "Wrong alignment on Trigger_lockerLooker_C_ReceiveTick");
static_assert(sizeof(Trigger_lockerLooker_C_ReceiveTick) == 0x000004, "Wrong size on Trigger_lockerLooker_C_ReceiveTick");
static_assert(offsetof(Trigger_lockerLooker_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Trigger_lockerLooker_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function trigger_lockerLooker.trigger_lockerLooker_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct Trigger_lockerLooker_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trigger_lockerLooker_C_RunTrigger) == 0x000008, "Wrong alignment on Trigger_lockerLooker_C_RunTrigger");
static_assert(sizeof(Trigger_lockerLooker_C_RunTrigger) == 0x000010, "Wrong size on Trigger_lockerLooker_C_RunTrigger");
static_assert(offsetof(Trigger_lockerLooker_C_RunTrigger, Param_Owner) == 0x000000, "Member 'Trigger_lockerLooker_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_RunTrigger, Param_Index) == 0x000008, "Member 'Trigger_lockerLooker_C_RunTrigger::Param_Index' has a wrong offset!");

// Function trigger_lockerLooker.trigger_lockerLooker_C.ExecuteUbergraph_trigger_lockerLooker
// 0x0118 (0x0118 - 0x0000)
struct Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UblackScreen_C*                         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x0038(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0078(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker) == 0x000008, "Wrong alignment on Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker");
static_assert(sizeof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker) == 0x000118, "Wrong size on Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, EntryPoint) == 0x000000, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_Create_ReturnValue) == 0x000010, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, Temp_name_Variable) == 0x000018, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, K2Node_Event_owner) == 0x000028, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, K2Node_Event_index) == 0x000030, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, K2Node_SwitchInteger_CmpSuccess) == 0x000034, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_obj_statDyn_obj) == 0x000038, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000058, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000060, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_SaveGameToSlot_ReturnValue) == 0x000074, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_Array_RemoveItem_ReturnValue) == 0x000075, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_SetGamePaused_ReturnValue) == 0x000076, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, Temp_object_Variable) == 0x000078, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000088, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000110, "Member 'Trigger_lockerLooker_C_ExecuteUbergraph_trigger_lockerLooker::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");

}

