#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_eventer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_eventer.trigger_eventer_C
// 0x0158 (0x03E0 - 0x0288)
class ATrigger_eventer_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_eventer_C;                  // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATriggerBase_C*                         Event_arirShip;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_solar;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_falseEnter;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirSignal;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_vehicletp;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_agrav;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_mann;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirSpk;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirpicSignal;                               // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_peace;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_bigmRoar;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_wisps;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrigger_spawnFollowingArir_C*          Event_arirFollower;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirEgg;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_vent;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_crys;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_fakeGrays;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_treehouse_0;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_picnic;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_breakVictor;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_break_RomeoSierra;                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_destoyPicnic;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_toeStab;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_cookier;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_susArir;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirSat_0;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirSat_1;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_arirSat_2;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_bedEvent;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_paperGray;                                   // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_treehouse_build_1;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_treehouse_build_2;                           // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_treehouse_build_3;                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_treehouse_build_4;                           // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_treehouse_build_5;                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_obelisk;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_piramid;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase_C*                         Event_piramid_sig;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAriralThrowStuff_C*>            AriralThrowers_bad;                                // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AAriralThrowStuff_C*>            AriralThrowers_good;                               // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_trigger_eventer(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RunEvent(class FName Event, class FName Special);
	void SummonArirPrank();
	void RunSpecialEvent(class FName EventName1);
	void GamemodeBeginPlay();
	void UserConstructionScript();
	void LoadTriggerData(const struct FStruct_triggerSave& Data, bool* Return);
	void ProcessKeys(bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_eventer_C">();
	}
	static class ATrigger_eventer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_eventer_C>();
	}
};
static_assert(alignof(ATrigger_eventer_C) == 0x000008, "Wrong alignment on ATrigger_eventer_C");
static_assert(sizeof(ATrigger_eventer_C) == 0x0003E0, "Wrong size on ATrigger_eventer_C");
static_assert(offsetof(ATrigger_eventer_C, UberGraphFrame_Trigger_eventer_C) == 0x000288, "Member 'ATrigger_eventer_C::UberGraphFrame_Trigger_eventer_C' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirShip) == 0x000290, "Member 'ATrigger_eventer_C::Event_arirShip' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_solar) == 0x000298, "Member 'ATrigger_eventer_C::Event_solar' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_falseEnter) == 0x0002A0, "Member 'ATrigger_eventer_C::Event_falseEnter' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirSignal) == 0x0002A8, "Member 'ATrigger_eventer_C::Event_arirSignal' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_vehicletp) == 0x0002B0, "Member 'ATrigger_eventer_C::Event_vehicletp' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_agrav) == 0x0002B8, "Member 'ATrigger_eventer_C::Event_agrav' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_mann) == 0x0002C0, "Member 'ATrigger_eventer_C::Event_mann' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirSpk) == 0x0002C8, "Member 'ATrigger_eventer_C::Event_arirSpk' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirpicSignal) == 0x0002D0, "Member 'ATrigger_eventer_C::Event_arirpicSignal' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_peace) == 0x0002D8, "Member 'ATrigger_eventer_C::Event_peace' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_bigmRoar) == 0x0002E0, "Member 'ATrigger_eventer_C::Event_bigmRoar' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_wisps) == 0x0002E8, "Member 'ATrigger_eventer_C::Event_wisps' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirFollower) == 0x0002F0, "Member 'ATrigger_eventer_C::Event_arirFollower' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirEgg) == 0x0002F8, "Member 'ATrigger_eventer_C::Event_arirEgg' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_vent) == 0x000300, "Member 'ATrigger_eventer_C::Event_vent' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_crys) == 0x000308, "Member 'ATrigger_eventer_C::Event_crys' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_fakeGrays) == 0x000310, "Member 'ATrigger_eventer_C::Event_fakeGrays' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_treehouse_0) == 0x000318, "Member 'ATrigger_eventer_C::Event_treehouse_0' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_picnic) == 0x000320, "Member 'ATrigger_eventer_C::Event_picnic' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_breakVictor) == 0x000328, "Member 'ATrigger_eventer_C::Event_breakVictor' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_break_RomeoSierra) == 0x000330, "Member 'ATrigger_eventer_C::Event_break_RomeoSierra' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_destoyPicnic) == 0x000338, "Member 'ATrigger_eventer_C::Event_destoyPicnic' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_toeStab) == 0x000340, "Member 'ATrigger_eventer_C::Event_toeStab' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_cookier) == 0x000348, "Member 'ATrigger_eventer_C::Event_cookier' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_susArir) == 0x000350, "Member 'ATrigger_eventer_C::Event_susArir' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirSat_0) == 0x000358, "Member 'ATrigger_eventer_C::Event_arirSat_0' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirSat_1) == 0x000360, "Member 'ATrigger_eventer_C::Event_arirSat_1' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_arirSat_2) == 0x000368, "Member 'ATrigger_eventer_C::Event_arirSat_2' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_bedEvent) == 0x000370, "Member 'ATrigger_eventer_C::Event_bedEvent' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_paperGray) == 0x000378, "Member 'ATrigger_eventer_C::Event_paperGray' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_treehouse_build_1) == 0x000380, "Member 'ATrigger_eventer_C::Event_treehouse_build_1' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_treehouse_build_2) == 0x000388, "Member 'ATrigger_eventer_C::Event_treehouse_build_2' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_treehouse_build_3) == 0x000390, "Member 'ATrigger_eventer_C::Event_treehouse_build_3' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_treehouse_build_4) == 0x000398, "Member 'ATrigger_eventer_C::Event_treehouse_build_4' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_treehouse_build_5) == 0x0003A0, "Member 'ATrigger_eventer_C::Event_treehouse_build_5' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_obelisk) == 0x0003A8, "Member 'ATrigger_eventer_C::Event_obelisk' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_piramid) == 0x0003B0, "Member 'ATrigger_eventer_C::Event_piramid' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, Event_piramid_sig) == 0x0003B8, "Member 'ATrigger_eventer_C::Event_piramid_sig' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, AriralThrowers_bad) == 0x0003C0, "Member 'ATrigger_eventer_C::AriralThrowers_bad' has a wrong offset!");
static_assert(offsetof(ATrigger_eventer_C, AriralThrowers_good) == 0x0003D0, "Member 'ATrigger_eventer_C::AriralThrowers_good' has a wrong offset!");

}

