#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trigger_alarm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TriggerBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass trigger_alarm.trigger_alarm_C
// 0x0028 (0x02B0 - 0x0288)
class ATrigger_alarm_C final : public ATriggerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Trigger_alarm_C;                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio1;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAlarmLamp_C*>                   Alarms;                                            // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void ExecuteUbergraph_trigger_alarm(int32 EntryPoint);
	void RunTrigger(class AActor* Param_Owner, int32 Param_Index);
	void ProcessKeys(bool* Return);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"trigger_alarm_C">();
	}
	static class ATrigger_alarm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrigger_alarm_C>();
	}
};
static_assert(alignof(ATrigger_alarm_C) == 0x000008, "Wrong alignment on ATrigger_alarm_C");
static_assert(sizeof(ATrigger_alarm_C) == 0x0002B0, "Wrong size on ATrigger_alarm_C");
static_assert(offsetof(ATrigger_alarm_C, UberGraphFrame_Trigger_alarm_C) == 0x000288, "Member 'ATrigger_alarm_C::UberGraphFrame_Trigger_alarm_C' has a wrong offset!");
static_assert(offsetof(ATrigger_alarm_C, Audio1) == 0x000290, "Member 'ATrigger_alarm_C::Audio1' has a wrong offset!");
static_assert(offsetof(ATrigger_alarm_C, Active) == 0x000298, "Member 'ATrigger_alarm_C::Active' has a wrong offset!");
static_assert(offsetof(ATrigger_alarm_C, Alarms) == 0x0002A0, "Member 'ATrigger_alarm_C::Alarms' has a wrong offset!");

}

