#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TriggerBase

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Struct_triggerSave_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function triggerBase.triggerBase_C.ExecuteUbergraph_triggerBase
// 0x06C8 (0x06C8 - 0x0000)
struct TriggerBase_C_ExecuteUbergraph_triggerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0010(0x00F0)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key_2;                                // 0x0100(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed_1;                            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0148(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_actor_1;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact_1;                             // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active_1;                             // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_4;                             // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x021C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact;                               // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x02D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_3;                             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x0364(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x03F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x04E0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0510(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x05B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x05D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewParam;                             // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACord_C*                                K2Node_Event_cord_1;                               // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket_1;                             // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACord_C*                                K2Node_Event_cord;                                 // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          K2Node_Event_socket;                               // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_sentFrom;                             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_active;                               // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_owner;                                // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_ExecuteUbergraph_triggerBase) == 0x000008, "Wrong alignment on TriggerBase_C_ExecuteUbergraph_triggerBase");
static_assert(sizeof(TriggerBase_C_ExecuteUbergraph_triggerBase) == 0x0006C8, "Wrong size on TriggerBase_C_ExecuteUbergraph_triggerBase");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, EntryPoint) == 0x000000, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_gamemode) == 0x000008, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_settings) == 0x000010, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_key_2) == 0x000100, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_key_2' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_pressed_1) == 0x000118, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_pressed_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_color) == 0x00011C, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_picker) == 0x000130, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_texture) == 0x000138, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_index_1) == 0x000140, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_damage_5) == 0x000144, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hit_5) == 0x000148, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_actor_1) == 0x0001D0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_impact_1) == 0x0001D8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_water_3) == 0x0001E8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_water_2) == 0x0001F0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_water_1) == 0x0001F8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_water) == 0x000200, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_activate) == 0x000208, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_static) == 0x000209, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_frozen) == 0x00020A, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_active_1) == 0x00020B, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_active_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_actor) == 0x000210, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_damage_4) == 0x000218, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hit_4) == 0x00021C, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_impact) == 0x0002A4, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_skipSetting) == 0x0002B0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_key_1) == 0x0002B8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_12) == 0x0002C8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hit_3) == 0x0002D0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_damage_3) == 0x000358, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_fuel) == 0x00035C, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_damage_2) == 0x000360, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hot) == 0x000364, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_11) == 0x0003F0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hit_2) == 0x0003F8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_action) == 0x000480, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_10) == 0x000488, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_9) == 0x000490, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_damage_1) == 0x000498, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_location_1) == 0x00049C, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_8) == 0x0004A8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_7) == 0x0004B0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_6) == 0x0004B8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_wheelDelta) == 0x0004C0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_5) == 0x0004C8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_mouse) == 0x0004D0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_4) == 0x0004D8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_key) == 0x0004E0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_pressed) == 0x0004F8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_temperature_1) == 0x0004FC, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_temperature) == 0x000500, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_speed) == 0x000504, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_3) == 0x000508, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hit_1) == 0x000510, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_name) == 0x000598, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_volume) == 0x0005A8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_2) == 0x0005B0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_location) == 0x0005B8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_damage) == 0x0005C4, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_clean_1) == 0x0005C8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player_1) == 0x0005D0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hit) == 0x0005D8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hook_1) == 0x000660, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_clean) == 0x000668, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_player) == 0x000670, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_hook) == 0x000678, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_NewParam) == 0x000680, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_NewParam' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_cord_1) == 0x000688, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_cord_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_socket_1) == 0x000690, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_socket_1' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_cord) == 0x000698, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_cord' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_socket) == 0x0006A0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_socket' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_sentFrom) == 0x0006A8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_sentFrom' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_active) == 0x0006B0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_owner) == 0x0006B8, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ExecuteUbergraph_triggerBase, K2Node_Event_index) == 0x0006C0, "Member 'TriggerBase_C_ExecuteUbergraph_triggerBase::K2Node_Event_index' has a wrong offset!");

// Function triggerBase.triggerBase_C.runTrigger
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_RunTrigger final
{
public:
	class AActor*                                 Param_Owner;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_RunTrigger) == 0x000008, "Wrong alignment on TriggerBase_C_RunTrigger");
static_assert(sizeof(TriggerBase_C_RunTrigger) == 0x000010, "Wrong size on TriggerBase_C_RunTrigger");
static_assert(offsetof(TriggerBase_C_RunTrigger, Param_Owner) == 0x000000, "Member 'TriggerBase_C_RunTrigger::Param_Owner' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_RunTrigger, Param_Index) == 0x000008, "Member 'TriggerBase_C_RunTrigger::Param_Index' has a wrong offset!");

// Function triggerBase.triggerBase_C.setActiveTrigger
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_SetActiveTrigger final
{
public:
	class AActor*                                 SentFrom;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerBase_C_SetActiveTrigger) == 0x000008, "Wrong alignment on TriggerBase_C_SetActiveTrigger");
static_assert(sizeof(TriggerBase_C_SetActiveTrigger) == 0x000010, "Wrong size on TriggerBase_C_SetActiveTrigger");
static_assert(offsetof(TriggerBase_C_SetActiveTrigger, SentFrom) == 0x000000, "Member 'TriggerBase_C_SetActiveTrigger::SentFrom' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_SetActiveTrigger, Active) == 0x000008, "Member 'TriggerBase_C_SetActiveTrigger::Active' has a wrong offset!");

// Function triggerBase.triggerBase_C.cordUnplugged
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_CordUnplugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_CordUnplugged) == 0x000008, "Wrong alignment on TriggerBase_C_CordUnplugged");
static_assert(sizeof(TriggerBase_C_CordUnplugged) == 0x000010, "Wrong size on TriggerBase_C_CordUnplugged");
static_assert(offsetof(TriggerBase_C_CordUnplugged, Cord) == 0x000000, "Member 'TriggerBase_C_CordUnplugged::Cord' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_CordUnplugged, Socket) == 0x000008, "Member 'TriggerBase_C_CordUnplugged::Socket' has a wrong offset!");

// Function triggerBase.triggerBase_C.cordPlugged
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_CordPlugged final
{
public:
	class ACord_C*                                Cord;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACordSocket_C*                          Socket;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_CordPlugged) == 0x000008, "Wrong alignment on TriggerBase_C_CordPlugged");
static_assert(sizeof(TriggerBase_C_CordPlugged) == 0x000010, "Wrong size on TriggerBase_C_CordPlugged");
static_assert(offsetof(TriggerBase_C_CordPlugged, Cord) == 0x000000, "Member 'TriggerBase_C_CordPlugged::Cord' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_CordPlugged, Socket) == 0x000008, "Member 'TriggerBase_C_CordPlugged::Socket' has a wrong offset!");

// Function triggerBase.triggerBase_C.set_ignoreSave_trigger
// 0x0001 (0x0001 - 0x0000)
struct TriggerBase_C_Set_ignoreSave_trigger final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerBase_C_Set_ignoreSave_trigger) == 0x000001, "Wrong alignment on TriggerBase_C_Set_ignoreSave_trigger");
static_assert(sizeof(TriggerBase_C_Set_ignoreSave_trigger) == 0x000001, "Wrong size on TriggerBase_C_Set_ignoreSave_trigger");
static_assert(offsetof(TriggerBase_C_Set_ignoreSave_trigger, NewParam) == 0x000000, "Member 'TriggerBase_C_Set_ignoreSave_trigger::NewParam' has a wrong offset!");

// Function triggerBase.triggerBase_C.hookTension
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_HookTension final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_HookTension) == 0x000008, "Wrong alignment on TriggerBase_C_HookTension");
static_assert(sizeof(TriggerBase_C_HookTension) == 0x000008, "Wrong size on TriggerBase_C_HookTension");
static_assert(offsetof(TriggerBase_C_HookTension, Hook) == 0x000000, "Member 'TriggerBase_C_HookTension::Hook' has a wrong offset!");

// Function triggerBase.triggerBase_C.cleanSponge
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_CleanSponge final
{
public:
	float                                         Clean;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_CleanSponge) == 0x000008, "Wrong alignment on TriggerBase_C_CleanSponge");
static_assert(sizeof(TriggerBase_C_CleanSponge) == 0x000010, "Wrong size on TriggerBase_C_CleanSponge");
static_assert(offsetof(TriggerBase_C_CleanSponge, Clean) == 0x000000, "Member 'TriggerBase_C_CleanSponge::Clean' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_CleanSponge, Player) == 0x000008, "Member 'TriggerBase_C_CleanSponge::Player' has a wrong offset!");

// Function triggerBase.triggerBase_C.hooked
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_Hooked final
{
public:
	class AHook_C*                                Hook;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_Hooked) == 0x000008, "Wrong alignment on TriggerBase_C_Hooked");
static_assert(sizeof(TriggerBase_C_Hooked) == 0x000008, "Wrong size on TriggerBase_C_Hooked");
static_assert(offsetof(TriggerBase_C_Hooked, Hook) == 0x000000, "Member 'TriggerBase_C_Hooked::Hook' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerUsedOn
// 0x0090 (0x0090 - 0x0000)
struct TriggerBase_C_PlayerUsedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TriggerBase_C_PlayerUsedOn) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerUsedOn");
static_assert(sizeof(TriggerBase_C_PlayerUsedOn) == 0x000090, "Wrong size on TriggerBase_C_PlayerUsedOn");
static_assert(offsetof(TriggerBase_C_PlayerUsedOn, Player) == 0x000000, "Member 'TriggerBase_C_PlayerUsedOn::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_PlayerUsedOn, Hit) == 0x000008, "Member 'TriggerBase_C_PlayerUsedOn::Hit' has a wrong offset!");

// Function triggerBase.triggerBase_C.slice
// 0x0001 (0x0001 - 0x0000)
struct TriggerBase_C_Slice final
{
public:
	bool                                          Clean;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerBase_C_Slice) == 0x000001, "Wrong alignment on TriggerBase_C_Slice");
static_assert(sizeof(TriggerBase_C_Slice) == 0x000001, "Wrong size on TriggerBase_C_Slice");
static_assert(offsetof(TriggerBase_C_Slice, Clean) == 0x000000, "Member 'TriggerBase_C_Slice::Clean' has a wrong offset!");

// Function triggerBase.triggerBase_C.reachedByExplosion
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_ReachedByExplosion final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_ReachedByExplosion) == 0x000004, "Wrong alignment on TriggerBase_C_ReachedByExplosion");
static_assert(sizeof(TriggerBase_C_ReachedByExplosion) == 0x000010, "Wrong size on TriggerBase_C_ReachedByExplosion");
static_assert(offsetof(TriggerBase_C_ReachedByExplosion, Location) == 0x000000, "Member 'TriggerBase_C_ReachedByExplosion::Location' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ReachedByExplosion, Damage) == 0x00000C, "Member 'TriggerBase_C_ReachedByExplosion::Damage' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerLookAway
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_PlayerLookAway final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerLookAway) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerLookAway");
static_assert(sizeof(TriggerBase_C_PlayerLookAway) == 0x000008, "Wrong size on TriggerBase_C_PlayerLookAway");
static_assert(offsetof(TriggerBase_C_PlayerLookAway, Player) == 0x000000, "Member 'TriggerBase_C_PlayerLookAway::Player' has a wrong offset!");

// Function triggerBase.triggerBase_C.stepped
// 0x0004 (0x0004 - 0x0000)
struct TriggerBase_C_Stepped final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_Stepped) == 0x000004, "Wrong alignment on TriggerBase_C_Stepped");
static_assert(sizeof(TriggerBase_C_Stepped) == 0x000004, "Wrong size on TriggerBase_C_Stepped");
static_assert(offsetof(TriggerBase_C_Stepped, Volume) == 0x000000, "Member 'TriggerBase_C_Stepped::Volume' has a wrong offset!");

// Function triggerBase.triggerBase_C.ActionName
// 0x00A0 (0x00A0 - 0x0000)
struct TriggerBase_C_ActionName final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 Param_Name;                                        // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_ActionName) == 0x000008, "Wrong alignment on TriggerBase_C_ActionName");
static_assert(sizeof(TriggerBase_C_ActionName) == 0x0000A0, "Wrong size on TriggerBase_C_ActionName");
static_assert(offsetof(TriggerBase_C_ActionName, Player) == 0x000000, "Member 'TriggerBase_C_ActionName::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ActionName, Hit) == 0x000008, "Member 'TriggerBase_C_ActionName::Hit' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ActionName, Param_Name) == 0x000090, "Member 'TriggerBase_C_ActionName::Param_Name' has a wrong offset!");

// Function triggerBase.triggerBase_C.accumulateTemperature
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_AccumulateTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_AccumulateTemperature) == 0x000004, "Wrong alignment on TriggerBase_C_AccumulateTemperature");
static_assert(sizeof(TriggerBase_C_AccumulateTemperature) == 0x000008, "Wrong size on TriggerBase_C_AccumulateTemperature");
static_assert(offsetof(TriggerBase_C_AccumulateTemperature, Temperature) == 0x000000, "Member 'TriggerBase_C_AccumulateTemperature::Temperature' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_AccumulateTemperature, Speed) == 0x000004, "Member 'TriggerBase_C_AccumulateTemperature::Speed' has a wrong offset!");

// Function triggerBase.triggerBase_C.addTemperature
// 0x0004 (0x0004 - 0x0000)
struct TriggerBase_C_AddTemperature final
{
public:
	float                                         Temperature;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_AddTemperature) == 0x000004, "Wrong alignment on TriggerBase_C_AddTemperature");
static_assert(sizeof(TriggerBase_C_AddTemperature) == 0x000004, "Wrong size on TriggerBase_C_AddTemperature");
static_assert(offsetof(TriggerBase_C_AddTemperature, Temperature) == 0x000000, "Member 'TriggerBase_C_AddTemperature::Temperature' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandAnyKey
// 0x0028 (0x0028 - 0x0000)
struct TriggerBase_C_PlayerHandAnyKey final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Param_Key;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerBase_C_PlayerHandAnyKey) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandAnyKey");
static_assert(sizeof(TriggerBase_C_PlayerHandAnyKey) == 0x000028, "Wrong size on TriggerBase_C_PlayerHandAnyKey");
static_assert(offsetof(TriggerBase_C_PlayerHandAnyKey, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandAnyKey::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_PlayerHandAnyKey, Param_Key) == 0x000008, "Member 'TriggerBase_C_PlayerHandAnyKey::Param_Key' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_PlayerHandAnyKey, Pressed) == 0x000020, "Member 'TriggerBase_C_PlayerHandAnyKey::Pressed' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandMouse
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_PlayerHandMouse final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Mouse;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerHandMouse) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandMouse");
static_assert(sizeof(TriggerBase_C_PlayerHandMouse) == 0x000010, "Wrong size on TriggerBase_C_PlayerHandMouse");
static_assert(offsetof(TriggerBase_C_PlayerHandMouse, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandMouse::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_PlayerHandMouse, Mouse) == 0x000008, "Member 'TriggerBase_C_PlayerHandMouse::Mouse' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandMouseWheel
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_PlayerHandMouseWheel final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WheelDelta;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerHandMouseWheel) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandMouseWheel");
static_assert(sizeof(TriggerBase_C_PlayerHandMouseWheel) == 0x000010, "Wrong size on TriggerBase_C_PlayerHandMouseWheel");
static_assert(offsetof(TriggerBase_C_PlayerHandMouseWheel, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandMouseWheel::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_PlayerHandMouseWheel, WheelDelta) == 0x000008, "Member 'TriggerBase_C_PlayerHandMouseWheel::WheelDelta' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandRelease_LMB
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_PlayerHandRelease_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerHandRelease_LMB) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandRelease_LMB");
static_assert(sizeof(TriggerBase_C_PlayerHandRelease_LMB) == 0x000008, "Wrong size on TriggerBase_C_PlayerHandRelease_LMB");
static_assert(offsetof(TriggerBase_C_PlayerHandRelease_LMB, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandRelease_LMB::Player' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandRelease_RMB
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_PlayerHandRelease_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerHandRelease_RMB) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandRelease_RMB");
static_assert(sizeof(TriggerBase_C_PlayerHandRelease_RMB) == 0x000008, "Wrong size on TriggerBase_C_PlayerHandRelease_RMB");
static_assert(offsetof(TriggerBase_C_PlayerHandRelease_RMB, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandRelease_RMB::Player' has a wrong offset!");

// Function triggerBase.triggerBase_C.exploded
// 0x0010 (0x0010 - 0x0000)
struct TriggerBase_C_Exploded final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_Exploded) == 0x000004, "Wrong alignment on TriggerBase_C_Exploded");
static_assert(sizeof(TriggerBase_C_Exploded) == 0x000010, "Wrong size on TriggerBase_C_Exploded");
static_assert(offsetof(TriggerBase_C_Exploded, Damage) == 0x000000, "Member 'TriggerBase_C_Exploded::Damage' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_Exploded, Location) == 0x000004, "Member 'TriggerBase_C_Exploded::Location' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandUse_LMB
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_PlayerHandUse_LMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerHandUse_LMB) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandUse_LMB");
static_assert(sizeof(TriggerBase_C_PlayerHandUse_LMB) == 0x000008, "Wrong size on TriggerBase_C_PlayerHandUse_LMB");
static_assert(offsetof(TriggerBase_C_PlayerHandUse_LMB, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandUse_LMB::Player' has a wrong offset!");

// Function triggerBase.triggerBase_C.playerHandUse_RMB
// 0x0008 (0x0008 - 0x0000)
struct TriggerBase_C_PlayerHandUse_RMB final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_PlayerHandUse_RMB) == 0x000008, "Wrong alignment on TriggerBase_C_PlayerHandUse_RMB");
static_assert(sizeof(TriggerBase_C_PlayerHandUse_RMB) == 0x000008, "Wrong size on TriggerBase_C_PlayerHandUse_RMB");
static_assert(offsetof(TriggerBase_C_PlayerHandUse_RMB, Player) == 0x000000, "Member 'TriggerBase_C_PlayerHandUse_RMB::Player' has a wrong offset!");

// Function triggerBase.triggerBase_C.actionOptionIndex
// 0x0098 (0x0098 - 0x0000)
struct TriggerBase_C_ActionOptionIndex final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       Action;                                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_ActionOptionIndex) == 0x000008, "Wrong alignment on TriggerBase_C_ActionOptionIndex");
static_assert(sizeof(TriggerBase_C_ActionOptionIndex) == 0x000098, "Wrong size on TriggerBase_C_ActionOptionIndex");
static_assert(offsetof(TriggerBase_C_ActionOptionIndex, Player) == 0x000000, "Member 'TriggerBase_C_ActionOptionIndex::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ActionOptionIndex, Hit) == 0x000008, "Member 'TriggerBase_C_ActionOptionIndex::Hit' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ActionOptionIndex, Action) == 0x000090, "Member 'TriggerBase_C_ActionOptionIndex::Action' has a wrong offset!");

// Function triggerBase.triggerBase_C.receivedPhyiscsDamage
// 0x008C (0x008C - 0x0000)
struct TriggerBase_C_ReceivedPhyiscsDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hot;                                               // 0x0004(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TriggerBase_C_ReceivedPhyiscsDamage) == 0x000004, "Wrong alignment on TriggerBase_C_ReceivedPhyiscsDamage");
static_assert(sizeof(TriggerBase_C_ReceivedPhyiscsDamage) == 0x00008C, "Wrong size on TriggerBase_C_ReceivedPhyiscsDamage");
static_assert(offsetof(TriggerBase_C_ReceivedPhyiscsDamage, Damage) == 0x000000, "Member 'TriggerBase_C_ReceivedPhyiscsDamage::Damage' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_ReceivedPhyiscsDamage, Hot) == 0x000004, "Member 'TriggerBase_C_ReceivedPhyiscsDamage::Hot' has a wrong offset!");

// Function triggerBase.triggerBase_C.ignite
// 0x0004 (0x0004 - 0x0000)
struct TriggerBase_C_Ignite final
{
public:
	float                                         Fuel;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_Ignite) == 0x000004, "Wrong alignment on TriggerBase_C_Ignite");
static_assert(sizeof(TriggerBase_C_Ignite) == 0x000004, "Wrong size on TriggerBase_C_Ignite");
static_assert(offsetof(TriggerBase_C_Ignite, Fuel) == 0x000000, "Member 'TriggerBase_C_Ignite::Fuel' has a wrong offset!");

// Function triggerBase.triggerBase_C.fireDamage
// 0x0004 (0x0004 - 0x0000)
struct TriggerBase_C_FireDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerBase_C_FireDamage) == 0x000004, "Wrong alignment on TriggerBase_C_FireDamage");
static_assert(sizeof(TriggerBase_C_FireDamage) == 0x000004, "Wrong size on TriggerBase_C_FireDamage");
static_assert(offsetof(TriggerBase_C_FireDamage, Damage) == 0x000000, "Member 'TriggerBase_C_FireDamage::Damage' has a wrong offset!");

// Function triggerBase.triggerBase_C.steppedOn
// 0x0090 (0x0090 - 0x0000)
struct TriggerBase_C_SteppedOn final
{
public:
	class AMainPlayer_C*                          Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(TriggerBase_C_SteppedOn) == 0x000008, "Wrong alignment on TriggerBase_C_SteppedOn");
static_assert(sizeof(TriggerBase_C_SteppedOn) == 0x000090, "Wrong size on TriggerBase_C_SteppedOn");
static_assert(offsetof(TriggerBase_C_SteppedOn, Player) == 0x000000, "Member 'TriggerBase_C_SteppedOn::Player' has a wrong offset!");
static_assert(offsetof(TriggerBase_C_SteppedOn, Hit) == 0x000008, "Member 'TriggerBase_C_SteppedOn::Hit' has a wrong offset!");

