#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UfoDreamer

#include "Basic.hpp"


namespace SDK::Params
{

// Function ufoDreamer.ufoDreamer_C.ExecuteUbergraph_ufoDreamer
// 0x0038 (0x0038 - 0x0000)
struct UfoDreamer_C_ExecuteUbergraph_ufoDreamer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer) == 0x000008, "Wrong alignment on UfoDreamer_C_ExecuteUbergraph_ufoDreamer");
static_assert(sizeof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer) == 0x000038, "Wrong size on UfoDreamer_C_ExecuteUbergraph_ufoDreamer");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, EntryPoint) == 0x000000, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_Array_Add_ReturnValue_1) == 0x00001C, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000020, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_GetObjectClass_ReturnValue_1) == 0x000028, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDreamer_C_ExecuteUbergraph_ufoDreamer, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000031, "Member 'UfoDreamer_C_ExecuteUbergraph_ufoDreamer::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");

}

