#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UfoDropper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ufoDropper.ufoDropper_C.ExecuteUbergraph_ufoDropper
// 0x0250 (0x0250 - 0x0000)
struct UfoDropper_C_ExecuteUbergraph_ufoDropper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00E8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects;                  // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALampPost_C*                            CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACeilingLamp_C*                         CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EF[0x1];                                      // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AKerfurOmega_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x01F0(0x0010)(ReferenceParm)
	class AKerfurOmega_C*                         CallFunc_Array_Random_OutItem;                     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AKerfurOmega_C*                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_objects_C>        K2Node_DynamicCast_AsInt_Objects_1;                // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UfoDropper_C_ExecuteUbergraph_ufoDropper) == 0x000010, "Wrong alignment on UfoDropper_C_ExecuteUbergraph_ufoDropper");
static_assert(sizeof(UfoDropper_C_ExecuteUbergraph_ufoDropper) == 0x000250, "Wrong size on UfoDropper_C_ExecuteUbergraph_ufoDropper");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, EntryPoint) == 0x000000, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::EntryPoint' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, Temp_int_Variable) == 0x000004, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, Temp_int_Variable_1) == 0x000010, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000030, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000C8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_ComponentBoundEvent_OtherActor) == 0x0000D0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_ComponentBoundEvent_OtherComp) == 0x0000D8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0000E0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000E4, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_ComponentBoundEvent_SweepResult) == 0x0000E8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001A0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001A8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_DynamicCast_AsInt_Objects) == 0x0001B0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_DynamicCast_AsInt_Objects' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_Event_DeltaSeconds) == 0x0001C4, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0001C8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Array_Length_ReturnValue_1) == 0x0001E8, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001EC, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, Temp_bool_IsClosed_Variable) == 0x0001ED, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, Temp_bool_Has_Been_Initd_Variable) == 0x0001EE, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_GetAllActorsOfClass_OutActors) == 0x0001F0, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Array_Random_OutItem) == 0x000200, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_Array_Random_OutIndex) == 0x000208, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000210, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000218, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_DynamicCast_AsInt_Objects_1) == 0x000228, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_DynamicCast_AsInt_Objects_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, K2Node_DynamicCast_bSuccess_1) == 0x000238, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_ExecuteUbergraph_ufoDropper, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000240, "Member 'UfoDropper_C_ExecuteUbergraph_ufoDropper::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function ufoDropper.ufoDropper_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct UfoDropper_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UfoDropper_C_ReceiveTick) == 0x000004, "Wrong alignment on UfoDropper_C_ReceiveTick");
static_assert(sizeof(UfoDropper_C_ReceiveTick) == 0x000004, "Wrong size on UfoDropper_C_ReceiveTick");
static_assert(offsetof(UfoDropper_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'UfoDropper_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ufoDropper.ufoDropper_C.BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'UfoDropper_C_BndEvt__ufoDropper_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

