#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_radialText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_radialText.umg_radialText_C
// 0x0038 (0x0298 - 0x0260)
class UUmg_radialText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_pivot;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasMover;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_text;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_umg_radialText(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_radialText_C">();
	}
	static class UUmg_radialText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_radialText_C>();
	}
};
static_assert(alignof(UUmg_radialText_C) == 0x000008, "Wrong alignment on UUmg_radialText_C");
static_assert(sizeof(UUmg_radialText_C) == 0x000298, "Wrong size on UUmg_radialText_C");
static_assert(offsetof(UUmg_radialText_C, UberGraphFrame) == 0x000260, "Member 'UUmg_radialText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_radialText_C, Canvas_pivot) == 0x000268, "Member 'UUmg_radialText_C::Canvas_pivot' has a wrong offset!");
static_assert(offsetof(UUmg_radialText_C, CanvasMover) == 0x000270, "Member 'UUmg_radialText_C::CanvasMover' has a wrong offset!");
static_assert(offsetof(UUmg_radialText_C, Txt_text) == 0x000278, "Member 'UUmg_radialText_C::Txt_text' has a wrong offset!");
static_assert(offsetof(UUmg_radialText_C, Text) == 0x000280, "Member 'UUmg_radialText_C::Text' has a wrong offset!");

}

