#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_spawnmenuSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function umg_spawnmenuSlot.umg_spawnmenuSlot_C.ExecuteUbergraph_umg_spawnmenuSlot
// 0x00A8 (0x00A8 - 0x0000)
struct Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2558[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2559[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0058(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255A[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0090(0x0018)()
};
static_assert(alignof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot) == 0x000008, "Wrong alignment on Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot");
static_assert(sizeof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot) == 0x0000A8, "Wrong size on Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, EntryPoint) == 0x000000, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, Temp_bool_Variable) == 0x000004, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, Temp_text_Variable) == 0x000008, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000020, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000028, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_Array_Find_ReturnValue) == 0x000048, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_Array_Get_Item) == 0x000050, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_Conv_NameToText_ReturnValue) == 0x000058, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, CallFunc_TextIsEmpty_ReturnValue) == 0x000088, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot, K2Node_Select_Default) == 0x000090, "Member 'Umg_spawnmenuSlot_C_ExecuteUbergraph_umg_spawnmenuSlot::K2Node_Select_Default' has a wrong offset!");

// Function umg_spawnmenuSlot.umg_spawnmenuSlot_C.Filter
// 0x0038 (0x0038 - 0x0000)
struct Umg_spawnmenuSlot_C_Filter final
{
public:
	bool                                          A;                                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255D[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_spawnmenuSlot_C_Filter) == 0x000008, "Wrong alignment on Umg_spawnmenuSlot_C_Filter");
static_assert(sizeof(Umg_spawnmenuSlot_C_Filter) == 0x000038, "Wrong size on Umg_spawnmenuSlot_C_Filter");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, A) == 0x000000, "Member 'Umg_spawnmenuSlot_C_Filter::A' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, Temp_int_Variable) == 0x000004, "Member 'Umg_spawnmenuSlot_C_Filter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, Temp_bool_Variable) == 0x000008, "Member 'Umg_spawnmenuSlot_C_Filter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, Temp_int_Variable_1) == 0x00000C, "Member 'Umg_spawnmenuSlot_C_Filter::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, Temp_byte_Variable) == 0x000010, "Member 'Umg_spawnmenuSlot_C_Filter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, Temp_byte_Variable_1) == 0x000011, "Member 'Umg_spawnmenuSlot_C_Filter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000012, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, K2Node_Select_Default) == 0x000013, "Member 'Umg_spawnmenuSlot_C_Filter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_Array_Contains_ReturnValue) == 0x000014, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_Contains_ReturnValue) == 0x000034, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_Filter, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000035, "Member 'Umg_spawnmenuSlot_C_Filter::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function umg_spawnmenuSlot.umg_spawnmenuSlot_C.setGridLocation
// 0x0010 (0x0010 - 0x0000)
struct Umg_spawnmenuSlot_C_SetGridLocation final
{
public:
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_spawnmenuSlot_C_SetGridLocation) == 0x000008, "Wrong alignment on Umg_spawnmenuSlot_C_SetGridLocation");
static_assert(sizeof(Umg_spawnmenuSlot_C_SetGridLocation) == 0x000010, "Wrong size on Umg_spawnmenuSlot_C_SetGridLocation");
static_assert(offsetof(Umg_spawnmenuSlot_C_SetGridLocation, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000000, "Member 'Umg_spawnmenuSlot_C_SetGridLocation::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_SetGridLocation, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'Umg_spawnmenuSlot_C_SetGridLocation::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_spawnmenuSlot_C_SetGridLocation, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'Umg_spawnmenuSlot_C_SetGridLocation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

}

