#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_shopSubcategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_shopCats_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_shopSubcategoryButton.umg_shopSubcategoryButton_C
// 0x0040 (0x02A0 - 0x0260)
class UUmg_shopSubcategoryButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_shopCat_tools;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Textbox_name;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Subcategory;                                       // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	Enum_shopCats                                 Category;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_laptop_C*                          Owner;                                             // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_shopSubcategoryButton(int32 EntryPoint);
	void BndEvt__umg_shopSubcategoryButton_button_shopCat_tools_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Upd();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_shopSubcategoryButton_C">();
	}
	static class UUmg_shopSubcategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_shopSubcategoryButton_C>();
	}
};
static_assert(alignof(UUmg_shopSubcategoryButton_C) == 0x000008, "Wrong alignment on UUmg_shopSubcategoryButton_C");
static_assert(sizeof(UUmg_shopSubcategoryButton_C) == 0x0002A0, "Wrong size on UUmg_shopSubcategoryButton_C");
static_assert(offsetof(UUmg_shopSubcategoryButton_C, UberGraphFrame) == 0x000260, "Member 'UUmg_shopSubcategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_shopSubcategoryButton_C, button_shopCat_tools) == 0x000268, "Member 'UUmg_shopSubcategoryButton_C::button_shopCat_tools' has a wrong offset!");
static_assert(offsetof(UUmg_shopSubcategoryButton_C, Textbox_name) == 0x000270, "Member 'UUmg_shopSubcategoryButton_C::Textbox_name' has a wrong offset!");
static_assert(offsetof(UUmg_shopSubcategoryButton_C, Subcategory) == 0x000278, "Member 'UUmg_shopSubcategoryButton_C::Subcategory' has a wrong offset!");
static_assert(offsetof(UUmg_shopSubcategoryButton_C, Category) == 0x000290, "Member 'UUmg_shopSubcategoryButton_C::Category' has a wrong offset!");
static_assert(offsetof(UUmg_shopSubcategoryButton_C, Owner) == 0x000298, "Member 'UUmg_shopSubcategoryButton_C::Owner' has a wrong offset!");

}

