#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_stats

#include "Basic.hpp"

#include "Struct_signal_data1_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_stats.umg_stats_C.ExecuteUbergraph_umg_stats
// 0x00C0 (0x00C0 - 0x0000)
struct Umg_stats_C_ExecuteUbergraph_umg_stats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_statsSlot_C*                       K2Node_DynamicCast_AsUmg_Stats_Slot;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USoundWave*                       K2Node_CustomEvent_PlayingSoundWave;               // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaybackPercent;                // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main_1;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_stats_C_ExecuteUbergraph_umg_stats) == 0x000008, "Wrong alignment on Umg_stats_C_ExecuteUbergraph_umg_stats");
static_assert(sizeof(Umg_stats_C_ExecuteUbergraph_umg_stats) == 0x0000C0, "Wrong size on Umg_stats_C_ExecuteUbergraph_umg_stats");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, EntryPoint) == 0x000000, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_Event_index) == 0x000008, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_Array_Get_Item) == 0x000020, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_DynamicCast_AsUmg_Stats_Slot) == 0x000030, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_DynamicCast_AsUmg_Stats_Slot' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000040, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_SpawnSound2D_ReturnValue) == 0x000068, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_CustomEvent_PlayingSoundWave) == 0x000078, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_CustomEvent_PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_CustomEvent_PlaybackPercent) == 0x000080, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_CustomEvent_PlaybackPercent' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000088, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_Lerp_ReturnValue) == 0x000090, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_MakeVector2D_ReturnValue) == 0x000098, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x0000A8, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, K2Node_ComponentBoundEvent_bIsChecked) == 0x0000A9, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_getMainSave_save_main) == 0x0000B0, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_ExecuteUbergraph_umg_stats, CallFunc_getMainSave_save_main_1) == 0x0000B8, "Member 'Umg_stats_C_ExecuteUbergraph_umg_stats::CallFunc_getMainSave_save_main_1' has a wrong offset!");

// Function umg_stats.umg_stats_C.BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Umg_stats_C_BndEvt__umg_stats_CheckBox_gloss_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function umg_stats.umg_stats_C.BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Umg_stats_C_BndEvt__umg_stats_CheckBox_stats_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function umg_stats.umg_stats_C.pb
// 0x0010 (0x0010 - 0x0000)
struct Umg_stats_C_Pb final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_stats_C_Pb) == 0x000008, "Wrong alignment on Umg_stats_C_Pb");
static_assert(sizeof(Umg_stats_C_Pb) == 0x000010, "Wrong size on Umg_stats_C_Pb");
static_assert(offsetof(Umg_stats_C_Pb, PlayingSoundWave) == 0x000000, "Member 'Umg_stats_C_Pb::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Pb, PlaybackPercent) == 0x000008, "Member 'Umg_stats_C_Pb::PlaybackPercent' has a wrong offset!");

// Function umg_stats.umg_stats_C.setIndex
// 0x0004 (0x0004 - 0x0000)
struct Umg_stats_C_SetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_stats_C_SetIndex) == 0x000004, "Wrong alignment on Umg_stats_C_SetIndex");
static_assert(sizeof(Umg_stats_C_SetIndex) == 0x000004, "Wrong size on Umg_stats_C_SetIndex");
static_assert(offsetof(Umg_stats_C_SetIndex, Param_Index) == 0x000000, "Member 'Umg_stats_C_SetIndex::Param_Index' has a wrong offset!");

// Function umg_stats.umg_stats_C.upd
// 0x0058 (0x0058 - 0x0000)
struct Umg_stats_C_Upd final
{
public:
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_6;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_7;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_8;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_9;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_10;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_11;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_12;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_13;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_14;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_15;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_16;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_17;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_18;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_stats_C_Upd) == 0x000008, "Wrong alignment on Umg_stats_C_Upd");
static_assert(sizeof(Umg_stats_C_Upd) == 0x000058, "Wrong size on Umg_stats_C_Upd");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_getMainSave_save_main) == 0x000000, "Member 'Umg_stats_C_Upd::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00000C, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000010, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000014, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x000018, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_5) == 0x00001C, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_6) == 0x000020, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_7) == 0x000024, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_8) == 0x000028, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_9) == 0x00002C, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_10) == 0x000030, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_11) == 0x000034, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_12) == 0x000038, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_13) == 0x00003C, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_14) == 0x000040, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_15) == 0x000044, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_16) == 0x000048, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_17) == 0x00004C, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue_18) == 0x000050, "Member 'Umg_stats_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue_18' has a wrong offset!");

// Function umg_stats.umg_stats_C.setStat
// 0x0010 (0x0010 - 0x0000)
struct Umg_stats_C_SetStat final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Stat;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_statsSlot_C*                       CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_stats_C_SetStat) == 0x000008, "Wrong alignment on Umg_stats_C_SetStat");
static_assert(sizeof(Umg_stats_C_SetStat) == 0x000010, "Wrong size on Umg_stats_C_SetStat");
static_assert(offsetof(Umg_stats_C_SetStat, Param_Index) == 0x000000, "Member 'Umg_stats_C_SetStat::Param_Index' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_SetStat, Stat) == 0x000004, "Member 'Umg_stats_C_SetStat::Stat' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_SetStat, CallFunc_Array_Get_Item) == 0x000008, "Member 'Umg_stats_C_SetStat::CallFunc_Array_Get_Item' has a wrong offset!");

// Function umg_stats.umg_stats_C.setSigGloss
// 0x01E0 (0x01E0 - 0x0000)
struct Umg_stats_C_SetSigGloss final
{
public:
	class UUmg_statsGlossSlot_C*                  Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_data1                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x01D0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_stats_C_SetSigGloss) == 0x000008, "Wrong alignment on Umg_stats_C_SetSigGloss");
static_assert(sizeof(Umg_stats_C_SetSigGloss) == 0x0001E0, "Wrong size on Umg_stats_C_SetSigGloss");
static_assert(offsetof(Umg_stats_C_SetSigGloss, Param_Slot) == 0x000000, "Member 'Umg_stats_C_SetSigGloss::Param_Slot' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_SetSigGloss, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'Umg_stats_C_SetSigGloss::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_SetSigGloss, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001D8, "Member 'Umg_stats_C_SetSigGloss::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function umg_stats.umg_stats_C.updSigGloss
// 0x0218 (0x0218 - 0x0000)
struct Umg_stats_C_UpdSigGloss final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0108(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0120(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x0178(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_3;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_4;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0200(0x0018)()
};
static_assert(alignof(Umg_stats_C_UpdSigGloss) == 0x000008, "Wrong alignment on Umg_stats_C_UpdSigGloss");
static_assert(sizeof(Umg_stats_C_UpdSigGloss) == 0x000218, "Wrong size on Umg_stats_C_UpdSigGloss");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_bool_Variable) == 0x000000, "Member 'Umg_stats_C_UpdSigGloss::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_object_Variable) == 0x000008, "Member 'Umg_stats_C_UpdSigGloss::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_int_Variable) == 0x000010, "Member 'Umg_stats_C_UpdSigGloss::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_text_Variable) == 0x000018, "Member 'Umg_stats_C_UpdSigGloss::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_int_Variable_1) == 0x000030, "Member 'Umg_stats_C_UpdSigGloss::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_object_Variable_1) == 0x000038, "Member 'Umg_stats_C_UpdSigGloss::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_int_Variable_2) == 0x000040, "Member 'Umg_stats_C_UpdSigGloss::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_int_Variable_3) == 0x000044, "Member 'Umg_stats_C_UpdSigGloss::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000070, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000D0, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Array_Find_ReturnValue) == 0x0000D8, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, Temp_int_Variable_4) == 0x0000EC, "Member 'Umg_stats_C_UpdSigGloss::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, K2Node_Select_Default) == 0x0000F0, "Member 'Umg_stats_C_UpdSigGloss::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, K2Node_Select_Default_1) == 0x0000F8, "Member 'Umg_stats_C_UpdSigGloss::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000100, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_BoolToText_ReturnValue) == 0x000108, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_FloatToText_ReturnValue) == 0x000120, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000138, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000148, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000158, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000168, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, K2Node_Select_Default_2) == 0x000178, "Member 'Umg_stats_C_UpdSigGloss::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000190, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001A0, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, K2Node_Select_Default_3) == 0x0001B0, "Member 'Umg_stats_C_UpdSigGloss::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0001B8, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0001C8, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, K2Node_Select_Default_4) == 0x0001D8, "Member 'Umg_stats_C_UpdSigGloss::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0001E0, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0001F0, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_UpdSigGloss, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000200, "Member 'Umg_stats_C_UpdSigGloss::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function umg_stats.umg_stats_C.genGloss
// 0x0048 (0x0048 - 0x0000)
struct Umg_stats_C_GenGloss final
{
public:
	class UUmg_statsGlossSlot_C*                  CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_stats_C_GenGloss) == 0x000008, "Wrong alignment on Umg_stats_C_GenGloss");
static_assert(sizeof(Umg_stats_C_GenGloss) == 0x000048, "Wrong size on Umg_stats_C_GenGloss");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Create_ReturnValue) == 0x000000, "Member 'Umg_stats_C_GenGloss::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Umg_stats_C_GenGloss::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Umg_stats_C_GenGloss::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Umg_stats_C_GenGloss::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'Umg_stats_C_GenGloss::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'Umg_stats_C_GenGloss::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_getMainSave_save_main) == 0x000028, "Member 'Umg_stats_C_GenGloss::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Array_Get_Item) == 0x000030, "Member 'Umg_stats_C_GenGloss::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'Umg_stats_C_GenGloss::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'Umg_stats_C_GenGloss::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_GenGloss, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'Umg_stats_C_GenGloss::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function umg_stats.umg_stats_C.removeGloss
// 0x0018 (0x0018 - 0x0000)
struct Umg_stats_C_RemoveGloss final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_statsGlossSlot_C*                  CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_stats_C_RemoveGloss) == 0x000008, "Wrong alignment on Umg_stats_C_RemoveGloss");
static_assert(sizeof(Umg_stats_C_RemoveGloss) == 0x000018, "Wrong size on Umg_stats_C_RemoveGloss");
static_assert(offsetof(Umg_stats_C_RemoveGloss, Temp_int_Variable) == 0x000000, "Member 'Umg_stats_C_RemoveGloss::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_RemoveGloss, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Umg_stats_C_RemoveGloss::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_RemoveGloss, CallFunc_Array_Get_Item) == 0x000008, "Member 'Umg_stats_C_RemoveGloss::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_stats_C_RemoveGloss, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Umg_stats_C_RemoveGloss::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
