#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_achievementSlot

#include "Basic.hpp"

#include "Struct_achievement_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_achievementSlot.umg_achievementSlot_C
// 0x0090 (0x02F0 - 0x0260)
class UUmg_achievementSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                bttn;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_adv;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_back;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_sel;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_adv;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_achievements_C*                    Main;                                              // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FStruct_achievement                    Data;                                              // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Ind;                                               // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_achievementSlot(int32 EntryPoint);
	void BndEvt__bttn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Upd(const struct FStruct_achievement& Param_Data);
	void Check(class UUmg_achievementSlot_C* Ac);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_achievementSlot_C">();
	}
	static class UUmg_achievementSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_achievementSlot_C>();
	}
};
static_assert(alignof(UUmg_achievementSlot_C) == 0x000008, "Wrong alignment on UUmg_achievementSlot_C");
static_assert(sizeof(UUmg_achievementSlot_C) == 0x0002F0, "Wrong size on UUmg_achievementSlot_C");
static_assert(offsetof(UUmg_achievementSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_achievementSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, bttn) == 0x000268, "Member 'UUmg_achievementSlot_C::bttn' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Img_adv) == 0x000270, "Member 'UUmg_achievementSlot_C::Img_adv' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Img_back) == 0x000278, "Member 'UUmg_achievementSlot_C::Img_back' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Img_sel) == 0x000280, "Member 'UUmg_achievementSlot_C::Img_sel' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Txt_adv) == 0x000288, "Member 'UUmg_achievementSlot_C::Txt_adv' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Main) == 0x000290, "Member 'UUmg_achievementSlot_C::Main' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Data) == 0x000298, "Member 'UUmg_achievementSlot_C::Data' has a wrong offset!");
static_assert(offsetof(UUmg_achievementSlot_C, Ind) == 0x0002E8, "Member 'UUmg_achievementSlot_C::Ind' has a wrong offset!");

}

