#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_langs

#include "Basic.hpp"


namespace SDK::Params
{

// Function umg_langs.umg_langs_C.ExecuteUbergraph_umg_langs
// 0x0090 (0x0090 - 0x0000)
struct Umg_langs_C_ExecuteUbergraph_umg_langs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_langSlot_C*                        CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0070(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_langs_C_ExecuteUbergraph_umg_langs) == 0x000008, "Wrong alignment on Umg_langs_C_ExecuteUbergraph_umg_langs");
static_assert(sizeof(Umg_langs_C_ExecuteUbergraph_umg_langs) == 0x000090, "Wrong size on Umg_langs_C_ExecuteUbergraph_umg_langs");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, EntryPoint) == 0x000000, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, K2Node_Event_index) == 0x000008, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Create_ReturnValue) == 0x000020, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Map_Keys_Keys) == 0x000040, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Array_Get_Item) == 0x000058, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Map_Find_Value) == 0x000070, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Umg_langs_C_ExecuteUbergraph_umg_langs, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'Umg_langs_C_ExecuteUbergraph_umg_langs::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function umg_langs.umg_langs_C.setIndex
// 0x0004 (0x0004 - 0x0000)
struct Umg_langs_C_SetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_langs_C_SetIndex) == 0x000004, "Wrong alignment on Umg_langs_C_SetIndex");
static_assert(sizeof(Umg_langs_C_SetIndex) == 0x000004, "Wrong size on Umg_langs_C_SetIndex");
static_assert(offsetof(Umg_langs_C_SetIndex, Param_Index) == 0x000000, "Member 'Umg_langs_C_SetIndex::Param_Index' has a wrong offset!");

}

