#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_videobrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_videobrowser.umg_videobrowser_C
// 0x0018 (0x0278 - 0x0260)
class UUmg_videobrowser_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_32;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWebBrowser*                            WebBrowser_14;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_videobrowser(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_videobrowser_C">();
	}
	static class UUmg_videobrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_videobrowser_C>();
	}
};
static_assert(alignof(UUmg_videobrowser_C) == 0x000008, "Wrong alignment on UUmg_videobrowser_C");
static_assert(sizeof(UUmg_videobrowser_C) == 0x000278, "Wrong size on UUmg_videobrowser_C");
static_assert(offsetof(UUmg_videobrowser_C, UberGraphFrame) == 0x000260, "Member 'UUmg_videobrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_videobrowser_C, Image_32) == 0x000268, "Member 'UUmg_videobrowser_C::Image_32' has a wrong offset!");
static_assert(offsetof(UUmg_videobrowser_C, WebBrowser_14) == 0x000270, "Member 'UUmg_videobrowser_C::WebBrowser_14' has a wrong offset!");

}

