#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_settingsSlot_windowed

#include "Basic.hpp"

#include "VictoryBPLibrary_structs.hpp"


namespace SDK::Params
{

// Function umg_settingsSlot_windowed.umg_settingsSlot_windowed_C.ExecuteUbergraph_umg_settingsSlot_windowed
// 0x000C (0x000C - 0x0000)
struct Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoyGraphicsFullScreen                        CallFunc_JoyGraphicsSettings__FullScreen_Get_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoyGraphicsFullScreen                        Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoyGraphicsFullScreen                        Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoyGraphicsFullScreen                        Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoyGraphicsFullScreen                        Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoyGraphicsFullScreen                        K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed) == 0x000004, "Wrong alignment on Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed");
static_assert(sizeof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed) == 0x00000C, "Wrong size on Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, EntryPoint) == 0x000000, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, CallFunc_JoyGraphicsSettings__FullScreen_Get_ReturnValue) == 0x000004, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::CallFunc_JoyGraphicsSettings__FullScreen_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, Temp_byte_Variable) == 0x000005, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, Temp_byte_Variable_1) == 0x000006, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, Temp_byte_Variable_2) == 0x000007, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, Temp_byte_Variable_3) == 0x000008, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed, K2Node_Select_Default) == 0x000009, "Member 'Umg_settingsSlot_windowed_C_ExecuteUbergraph_umg_settingsSlot_windowed::K2Node_Select_Default' has a wrong offset!");

}

