#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_saveSlots

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_gamemode_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_saveSlots.umg_saveSlots_C
// 0x0198 (0x03F8 - 0x0260)
class UUmg_saveSlots_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_back;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_createNew;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_createSlot;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_delete;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_duplicate;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_exit;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_launch;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_openSaveDir;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_play;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_reset;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_updatelist;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_loading;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasMapSelect;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasMapSelect_1;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasMapSelect_2;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_48;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        Cbox_sboxLevel;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ETB_days;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Etb_level;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ETB_slotName;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_96;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_126;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_302;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_list;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_slotName;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_days;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_days_1;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_msg;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_top;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_308;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUmg_saveSlot_C*>                Slots;                                             // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUmg_saveSlot_C*                        Selected;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartDay;                                          // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDay;                                            // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USaveSlot_C*>                    Saves;                                             // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         SavesNames;                                        // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SelectedId;                                        // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            TempSave;                                          // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SelectedMap;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SavesNames_infront;                                // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class USaveSlot_C*>                    Saves_infront;                                     // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UUmg_saveSlot_C*>                Slots_infront;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUmg_saveSlot_C*>                Slots_putInfront;                                  // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_umg_saveSlots(int32 EntryPoint);
	void UpdateList();
	void BndEvt__umg_saveSlots_button_updatelist_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_saveSlots_button_duplicate_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_saveSlots_button_openSaveDir_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void BndEvt__button_create_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_saveSlots_button_create_1_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__button_delete_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_reset_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_launch_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_back_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_apply_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_exit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Gen();
	void SelectSlot(class UUmg_saveSlot_C* Param_Slot);
	void Upd();
	class FText FindSBMap(const class FString& Param_Name);
	void LoadSlots();
	void GetSaveObject(const class FString& ItemToFind, class USaveSlot_C** Output);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_saveSlots_C">();
	}
	static class UUmg_saveSlots_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_saveSlots_C>();
	}
};
static_assert(alignof(UUmg_saveSlots_C) == 0x000008, "Wrong alignment on UUmg_saveSlots_C");
static_assert(sizeof(UUmg_saveSlots_C) == 0x0003F8, "Wrong size on UUmg_saveSlots_C");
static_assert(offsetof(UUmg_saveSlots_C, UberGraphFrame) == 0x000260, "Member 'UUmg_saveSlots_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_back) == 0x000268, "Member 'UUmg_saveSlots_C::button_back' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_createNew) == 0x000270, "Member 'UUmg_saveSlots_C::button_createNew' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_createSlot) == 0x000278, "Member 'UUmg_saveSlots_C::button_createSlot' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_delete) == 0x000280, "Member 'UUmg_saveSlots_C::button_delete' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_duplicate) == 0x000288, "Member 'UUmg_saveSlots_C::button_duplicate' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_exit) == 0x000290, "Member 'UUmg_saveSlots_C::button_exit' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_launch) == 0x000298, "Member 'UUmg_saveSlots_C::button_launch' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_openSaveDir) == 0x0002A0, "Member 'UUmg_saveSlots_C::button_openSaveDir' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_play) == 0x0002A8, "Member 'UUmg_saveSlots_C::button_play' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Button_reset) == 0x0002B0, "Member 'UUmg_saveSlots_C::Button_reset' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, button_updatelist) == 0x0002B8, "Member 'UUmg_saveSlots_C::button_updatelist' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Canvas_loading) == 0x0002C0, "Member 'UUmg_saveSlots_C::Canvas_loading' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, CanvasMapSelect) == 0x0002C8, "Member 'UUmg_saveSlots_C::CanvasMapSelect' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, CanvasMapSelect_1) == 0x0002D0, "Member 'UUmg_saveSlots_C::CanvasMapSelect_1' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, CanvasMapSelect_2) == 0x0002D8, "Member 'UUmg_saveSlots_C::CanvasMapSelect_2' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, CanvasPanel_48) == 0x0002E0, "Member 'UUmg_saveSlots_C::CanvasPanel_48' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Cbox_sboxLevel) == 0x0002E8, "Member 'UUmg_saveSlots_C::Cbox_sboxLevel' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, ETB_days) == 0x0002F0, "Member 'UUmg_saveSlots_C::ETB_days' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Etb_level) == 0x0002F8, "Member 'UUmg_saveSlots_C::Etb_level' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, ETB_slotName) == 0x000300, "Member 'UUmg_saveSlots_C::ETB_slotName' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Image_64) == 0x000308, "Member 'UUmg_saveSlots_C::Image_64' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Image_96) == 0x000310, "Member 'UUmg_saveSlots_C::Image_96' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Image_126) == 0x000318, "Member 'UUmg_saveSlots_C::Image_126' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Image_302) == 0x000320, "Member 'UUmg_saveSlots_C::Image_302' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, ScrollBox_list) == 0x000328, "Member 'UUmg_saveSlots_C::ScrollBox_list' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Tex_slotName) == 0x000330, "Member 'UUmg_saveSlots_C::Tex_slotName' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Txt_days) == 0x000338, "Member 'UUmg_saveSlots_C::Txt_days' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Txt_days_1) == 0x000340, "Member 'UUmg_saveSlots_C::Txt_days_1' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Txt_msg) == 0x000348, "Member 'UUmg_saveSlots_C::Txt_msg' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Txt_top) == 0x000350, "Member 'UUmg_saveSlots_C::Txt_top' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, WidgetSwitcher_308) == 0x000358, "Member 'UUmg_saveSlots_C::WidgetSwitcher_308' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Slots) == 0x000360, "Member 'UUmg_saveSlots_C::Slots' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Selected) == 0x000370, "Member 'UUmg_saveSlots_C::Selected' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, StartDay) == 0x000378, "Member 'UUmg_saveSlots_C::StartDay' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, MaxDay) == 0x00037C, "Member 'UUmg_saveSlots_C::MaxDay' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Saves) == 0x000380, "Member 'UUmg_saveSlots_C::Saves' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, SavesNames) == 0x000390, "Member 'UUmg_saveSlots_C::SavesNames' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, SelectedId) == 0x0003A0, "Member 'UUmg_saveSlots_C::SelectedId' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, TempSave) == 0x0003A8, "Member 'UUmg_saveSlots_C::TempSave' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, SelectedMap) == 0x0003B0, "Member 'UUmg_saveSlots_C::SelectedMap' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, SavesNames_infront) == 0x0003B8, "Member 'UUmg_saveSlots_C::SavesNames_infront' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Saves_infront) == 0x0003C8, "Member 'UUmg_saveSlots_C::Saves_infront' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Slots_infront) == 0x0003D8, "Member 'UUmg_saveSlots_C::Slots_infront' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlots_C, Slots_putInfront) == 0x0003E8, "Member 'UUmg_saveSlots_C::Slots_putInfront' has a wrong offset!");

}

