#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_carmapPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_carmapPoint.umg_carmapPoint_C
// 0x0020 (0x0280 - 0x0260)
class UUmg_carmapPoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_34;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_carmapPoint(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_carmapPoint_C">();
	}
	static class UUmg_carmapPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_carmapPoint_C>();
	}
};
static_assert(alignof(UUmg_carmapPoint_C) == 0x000008, "Wrong alignment on UUmg_carmapPoint_C");
static_assert(sizeof(UUmg_carmapPoint_C) == 0x000280, "Wrong size on UUmg_carmapPoint_C");
static_assert(offsetof(UUmg_carmapPoint_C, UberGraphFrame) == 0x000260, "Member 'UUmg_carmapPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_carmapPoint_C, Image_34) == 0x000268, "Member 'UUmg_carmapPoint_C::Image_34' has a wrong offset!");
static_assert(offsetof(UUmg_carmapPoint_C, MainCanvas) == 0x000270, "Member 'UUmg_carmapPoint_C::MainCanvas' has a wrong offset!");
static_assert(offsetof(UUmg_carmapPoint_C, Size) == 0x000278, "Member 'UUmg_carmapPoint_C::Size' has a wrong offset!");

}

