#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_camSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_camSlot.umg_camSlot_C
// 0x0058 (0x02B8 - 0x0260)
class UUmg_camSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_33;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_342;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_81;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_name;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Txt;                                               // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Index_Umg_camSlot_C;                               // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_laptop_C*                          Laptop;                                            // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AProp_rdrone_C*                         Drone;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_camSlot(int32 EntryPoint);
	void BndEvt__umg_camSlot_EditableTextBox_342_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__umg_camSlot_EditableTextBox_342_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__Button_33_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Upd();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_camSlot_C">();
	}
	static class UUmg_camSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_camSlot_C>();
	}
};
static_assert(alignof(UUmg_camSlot_C) == 0x000008, "Wrong alignment on UUmg_camSlot_C");
static_assert(sizeof(UUmg_camSlot_C) == 0x0002B8, "Wrong size on UUmg_camSlot_C");
static_assert(offsetof(UUmg_camSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_camSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, Button_33) == 0x000268, "Member 'UUmg_camSlot_C::Button_33' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, EditableTextBox_342) == 0x000270, "Member 'UUmg_camSlot_C::EditableTextBox_342' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, Image_81) == 0x000278, "Member 'UUmg_camSlot_C::Image_81' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, TextBlock_name) == 0x000280, "Member 'UUmg_camSlot_C::TextBlock_name' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, Txt) == 0x000288, "Member 'UUmg_camSlot_C::Txt' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, Index_Umg_camSlot_C) == 0x0002A0, "Member 'UUmg_camSlot_C::Index_Umg_camSlot_C' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, Laptop) == 0x0002A8, "Member 'UUmg_camSlot_C::Laptop' has a wrong offset!");
static_assert(offsetof(UUmg_camSlot_C, Drone) == 0x0002B0, "Member 'UUmg_camSlot_C::Drone' has a wrong offset!");

}

