#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_oj

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_oj.umg_oj_C
// 0x0038 (0x0298 - 0x0260)
class UUmg_oj_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_pivot;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_33;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         A;                                                 // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Obj;                                               // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0288(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_oj(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_oj_C">();
	}
	static class UUmg_oj_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_oj_C>();
	}
};
static_assert(alignof(UUmg_oj_C) == 0x000008, "Wrong alignment on UUmg_oj_C");
static_assert(sizeof(UUmg_oj_C) == 0x000298, "Wrong size on UUmg_oj_C");
static_assert(offsetof(UUmg_oj_C, UberGraphFrame) == 0x000260, "Member 'UUmg_oj_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_oj_C, Canvas_pivot) == 0x000268, "Member 'UUmg_oj_C::Canvas_pivot' has a wrong offset!");
static_assert(offsetof(UUmg_oj_C, Image_33) == 0x000270, "Member 'UUmg_oj_C::Image_33' has a wrong offset!");
static_assert(offsetof(UUmg_oj_C, A) == 0x000278, "Member 'UUmg_oj_C::A' has a wrong offset!");
static_assert(offsetof(UUmg_oj_C, Obj) == 0x000280, "Member 'UUmg_oj_C::Obj' has a wrong offset!");
static_assert(offsetof(UUmg_oj_C, Loc) == 0x000288, "Member 'UUmg_oj_C::Loc' has a wrong offset!");

}

