#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_menu.umg_menu_C
// 0x0208 (0x0468 - 0x0260)
class UUmg_menu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_achiv;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_credits;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_discord;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_exit;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_Help;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_itch;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_Menu;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_patreon;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_Resume;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_Save;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_Settings;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_start;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_stats;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_tutCanc;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_tutOk;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_twt;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_begin;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_blur;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_loading;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvMenu;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_178;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ScreenSwi;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_1;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_widgets;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnach;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btncreds;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnext;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnhelp;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnmenu;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnresum;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnsave;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnStart;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_btnstat;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_playTut;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_suppDisc;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_suppItch;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_suppPatr;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_supptwt;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_aut;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_links;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_loading;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_name;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_name_1;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_loading;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_version;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_achievements_C*                    Umg_achievements;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_credits_C*                         Umg_credits;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_exitConfirm_C*                     Umg_exitConfirm;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_gamemode_C*                        Umg_gamemode;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_help_C*                            Umg_help;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_keybinds_C*                        Umg_keybinds;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_langs_C*                           Umg_langs;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_mess_C*                            Umg_mess;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_patronList_C*                      Umg_patronList;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_resetSave_C*                       Umg_resetSave;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_saveSlots_C*                       Umg_saveSlots;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_settings_C*                        Umg_settings;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_stats_C*                           Umg_stats;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Fade;                                              // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_217B[0x3];                                     // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         A;                                                 // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound;                                             // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          beginn;                                            // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          As;                                                // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Canexit;                                           // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_217C[0x5];                                     // 0x0453(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                WidgetEnter;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPause;                                           // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Save;                                              // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_umg_menu(int32 EntryPoint);
	void OpenSolar();
	void OpenAmbience();
	void BndEvt__button_stats_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void Open_halloween();
	void BndEvt__button_launch_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_back_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void Resume();
	void Construct();
	void OpenSandbox();
	void OpenInfinite();
	void OpenStorymode();
	void OpenTutor();
	void BndEvt__button_achiv_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void Launch();
	void BndEvt__button_twt_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_discord_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_itch_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_patreon_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_credits_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void FadeIn();
	void BndEvt__button_Help_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_Settings_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_Menu_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_Save_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_Resume_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void BndEvt__button_Exit_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__button_NewGame_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Action(int32 Type, class UUmg_saveSlot_C* Param_Slot);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Gather(class FText* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_menu_C">();
	}
	static class UUmg_menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_menu_C>();
	}
};
static_assert(alignof(UUmg_menu_C) == 0x000008, "Wrong alignment on UUmg_menu_C");
static_assert(sizeof(UUmg_menu_C) == 0x000468, "Wrong size on UUmg_menu_C");
static_assert(offsetof(UUmg_menu_C, UberGraphFrame) == 0x000260, "Member 'UUmg_menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_achiv) == 0x000268, "Member 'UUmg_menu_C::button_achiv' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_credits) == 0x000270, "Member 'UUmg_menu_C::button_credits' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_discord) == 0x000278, "Member 'UUmg_menu_C::button_discord' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_exit) == 0x000280, "Member 'UUmg_menu_C::button_exit' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_Help) == 0x000288, "Member 'UUmg_menu_C::button_Help' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_itch) == 0x000290, "Member 'UUmg_menu_C::button_itch' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_Menu) == 0x000298, "Member 'UUmg_menu_C::button_Menu' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_patreon) == 0x0002A0, "Member 'UUmg_menu_C::button_patreon' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_Resume) == 0x0002A8, "Member 'UUmg_menu_C::button_Resume' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_Save) == 0x0002B0, "Member 'UUmg_menu_C::button_Save' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_Settings) == 0x0002B8, "Member 'UUmg_menu_C::button_Settings' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_start) == 0x0002C0, "Member 'UUmg_menu_C::button_start' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_stats) == 0x0002C8, "Member 'UUmg_menu_C::button_stats' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_tutCanc) == 0x0002D0, "Member 'UUmg_menu_C::button_tutCanc' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_tutOk) == 0x0002D8, "Member 'UUmg_menu_C::button_tutOk' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, button_twt) == 0x0002E0, "Member 'UUmg_menu_C::button_twt' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Canvas_begin) == 0x0002E8, "Member 'UUmg_menu_C::Canvas_begin' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Canvas_blur) == 0x0002F0, "Member 'UUmg_menu_C::Canvas_blur' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Canvas_loading) == 0x0002F8, "Member 'UUmg_menu_C::Canvas_loading' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, CanvMenu) == 0x000300, "Member 'UUmg_menu_C::CanvMenu' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Image_4) == 0x000308, "Member 'UUmg_menu_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Image_178) == 0x000310, "Member 'UUmg_menu_C::Image_178' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, ScreenSwi) == 0x000318, "Member 'UUmg_menu_C::ScreenSwi' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Switcher_1) == 0x000320, "Member 'UUmg_menu_C::Switcher_1' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Switcher_widgets) == 0x000328, "Member 'UUmg_menu_C::Switcher_widgets' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnach) == 0x000330, "Member 'UUmg_menu_C::Tex_btnach' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btncreds) == 0x000338, "Member 'UUmg_menu_C::Tex_btncreds' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnext) == 0x000340, "Member 'UUmg_menu_C::Tex_btnext' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnhelp) == 0x000348, "Member 'UUmg_menu_C::Tex_btnhelp' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnmenu) == 0x000350, "Member 'UUmg_menu_C::Tex_btnmenu' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnresum) == 0x000358, "Member 'UUmg_menu_C::Tex_btnresum' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnsave) == 0x000360, "Member 'UUmg_menu_C::Tex_btnsave' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnStart) == 0x000368, "Member 'UUmg_menu_C::Tex_btnStart' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_btnstat) == 0x000370, "Member 'UUmg_menu_C::Tex_btnstat' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_playTut) == 0x000378, "Member 'UUmg_menu_C::Tex_playTut' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_suppDisc) == 0x000380, "Member 'UUmg_menu_C::Tex_suppDisc' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_suppItch) == 0x000388, "Member 'UUmg_menu_C::Tex_suppItch' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_suppPatr) == 0x000390, "Member 'UUmg_menu_C::Tex_suppPatr' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Tex_supptwt) == 0x000398, "Member 'UUmg_menu_C::Tex_supptwt' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Text_aut) == 0x0003A0, "Member 'UUmg_menu_C::Text_aut' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Text_links) == 0x0003A8, "Member 'UUmg_menu_C::Text_links' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Text_loading) == 0x0003B0, "Member 'UUmg_menu_C::Text_loading' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Text_name) == 0x0003B8, "Member 'UUmg_menu_C::Text_name' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Text_name_1) == 0x0003C0, "Member 'UUmg_menu_C::Text_name_1' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Txt_loading) == 0x0003C8, "Member 'UUmg_menu_C::Txt_loading' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Txt_version) == 0x0003D0, "Member 'UUmg_menu_C::Txt_version' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_achievements) == 0x0003D8, "Member 'UUmg_menu_C::Umg_achievements' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_credits) == 0x0003E0, "Member 'UUmg_menu_C::Umg_credits' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_exitConfirm) == 0x0003E8, "Member 'UUmg_menu_C::Umg_exitConfirm' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_gamemode) == 0x0003F0, "Member 'UUmg_menu_C::Umg_gamemode' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_help) == 0x0003F8, "Member 'UUmg_menu_C::Umg_help' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_keybinds) == 0x000400, "Member 'UUmg_menu_C::Umg_keybinds' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_langs) == 0x000408, "Member 'UUmg_menu_C::Umg_langs' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_mess) == 0x000410, "Member 'UUmg_menu_C::Umg_mess' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_patronList) == 0x000418, "Member 'UUmg_menu_C::Umg_patronList' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_resetSave) == 0x000420, "Member 'UUmg_menu_C::Umg_resetSave' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_saveSlots) == 0x000428, "Member 'UUmg_menu_C::Umg_saveSlots' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_settings) == 0x000430, "Member 'UUmg_menu_C::Umg_settings' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Umg_stats) == 0x000438, "Member 'UUmg_menu_C::Umg_stats' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Fade) == 0x000440, "Member 'UUmg_menu_C::Fade' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, A) == 0x000444, "Member 'UUmg_menu_C::A' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Sound) == 0x000448, "Member 'UUmg_menu_C::Sound' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, beginn) == 0x000450, "Member 'UUmg_menu_C::beginn' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, As) == 0x000451, "Member 'UUmg_menu_C::As' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Canexit) == 0x000452, "Member 'UUmg_menu_C::Canexit' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, WidgetEnter) == 0x000458, "Member 'UUmg_menu_C::WidgetEnter' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, IsPause) == 0x000460, "Member 'UUmg_menu_C::IsPause' has a wrong offset!");
static_assert(offsetof(UUmg_menu_C, Save) == 0x000461, "Member 'UUmg_menu_C::Save' has a wrong offset!");

}

