#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_serverMinigameNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_serverMinigameNumber.umg_serverMinigameNumber_C
// 0x0028 (0x0288 - 0x0260)
class UUmg_serverMinigameNumber_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_num;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_num;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_serverMinigameSlott_C*             Owner;                                             // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_serverMinigameNumber(int32 EntryPoint);
	void BndEvt__button_num_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_serverMinigameNumber_C">();
	}
	static class UUmg_serverMinigameNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_serverMinigameNumber_C>();
	}
};
static_assert(alignof(UUmg_serverMinigameNumber_C) == 0x000008, "Wrong alignment on UUmg_serverMinigameNumber_C");
static_assert(sizeof(UUmg_serverMinigameNumber_C) == 0x000288, "Wrong size on UUmg_serverMinigameNumber_C");
static_assert(offsetof(UUmg_serverMinigameNumber_C, UberGraphFrame) == 0x000260, "Member 'UUmg_serverMinigameNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_serverMinigameNumber_C, button_num) == 0x000268, "Member 'UUmg_serverMinigameNumber_C::button_num' has a wrong offset!");
static_assert(offsetof(UUmg_serverMinigameNumber_C, Text_num) == 0x000270, "Member 'UUmg_serverMinigameNumber_C::Text_num' has a wrong offset!");
static_assert(offsetof(UUmg_serverMinigameNumber_C, Num) == 0x000278, "Member 'UUmg_serverMinigameNumber_C::Num' has a wrong offset!");
static_assert(offsetof(UUmg_serverMinigameNumber_C, Owner) == 0x000280, "Member 'UUmg_serverMinigameNumber_C::Owner' has a wrong offset!");

}

