#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_hint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_notifyType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_hint.umg_hint_C
// 0x0058 (0x02B8 - 0x0260)
class UUmg_hint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canv;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_base;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_102;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_80;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_infoTex;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         A;                                                 // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Targ;                                              // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                      State;                                             // 0x0298(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Ae;                                                // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Mass;                                              // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pos;                                               // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Siz;                                               // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Resiz;                                             // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	Enum_notifyType                               Type;                                              // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_hint(int32 EntryPoint);
	void Del();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void begin(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_hint_C">();
	}
	static class UUmg_hint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_hint_C>();
	}
};
static_assert(alignof(UUmg_hint_C) == 0x000008, "Wrong alignment on UUmg_hint_C");
static_assert(sizeof(UUmg_hint_C) == 0x0002B8, "Wrong size on UUmg_hint_C");
static_assert(offsetof(UUmg_hint_C, UberGraphFrame) == 0x000260, "Member 'UUmg_hint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Canv) == 0x000268, "Member 'UUmg_hint_C::Canv' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Canvas_base) == 0x000270, "Member 'UUmg_hint_C::Canvas_base' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Image_102) == 0x000278, "Member 'UUmg_hint_C::Image_102' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, RetainerBox_80) == 0x000280, "Member 'UUmg_hint_C::RetainerBox_80' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Tex_infoTex) == 0x000288, "Member 'UUmg_hint_C::Tex_infoTex' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, A) == 0x000290, "Member 'UUmg_hint_C::A' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Targ) == 0x000294, "Member 'UUmg_hint_C::Targ' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, State) == 0x000298, "Member 'UUmg_hint_C::State' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Ae) == 0x0002A0, "Member 'UUmg_hint_C::Ae' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Mass) == 0x0002A4, "Member 'UUmg_hint_C::Mass' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Pos) == 0x0002A8, "Member 'UUmg_hint_C::Pos' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Siz) == 0x0002AC, "Member 'UUmg_hint_C::Siz' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Resiz) == 0x0002B0, "Member 'UUmg_hint_C::Resiz' has a wrong offset!");
static_assert(offsetof(UUmg_hint_C, Type) == 0x0002B1, "Member 'UUmg_hint_C::Type' has a wrong offset!");

}

