#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_printer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function umg_printer.umg_printer_C.ExecuteUbergraph_umg_printer
// 0x0080 (0x0080 - 0x0000)
struct Umg_printer_C_ExecuteUbergraph_umg_printer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2641[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	bool                                          CallFunc_setActiveInterface_return;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpen_ReturnValue_1;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpen_ReturnValue_2;                     // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2642[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_3;         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_3;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETextureFilter                                CallFunc_nameToFilter_Filter;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2643[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_2;         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_2;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2644[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextureFilter                                CallFunc_nameToFilter_Filter_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextureFilter                                CallFunc_nameToFilter_Filter_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2645[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_nameToMaterial_mat;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue_3;                     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isBuoyant__buoyant_;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_printer_C_ExecuteUbergraph_umg_printer) == 0x000008, "Wrong alignment on Umg_printer_C_ExecuteUbergraph_umg_printer");
static_assert(sizeof(Umg_printer_C_ExecuteUbergraph_umg_printer) == 0x000080, "Wrong size on Umg_printer_C_ExecuteUbergraph_umg_printer");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, EntryPoint) == 0x000000, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_getMainPlayer_AsMain_Player) == 0x000008, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_Event_InFocusEvent) == 0x000010, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_setActiveInterface_return) == 0x000018, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_setActiveInterface_return' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_IsOpen_ReturnValue) == 0x000019, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_IsOpen_ReturnValue_1) == 0x00001A, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_IsOpen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_IsOpen_ReturnValue_2) == 0x00001B, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_IsOpen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectedItem_3) == 0x000020, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectedItem_3' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectionType_3) == 0x000030, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectionType_3' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_BooleanOR_ReturnValue_1) == 0x000031, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_nameToFilter_Filter) == 0x000032, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_nameToFilter_Filter' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectedItem_2) == 0x000038, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectedItem_2' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectionType_2) == 0x000048, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectionType_2' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000050, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectionType_1) == 0x000060, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_nameToFilter_Filter_1) == 0x000061, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_nameToFilter_Filter_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_nameToFilter_Filter_2) == 0x000062, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_nameToFilter_Filter_2' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectedItem) == 0x000068, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, K2Node_ComponentBoundEvent_SelectionType) == 0x000078, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_nameToMaterial_mat) == 0x000079, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_nameToMaterial_mat' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_IsOpen_ReturnValue_3) == 0x00007A, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_IsOpen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_BooleanOR_ReturnValue_2) == 0x00007B, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_ExecuteUbergraph_umg_printer, CallFunc_isBuoyant__buoyant_) == 0x00007C, "Member 'Umg_printer_C_ExecuteUbergraph_umg_printer::CallFunc_isBuoyant__buoyant_' has a wrong offset!");

// Function umg_printer.umg_printer_C.BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function umg_printer.umg_printer_C.BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function umg_printer.umg_printer_C.BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function umg_printer.umg_printer_C.BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Umg_printer_C_BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function umg_printer.umg_printer_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct Umg_printer_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(Umg_printer_C_OnFocusLost) == 0x000004, "Wrong alignment on Umg_printer_C_OnFocusLost");
static_assert(sizeof(Umg_printer_C_OnFocusLost) == 0x000008, "Wrong size on Umg_printer_C_OnFocusLost");
static_assert(offsetof(Umg_printer_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'Umg_printer_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function umg_printer.umg_printer_C.gen
// 0x0078 (0x0078 - 0x0000)
struct Umg_printer_C_Gen final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2646[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_printerSlot_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_printerSlot_C*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2647[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_userAssetFolder_path;                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2648[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_printer_C_Gen) == 0x000008, "Wrong alignment on Umg_printer_C_Gen");
static_assert(sizeof(Umg_printer_C_Gen) == 0x000078, "Wrong size on Umg_printer_C_Gen");
static_assert(offsetof(Umg_printer_C_Gen, Temp_int_Variable) == 0x000000, "Member 'Umg_printer_C_Gen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Create_ReturnValue) == 0x000008, "Member 'Umg_printer_C_Gen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Umg_printer_C_Gen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, Temp_int_Array_Index_Variable) == 0x000014, "Member 'Umg_printer_C_Gen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'Umg_printer_C_Gen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'Umg_printer_C_Gen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Array_Get_Item) == 0x000020, "Member 'Umg_printer_C_Gen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'Umg_printer_C_Gen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'Umg_printer_C_Gen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Umg_printer_C_Gen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'Umg_printer_C_Gen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_userAssetFolder_path) == 0x000040, "Member 'Umg_printer_C_Gen::CallFunc_userAssetFolder_path' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000050, "Member 'Umg_printer_C_Gen::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'Umg_printer_C_Gen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'Umg_printer_C_Gen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Gen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'Umg_printer_C_Gen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function umg_printer.umg_printer_C.OnKeyDown
// 0x0200 (0x0200 - 0x0000)
struct Umg_printer_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0140(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_printer_C_OnKeyDown) == 0x000008, "Wrong alignment on Umg_printer_C_OnKeyDown");
static_assert(sizeof(Umg_printer_C_OnKeyDown) == 0x000200, "Wrong size on Umg_printer_C_OnKeyDown");
static_assert(offsetof(Umg_printer_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'Umg_printer_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'Umg_printer_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'Umg_printer_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'Umg_printer_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_OnKeyDown, K2Node_MakeStruct_EventReply) == 0x000140, "Member 'Umg_printer_C_OnKeyDown::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'Umg_printer_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function umg_printer.umg_printer_C.Info
// 0x00B0 (0x00B0 - 0x0000)
struct Umg_printer_C_Info final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2649[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0040(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264C[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_2;            // 0x0098(0x0018)()
};
static_assert(alignof(Umg_printer_C_Info) == 0x000008, "Wrong alignment on Umg_printer_C_Info");
static_assert(sizeof(Umg_printer_C_Info) == 0x0000B0, "Wrong size on Umg_printer_C_Info");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Umg_printer_C_Info::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'Umg_printer_C_Info::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Conv_BoolToText_ReturnValue) == 0x000008, "Member 'Umg_printer_C_Info::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'Umg_printer_C_Info::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'Umg_printer_C_Info::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000040, "Member 'Umg_printer_C_Info::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'Umg_printer_C_Info::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x000060, "Member 'Umg_printer_C_Info::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'Umg_printer_C_Info::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'Umg_printer_C_Info::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_Info, CallFunc_Conv_BoolToText_ReturnValue_2) == 0x000098, "Member 'Umg_printer_C_Info::CallFunc_Conv_BoolToText_ReturnValue_2' has a wrong offset!");

// Function umg_printer.umg_printer_C.nameToFilter
// 0x0060 (0x0060 - 0x0000)
struct Umg_printer_C_NameToFilter final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ETextureFilter                                Filter;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETextureFilter>                        B;                                                 // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         A;                                                 // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<ETextureFilter>                        K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextureFilter                                CallFunc_Array_Get_Item;                           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_printer_C_NameToFilter) == 0x000008, "Wrong alignment on Umg_printer_C_NameToFilter");
static_assert(sizeof(Umg_printer_C_NameToFilter) == 0x000060, "Wrong size on Umg_printer_C_NameToFilter");
static_assert(offsetof(Umg_printer_C_NameToFilter, Param_Name) == 0x000000, "Member 'Umg_printer_C_NameToFilter::Param_Name' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, Filter) == 0x000010, "Member 'Umg_printer_C_NameToFilter::Filter' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, B) == 0x000018, "Member 'Umg_printer_C_NameToFilter::B' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, A) == 0x000028, "Member 'Umg_printer_C_NameToFilter::A' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, K2Node_MakeArray_Array) == 0x000038, "Member 'Umg_printer_C_NameToFilter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, K2Node_MakeArray_Array_1) == 0x000048, "Member 'Umg_printer_C_NameToFilter::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, CallFunc_Array_Find_ReturnValue) == 0x000058, "Member 'Umg_printer_C_NameToFilter::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToFilter, CallFunc_Array_Get_Item) == 0x00005C, "Member 'Umg_printer_C_NameToFilter::CallFunc_Array_Get_Item' has a wrong offset!");

// Function umg_printer.umg_printer_C.nameToMaterial
// 0x0060 (0x0060 - 0x0000)
struct Umg_printer_C_NameToMaterial final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Mat;                                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETextureFilter>                        B;                                                 // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         A;                                                 // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<ETextureFilter>                        K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_printer_C_NameToMaterial) == 0x000008, "Wrong alignment on Umg_printer_C_NameToMaterial");
static_assert(sizeof(Umg_printer_C_NameToMaterial) == 0x000060, "Wrong size on Umg_printer_C_NameToMaterial");
static_assert(offsetof(Umg_printer_C_NameToMaterial, Param_Name) == 0x000000, "Member 'Umg_printer_C_NameToMaterial::Param_Name' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToMaterial, Mat) == 0x000010, "Member 'Umg_printer_C_NameToMaterial::Mat' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToMaterial, B) == 0x000018, "Member 'Umg_printer_C_NameToMaterial::B' has a wrong offset!");
static_assert(offsetof(Umg_printer_C_NameToMaterial, A) == 0x000028, "Member 'Umg_printer_C_NameToMaterial::A' has a wrong offset!");
