#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_help

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_help.umg_help_C
// 0x0170 (0x03D0 - 0x0260)
class UUmg_help_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_exit;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             Helpbox;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             Helpbox_desc;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_302;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_help;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Textbox_search;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USave_main_C*                           Sav;                                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUmg_settingsSlot_C*>            Sliders;                                           // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUmg_settingsSlot_C*>            V_slots;                                           // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUmg_settingsSlot_C*>            S_slots;                                           // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FStruct_settings                       SettingsCopy;                                      // 0x02D0(0x00CC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2164[0x4];                                     // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUmg_helpButton_C*>              HelpButtons;                                       // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUmg_helpButton_C*                      Active;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SearchTxt;                                         // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_umg_help(int32 EntryPoint);
	void BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void Resume();
	void BndEvt__button_exit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetIndex(int32 Param_Index);
	void Press(class UUmg_helpButton_C* Button);
	void Search(const class FText& Prompt);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_help_C">();
	}
	static class UUmg_help_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_help_C>();
	}
};
static_assert(alignof(UUmg_help_C) == 0x000008, "Wrong alignment on UUmg_help_C");
static_assert(sizeof(UUmg_help_C) == 0x0003D0, "Wrong size on UUmg_help_C");
static_assert(offsetof(UUmg_help_C, UberGraphFrame) == 0x000260, "Member 'UUmg_help_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, button_exit) == 0x000268, "Member 'UUmg_help_C::button_exit' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Helpbox) == 0x000270, "Member 'UUmg_help_C::Helpbox' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Helpbox_desc) == 0x000278, "Member 'UUmg_help_C::Helpbox_desc' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Image_302) == 0x000280, "Member 'UUmg_help_C::Image_302' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Text_help) == 0x000288, "Member 'UUmg_help_C::Text_help' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Textbox_search) == 0x000290, "Member 'UUmg_help_C::Textbox_search' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Sav) == 0x000298, "Member 'UUmg_help_C::Sav' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Sliders) == 0x0002A0, "Member 'UUmg_help_C::Sliders' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, V_slots) == 0x0002B0, "Member 'UUmg_help_C::V_slots' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, S_slots) == 0x0002C0, "Member 'UUmg_help_C::S_slots' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, SettingsCopy) == 0x0002D0, "Member 'UUmg_help_C::SettingsCopy' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, HelpButtons) == 0x0003A0, "Member 'UUmg_help_C::HelpButtons' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, Active) == 0x0003B0, "Member 'UUmg_help_C::Active' has a wrong offset!");
static_assert(offsetof(UUmg_help_C, SearchTxt) == 0x0003B8, "Member 'UUmg_help_C::SearchTxt' has a wrong offset!");

}

