#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_signal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_signal.umg_signal_C
// 0x0020 (0x0280 - 0x0260)
class UUmg_signal_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_59;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Loc;                                               // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_signal(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_signal_C">();
	}
	static class UUmg_signal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_signal_C>();
	}
};
static_assert(alignof(UUmg_signal_C) == 0x000008, "Wrong alignment on UUmg_signal_C");
static_assert(sizeof(UUmg_signal_C) == 0x000280, "Wrong size on UUmg_signal_C");
static_assert(offsetof(UUmg_signal_C, UberGraphFrame) == 0x000260, "Member 'UUmg_signal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_signal_C, Image_59) == 0x000268, "Member 'UUmg_signal_C::Image_59' has a wrong offset!");
static_assert(offsetof(UUmg_signal_C, Loc) == 0x000270, "Member 'UUmg_signal_C::Loc' has a wrong offset!");

}

