#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_onlineRadio

#include "Basic.hpp"

#include "Struct_tv_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Enum_playlist_structs.hpp"


namespace SDK::Params
{

// Function umg_onlineRadio.umg_onlineRadio_C.ExecuteUbergraph_umg_onlineRadio
// 0x0080 (0x0080 - 0x0000)
struct Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_playlist                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_playlist                                 Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_playlist                                 Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_playlist                                 Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_radio_internet_C*                 K2Node_CustomEvent_radio;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0018(0x0008)(NoDestructor)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0028(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_playlist                                 Temp_byte_Variable_4;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_setActiveInterface_return;                // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	Enum_playlist                                 K2Node_Select_Default;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio) == 0x000008, "Wrong alignment on Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio");
static_assert(sizeof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio) == 0x000080, "Wrong size on Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, EntryPoint) == 0x000000, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, Temp_byte_Variable) == 0x000004, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, Temp_byte_Variable_1) == 0x000005, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, Temp_byte_Variable_2) == 0x000006, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, Temp_byte_Variable_3) == 0x000007, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, K2Node_CustomEvent_radio) == 0x000008, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::K2Node_CustomEvent_radio' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_getMainPlayer_AsMain_Player) == 0x000010, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, K2Node_Event_InFocusEvent) == 0x000018, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, K2Node_ComponentBoundEvent_Value) == 0x000020, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_Play_ReturnValue) == 0x000024, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_Conv_FloatToText_ReturnValue) == 0x000028, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, Temp_byte_Variable_4) == 0x000044, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_Pause_ReturnValue) == 0x000045, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_Pause_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_setActiveInterface_return) == 0x000046, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_setActiveInterface_return' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000048, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, K2Node_Select_Default) == 0x000070, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000078, "Member 'Umg_onlineRadio_C_ExecuteUbergraph_umg_onlineRadio::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

// Function umg_onlineRadio.umg_onlineRadio_C.BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'Umg_onlineRadio_C_BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function umg_onlineRadio.umg_onlineRadio_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct Umg_onlineRadio_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(Umg_onlineRadio_C_OnFocusLost) == 0x000004, "Wrong alignment on Umg_onlineRadio_C_OnFocusLost");
static_assert(sizeof(Umg_onlineRadio_C_OnFocusLost) == 0x000008, "Wrong size on Umg_onlineRadio_C_OnFocusLost");
static_assert(offsetof(Umg_onlineRadio_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'Umg_onlineRadio_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function umg_onlineRadio.umg_onlineRadio_C.Open
// 0x0008 (0x0008 - 0x0000)
struct Umg_onlineRadio_C_Open final
{
public:
	class AProp_radio_internet_C*                 Param_Radio;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_onlineRadio_C_Open) == 0x000008, "Wrong alignment on Umg_onlineRadio_C_Open");
static_assert(sizeof(Umg_onlineRadio_C_Open) == 0x000008, "Wrong size on Umg_onlineRadio_C_Open");
static_assert(offsetof(Umg_onlineRadio_C_Open, Param_Radio) == 0x000000, "Member 'Umg_onlineRadio_C_Open::Param_Radio' has a wrong offset!");

// Function umg_onlineRadio.umg_onlineRadio_C.gen
// 0x0080 (0x0080 - 0x0000)
struct Umg_onlineRadio_C_Gen final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_radioStSlot_C*                     CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_radioStSlot_C*                     CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_tv                             CallFunc_Array_Get_Item_1;                         // 0x0058(0x0028)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_onlineRadio_C_Gen) == 0x000008, "Wrong alignment on Umg_onlineRadio_C_Gen");
static_assert(sizeof(Umg_onlineRadio_C_Gen) == 0x000080, "Wrong size on Umg_onlineRadio_C_Gen");
static_assert(offsetof(Umg_onlineRadio_C_Gen, Param_Name) == 0x000000, "Member 'Umg_onlineRadio_C_Gen::Param_Name' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, Temp_int_Variable) == 0x000010, "Member 'Umg_onlineRadio_C_Gen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'Umg_onlineRadio_C_Gen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'Umg_onlineRadio_C_Gen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000030, "Member 'Umg_onlineRadio_C_Gen::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Array_Get_Item) == 0x000038, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Less_IntInt_ReturnValue_1) == 0x00004C, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, Temp_int_Array_Index_Variable) == 0x000054, "Member 'Umg_onlineRadio_C_Gen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Gen, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'Umg_onlineRadio_C_Gen::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function umg_onlineRadio.umg_onlineRadio_C.OnKeyDown
// 0x0200 (0x0200 - 0x0000)
struct Umg_onlineRadio_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0128(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_onlineRadio_C_OnKeyDown) == 0x000008, "Wrong alignment on Umg_onlineRadio_C_OnKeyDown");
static_assert(sizeof(Umg_onlineRadio_C_OnKeyDown) == 0x000200, "Wrong size on Umg_onlineRadio_C_OnKeyDown");
static_assert(offsetof(Umg_onlineRadio_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'Umg_onlineRadio_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'Umg_onlineRadio_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'Umg_onlineRadio_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_OnKeyDown, K2Node_MakeStruct_EventReply) == 0x000128, "Member 'Umg_onlineRadio_C_OnKeyDown::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x0001E0, "Member 'Umg_onlineRadio_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'Umg_onlineRadio_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function umg_onlineRadio.umg_onlineRadio_C.select
// 0x0060 (0x0060 - 0x0000)
struct Umg_onlineRadio_C_Select final
{
public:
	struct FStruct_tv                             Param_Data;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          PausePlayer;                                       // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class UUmg_radioStSlot_C*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_onlineRadio_C_Select) == 0x000008, "Wrong alignment on Umg_onlineRadio_C_Select");
static_assert(sizeof(Umg_onlineRadio_C_Select) == 0x000060, "Wrong size on Umg_onlineRadio_C_Select");
static_assert(offsetof(Umg_onlineRadio_C_Select, Param_Data) == 0x000000, "Member 'Umg_onlineRadio_C_Select::Param_Data' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, PausePlayer) == 0x000028, "Member 'Umg_onlineRadio_C_Select::PausePlayer' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, Temp_int_Variable) == 0x00002C, "Member 'Umg_onlineRadio_C_Select::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Umg_onlineRadio_C_Select::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'Umg_onlineRadio_C_Select::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, CallFunc_Array_Get_Item) == 0x000050, "Member 'Umg_onlineRadio_C_Select::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Umg_onlineRadio_C_Select::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_onlineRadio_C_Select, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'Umg_onlineRadio_C_Select::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

