#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_oj

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_oj.umg_oj_C.ExecuteUbergraph_umg_oj
// 0x0150 (0x0150 - 0x0000)
struct Umg_oj_C_ExecuteUbergraph_umg_oj final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetVectorLength_ReturnValue;              // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_oj_C_ExecuteUbergraph_umg_oj) == 0x000010, "Wrong alignment on Umg_oj_C_ExecuteUbergraph_umg_oj");
static_assert(sizeof(Umg_oj_C_ExecuteUbergraph_umg_oj) == 0x000150, "Wrong size on Umg_oj_C_ExecuteUbergraph_umg_oj");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, EntryPoint) == 0x000000, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, K2Node_Event_MyGeometry) == 0x000004, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000050, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000060, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, Temp_int_Variable) == 0x00006C, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000078, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x00008C, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x000094, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Vector_Distance_ReturnValue) == 0x000098, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00009C, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_MakeVector2D_ReturnValue) == 0x0000A0, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000A8, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_GetComponentBounds_Origin) == 0x0000B0, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_GetComponentBounds_BoxExtent) == 0x0000BC, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_GetComponentBounds_SphereRadius) == 0x0000C8, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_getMainPlayer_AsMain_Player) == 0x0000D0, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D8, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Add_VectorVector_ReturnValue) == 0x0000E4, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F0, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000130, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_ExecuteUbergraph_umg_oj, CallFunc_SetVectorLength_ReturnValue) == 0x00013C, "Member 'Umg_oj_C_ExecuteUbergraph_umg_oj::CallFunc_SetVectorLength_ReturnValue' has a wrong offset!");

// Function umg_oj.umg_oj_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_oj_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_oj_C_Tick) == 0x000004, "Wrong alignment on Umg_oj_C_Tick");
static_assert(sizeof(Umg_oj_C_Tick) == 0x00003C, "Wrong size on Umg_oj_C_Tick");
static_assert(offsetof(Umg_oj_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_oj_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_oj_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_oj_C_Tick::InDeltaTime' has a wrong offset!");

}

