#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_settingsSlot_funny

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_settingsSlot_funny.umg_settingsSlot_funny_C
// 0x0020 (0x0280 - 0x0260)
class UUmg_settingsSlot_funny_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              CheckBox_vres;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Textv;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_settings_C*                        Parent;                                            // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_settingsSlot_funny(int32 EntryPoint);
	void Upd();
	void BndEvt__umg_settingsSlot_funny_CheckBox_vres_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_settingsSlot_funny_C">();
	}
	static class UUmg_settingsSlot_funny_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_settingsSlot_funny_C>();
	}
};
static_assert(alignof(UUmg_settingsSlot_funny_C) == 0x000008, "Wrong alignment on UUmg_settingsSlot_funny_C");
static_assert(sizeof(UUmg_settingsSlot_funny_C) == 0x000280, "Wrong size on UUmg_settingsSlot_funny_C");
static_assert(offsetof(UUmg_settingsSlot_funny_C, UberGraphFrame) == 0x000260, "Member 'UUmg_settingsSlot_funny_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_funny_C, CheckBox_vres) == 0x000268, "Member 'UUmg_settingsSlot_funny_C::CheckBox_vres' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_funny_C, Textv) == 0x000270, "Member 'UUmg_settingsSlot_funny_C::Textv' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_funny_C, Parent) == 0x000278, "Member 'UUmg_settingsSlot_funny_C::Parent' has a wrong offset!");

}

