#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_mess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_mess.umg_mess_C
// 0x0040 (0x02A0 - 0x0260)
class UUmg_mess_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_back;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_okay;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_106;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_msg;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_top;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Action;                                            // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_saveSlot_C*                        AcSlot;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_mess(int32 EntryPoint);
	void BndEvt__button_okay_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_back_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Upd(int32 Param_Action, class UUmg_saveSlot_C* Param_Slot);
	void Hide();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_mess_C">();
	}
	static class UUmg_mess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_mess_C>();
	}
};
static_assert(alignof(UUmg_mess_C) == 0x000008, "Wrong alignment on UUmg_mess_C");
static_assert(sizeof(UUmg_mess_C) == 0x0002A0, "Wrong size on UUmg_mess_C");
static_assert(offsetof(UUmg_mess_C, UberGraphFrame) == 0x000260, "Member 'UUmg_mess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, button_back) == 0x000268, "Member 'UUmg_mess_C::button_back' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, button_okay) == 0x000270, "Member 'UUmg_mess_C::button_okay' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, Image_106) == 0x000278, "Member 'UUmg_mess_C::Image_106' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, Txt_msg) == 0x000280, "Member 'UUmg_mess_C::Txt_msg' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, Txt_top) == 0x000288, "Member 'UUmg_mess_C::Txt_top' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, Action) == 0x000290, "Member 'UUmg_mess_C::Action' has a wrong offset!");
static_assert(offsetof(UUmg_mess_C, AcSlot) == 0x000298, "Member 'UUmg_mess_C::AcSlot' has a wrong offset!");

}

