#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_minimap

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_minimap.umg_minimap_C
// 0x0020 (0x0280 - 0x0260)
class UUmg_minimap_C final : public UUserWidget
{
public:
	class UCanvasPanel*                           Canvaas;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_47;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_xloc;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_yloc;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_minimap_C">();
	}
	static class UUmg_minimap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_minimap_C>();
	}
};
static_assert(alignof(UUmg_minimap_C) == 0x000008, "Wrong alignment on UUmg_minimap_C");
static_assert(sizeof(UUmg_minimap_C) == 0x000280, "Wrong size on UUmg_minimap_C");
static_assert(offsetof(UUmg_minimap_C, Canvaas) == 0x000260, "Member 'UUmg_minimap_C::Canvaas' has a wrong offset!");
static_assert(offsetof(UUmg_minimap_C, Image_47) == 0x000268, "Member 'UUmg_minimap_C::Image_47' has a wrong offset!");
static_assert(offsetof(UUmg_minimap_C, Txt_xloc) == 0x000270, "Member 'UUmg_minimap_C::Txt_xloc' has a wrong offset!");
static_assert(offsetof(UUmg_minimap_C, Txt_yloc) == 0x000278, "Member 'UUmg_minimap_C::Txt_yloc' has a wrong offset!");

}

