#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_serverMinigameNumber

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_serverMinigameNumber.umg_serverMinigameNumber_C.ExecuteUbergraph_umg_serverMinigameNumber
// 0x0048 (0x0048 - 0x0000)
struct Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DFloat_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber) == 0x000008, "Wrong alignment on Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber");
static_assert(sizeof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber) == 0x000048, "Wrong size on Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, EntryPoint) == 0x000000, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Multiply_IntInt_ReturnValue) == 0x000020, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000024, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00002C, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Add_Vector2DFloat_ReturnValue) == 0x000038, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Add_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'Umg_serverMinigameNumber_C_ExecuteUbergraph_umg_serverMinigameNumber::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

}

