#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_photoSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_photoSlot.umg_photoSlot_C
// 0x0048 (0x02A8 - 0x0260)
class UUmg_photoSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_65;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_152;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_print;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_pic;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture*                               Tex;                                               // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUmg_laptop_C*                          Laptop;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Ind;                                               // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_photoSlot(int32 EntryPoint);
	void BndEvt__umg_phSlot_Button_print_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_152_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_65_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void GoPrint();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_photoSlot_C">();
	}
	static class UUmg_photoSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_photoSlot_C>();
	}
};
static_assert(alignof(UUmg_photoSlot_C) == 0x000008, "Wrong alignment on UUmg_photoSlot_C");
static_assert(sizeof(UUmg_photoSlot_C) == 0x0002A8, "Wrong size on UUmg_photoSlot_C");
static_assert(offsetof(UUmg_photoSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_photoSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Button) == 0x000268, "Member 'UUmg_photoSlot_C::Button' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Button_65) == 0x000270, "Member 'UUmg_photoSlot_C::Button_65' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Button_152) == 0x000278, "Member 'UUmg_photoSlot_C::Button_152' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Button_print) == 0x000280, "Member 'UUmg_photoSlot_C::Button_print' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Image_pic) == 0x000288, "Member 'UUmg_photoSlot_C::Image_pic' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Tex) == 0x000290, "Member 'UUmg_photoSlot_C::Tex' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Laptop) == 0x000298, "Member 'UUmg_photoSlot_C::Laptop' has a wrong offset!");
static_assert(offsetof(UUmg_photoSlot_C, Ind) == 0x0002A0, "Member 'UUmg_photoSlot_C::Ind' has a wrong offset!");

}

