#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_hovertextNametag

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function umg_hovertextNametag.umg_hovertextNametag_C.ExecuteUbergraph_umg_hovertextNametag
// 0x00E0 (0x00E0 - 0x0000)
struct Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_loc_Origin;                               // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFOVAngle_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag) == 0x000008, "Wrong alignment on Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag");
static_assert(sizeof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag) == 0x0000E0, "Wrong size on Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, EntryPoint) == 0x000000, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_loc_Origin) == 0x000004, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_loc_Origin' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, K2Node_Event_MyGeometry) == 0x000020, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, K2Node_Event_InDeltaTime) == 0x000058, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000060, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_GetFOVAngle_ReturnValue) == 0x000068, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_GetFOVAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000078, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x00007C, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_GetDesiredSize_ReturnValue) == 0x000084, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Vector_Distance_ReturnValue) == 0x000098, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x00009C, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x0000A4, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000A8, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000AC, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000B0, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_MakeVector2D_ReturnValue) == 0x0000BC, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_BreakVector2D_X) == 0x0000C4, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_BreakVector2D_Y) == 0x0000C8, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000CC, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000D4, "Member 'Umg_hovertextNametag_C_ExecuteUbergraph_umg_hovertextNametag::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function umg_hovertextNametag.umg_hovertextNametag_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_hovertextNametag_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_hovertextNametag_C_Tick) == 0x000004, "Wrong alignment on Umg_hovertextNametag_C_Tick");
static_assert(sizeof(Umg_hovertextNametag_C_Tick) == 0x00003C, "Wrong size on Umg_hovertextNametag_C_Tick");
static_assert(offsetof(Umg_hovertextNametag_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_hovertextNametag_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_hovertextNametag_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_hovertextNametag.umg_hovertextNametag_C.Loc
// 0x0058 (0x0058 - 0x0000)
struct Umg_hovertextNametag_C_Loc final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_hovertextNametag_C_Loc) == 0x000008, "Wrong alignment on Umg_hovertextNametag_C_Loc");
static_assert(sizeof(Umg_hovertextNametag_C_Loc) == 0x000058, "Wrong size on Umg_hovertextNametag_C_Loc");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, Origin) == 0x000000, "Member 'Umg_hovertextNametag_C_Loc::Origin' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_GetComponentBounds_Origin) == 0x000010, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_GetComponentBounds_BoxExtent) == 0x00001C, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_GetComponentBounds_SphereRadius) == 0x000028, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_IsValid_ReturnValue_1) == 0x00002C, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_GetComponentBounds_Origin_1) == 0x000038, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_GetComponentBounds_BoxExtent_1) == 0x000044, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(Umg_hovertextNametag_C_Loc, CallFunc_GetComponentBounds_SphereRadius_1) == 0x000050, "Member 'Umg_hovertextNametag_C_Loc::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");

}

