#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_signalName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_signalName.umg_signalName_C
// 0x0030 (0x0290 - 0x0260)
class UUmg_signalName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_tab_upgrades;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Etxt_name;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_29;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USignalSlot_C*                          Rename;                                            // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Qi;                                                // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_umg_signalName(int32 EntryPoint);
	void BndEvt__Etxt_name_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Exi();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void BndEvt__button_tab_upgrades_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Init(class USignalSlot_C* Param_Rename);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_signalName_C">();
	}
	static class UUmg_signalName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_signalName_C>();
	}
};
static_assert(alignof(UUmg_signalName_C) == 0x000008, "Wrong alignment on UUmg_signalName_C");
static_assert(sizeof(UUmg_signalName_C) == 0x000290, "Wrong size on UUmg_signalName_C");
static_assert(offsetof(UUmg_signalName_C, UberGraphFrame) == 0x000260, "Member 'UUmg_signalName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_signalName_C, button_tab_upgrades) == 0x000268, "Member 'UUmg_signalName_C::button_tab_upgrades' has a wrong offset!");
static_assert(offsetof(UUmg_signalName_C, Etxt_name) == 0x000270, "Member 'UUmg_signalName_C::Etxt_name' has a wrong offset!");
static_assert(offsetof(UUmg_signalName_C, Image_29) == 0x000278, "Member 'UUmg_signalName_C::Image_29' has a wrong offset!");
static_assert(offsetof(UUmg_signalName_C, Rename) == 0x000280, "Member 'UUmg_signalName_C::Rename' has a wrong offset!");
static_assert(offsetof(UUmg_signalName_C, Qi) == 0x000288, "Member 'UUmg_signalName_C::Qi' has a wrong offset!");

}

