#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_spawnmenuSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Struct_prop_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_spawnmenuSlot.umg_spawnmenuSlot_C
// 0x00E8 (0x0348 - 0x0260)
class UUmg_spawnmenuSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_41;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_125;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_cov;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_name;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_number;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_Umg_spawnmenuSlot_C;                         // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_prop                           Data;                                              // 0x02A0(0x0080)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Name_Umg_spawnmenuSlot_C;                          // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynmat;                                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_spawnmenu_C*                       Owner;                                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Spec;                                              // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_spawnmenuSlot(int32 EntryPoint);
	void Construct();
	void BndEvt__umg_spawnmenuSlot_Button_41_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_41_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_41_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Filter();
	void SetGridLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_spawnmenuSlot_C">();
	}
	static class UUmg_spawnmenuSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_spawnmenuSlot_C>();
	}
};
static_assert(alignof(UUmg_spawnmenuSlot_C) == 0x000008, "Wrong alignment on UUmg_spawnmenuSlot_C");
static_assert(sizeof(UUmg_spawnmenuSlot_C) == 0x000348, "Wrong size on UUmg_spawnmenuSlot_C");
static_assert(offsetof(UUmg_spawnmenuSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_spawnmenuSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Button_41) == 0x000268, "Member 'UUmg_spawnmenuSlot_C::Button_41' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Image_73) == 0x000270, "Member 'UUmg_spawnmenuSlot_C::Image_73' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Image_125) == 0x000278, "Member 'UUmg_spawnmenuSlot_C::Image_125' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Image_cov) == 0x000280, "Member 'UUmg_spawnmenuSlot_C::Image_cov' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Txt_name) == 0x000288, "Member 'UUmg_spawnmenuSlot_C::Txt_name' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Txt_number) == 0x000290, "Member 'UUmg_spawnmenuSlot_C::Txt_number' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Index_Umg_spawnmenuSlot_C) == 0x000298, "Member 'UUmg_spawnmenuSlot_C::Index_Umg_spawnmenuSlot_C' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Data) == 0x0002A0, "Member 'UUmg_spawnmenuSlot_C::Data' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Name_Umg_spawnmenuSlot_C) == 0x000320, "Member 'UUmg_spawnmenuSlot_C::Name_Umg_spawnmenuSlot_C' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Dynmat) == 0x000328, "Member 'UUmg_spawnmenuSlot_C::Dynmat' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Owner) == 0x000330, "Member 'UUmg_spawnmenuSlot_C::Owner' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Type) == 0x000338, "Member 'UUmg_spawnmenuSlot_C::Type' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenuSlot_C, Spec) == 0x000340, "Member 'UUmg_spawnmenuSlot_C::Spec' has a wrong offset!");

}

