#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_inventorySlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function umg_inventorySlot.umg_inventorySlot_C.ExecuteUbergraph_umg_inventorySlot
// 0x0010 (0x0010 - 0x0000)
struct Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot) == 0x000008, "Wrong alignment on Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot");
static_assert(sizeof(Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot) == 0x000010, "Wrong size on Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot");
static_assert(offsetof(Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot, EntryPoint) == 0x000000, "Member 'Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'Umg_inventorySlot_C_ExecuteUbergraph_umg_inventorySlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function umg_inventorySlot.umg_inventorySlot_C.set
// 0x0038 (0x0038 - 0x0000)
struct Umg_inventorySlot_C_Set final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Ae;                                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262C[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_inventorySlot_C_Set) == 0x000008, "Wrong alignment on Umg_inventorySlot_C_Set");
static_assert(sizeof(Umg_inventorySlot_C_Set) == 0x000038, "Wrong size on Umg_inventorySlot_C_Set");
static_assert(offsetof(Umg_inventorySlot_C_Set, Param_Name) == 0x000000, "Member 'Umg_inventorySlot_C_Set::Param_Name' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, Ae) == 0x000010, "Member 'Umg_inventorySlot_C_Set::Ae' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, Temp_bool_Variable) == 0x000011, "Member 'Umg_inventorySlot_C_Set::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, Temp_byte_Variable) == 0x000012, "Member 'Umg_inventorySlot_C_Set::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, Temp_byte_Variable_1) == 0x000013, "Member 'Umg_inventorySlot_C_Set::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, K2Node_Select_Default) == 0x000014, "Member 'Umg_inventorySlot_C_Set::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000018, "Member 'Umg_inventorySlot_C_Set::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000020, "Member 'Umg_inventorySlot_C_Set::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, CallFunc_IsEmpty_ReturnValue) == 0x000028, "Member 'Umg_inventorySlot_C_Set::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, CallFunc_Array_Find_ReturnValue) == 0x00002C, "Member 'Umg_inventorySlot_C_Set::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_inventorySlot_C_Set, CallFunc_Array_Get_Item) == 0x000030, "Member 'Umg_inventorySlot_C_Set::CallFunc_Array_Get_Item' has a wrong offset!");

}

