#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_radarScreen

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_radarScreen.umg_radarScreen_C.ExecuteUbergraph_umg_radarScreen
// 0x0548 (0x0548 - 0x0000)
struct Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0018(0x00F0)(HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0108(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active_calc;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_downl;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_coords;                  // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_play;                    // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_light;                   // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Active_calc, bool Active_downl, bool Active_coords, bool Active_play, bool Active_light)> K2Node_CreateDelegate_OutputDelegate;              // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComp_radarPoint_C*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_1;               // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_radarPoint_C*                      CallFunc_Create_ReturnValue;                       // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0338(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0360(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0388(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x03B8(0x0018)()
	class FString                                 K2Node_Select_Default;                             // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0400(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EA[0x2];                                      // 0x04EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URichTextBlock*>                 K2Node_MakeArray_Array;                            // 0x04F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URichTextBlock*                         CallFunc_Array_Get_Item_2;                         // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51A[0x2];                                      // 0x051A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen) == 0x000008, "Wrong alignment on Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen");
static_assert(sizeof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen) == 0x000548, "Wrong size on Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, EntryPoint) == 0x000000, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Variable) == 0x000004, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_settings) == 0x000018, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_key) == 0x000108, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_pressed) == 0x000120, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_color) == 0x000124, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_picker) == 0x000138, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_texture) == 0x000140, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_index) == 0x000148, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000150, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_calc) == 0x000158, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_calc' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_downl) == 0x000159, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_downl' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_coords) == 0x00015A, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_coords' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_play) == 0x00015B, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_play' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_light) == 0x00015C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_light' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable_1) == 0x000160, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000164, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000168, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000170, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000178, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable_1) == 0x000184, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000188, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_IntInt_ReturnValue) == 0x00018C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000190, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000194, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable_2) == 0x0001A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001A4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001B0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0001B4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001C4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable_2) == 0x0001D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0001D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetDisplayName_ReturnValue) == 0x0001E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Add_ReturnValue) == 0x0001F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x000200, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000210, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000220, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000230, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_LowEntry_LocalVariable_Value__Object) == 0x00023C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetComponentByClass_ReturnValue) == 0x000248, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000250, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Vector_Distance_ReturnValue) == 0x000254, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000258, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00025C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000268, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_X) == 0x00026C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_Y) == 0x000270, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_Z) == 0x000274, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_FloatFloat_ReturnValue) == 0x000278, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_DegAtan2_ReturnValue) == 0x00027C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_MakeVector2D_ReturnValue) == 0x000280, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_FloatFloat_ReturnValue) == 0x000288, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Contains_ReturnValue) == 0x00028C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000290, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000294, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000298, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00029C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetRotated2D_ReturnValue) == 0x0002A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue) == 0x0002A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_1) == 0x0002A9, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_2) == 0x0002AA, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x0002B0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getObjectFromKey_Output) == 0x0002B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_AsInt_Ttrigger) == 0x0002C0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_bSuccess) == 0x0002D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_1) == 0x0002D4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToString_ReturnValue) == 0x0002D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_AsInt_Ttrigger_1) == 0x0002E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_AsInt_Ttrigger_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_bSuccess_1) == 0x0002F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Create_ReturnValue) == 0x000300, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000308, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_AddChild_ReturnValue) == 0x000310, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000318, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item_1) == 0x000320, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_2) == 0x000330, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000334, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToText_ReturnValue) == 0x000338, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x000350, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000360, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000378, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000388, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0003B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Select_Default) == 0x0003D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0003E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0003F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000400, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000418, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_2) == 0x00041C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectString_ReturnValue) == 0x000420, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x000430, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectString_ReturnValue_1) == 0x000438, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000448, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000458, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000468, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000478, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000488, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000490, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_byte_Variable) == 0x0004A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0004A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0004B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_byte_Variable_1) == 0x0004C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_gamemode) == 0x0004D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectColor_ReturnValue) == 0x0004D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToBool_ReturnValue) == 0x0004E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x0004E9, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004EC, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0004F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_bool_Variable) == 0x0004F1, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_MakeArray_Array) == 0x0004F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item_2) == 0x000508, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Select_Default_1) == 0x000510, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_3) == 0x000514, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_3) == 0x000518, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_3) == 0x000519, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00051C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000520, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000524, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000528, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x00052C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000530, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Lerp_ReturnValue) == 0x000534, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x000538, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Contains_ReturnValue_1) == 0x000540, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Umg_radarScreen_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_radarScreen_C_StuffUpgraded) == 0x000008, "Wrong alignment on Umg_radarScreen_C_StuffUpgraded");
static_assert(sizeof(Umg_radarScreen_C_StuffUpgraded) == 0x000008, "Wrong size on Umg_radarScreen_C_StuffUpgraded");
static_assert(offsetof(Umg_radarScreen_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Umg_radarScreen_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.powerChanged
// 0x0005 (0x0005 - 0x0000)
struct Umg_radarScreen_C_PowerChanged final
{
public:
