#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_texturePicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_texturePicker.umg_texturePicker_C
// 0x0048 (0x02A8 - 0x0260)
class UUmg_texturePicker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      Grid;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_51;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     TexArray;                                          // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UUmg_texturePickerButton_C*>     TexSlots;                                          // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UTexture2D*                             PickedTex;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PickedIndex;                                       // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_texturePicker(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void LoadArray(TArray<class UTexture2D*>& Textures);
	void Pick(class UTexture2D* Tex, int32 Param_Index);
	void Unfocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_texturePicker_C">();
	}
	static class UUmg_texturePicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_texturePicker_C>();
	}
};
static_assert(alignof(UUmg_texturePicker_C) == 0x000008, "Wrong alignment on UUmg_texturePicker_C");
static_assert(sizeof(UUmg_texturePicker_C) == 0x0002A8, "Wrong size on UUmg_texturePicker_C");
static_assert(offsetof(UUmg_texturePicker_C, UberGraphFrame) == 0x000260, "Member 'UUmg_texturePicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_texturePicker_C, Grid) == 0x000268, "Member 'UUmg_texturePicker_C::Grid' has a wrong offset!");
static_assert(offsetof(UUmg_texturePicker_C, Image_51) == 0x000270, "Member 'UUmg_texturePicker_C::Image_51' has a wrong offset!");
static_assert(offsetof(UUmg_texturePicker_C, TexArray) == 0x000278, "Member 'UUmg_texturePicker_C::TexArray' has a wrong offset!");
static_assert(offsetof(UUmg_texturePicker_C, TexSlots) == 0x000288, "Member 'UUmg_texturePicker_C::TexSlots' has a wrong offset!");
static_assert(offsetof(UUmg_texturePicker_C, PickedTex) == 0x000298, "Member 'UUmg_texturePicker_C::PickedTex' has a wrong offset!");
static_assert(offsetof(UUmg_texturePicker_C, PickedIndex) == 0x0002A0, "Member 'UUmg_texturePicker_C::PickedIndex' has a wrong offset!");

}

