#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_reactor

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function umg_reactor.umg_reactor_C.ExecuteUbergraph_umg_reactor
// 0x0458 (0x0458 - 0x0000)
struct Umg_reactor_C_ExecuteUbergraph_umg_reactor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_reactorRod_C*                      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E54[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0048(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E55[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x0118(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E56[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E57[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E58[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0178(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_reactorRod_C*                      CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E59[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x01F0(0x0018)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0230(0x0018)()
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FloatSpringInterp_ReturnValue;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5A[0x2];                                     // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5B[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0298(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x02B0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0308(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0320(0x0018)()
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5C[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5D[0x4];                                     // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x0350(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5E[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0390(0x0018)()
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_4;       // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5F[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_4;           // 0x03C0(0x0018)()
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E60[0x4];                                     // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E61[0x4];                                     // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E62[0x4];                                     // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0410(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E63[0x3];                                     // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E64[0x2];                                     // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_3;                         // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_reactor_C_ExecuteUbergraph_umg_reactor) == 0x000008, "Wrong alignment on Umg_reactor_C_ExecuteUbergraph_umg_reactor");
static_assert(sizeof(Umg_reactor_C_ExecuteUbergraph_umg_reactor) == 0x000458, "Wrong size on Umg_reactor_C_ExecuteUbergraph_umg_reactor");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, EntryPoint) == 0x000000, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Create_ReturnValue) == 0x000010, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Loop_Counter_Variable_3) == 0x000030, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_IntInt_ReturnValue_3) == 0x000034, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Array_Index_Variable_3) == 0x000038, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_gamemode) == 0x000040, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_settings) == 0x000048, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_key) == 0x000118, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_pressed) == 0x000130, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_color) == 0x000134, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000148, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000150, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000158, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Add_ReturnValue) == 0x000164, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Less_IntInt_ReturnValue) == 0x000168, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_AddChild_ReturnValue) == 0x000170, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_MyGeometry) == 0x000178, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, K2Node_Event_InDeltaTime) == 0x0001B0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Get_Item) == 0x0001B4, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Get_Item_1) == 0x0001B8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Loop_Counter_Variable_4) == 0x0001C4, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Length_ReturnValue_2) == 0x0001C8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001CC, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0001D4, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0001D8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001DC, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0001E0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001E8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Lerp_ReturnValue) == 0x0001EC, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_FloatToText_ReturnValue) == 0x0001F0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_MakeVector2D_ReturnValue) == 0x000208, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_TextToString_ReturnValue) == 0x000210, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Concat_StrStr_ReturnValue) == 0x000220, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_StringToText_ReturnValue) == 0x000230, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000248, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x00024C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000250, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000254, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000258, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00025C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_FloatSpringInterp_ReturnValue) == 0x000260, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_FloatSpringInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000264, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_FClamp_ReturnValue) == 0x000268, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x00026C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Loop_Counter_Variable_5) == 0x000270, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Length_ReturnValue_3) == 0x000274, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Less_IntInt_ReturnValue_2) == 0x000278, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Less_IntInt_ReturnValue_3) == 0x000279, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_IntInt_ReturnValue_5) == 0x00027C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Length_ReturnValue_4) == 0x000280, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_FClamp_ReturnValue_1) == 0x000284, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Less_IntInt_ReturnValue_4) == 0x000288, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00028C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000290, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000294, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000298, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x0002B0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0002C8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0002D8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0002E8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002F8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000308, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000320, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x000338, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00033C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_SelectFloat_ReturnValue) == 0x000340, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000344, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000348, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_FloatToText_ReturnValue_3) == 0x000350, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_FloatToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000368, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000378, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000388, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000390, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Lerp_ReturnValue_1) == 0x0003A8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GetWorldDeltaSeconds_ReturnValue_4) == 0x0003AC, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GetWorldDeltaSeconds_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x0003B0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x0003B4, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x0003B8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_FloatToText_ReturnValue_4) == 0x0003C0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_FloatToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Lerp_ReturnValue_2) == 0x0003D8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_TextToString_ReturnValue_4) == 0x0003E0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x0003F0, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0003F8, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000408, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000410, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Add_FloatFloat_ReturnValue) == 0x000428, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_FClamp_ReturnValue_2) == 0x00042C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x000430, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Length_ReturnValue_5) == 0x000434, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Less_IntInt_ReturnValue_5) == 0x000438, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_RandomFloatInRange_ReturnValue) == 0x00043C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000440, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000441, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Array_Index_Variable_4) == 0x000444, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, Temp_int_Array_Index_Variable_5) == 0x000448, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Get_Item_2) == 0x00044C, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_FInterpTo_Constant_ReturnValue_1) == 0x000450, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_FInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_ExecuteUbergraph_umg_reactor, CallFunc_Array_Get_Item_3) == 0x000454, "Member 'Umg_reactor_C_ExecuteUbergraph_umg_reactor::CallFunc_Array_Get_Item_3' has a wrong offset!");

// Function umg_reactor.umg_reactor_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_reactor_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_reactor_C_Tick) == 0x000004, "Wrong alignment on Umg_reactor_C_Tick");
static_assert(sizeof(Umg_reactor_C_Tick) == 0x00003C, "Wrong size on Umg_reactor_C_Tick");
static_assert(offsetof(Umg_reactor_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_reactor_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_reactor_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_reactor.umg_reactor_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Umg_reactor_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_reactor_C_ApplyColor) == 0x000004, "Wrong alignment on Umg_reactor_C_ApplyColor");
static_assert(sizeof(Umg_reactor_C_ApplyColor) == 0x000010, "Wrong size on Umg_reactor_C_ApplyColor");
static_assert(offsetof(Umg_reactor_C_ApplyColor, Color) == 0x000000, "Member 'Umg_reactor_C_ApplyColor::Color' has a wrong offset!");

// Function umg_reactor.umg_reactor_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Umg_reactor_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_reactor_C_AnyKey) == 0x000008, "Wrong alignment on Umg_reactor_C_AnyKey");
static_assert(sizeof(Umg_reactor_C_AnyKey) == 0x000020, "Wrong size on Umg_reactor_C_AnyKey");
static_assert(offsetof(Umg_reactor_C_AnyKey, Key) == 0x000000, "Member 'Umg_reactor_C_AnyKey::Key' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_AnyKey, Pressed) == 0x000018, "Member 'Umg_reactor_C_AnyKey::Pressed' has a wrong offset!");

// Function umg_reactor.umg_reactor_C.settingsApplied
// 0x00CC (0x00CC - 0x0000)
struct Umg_reactor_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00CC)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_reactor_C_SettingsApplied) == 0x000004, "Wrong alignment on Umg_reactor_C_SettingsApplied");
static_assert(sizeof(Umg_reactor_C_SettingsApplied) == 0x0000CC, "Wrong size on Umg_reactor_C_SettingsApplied");
static_assert(offsetof(Umg_reactor_C_SettingsApplied, Settings) == 0x000000, "Member 'Umg_reactor_C_SettingsApplied::Settings' has a wrong offset!");

// Function umg_reactor.umg_reactor_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Umg_reactor_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_reactor_C_StuffUpgraded) == 0x000008, "Wrong alignment on Umg_reactor_C_StuffUpgraded");
static_assert(sizeof(Umg_reactor_C_StuffUpgraded) == 0x000008, "Wrong size on Umg_reactor_C_StuffUpgraded");
static_assert(offsetof(Umg_reactor_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Umg_reactor_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function umg_reactor.umg_reactor_C.dreamInv
// 0x0018 (0x0018 - 0x0000)
struct Umg_reactor_C_DreamInv final
{
public:
	TArray<struct FStruct_save>                   Invv;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ADreamBase_C*                           Base;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_reactor_C_DreamInv) == 0x000008, "Wrong alignment on Umg_reactor_C_DreamInv");
static_assert(sizeof(Umg_reactor_C_DreamInv) == 0x000018, "Wrong size on Umg_reactor_C_DreamInv");
static_assert(offsetof(Umg_reactor_C_DreamInv, Invv) == 0x000000, "Member 'Umg_reactor_C_DreamInv::Invv' has a wrong offset!");
static_assert(offsetof(Umg_reactor_C_DreamInv, Base) == 0x000010, "Member 'Umg_reactor_C_DreamInv::Base' has a wrong offset!");

}

