#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_invaders

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_invaders.umg_invaders_C
// 0x0030 (0x0290 - 0x0260)
class UUmg_invaders_C final : public UUserWidget
{
public:
	class UCanvasPanel*                           Canvas_menu;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_hscore;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_score;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_wave;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMg_invaders_C*                         Owner;                                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Upd();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_invaders_C">();
	}
	static class UUmg_invaders_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_invaders_C>();
	}
};
static_assert(alignof(UUmg_invaders_C) == 0x000008, "Wrong alignment on UUmg_invaders_C");
static_assert(sizeof(UUmg_invaders_C) == 0x000290, "Wrong size on UUmg_invaders_C");
static_assert(offsetof(UUmg_invaders_C, Canvas_menu) == 0x000260, "Member 'UUmg_invaders_C::Canvas_menu' has a wrong offset!");
static_assert(offsetof(UUmg_invaders_C, Image_103) == 0x000268, "Member 'UUmg_invaders_C::Image_103' has a wrong offset!");
static_assert(offsetof(UUmg_invaders_C, Txt_hscore) == 0x000270, "Member 'UUmg_invaders_C::Txt_hscore' has a wrong offset!");
static_assert(offsetof(UUmg_invaders_C, Txt_score) == 0x000278, "Member 'UUmg_invaders_C::Txt_score' has a wrong offset!");
static_assert(offsetof(UUmg_invaders_C, Txt_wave) == 0x000280, "Member 'UUmg_invaders_C::Txt_wave' has a wrong offset!");
static_assert(offsetof(UUmg_invaders_C, Owner) == 0x000288, "Member 'UUmg_invaders_C::Owner' has a wrong offset!");

}

