#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_settingsSlot_assetFolder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_difficulty_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_settingsSlot_assetFolder.umg_settingsSlot_assetFolder_C
// 0x0030 (0x0290 - 0x0260)
class UUmg_settingsSlot_assetFolder_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Diff;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Textbox;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_settings_C*                        Parent;                                            // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_difficulty>                       E;                                                 // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_umg_settingsSlot_assetFolder(int32 EntryPoint);
	void BndEvt__umg_settingsSlot_assetFolder_textbox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Upd();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_settingsSlot_assetFolder_C">();
	}
	static class UUmg_settingsSlot_assetFolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_settingsSlot_assetFolder_C>();
	}
};
static_assert(alignof(UUmg_settingsSlot_assetFolder_C) == 0x000008, "Wrong alignment on UUmg_settingsSlot_assetFolder_C");
static_assert(sizeof(UUmg_settingsSlot_assetFolder_C) == 0x000290, "Wrong size on UUmg_settingsSlot_assetFolder_C");
static_assert(offsetof(UUmg_settingsSlot_assetFolder_C, UberGraphFrame) == 0x000260, "Member 'UUmg_settingsSlot_assetFolder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_assetFolder_C, Diff) == 0x000268, "Member 'UUmg_settingsSlot_assetFolder_C::Diff' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_assetFolder_C, Textbox) == 0x000270, "Member 'UUmg_settingsSlot_assetFolder_C::Textbox' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_assetFolder_C, Parent) == 0x000278, "Member 'UUmg_settingsSlot_assetFolder_C::Parent' has a wrong offset!");
static_assert(offsetof(UUmg_settingsSlot_assetFolder_C, E) == 0x000280, "Member 'UUmg_settingsSlot_assetFolder_C::E' has a wrong offset!");

}

