#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_achievementPopup

#include "Basic.hpp"

#include "Struct_achievement_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_achievementPopup.umg_achievementPopup_C
// 0x00A0 (0x0300 - 0x0260)
class UUmg_achievementPopup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasResizer;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_27;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_achievement;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_bar;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ach;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_name;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_progress;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         A;                                                 // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dir;                                               // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Ac;                                                // 0x02A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_achievement                    Data;                                              // 0x02A8(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_achievementPopup(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Upd(const struct FStruct_achievement& Param_Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_achievementPopup_C">();
	}
	static class UUmg_achievementPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_achievementPopup_C>();
	}
};
static_assert(alignof(UUmg_achievementPopup_C) == 0x000008, "Wrong alignment on UUmg_achievementPopup_C");
static_assert(sizeof(UUmg_achievementPopup_C) == 0x000300, "Wrong size on UUmg_achievementPopup_C");
static_assert(offsetof(UUmg_achievementPopup_C, UberGraphFrame) == 0x000260, "Member 'UUmg_achievementPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, CanvasResizer) == 0x000268, "Member 'UUmg_achievementPopup_C::CanvasResizer' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Image_27) == 0x000270, "Member 'UUmg_achievementPopup_C::Image_27' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Img_achievement) == 0x000278, "Member 'UUmg_achievementPopup_C::Img_achievement' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Img_bar) == 0x000280, "Member 'UUmg_achievementPopup_C::Img_bar' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Txt_ach) == 0x000288, "Member 'UUmg_achievementPopup_C::Txt_ach' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Txt_name) == 0x000290, "Member 'UUmg_achievementPopup_C::Txt_name' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Txt_progress) == 0x000298, "Member 'UUmg_achievementPopup_C::Txt_progress' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, A) == 0x0002A0, "Member 'UUmg_achievementPopup_C::A' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Dir) == 0x0002A4, "Member 'UUmg_achievementPopup_C::Dir' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Ac) == 0x0002A5, "Member 'UUmg_achievementPopup_C::Ac' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Data) == 0x0002A8, "Member 'UUmg_achievementPopup_C::Data' has a wrong offset!");
static_assert(offsetof(UUmg_achievementPopup_C, Type) == 0x0002F8, "Member 'UUmg_achievementPopup_C::Type' has a wrong offset!");

}

