#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_badSun

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function umg_badSun.umg_badSun_C.ExecuteUbergraph_umg_badSun
// 0x06A0 (0x06A0 - 0x0000)
struct Umg_badSun_C_ExecuteUbergraph_umg_badSun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameover_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0168(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue_1;   // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF[0x1];                                      // 0x03AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable_3;                              // 0x03C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x03D0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x03E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x2];                                      // 0x0472(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x04DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x04E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50A[0x2];                                      // 0x050A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0510(0x0018)(ConstParm)
	class FName                                   K2Node_Select_Default;                             // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_5;        // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_6;        // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_2;       // 0x055C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_2;  // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_7;        // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F2[0x2];                                      // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0608(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0614(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0640(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x065C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0675(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_676[0x2];                                      // 0x0676(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_8;        // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x069A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x069B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x069C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x069D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x069E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_badSun_C_ExecuteUbergraph_umg_badSun) == 0x000010, "Wrong alignment on Umg_badSun_C_ExecuteUbergraph_umg_badSun");
static_assert(sizeof(Umg_badSun_C_ExecuteUbergraph_umg_badSun) == 0x0006A0, "Wrong size on Umg_badSun_C_ExecuteUbergraph_umg_badSun");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, EntryPoint) == 0x000000, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_byte_Variable) == 0x000004, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable) == 0x000008, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable) == 0x000010, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_1) == 0x000050, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_bool_Variable) == 0x000070, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_2) == 0x000074, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Event_MyGeometry) == 0x000078, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000E4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000FC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000114, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x000120, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000128, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainPlayer_AsMain_Player) == 0x000130, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00013C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000148, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable) == 0x000154, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000160, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_obj_static_obj) == 0x000168, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000178, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_1) == 0x000184, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000190, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000198, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getSaveSlot_saveSlot) == 0x0001A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001A9, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001AA, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainPlayer_AsMain_Player_1) == 0x0001B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomPointInBoundingBox_ReturnValue_1) == 0x0001C4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomPointInBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x0001E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x0001E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable_1) == 0x0001F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000208, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000290, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_IntInt_ReturnValue_1) == 0x000294, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit) == 0x000298, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap) == 0x000299, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time) == 0x00029C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance) == 0x0002A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location) == 0x0002A4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint) == 0x0002B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal) == 0x0002BC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactNormal) == 0x0002C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_PhysMat) == 0x0002D8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitActor) == 0x0002E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitComponent) == 0x0002E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitBoneName) == 0x0002F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitItem) == 0x0002F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ElementIndex) == 0x0002FC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_FaceIndex) == 0x000300, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceStart) == 0x000304, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceEnd) == 0x000310, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FindLookAtRotation_ReturnValue) == 0x00031C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000328, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomRotator_ReturnValue) == 0x00032C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000338, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_MakeTransform_ReturnValue_1) == 0x000340, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000370, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000378, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Lerp_ReturnValue) == 0x000380, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000384, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000388, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000390, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x000394, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000398, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00039C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_2) == 0x0003A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FClamp_ReturnValue) == 0x0003A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0003AC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0003AD, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BooleanAND_ReturnValue) == 0x0003AE, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerController_ReturnValue_1) == 0x0003B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetControlRotation_ReturnValue) == 0x0003B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_3) == 0x0003C4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable_2) == 0x0003D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x0003E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x000468, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00046C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000470, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000471, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time_1) == 0x000474, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance_1) == 0x000478, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location_1) == 0x00047C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000488, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal_1) == 0x000494, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0004A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_PhysMat_1) == 0x0004B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitActor_1) == 0x0004B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitComponent_1) == 0x0004C0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitBoneName_1) == 0x0004C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitItem_1) == 0x0004D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ElementIndex_1) == 0x0004D4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_FaceIndex_1) == 0x0004D8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceStart_1) == 0x0004DC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
