#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_spawnmenu

#include "Basic.hpp"

#include "Enum_spawnmenuCats_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_spawnmenu.umg_spawnmenu_C
// 0x00F8 (0x0358 - 0x0260)
class UUmg_spawnmenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_search;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_hovertext;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_dynamic;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_ents;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_food;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_misc;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_mods;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_props;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_signals;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_tools;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cat_wip;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_spoiler;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_148;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_134;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_34;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       Textbox_search;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_name;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUmg_spawnmenuSlot_C*>           Slo;                                               // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Settype;                                           // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Spec;                                              // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Is;                                                // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Search;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Searching;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Ind;                                               // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowSpoilers;                                      // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_spawnmenuCats>                    CategoriesActive;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  Hs;                                                // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_umg_spawnmenu(int32 EntryPoint);
	void BndEvt__umg_spawnmenu_checkbox_cat_mods_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_tools_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_wip_K2Node_ComponentBoundEvent_11_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_signals_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_props_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_misc_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_food_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_ents_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_checkbox_cat_dynamic_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_CheckBox_spoiler_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__umg_spawnmenu_Button_186_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__umg_spawnmenu_textbox_search_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Spawn(class FName Param_Name, int32 Ype, class UClass* S1, const struct FStruct_prop& Data);
	void SetName(const class FText& InText);
	void FilterList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_spawnmenu_C">();
	}
	static class UUmg_spawnmenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_spawnmenu_C>();
	}
};
static_assert(alignof(UUmg_spawnmenu_C) == 0x000008, "Wrong alignment on UUmg_spawnmenu_C");
static_assert(sizeof(UUmg_spawnmenu_C) == 0x000358, "Wrong size on UUmg_spawnmenu_C");
static_assert(offsetof(UUmg_spawnmenu_C, UberGraphFrame) == 0x000260, "Member 'UUmg_spawnmenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Button_search) == 0x000268, "Member 'UUmg_spawnmenu_C::Button_search' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Canvas_hovertext) == 0x000270, "Member 'UUmg_spawnmenu_C::Canvas_hovertext' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_dynamic) == 0x000278, "Member 'UUmg_spawnmenu_C::Checkbox_cat_dynamic' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_ents) == 0x000280, "Member 'UUmg_spawnmenu_C::Checkbox_cat_ents' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_food) == 0x000288, "Member 'UUmg_spawnmenu_C::Checkbox_cat_food' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_misc) == 0x000290, "Member 'UUmg_spawnmenu_C::Checkbox_cat_misc' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_mods) == 0x000298, "Member 'UUmg_spawnmenu_C::Checkbox_cat_mods' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_props) == 0x0002A0, "Member 'UUmg_spawnmenu_C::Checkbox_cat_props' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_signals) == 0x0002A8, "Member 'UUmg_spawnmenu_C::Checkbox_cat_signals' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_tools) == 0x0002B0, "Member 'UUmg_spawnmenu_C::Checkbox_cat_tools' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Checkbox_cat_wip) == 0x0002B8, "Member 'UUmg_spawnmenu_C::Checkbox_cat_wip' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, CheckBox_spoiler) == 0x0002C0, "Member 'UUmg_spawnmenu_C::CheckBox_spoiler' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, GridPanel_148) == 0x0002C8, "Member 'UUmg_spawnmenu_C::GridPanel_148' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Image_134) == 0x0002D0, "Member 'UUmg_spawnmenu_C::Image_134' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, ScrollBox_34) == 0x0002D8, "Member 'UUmg_spawnmenu_C::ScrollBox_34' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Textbox_search) == 0x0002E0, "Member 'UUmg_spawnmenu_C::Textbox_search' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Txt_name) == 0x0002E8, "Member 'UUmg_spawnmenu_C::Txt_name' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Slo) == 0x0002F0, "Member 'UUmg_spawnmenu_C::Slo' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Settype) == 0x000300, "Member 'UUmg_spawnmenu_C::Settype' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Spec) == 0x000308, "Member 'UUmg_spawnmenu_C::Spec' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Is) == 0x000310, "Member 'UUmg_spawnmenu_C::Is' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Search) == 0x000318, "Member 'UUmg_spawnmenu_C::Search' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Searching) == 0x000328, "Member 'UUmg_spawnmenu_C::Searching' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Ind) == 0x00032C, "Member 'UUmg_spawnmenu_C::Ind' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, ShowSpoilers) == 0x000330, "Member 'UUmg_spawnmenu_C::ShowSpoilers' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, CategoriesActive) == 0x000338, "Member 'UUmg_spawnmenu_C::CategoriesActive' has a wrong offset!");
static_assert(offsetof(UUmg_spawnmenu_C, Hs) == 0x000348, "Member 'UUmg_spawnmenu_C::Hs' has a wrong offset!");

}

