#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_patronList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_patronList.umg_patronList_C
// 0x0130 (0x0390 - 0x0260)
class UUmg_patronList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_54;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_size;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_visible;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_tier3_2;                                      // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_tier3_1;                                      // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Text_3_2;                                          // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Text_2_2;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Txt;                                               // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         A;                                                 // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Lines;                                             // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text_boostyB;                                      // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Text_bst;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Downloaded;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_tier32;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_tier31;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_tier22;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_tier21;                                         // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_tier12;                                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_tier11;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 DW_boosty;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_patronList(int32 EntryPoint);
	void GeneratePatronList();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_patronList_C">();
	}
	static class UUmg_patronList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_patronList_C>();
	}
};
static_assert(alignof(UUmg_patronList_C) == 0x000008, "Wrong alignment on UUmg_patronList_C");
static_assert(sizeof(UUmg_patronList_C) == 0x000390, "Wrong size on UUmg_patronList_C");
static_assert(offsetof(UUmg_patronList_C, UberGraphFrame) == 0x000260, "Member 'UUmg_patronList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, SizeBox_54) == 0x000268, "Member 'UUmg_patronList_C::SizeBox_54' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_size) == 0x000270, "Member 'UUmg_patronList_C::Text_size' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_visible) == 0x000278, "Member 'UUmg_patronList_C::Text_visible' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_tier3_2) == 0x000280, "Member 'UUmg_patronList_C::Text_tier3_2' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_tier3_1) == 0x000298, "Member 'UUmg_patronList_C::Text_tier3_1' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_3_2) == 0x0002B0, "Member 'UUmg_patronList_C::Text_3_2' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_2_2) == 0x0002C0, "Member 'UUmg_patronList_C::Text_2_2' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Txt) == 0x0002D0, "Member 'UUmg_patronList_C::Txt' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, A) == 0x0002E0, "Member 'UUmg_patronList_C::A' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Lines) == 0x0002E4, "Member 'UUmg_patronList_C::Lines' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_boostyB) == 0x0002E8, "Member 'UUmg_patronList_C::Text_boostyB' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Text_bst) == 0x000300, "Member 'UUmg_patronList_C::Text_bst' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, Downloaded) == 0x000310, "Member 'UUmg_patronList_C::Downloaded' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_tier32) == 0x000320, "Member 'UUmg_patronList_C::DW_tier32' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_tier31) == 0x000330, "Member 'UUmg_patronList_C::DW_tier31' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_tier22) == 0x000340, "Member 'UUmg_patronList_C::DW_tier22' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_tier21) == 0x000350, "Member 'UUmg_patronList_C::DW_tier21' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_tier12) == 0x000360, "Member 'UUmg_patronList_C::DW_tier12' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_tier11) == 0x000370, "Member 'UUmg_patronList_C::DW_tier11' has a wrong offset!");
static_assert(offsetof(UUmg_patronList_C, DW_boosty) == 0x000380, "Member 'UUmg_patronList_C::DW_boosty' has a wrong offset!");

}

