#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_deathscreen

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_deathscreen.umg_deathscreen_C
// 0x0018 (0x0278 - 0x0260)
class UUmg_deathscreen_C final : public UUserWidget
{
public:
	class UImage*                                 Image;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_127;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_deathscreen_C">();
	}
	static class UUmg_deathscreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_deathscreen_C>();
	}
};
static_assert(alignof(UUmg_deathscreen_C) == 0x000008, "Wrong alignment on UUmg_deathscreen_C");
static_assert(sizeof(UUmg_deathscreen_C) == 0x000278, "Wrong size on UUmg_deathscreen_C");
static_assert(offsetof(UUmg_deathscreen_C, Image) == 0x000260, "Member 'UUmg_deathscreen_C::Image' has a wrong offset!");
static_assert(offsetof(UUmg_deathscreen_C, Image_46) == 0x000268, "Member 'UUmg_deathscreen_C::Image_46' has a wrong offset!");
static_assert(offsetof(UUmg_deathscreen_C, Image_127) == 0x000270, "Member 'UUmg_deathscreen_C::Image_127' has a wrong offset!");

}

