#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_help

#include "Basic.hpp"

#include "Struct_help_structs.hpp"


namespace SDK::Params
{

// Function umg_help.umg_help_C.ExecuteUbergraph_umg_help
// 0x00A8 (0x00A8 - 0x0000)
struct Umg_help_C_ExecuteUbergraph_umg_help final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2165[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	class UUmg_helpButton_C*                      CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_help                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2166[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2167[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_help_C_ExecuteUbergraph_umg_help) == 0x000008, "Wrong alignment on Umg_help_C_ExecuteUbergraph_umg_help");
static_assert(sizeof(Umg_help_C_ExecuteUbergraph_umg_help) == 0x0000A8, "Wrong size on Umg_help_C_ExecuteUbergraph_umg_help");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, EntryPoint) == 0x000000, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_Create_ReturnValue) == 0x000020, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, K2Node_Event_index) == 0x00002C, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000030, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_Array_Get_Item) == 0x000058, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_ExecuteUbergraph_umg_help, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'Umg_help_C_ExecuteUbergraph_umg_help::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function umg_help.umg_help_C.BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_help_C_BndEvt__umg_help_textbox_search_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function umg_help.umg_help_C.setIndex
// 0x0004 (0x0004 - 0x0000)
struct Umg_help_C_SetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_help_C_SetIndex) == 0x000004, "Wrong alignment on Umg_help_C_SetIndex");
static_assert(sizeof(Umg_help_C_SetIndex) == 0x000004, "Wrong size on Umg_help_C_SetIndex");
static_assert(offsetof(Umg_help_C_SetIndex, Param_Index) == 0x000000, "Member 'Umg_help_C_SetIndex::Param_Index' has a wrong offset!");

// Function umg_help.umg_help_C.press
// 0x0040 (0x0040 - 0x0000)
struct Umg_help_C_Press final
{
public:
	class UUmg_helpButton_C*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RegexReplace_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(Umg_help_C_Press) == 0x000008, "Wrong alignment on Umg_help_C_Press");
static_assert(sizeof(Umg_help_C_Press) == 0x000040, "Wrong size on Umg_help_C_Press");
static_assert(offsetof(Umg_help_C_Press, Button) == 0x000000, "Member 'Umg_help_C_Press::Button' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Press, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'Umg_help_C_Press::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Press, CallFunc_RegexReplace_ReturnValue) == 0x000018, "Member 'Umg_help_C_Press::CallFunc_RegexReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Press, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'Umg_help_C_Press::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function umg_help.umg_help_C.Search
// 0x0038 (0x0038 - 0x0000)
struct Umg_help_C_Search final
{
public:
	class FText                                   Prompt;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2168[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_helpButton_C*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_help_C_Search) == 0x000008, "Wrong alignment on Umg_help_C_Search");
static_assert(sizeof(Umg_help_C_Search) == 0x000038, "Wrong size on Umg_help_C_Search");
static_assert(offsetof(Umg_help_C_Search, Prompt) == 0x000000, "Member 'Umg_help_C_Search::Prompt' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Search, Temp_int_Variable) == 0x000018, "Member 'Umg_help_C_Search::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Search, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Umg_help_C_Search::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Search, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Umg_help_C_Search::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Search, CallFunc_Array_Get_Item) == 0x000028, "Member 'Umg_help_C_Search::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_help_C_Search, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Umg_help_C_Search::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

