#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_upgradeSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function umg_upgradeSlot.umg_upgradeSlot_C.ExecuteUbergraph_umg_upgradeSlot
// 0x00B8 (0x00B8 - 0x0000)
struct Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27E4[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27E5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27E6[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27E7[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27E8[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_5;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_6;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot) == 0x000008, "Wrong alignment on Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot");
static_assert(sizeof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot) == 0x0000B8, "Wrong size on Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, EntryPoint) == 0x000000, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable) == 0x000004, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_1) == 0x000008, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000018, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_2) == 0x000020, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default) == 0x000024, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default_1) == 0x000028, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000038, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_3) == 0x000040, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000060, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Multiply_IntInt_ReturnValue) == 0x000074, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_4) == 0x000078, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default_2) == 0x00007C, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000080, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000084, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x000088, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_5) == 0x000090, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_5' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000098, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00009C, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_FFloor_ReturnValue) == 0x0000A0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_5) == 0x0000A4, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_6) == 0x0000A8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_6' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default_3) == 0x0000B0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B4, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function umg_upgradeSlot.umg_upgradeSlot_C.upd
// 0x0088 (0x0088 - 0x0000)
struct Umg_upgradeSlot_C_Upd final
{
public:
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27E9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27EA[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
};
static_assert(alignof(Umg_upgradeSlot_C_Upd) == 0x000008, "Wrong alignment on Umg_upgradeSlot_C_Upd");
static_assert(sizeof(Umg_upgradeSlot_C_Upd) == 0x000088, "Wrong size on Umg_upgradeSlot_C_Upd");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000000, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000008, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, Temp_int_Variable) == 0x000010, "Member 'Umg_upgradeSlot_C_Upd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, K2Node_Select_Default) == 0x000028, "Member 'Umg_upgradeSlot_C_Upd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, Temp_int_Variable_1) == 0x00002C, "Member 'Umg_upgradeSlot_C_Upd::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, K2Node_Select_Default_1) == 0x000034, "Member 'Umg_upgradeSlot_C_Upd::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000040, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

