#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_settingsSlot_regenerateSav

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_keybind_structs.hpp"
#include "Struct_achievement_structs.hpp"
#include "Struct_stats_structs.hpp"


namespace SDK::Params
{

// Function umg_settingsSlot_regenerateSav.umg_settingsSlot_regenerateSav_C.ExecuteUbergraph_umg_settingsSlot_regenerateSav
// 0x0128 (0x0128 - 0x0000)
struct Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_208F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteGameInSlot_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2090[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_LowEntry_LocalVariable_Value__Object;       // 0x0018(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_LowEntry_LocalVariable_Value__1_Object;     // 0x0028(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_LowEntry_LocalVariable_Value__2_Object;     // 0x0038(0x0010)(ReferenceParm)
	TArray<struct FStruct_save>                   K2Node_LowEntry_LocalVariable_Value__3_Object;     // 0x0048(0x0010)(ReferenceParm)
	struct FStruct_stats                          K2Node_LowEntry_LocalVariable_Value__4_Object;     // 0x0058(0x005C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_LowEntry_LocalVariable_Value__5_Object;     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_LowEntry_LocalVariable_Value__6_Object;     // 0x00B8(0x0010)(ReferenceParm)
	TArray<bool>                                  K2Node_LowEntry_LocalVariable_Value__7_Object;     // 0x00C8(0x0010)(ReferenceParm)
	TArray<struct FStruct_achievement>            K2Node_LowEntry_LocalVariable_Value__8_Object;     // 0x00D8(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_LowEntry_LocalVariable_Value__9_Object;     // 0x00E8(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_LowEntry_LocalVariable_Value__10_Object;    // 0x00F8(0x0010)(ReferenceParm)
	TArray<struct FStruct_keybind>                K2Node_LowEntry_LocalVariable_Value__11_Object;    // 0x0108(0x0010)(ReferenceParm)
	class USave_main_C*                           CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav) == 0x000008, "Wrong alignment on Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav");
static_assert(sizeof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav) == 0x000128, "Wrong size on Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, EntryPoint) == 0x000000, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, CallFunc_DeleteGameInSlot_ReturnValue) == 0x000010, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::CallFunc_DeleteGameInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__Object) == 0x000018, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__1_Object) == 0x000028, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__1_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__2_Object) == 0x000038, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__2_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__3_Object) == 0x000048, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__3_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__4_Object) == 0x000058, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__4_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__5_Object) == 0x0000B4, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__5_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__6_Object) == 0x0000B8, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__6_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__7_Object) == 0x0000C8, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__7_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__8_Object) == 0x0000D8, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__8_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__9_Object) == 0x0000E8, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__9_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__10_Object) == 0x0000F8, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__10_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, K2Node_LowEntry_LocalVariable_Value__11_Object) == 0x000108, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::K2Node_LowEntry_LocalVariable_Value__11_Object' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000118, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav, CallFunc_SaveGameToSlot_ReturnValue) == 0x000120, "Member 'Umg_settingsSlot_regenerateSav_C_ExecuteUbergraph_umg_settingsSlot_regenerateSav::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

}

