#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_credits

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_credits.umg_credits_C
// 0x02A8 (0x0508 - 0x0260)
class UUmg_credits_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_adv;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_contribution;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_exit;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_form3;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_Help;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_music;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_patrons1;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_patrons2;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_patrons3;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_resources;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_tools;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_translations;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_va;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_302;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_desc;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USave_main_C*                           Sav;                                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUmg_settingsSlot_C*>            Sliders;                                           // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUmg_settingsSlot_C*>            V_slots;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUmg_settingsSlot_C*>            S_slots;                                           // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FStruct_settings                       SettingsCopy;                                      // 0x0318(0x00CC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2172[0x4];                                     // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Txt_adv;                                           // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_trans;                                         // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_tools;                                         // 0x0418(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_res;                                           // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_p3;                                            // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_p2;                                            // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_p1;                                            // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_music;                                         // 0x0490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_help;                                          // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Txt_formP3;                                        // 0x04C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_contr;                                        // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_va;                                           // 0x04F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_umg_credits(int32 EntryPoint);
	void BndEvt__umg_credits_button_va_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void BndEvt__umg_credits_button_translations_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_tools_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_resources_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_patrons3_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_patrons2_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_patrons1_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_music_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_help_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_form3_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_contribution_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_credits_button_adv_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Resume();
	void BndEvt__button_exit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetIndex(int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_credits_C">();
	}
	static class UUmg_credits_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_credits_C>();
	}
};
static_assert(alignof(UUmg_credits_C) == 0x000008, "Wrong alignment on UUmg_credits_C");
static_assert(sizeof(UUmg_credits_C) == 0x000508, "Wrong size on UUmg_credits_C");
static_assert(offsetof(UUmg_credits_C, UberGraphFrame) == 0x000260, "Member 'UUmg_credits_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_adv) == 0x000268, "Member 'UUmg_credits_C::button_adv' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_contribution) == 0x000270, "Member 'UUmg_credits_C::button_contribution' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_exit) == 0x000278, "Member 'UUmg_credits_C::button_exit' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_form3) == 0x000280, "Member 'UUmg_credits_C::button_form3' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_Help) == 0x000288, "Member 'UUmg_credits_C::button_Help' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_music) == 0x000290, "Member 'UUmg_credits_C::button_music' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_patrons1) == 0x000298, "Member 'UUmg_credits_C::button_patrons1' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_patrons2) == 0x0002A0, "Member 'UUmg_credits_C::button_patrons2' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_patrons3) == 0x0002A8, "Member 'UUmg_credits_C::button_patrons3' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_resources) == 0x0002B0, "Member 'UUmg_credits_C::button_resources' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_tools) == 0x0002B8, "Member 'UUmg_credits_C::button_tools' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_translations) == 0x0002C0, "Member 'UUmg_credits_C::button_translations' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, button_va) == 0x0002C8, "Member 'UUmg_credits_C::button_va' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Image_302) == 0x0002D0, "Member 'UUmg_credits_C::Image_302' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Text_desc) == 0x0002D8, "Member 'UUmg_credits_C::Text_desc' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Sav) == 0x0002E0, "Member 'UUmg_credits_C::Sav' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Sliders) == 0x0002E8, "Member 'UUmg_credits_C::Sliders' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, V_slots) == 0x0002F8, "Member 'UUmg_credits_C::V_slots' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, S_slots) == 0x000308, "Member 'UUmg_credits_C::S_slots' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, SettingsCopy) == 0x000318, "Member 'UUmg_credits_C::SettingsCopy' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_adv) == 0x0003E8, "Member 'UUmg_credits_C::Txt_adv' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_trans) == 0x000400, "Member 'UUmg_credits_C::Txt_trans' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_tools) == 0x000418, "Member 'UUmg_credits_C::Txt_tools' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_res) == 0x000430, "Member 'UUmg_credits_C::Txt_res' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_p3) == 0x000448, "Member 'UUmg_credits_C::Txt_p3' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_p2) == 0x000460, "Member 'UUmg_credits_C::Txt_p2' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_p1) == 0x000478, "Member 'UUmg_credits_C::Txt_p1' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_music) == 0x000490, "Member 'UUmg_credits_C::Txt_music' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_help) == 0x0004A8, "Member 'UUmg_credits_C::Txt_help' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Txt_formP3) == 0x0004C0, "Member 'UUmg_credits_C::Txt_formP3' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Text_contr) == 0x0004D8, "Member 'UUmg_credits_C::Text_contr' has a wrong offset!");
static_assert(offsetof(UUmg_credits_C, Text_va) == 0x0004F0, "Member 'UUmg_credits_C::Text_va' has a wrong offset!");

}

