#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_radarScreen

#include "Basic.hpp"

#include "Struct_save_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function umg_radarScreen.umg_radarScreen_C.ExecuteUbergraph_umg_radarScreen
// 0x0510 (0x0510 - 0x0000)
struct Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E67[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0020(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E68[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x00F0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E69[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6A[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active_calc;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_downl;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_coords;                  // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_play;                    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_light;                   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6B[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6C[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6D[0x2];                                     // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Active_calc, bool Active_downl, bool Active_coords, bool Active_play, bool Active_light)> K2Node_CreateDelegate_OutputDelegate;              // 0x017C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6E[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6F[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E70[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E71[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URadarPointComponent_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqualExactly_VectorVector_ReturnValue; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E72[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E73[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E74[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E75[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E76[0x5];                                     // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObjectFromKey_Output;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger;                 // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E77[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_ttrigger_C>       K2Node_DynamicCast_AsInt_Ttrigger_1;               // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E78[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_radarPoint_C*                      CallFunc_Create_ReturnValue;                       // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E79[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E7A[0x3];                                     // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0310(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0338(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0360(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0378(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0390(0x0018)()
	class FString                                 K2Node_Select_Default;                             // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x03D8(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E7B[0x3];                                     // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E7C[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E7D[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E7E[0x7];                                     // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E7F[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x04B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E80[0x2];                                     // 0x04C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E81[0x6];                                     // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URichTextBlock*>                 K2Node_MakeArray_Array;                            // 0x04D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URichTextBlock*                         CallFunc_Array_Get_Item_2;                         // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E82[0x3];                                     // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E83[0x2];                                     // 0x04F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue_1;         // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen) == 0x000008, "Wrong alignment on Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen");
static_assert(sizeof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen) == 0x000510, "Wrong size on Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, EntryPoint) == 0x000000, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Variable) == 0x000010, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_settings) == 0x000020, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_key) == 0x0000F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_pressed) == 0x000108, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_color) == 0x00010C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000120, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_calc) == 0x000128, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_calc' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_downl) == 0x000129, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_downl' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_coords) == 0x00012A, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_coords' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_play) == 0x00012B, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_play' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CustomEvent_active_light) == 0x00012C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CustomEvent_active_light' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable_1) == 0x000130, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000134, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000138, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000140, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000148, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000155, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable_1) == 0x000158, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00015C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_IntInt_ReturnValue) == 0x000168, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_VectorVector_ReturnValue) == 0x00016C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Loop_Counter_Variable_2) == 0x000178, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_CreateDelegate_OutputDelegate) == 0x00017C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x00018C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000190, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0001A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_int_Array_Index_Variable_2) == 0x0001A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetDisplayName_ReturnValue) == 0x0001B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Add_ReturnValue) == 0x0001C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x0001D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000200, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_LowEntry_LocalVariable_Value__Object) == 0x00020C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetComponentByClass_ReturnValue) == 0x000218, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_NotEqualExactly_VectorVector_ReturnValue) == 0x000220, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_NotEqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Vector_Distance_ReturnValue) == 0x000224, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000228, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00022C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000238, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_X) == 0x00023C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_Y) == 0x000240, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BreakVector_Z) == 0x000244, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_FloatFloat_ReturnValue) == 0x000248, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_DegAtan2_ReturnValue) == 0x00024C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_MakeVector2D_ReturnValue) == 0x000250, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_FloatFloat_ReturnValue) == 0x000258, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Contains_ReturnValue) == 0x00025C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000260, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000264, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000268, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00026C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_GetRotated2D_ReturnValue) == 0x000270, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue) == 0x000278, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_1) == 0x000279, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_2) == 0x00027A, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000280, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getObjectFromKey_Output) == 0x000288, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getObjectFromKey_Output' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_AsInt_Ttrigger) == 0x000290, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_AsInt_Ttrigger' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_bSuccess) == 0x0002A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_AsInt_Ttrigger_1) == 0x0002A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_AsInt_Ttrigger_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_DynamicCast_bSuccess_1) == 0x0002B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Create_ReturnValue) == 0x0002C0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_1) == 0x0002C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToString_ReturnValue) == 0x0002D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0002E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_AddChild_ReturnValue) == 0x0002E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x0002F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item_1) == 0x0002F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_2) == 0x000308, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x00030C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToText_ReturnValue) == 0x000310, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x000328, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000338, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000350, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000360, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000378, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000390, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Select_Default) == 0x0003A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0003B8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0003C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0003D8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003F4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectString_ReturnValue) == 0x0003F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x000408, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectString_ReturnValue_1) == 0x000410, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000420, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000430, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000440, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000450, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000460, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000468, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_byte_Variable) == 0x000478, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000480, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000490, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_byte_Variable_1) == 0x0004A0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Event_gamemode) == 0x0004A8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_SelectColor_ReturnValue) == 0x0004B0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToBool_ReturnValue) == 0x0004C0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x0004C1, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004C4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0004C8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, Temp_bool_Variable) == 0x0004C9, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_MakeArray_Array) == 0x0004D0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Get_Item_2) == 0x0004E0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, K2Node_Select_Default_1) == 0x0004E8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Array_Length_ReturnValue_3) == 0x0004EC, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Less_IntInt_ReturnValue_3) == 0x0004F0, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_BooleanAND_ReturnValue_3) == 0x0004F1, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0004F4, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0004F8, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0004FC, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000500, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Percent_FloatFloat_ReturnValue_1) == 0x000504, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Percent_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000508, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen, CallFunc_Lerp_ReturnValue) == 0x00050C, "Member 'Umg_radarScreen_C_ExecuteUbergraph_umg_radarScreen::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Umg_radarScreen_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_radarScreen_C_StuffUpgraded) == 0x000008, "Wrong alignment on Umg_radarScreen_C_StuffUpgraded");
static_assert(sizeof(Umg_radarScreen_C_StuffUpgraded) == 0x000008, "Wrong size on Umg_radarScreen_C_StuffUpgraded");
static_assert(offsetof(Umg_radarScreen_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Umg_radarScreen_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function umg_radarScreen.umg_radarScreen_C.powerChanged
// 0x0005 (0x0005 - 0x0000)
struct Umg_radarScreen_C_PowerChanged final
{
public:
	bool                                          Active_calc;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_downl;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_coords;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_play;                                       // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active_light;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_radarScreen_C_PowerChanged) == 0x000001, "Wrong alignment on Umg_radarScreen_C_PowerChanged");
static_assert(sizeof(Umg_radarScreen_C_PowerChanged) == 0x000005, "Wrong size on Umg_radarScreen_C_PowerChanged");
static_assert(offsetof(Umg_radarScreen_C_PowerChanged, Active_calc) == 0x000000, "Member 'Umg_radarScreen_C_PowerChanged::Active_calc' has a wrong offset!");
