#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_hovertextNametag

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_hovertextNametag.umg_hovertextNametag_C
// 0x0070 (0x02D0 - 0x0260)
class UUmg_hovertextNametag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_31;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_41;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FVector                                Offset;                                            // 0x02B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD7[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Component;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_hovertextNametag(int32 EntryPoint);
	void Update();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Loc(struct FVector* Origin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_hovertextNametag_C">();
	}
	static class UUmg_hovertextNametag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_hovertextNametag_C>();
	}
};
static_assert(alignof(UUmg_hovertextNametag_C) == 0x000008, "Wrong alignment on UUmg_hovertextNametag_C");
static_assert(sizeof(UUmg_hovertextNametag_C) == 0x0002D0, "Wrong size on UUmg_hovertextNametag_C");
static_assert(offsetof(UUmg_hovertextNametag_C, UberGraphFrame) == 0x000260, "Member 'UUmg_hovertextNametag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, back) == 0x000268, "Member 'UUmg_hovertextNametag_C::back' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, CanvasPanel) == 0x000270, "Member 'UUmg_hovertextNametag_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, CanvasPanel_0) == 0x000278, "Member 'UUmg_hovertextNametag_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, CanvasPanel_31) == 0x000280, "Member 'UUmg_hovertextNametag_C::CanvasPanel_31' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, TextBlock_41) == 0x000288, "Member 'UUmg_hovertextNametag_C::TextBlock_41' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, Owner) == 0x000290, "Member 'UUmg_hovertextNametag_C::Owner' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, Text) == 0x000298, "Member 'UUmg_hovertextNametag_C::Text' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, Offset) == 0x0002B0, "Member 'UUmg_hovertextNametag_C::Offset' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, Size) == 0x0002BC, "Member 'UUmg_hovertextNametag_C::Size' has a wrong offset!");
static_assert(offsetof(UUmg_hovertextNametag_C, Component) == 0x0002C8, "Member 'UUmg_hovertextNametag_C::Component' has a wrong offset!");

}

