#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_UI

#include "Basic.hpp"

#include "Struct_settings_structs.hpp"
#include "Struct_save_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "Struct_mObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function umg_UI.umg_UI_C.ExecuteUbergraph_umg_UI
// 0x04D0 (0x04D0 - 0x0000)
struct Umg_UI_C_ExecuteUbergraph_umg_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0010(0x00F0)(HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0108(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_compassAngle_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0148(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_calcSize_size;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_calcSize_min;                             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_calcSize_max;                             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_calcSize_origin;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPrimaryMonitorResolution_Width;        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrimaryMonitorResolution_Height;       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_IntPointToVector2D_ReturnValue;      // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x1];                                      // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_3;                       // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_4;                       // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_5;                       // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0274(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0280(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_4;        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_5;        // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x02BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array_1;                          // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x02F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0320(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0358(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0380(0x0018)()
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x03A8(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x03C0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUmg_texturePicker_C*                   K2Node_Event_picker;                               // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_color;                                // 0x0438(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0458(0x0018)()
	struct FKey                                   K2Node_Event_key;                                  // 0x0470(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_4;           // 0x04B0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x04CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x04CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_ExecuteUbergraph_umg_UI) == 0x000008, "Wrong alignment on Umg_UI_C_ExecuteUbergraph_umg_UI");
static_assert(sizeof(Umg_UI_C_ExecuteUbergraph_umg_UI) == 0x0004D0, "Wrong size on Umg_UI_C_ExecuteUbergraph_umg_UI");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, EntryPoint) == 0x000000, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_bool_Variable) == 0x000004, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000008, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00000C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_settings) == 0x000010, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000100, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_FloatToText_ReturnValue) == 0x000108, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_TextToString_ReturnValue) == 0x000120, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_compassAngle_ReturnValue) == 0x000130, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_compassAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Concat_StrStr_ReturnValue) == 0x000138, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_StringToText_ReturnValue) == 0x000148, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_gamemode) == 0x000168, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000178, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_calcSize_size) == 0x000180, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_calcSize_size' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_calcSize_min) == 0x000188, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_calcSize_min' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_calcSize_max) == 0x000190, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_calcSize_max' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_calcSize_origin) == 0x000198, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_calcSize_origin' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0001A0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_bool_Variable_1) == 0x0001A8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetPrimaryMonitorResolution_Width) == 0x0001AC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetPrimaryMonitorResolution_Width' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetPrimaryMonitorResolution_Height) == 0x0001B0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetPrimaryMonitorResolution_Height' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_MakeStruct_IntPoint) == 0x0001B4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_IntPointToVector2D_ReturnValue) == 0x0001BC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_IntPointToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X) == 0x0001C4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y) == 0x0001C8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_bool_Variable_2) == 0x0001CC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x0001D0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Not_PreBool_ReturnValue) == 0x0001D8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001D9, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BooleanAND_ReturnValue) == 0x0001DA, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BooleanOR_ReturnValue) == 0x0001DB, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SelectFloat_ReturnValue) == 0x0001DC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_MakeVector2D_ReturnValue) == 0x0001E0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Select_Default) == 0x0001E8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X_1) == 0x0001F0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y_1) == 0x0001F4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X_2) == 0x0001F8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y_2) == 0x0001FC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetDesiredSize_ReturnValue) == 0x000200, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X_3) == 0x000208, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y_3) == 0x00020C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_byte_Variable) == 0x000210, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_byte_Variable_1) == 0x000211, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_bool_Variable_3) == 0x000212, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Array_Length_ReturnValue) == 0x000214, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Select_Default_1) == 0x000218, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00021C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000220, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_MakeVector2D_ReturnValue_1) == 0x000224, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Select_Default_2) == 0x00022C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X_4) == 0x000234, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y_4) == 0x000238, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FMax_ReturnValue) == 0x00023C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FMax_ReturnValue_1) == 0x000240, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FMax_ReturnValue_2) == 0x000244, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FMax_ReturnValue_3) == 0x000248, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FMax_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Add_FloatFloat_ReturnValue) == 0x00024C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000250, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000254, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000258, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00025C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000260, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FMax_ReturnValue_4) == 0x000264, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FMax_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FMax_ReturnValue_5) == 0x000268, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FMax_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x00026C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000270, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_MakeVector2D_ReturnValue_2) == 0x000274, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_MakeArray_Array) == 0x000280, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000290, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_getMainPlayer_AsMain_Player) == 0x000298, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002A0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0002A4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_FInterpTo_ReturnValue) == 0x0002A8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X_5) == 0x0002AC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X_5' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y_5) == 0x0002B0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y_5' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Subtract_FloatFloat_ReturnValue_4) == 0x0002B4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Subtract_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Subtract_FloatFloat_ReturnValue_5) == 0x0002B8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Subtract_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_MakeVector2D_ReturnValue_3) == 0x0002BC, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Select_Default_3) == 0x0002C4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0002D0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_MakeArray_Array_1) == 0x0002D8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x0002E8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x0002F0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x0002F8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000310, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x000320, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000338, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000348, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000358, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000370, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000380, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000398, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003A0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_FloatToText_ReturnValue_3) == 0x0003A8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_FloatToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_MyGeometry) == 0x0003C0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_InDeltaTime) == 0x0003F8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000400, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_picker) == 0x000410, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_picker' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_texture) == 0x000418, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_index) == 0x000420, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SelectString_ReturnValue) == 0x000428, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_color) == 0x000438, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000448, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000458, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_key) == 0x000470, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Event_pressed) == 0x000488, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000490, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_X_6) == 0x000498, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_X_6' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_BreakVector2D_Y_6) == 0x00049C, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_BreakVector2D_Y_6' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0004A0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_SelectFloat_ReturnValue_1) == 0x0004A4, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_MakeVector2D_ReturnValue_4) == 0x0004A8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, CallFunc_Conv_FloatToText_ReturnValue_4) == 0x0004B0, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::CallFunc_Conv_FloatToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_byte_Variable_2) == 0x0004C8, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_byte_Variable_3) == 0x0004C9, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, Temp_bool_Variable_4) == 0x0004CA, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_ExecuteUbergraph_umg_UI, K2Node_Select_Default_4) == 0x0004CB, "Member 'Umg_UI_C_ExecuteUbergraph_umg_UI::K2Node_Select_Default_4' has a wrong offset!");

// Function umg_UI.umg_UI_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Umg_UI_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_UI_C_AnyKey) == 0x000008, "Wrong alignment on Umg_UI_C_AnyKey");
static_assert(sizeof(Umg_UI_C_AnyKey) == 0x000020, "Wrong size on Umg_UI_C_AnyKey");
static_assert(offsetof(Umg_UI_C_AnyKey, Key) == 0x000000, "Member 'Umg_UI_C_AnyKey::Key' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_AnyKey, Pressed) == 0x000018, "Member 'Umg_UI_C_AnyKey::Pressed' has a wrong offset!");

// Function umg_UI.umg_UI_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Umg_UI_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_ApplyColor) == 0x000004, "Wrong alignment on Umg_UI_C_ApplyColor");
static_assert(sizeof(Umg_UI_C_ApplyColor) == 0x000010, "Wrong size on Umg_UI_C_ApplyColor");
static_assert(offsetof(Umg_UI_C_ApplyColor, Color) == 0x000000, "Member 'Umg_UI_C_ApplyColor::Color' has a wrong offset!");

// Function umg_UI.umg_UI_C.texturePickerApply
// 0x0018 (0x0018 - 0x0000)
struct Umg_UI_C_TexturePickerApply final
{
public:
	class UUmg_texturePicker_C*                   Picker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_TexturePickerApply) == 0x000008, "Wrong alignment on Umg_UI_C_TexturePickerApply");
static_assert(sizeof(Umg_UI_C_TexturePickerApply) == 0x000018, "Wrong size on Umg_UI_C_TexturePickerApply");
static_assert(offsetof(Umg_UI_C_TexturePickerApply, Picker) == 0x000000, "Member 'Umg_UI_C_TexturePickerApply::Picker' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_TexturePickerApply, Texture) == 0x000008, "Member 'Umg_UI_C_TexturePickerApply::Texture' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_TexturePickerApply, Param_Index) == 0x000010, "Member 'Umg_UI_C_TexturePickerApply::Param_Index' has a wrong offset!");

// Function umg_UI.umg_UI_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_UI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_Tick) == 0x000004, "Wrong alignment on Umg_UI_C_Tick");
static_assert(sizeof(Umg_UI_C_Tick) == 0x00003C, "Wrong size on Umg_UI_C_Tick");
static_assert(offsetof(Umg_UI_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_UI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_UI_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_UI.umg_UI_C.stuffUpgraded
// 0x0008 (0x0008 - 0x0000)
struct Umg_UI_C_StuffUpgraded final
{
public:
	class AMainGamemode_C*                        GameMode;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_StuffUpgraded) == 0x000008, "Wrong alignment on Umg_UI_C_StuffUpgraded");
static_assert(sizeof(Umg_UI_C_StuffUpgraded) == 0x000008, "Wrong size on Umg_UI_C_StuffUpgraded");
static_assert(offsetof(Umg_UI_C_StuffUpgraded, GameMode) == 0x000000, "Member 'Umg_UI_C_StuffUpgraded::GameMode' has a wrong offset!");

// Function umg_UI.umg_UI_C.settingsApplied
// 0x00F0 (0x00F0 - 0x0000)
struct Umg_UI_C_SettingsApplied final
{
public:
	struct FStruct_settings                       Settings;                                          // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_SettingsApplied) == 0x000008, "Wrong alignment on Umg_UI_C_SettingsApplied");
static_assert(sizeof(Umg_UI_C_SettingsApplied) == 0x0000F0, "Wrong size on Umg_UI_C_SettingsApplied");
static_assert(offsetof(Umg_UI_C_SettingsApplied, Settings) == 0x000000, "Member 'Umg_UI_C_SettingsApplied::Settings' has a wrong offset!");

// Function umg_UI.umg_UI_C.openHovertext
// 0x0048 (0x0048 - 0x0000)
struct Umg_UI_C_OpenHovertext final
{
public:
	class UPrimitiveComponent*                    Param_HovertextLoc;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SettActive;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InText;                                            // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsActor;                                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Hide;                                              // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_UI_C_OpenHovertext) == 0x000008, "Wrong alignment on Umg_UI_C_OpenHovertext");
static_assert(sizeof(Umg_UI_C_OpenHovertext) == 0x000048, "Wrong size on Umg_UI_C_OpenHovertext");
static_assert(offsetof(Umg_UI_C_OpenHovertext, Param_HovertextLoc) == 0x000000, "Member 'Umg_UI_C_OpenHovertext::Param_HovertextLoc' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, SettActive) == 0x000008, "Member 'Umg_UI_C_OpenHovertext::SettActive' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, InText) == 0x000010, "Member 'Umg_UI_C_OpenHovertext::InText' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, IsActor) == 0x000028, "Member 'Umg_UI_C_OpenHovertext::IsActor' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, Hide) == 0x000029, "Member 'Umg_UI_C_OpenHovertext::Hide' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, Temp_byte_Variable) == 0x00002A, "Member 'Umg_UI_C_OpenHovertext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, CallFunc_TextIsEmpty_ReturnValue) == 0x00002B, "Member 'Umg_UI_C_OpenHovertext::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'Umg_UI_C_OpenHovertext::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, Temp_byte_Variable_1) == 0x00002D, "Member 'Umg_UI_C_OpenHovertext::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, Temp_bool_Variable) == 0x00002E, "Member 'Umg_UI_C_OpenHovertext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_UI_C_OpenHovertext, Temp_byte_Variable_2) == 0x00002F, "Member 'Umg_UI_C_OpenHovertext::Temp_byte_Variable_2' has a wrong offset!");
