#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_saveSlots

#include "Basic.hpp"

#include "Enum_gamemode_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FileSDK_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function umg_saveSlots.umg_saveSlots_C.ExecuteUbergraph_umg_saveSlots
// 0x0290 (0x0290 - 0x0000)
struct Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20F3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x00C8(0x0018)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F4[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F5[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlot_C*                            K2Node_DynamicCast_AsSave_Slot;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F6[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_2;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_3;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_gameVersion_version;                      // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_gameVersion_version_1;                    // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F7[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_4;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_5;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_gamemode                                 Temp_byte_Variable;                                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20F8[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F9[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_6;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20FA[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01D0(0x0018)()
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20FB[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_findSBMap_ReturnValue;                    // 0x0210(0x0018)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_7;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasAchievement_ReturnValue;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20FC[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0250(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20FD[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots) == 0x000008, "Wrong alignment on Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots");
static_assert(sizeof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots) == 0x000290, "Wrong size on Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, EntryPoint) == 0x000000, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable) == 0x000008, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_1) == 0x000018, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_2) == 0x000028, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_3) == 0x000038, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_4) == 0x000048, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_5) == 0x000058, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_6) == 0x000068, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000078, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_string_Variable_7) == 0x000088, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_string_Variable_7' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000098, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_GetText_ReturnValue) == 0x0000A0, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_GetText_ReturnValue_1) == 0x0000C8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000E0, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000E8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000F8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000108, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_DynamicCast_AsSave_Slot) == 0x000110, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_DynamicCast_AsSave_Slot' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_1) == 0x000120, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_2) == 0x000128, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_2' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000130, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_3) == 0x000138, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_3' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_gameVersion_version) == 0x000140, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_gameVersion_version' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_gameVersion_version_1) == 0x000150, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_gameVersion_version_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000160, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_4) == 0x000168, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_4' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000170, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000178, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_5) == 0x000180, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_5' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainSave_save_main) == 0x000188, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, Temp_byte_Variable) == 0x000190, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_Select_Default) == 0x000198, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001A8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Concat_StrStr_ReturnValue) == 0x0001B0, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_6) == 0x0001C0, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_6' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_SaveGameToSlot_ReturnValue) == 0x0001C8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_GetText_ReturnValue_2) == 0x0001D0, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_ComponentBoundEvent_SelectedItem) == 0x0001E8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_ComponentBoundEvent_SelectionType) == 0x0001F8, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000200, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_findSBMap_ReturnValue) == 0x000210, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_findSBMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_StringToName_ReturnValue) == 0x000228, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000230, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_getMainGameInstance_AsGame_Inst_7) == 0x000240, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_getMainGameInstance_AsGame_Inst_7' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_hasAchievement_ReturnValue) == 0x000248, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_hasAchievement_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_ComponentBoundEvent_Text) == 0x000250, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, K2Node_ComponentBoundEvent_CommitMethod) == 0x000268, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000270, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Conv_StringToInt_ReturnValue) == 0x000280, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000284, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000288, "Member 'Umg_saveSlots_C_ExecuteUbergraph_umg_saveSlots::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function umg_saveSlots.umg_saveSlots_C.BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Umg_saveSlots_C_BndEvt__umg_saveSlots_ETB_days_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function umg_saveSlots.umg_saveSlots_C.BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Umg_saveSlots_C_BndEvt__umg_saveSlots_ComboBoxString_195_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function umg_saveSlots.umg_saveSlots_C.gen
// 0x0410 (0x0410 - 0x0000)
struct Umg_saveSlots_C_Gen final
{
public:
	TArray<class UUmg_saveSlot_C*>                backup;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         I;                                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20FE[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20FF[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2100[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2101[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_saveSlot_C*                        CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_saveSlot_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2102[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_saveSlot_C*                        CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2103[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2104[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_saveSlot_C*                        CallFunc_Create_ReturnValue_2;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_saveSlot_C*                        CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2105[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2106[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_InsertChildAt_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2107[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_saveSlot_C*                        CallFunc_Create_ReturnValue_3;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2108[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ProjectSavedDir_ReturnValue;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUmg_saveSlot_C*                        CallFunc_Create_ReturnValue_4;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2109[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_1;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_210A[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UUmg_saveSlot_C*                  Temp_object_Variable;                              // 0x0158(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_210B[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ProjectSavedDir_ReturnValue_1;            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUmg_saveSlot_C*                        CallFunc_Array_Get_Item_2;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_JoyFileIO_GetFiles_Files;                 // 0x0190(0x0010)(ReferenceParm)
	bool                                          CallFunc_JoyFileIO_GetFiles_ReturnValue;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_210C[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_210D[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFileSDKFileInfo                       CallFunc_GetFileOrDirectoryInfo_Info;              // 0x01D0(0x0048)()
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_210E[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue_1;                       // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_210F[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue_1;                   // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USaveSlot_C*                            K2Node_DynamicCast_AsSave_Slot;                    // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2110[0x3];                                     // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2111[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_1;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue_2;                       // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USaveSlot_C*                            K2Node_DynamicCast_AsSave_Slot_1;                  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2112[0x2];                                     // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2113[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_2;                        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2114[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue_2;                   // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2115[0x4];                                     // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_2;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue_3;                       // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USaveSlot_C*                            K2Node_DynamicCast_AsSave_Slot_2;                  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2116[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2117[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_2;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_3;                        // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2118[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue_3;                   // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2119[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_3;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue_4;                       // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USaveSlot_C*                            K2Node_DynamicCast_AsSave_Slot_3;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211A[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_11;                 // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_3;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211B[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_3;               // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_4;                        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211C[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue_4;                   // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_12;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211D[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_4;           // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211E[0x4];                                     // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            K2Node_DynamicCast_AsSave_Slot_4;                  // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211F[0x2];                                     // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_13;                 // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_4;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2120[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_4;               // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_5;                        // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2121[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UUmg_saveSlot_C*                  Temp_object_Variable_1;                            // 0x0400(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2122[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_14;                 // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_saveSlots_C_Gen) == 0x000008, "Wrong alignment on Umg_saveSlots_C_Gen");
static_assert(sizeof(Umg_saveSlots_C_Gen) == 0x000410, "Wrong size on Umg_saveSlots_C_Gen");
static_assert(offsetof(Umg_saveSlots_C_Gen, backup) == 0x000000, "Member 'Umg_saveSlots_C_Gen::backup' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, I) == 0x000010, "Member 'Umg_saveSlots_C_Gen::I' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_byte_Variable) == 0x000014, "Member 'Umg_saveSlots_C_Gen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Variable) == 0x000018, "Member 'Umg_saveSlots_C_Gen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'Umg_saveSlots_C_Gen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Umg_saveSlots_C_Gen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Array_Index_Variable) == 0x000024, "Member 'Umg_saveSlots_C_Gen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_byte_Variable_1) == 0x000028, "Member 'Umg_saveSlots_C_Gen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Variable_1) == 0x00002C, "Member 'Umg_saveSlots_C_Gen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'Umg_saveSlots_C_Gen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'Umg_saveSlots_C_Gen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'Umg_saveSlots_C_Gen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_bool_Variable) == 0x00003C, "Member 'Umg_saveSlots_C_Gen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_saveSlots_C_Gen, Temp_int_Variable_2) == 0x000040, "Member 'Umg_saveSlots_C_Gen::Temp_int_Variable_2' has a wrong offset!");
