#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_shopSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_store_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_shopSlot.umg_shopSlot_C
// 0x0078 (0x02D8 - 0x0260)
class UUmg_shopSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_add;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_item;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_price;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_laptop_C*                          Owner;                                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FStruct_store                          Data;                                              // 0x0290(0x0048)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_shopSlot(int32 EntryPoint);
	void BndEvt__Button_add_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_shopSlot_C">();
	}
	static class UUmg_shopSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_shopSlot_C>();
	}
};
static_assert(alignof(UUmg_shopSlot_C) == 0x000008, "Wrong alignment on UUmg_shopSlot_C");
static_assert(sizeof(UUmg_shopSlot_C) == 0x0002D8, "Wrong size on UUmg_shopSlot_C");
static_assert(offsetof(UUmg_shopSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_shopSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_shopSlot_C, Button_add) == 0x000268, "Member 'UUmg_shopSlot_C::Button_add' has a wrong offset!");
static_assert(offsetof(UUmg_shopSlot_C, Img) == 0x000270, "Member 'UUmg_shopSlot_C::Img' has a wrong offset!");
static_assert(offsetof(UUmg_shopSlot_C, Text_item) == 0x000278, "Member 'UUmg_shopSlot_C::Text_item' has a wrong offset!");
static_assert(offsetof(UUmg_shopSlot_C, Text_price) == 0x000280, "Member 'UUmg_shopSlot_C::Text_price' has a wrong offset!");
static_assert(offsetof(UUmg_shopSlot_C, Owner) == 0x000288, "Member 'UUmg_shopSlot_C::Owner' has a wrong offset!");
static_assert(offsetof(UUmg_shopSlot_C, Data) == 0x000290, "Member 'UUmg_shopSlot_C::Data' has a wrong offset!");

}

