#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_saveSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_saveSlot.umg_saveSlot_C
// 0x0098 (0x02F8 - 0x0260)
class UUmg_saveSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_select;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_99;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_img;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_day;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_name;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_date;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_size;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ver;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_saveSlots_C*                       Parent;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 SlotName;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Days;                                              // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Ver;                                               // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USaveSlot_C*                            Save;                                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int64                                         Size;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_saveSlot(int32 EntryPoint);
	void Construct();
	void BndEvt__Button_res_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_160_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_select_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Upd(int32 Param_ID, class UTexture2D* Texture);
	void DeleteSlot();
	void ResetSlot();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_saveSlot_C">();
	}
	static class UUmg_saveSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_saveSlot_C>();
	}
};
static_assert(alignof(UUmg_saveSlot_C) == 0x000008, "Wrong alignment on UUmg_saveSlot_C");
static_assert(sizeof(UUmg_saveSlot_C) == 0x0002F8, "Wrong size on UUmg_saveSlot_C");
static_assert(offsetof(UUmg_saveSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_saveSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, button_select) == 0x000268, "Member 'UUmg_saveSlot_C::button_select' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Image) == 0x000270, "Member 'UUmg_saveSlot_C::Image' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Image_1) == 0x000278, "Member 'UUmg_saveSlot_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Image_99) == 0x000280, "Member 'UUmg_saveSlot_C::Image_99' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Image_img) == 0x000288, "Member 'UUmg_saveSlot_C::Image_img' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Text_day) == 0x000290, "Member 'UUmg_saveSlot_C::Text_day' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Text_name) == 0x000298, "Member 'UUmg_saveSlot_C::Text_name' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Txt_date) == 0x0002A0, "Member 'UUmg_saveSlot_C::Txt_date' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Txt_size) == 0x0002A8, "Member 'UUmg_saveSlot_C::Txt_size' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Txt_ver) == 0x0002B0, "Member 'UUmg_saveSlot_C::Txt_ver' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Parent) == 0x0002B8, "Member 'UUmg_saveSlot_C::Parent' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, SlotName) == 0x0002C0, "Member 'UUmg_saveSlot_C::SlotName' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Days) == 0x0002D0, "Member 'UUmg_saveSlot_C::Days' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, ID) == 0x0002D4, "Member 'UUmg_saveSlot_C::ID' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Ver) == 0x0002D8, "Member 'UUmg_saveSlot_C::Ver' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Save) == 0x0002E8, "Member 'UUmg_saveSlot_C::Save' has a wrong offset!");
static_assert(offsetof(UUmg_saveSlot_C, Size) == 0x0002F0, "Member 'UUmg_saveSlot_C::Size' has a wrong offset!");

}

