#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_signalMenuSlot

#include "Basic.hpp"

#include "Struct_signalDataDynamic_structs.hpp"
#include "Struct_signal_data2_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_signalMenuSlot.umg_signalMenuSlot_C.ExecuteUbergraph_umg_signalMenuSlot
// 0x0098 (0x0098 - 0x0000)
struct Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2569[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0038(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
};
static_assert(alignof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot) == 0x000008, "Wrong alignment on Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot");
static_assert(sizeof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot) == 0x000098, "Wrong size on Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, EntryPoint) == 0x000000, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_Conv_FloatToText_ReturnValue) == 0x000038, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_SelectString_ReturnValue) == 0x000070, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'Umg_signalMenuSlot_C_ExecuteUbergraph_umg_signalMenuSlot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function umg_signalMenuSlot.umg_signalMenuSlot_C.Spawn
// 0x0330 (0x0330 - 0x0000)
struct Umg_signalMenuSlot_C_Spawn final
{
public:
	int32                                         Decoded;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_signal_data2                   CallFunc_nameToSignal_data;                        // 0x0010(0x01D0)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256B[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_signalDataDynamic              CallFunc_signalToDynamic_dynamic;                  // 0x01F0(0x0070)(HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0260(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GenerateRandomBytes_ByteArray;            // 0x0298(0x0010)(ReferenceParm)
	class AProp_drive_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BytesToBase64_ReturnValue;                // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FStruct_signalDataDynamic              K2Node_SetFieldsInStruct_StructOut;                // 0x02C0(0x0070)(HasGetValueTypeHash)
};
static_assert(alignof(Umg_signalMenuSlot_C_Spawn) == 0x000010, "Wrong alignment on Umg_signalMenuSlot_C_Spawn");
static_assert(sizeof(Umg_signalMenuSlot_C_Spawn) == 0x000330, "Wrong size on Umg_signalMenuSlot_C_Spawn");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, Decoded) == 0x000000, "Member 'Umg_signalMenuSlot_C_Spawn::Decoded' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_nameToSignal_data) == 0x000010, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_nameToSignal_data' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E0, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_signalToDynamic_dynamic) == 0x0001F0, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_signalToDynamic_dynamic' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_MakeTransform_ReturnValue) == 0x000260, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000290, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_GenerateRandomBytes_ByteArray) == 0x000298, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_GenerateRandomBytes_ByteArray' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002A8, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, CallFunc_BytesToBase64_ReturnValue) == 0x0002B0, "Member 'Umg_signalMenuSlot_C_Spawn::CallFunc_BytesToBase64_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_signalMenuSlot_C_Spawn, K2Node_SetFieldsInStruct_StructOut) == 0x0002C0, "Member 'Umg_signalMenuSlot_C_Spawn::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");

}

