#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_inventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_inventory.umg_inventory_C
// 0x0028 (0x0288 - 0x0260)
class UUmg_inventory_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             Grid;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_69;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUmg_inventorySlot_C*>           Slots;                                             // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_umg_inventory(int32 EntryPoint);
	void Render();
	void Construct();
	void Upd();
	void Drop(int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_inventory_C">();
	}
	static class UUmg_inventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_inventory_C>();
	}
};
static_assert(alignof(UUmg_inventory_C) == 0x000008, "Wrong alignment on UUmg_inventory_C");
static_assert(sizeof(UUmg_inventory_C) == 0x000288, "Wrong size on UUmg_inventory_C");
static_assert(offsetof(UUmg_inventory_C, UberGraphFrame) == 0x000260, "Member 'UUmg_inventory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_inventory_C, Grid) == 0x000268, "Member 'UUmg_inventory_C::Grid' has a wrong offset!");
static_assert(offsetof(UUmg_inventory_C, Image_69) == 0x000270, "Member 'UUmg_inventory_C::Image_69' has a wrong offset!");
static_assert(offsetof(UUmg_inventory_C, Slots) == 0x000278, "Member 'UUmg_inventory_C::Slots' has a wrong offset!");

}

