#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_placeTp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_placeTp.umg_placeTp_C
// 0x0038 (0x0298 - 0x0260)
class UUmg_placeTp_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tex_name;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                Loc;                                               // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_Umg_placeTp_C;                                // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_placeTp(int32 EntryPoint);
	void Construct();
	void BndEvt__umg_placeTp_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_placeTp_C">();
	}
	static class UUmg_placeTp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_placeTp_C>();
	}
};
static_assert(alignof(UUmg_placeTp_C) == 0x000008, "Wrong alignment on UUmg_placeTp_C");
static_assert(sizeof(UUmg_placeTp_C) == 0x000298, "Wrong size on UUmg_placeTp_C");
static_assert(offsetof(UUmg_placeTp_C, UberGraphFrame) == 0x000260, "Member 'UUmg_placeTp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_placeTp_C, Button_0) == 0x000268, "Member 'UUmg_placeTp_C::Button_0' has a wrong offset!");
static_assert(offsetof(UUmg_placeTp_C, Tex_name) == 0x000270, "Member 'UUmg_placeTp_C::Tex_name' has a wrong offset!");
static_assert(offsetof(UUmg_placeTp_C, Loc) == 0x000278, "Member 'UUmg_placeTp_C::Loc' has a wrong offset!");
static_assert(offsetof(UUmg_placeTp_C, Name_Umg_placeTp_C) == 0x000288, "Member 'UUmg_placeTp_C::Name_Umg_placeTp_C' has a wrong offset!");

}

