#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_propInvSlor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_propInvSlor.umg_propInvSlor_C
// 0x0080 (0x02E0 - 0x0260)
class UUmg_propInvSlor_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_action;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_d;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_u;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_421;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_prop;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_am;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_v;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_w;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         IdList;                                            // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUmg_propInv_C*                         Owner;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Prop;                                              // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Tag;                                               // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         IdLast;                                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_propInvSlor(int32 EntryPoint);
	void BndEvt__umg_propInvSlor_Button_action_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__umg_propInvSlor_Button_action_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_u_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_d_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_103_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Init(const class FString& ItemToFind, float Weight, float Volume);
	void Sel();
	void SetAmount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_propInvSlor_C">();
	}
	static class UUmg_propInvSlor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_propInvSlor_C>();
	}
};
static_assert(alignof(UUmg_propInvSlor_C) == 0x000008, "Wrong alignment on UUmg_propInvSlor_C");
static_assert(sizeof(UUmg_propInvSlor_C) == 0x0002E0, "Wrong size on UUmg_propInvSlor_C");
static_assert(offsetof(UUmg_propInvSlor_C, UberGraphFrame) == 0x000260, "Member 'UUmg_propInvSlor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Button_action) == 0x000268, "Member 'UUmg_propInvSlor_C::Button_action' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Button_d) == 0x000270, "Member 'UUmg_propInvSlor_C::Button_d' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Button_u) == 0x000278, "Member 'UUmg_propInvSlor_C::Button_u' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Image_421) == 0x000280, "Member 'UUmg_propInvSlor_C::Image_421' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Img_prop) == 0x000288, "Member 'UUmg_propInvSlor_C::Img_prop' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Txt_am) == 0x000290, "Member 'UUmg_propInvSlor_C::Txt_am' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Txt_v) == 0x000298, "Member 'UUmg_propInvSlor_C::Txt_v' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Txt_w) == 0x0002A0, "Member 'UUmg_propInvSlor_C::Txt_w' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, ID) == 0x0002A8, "Member 'UUmg_propInvSlor_C::ID' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, IdList) == 0x0002AC, "Member 'UUmg_propInvSlor_C::IdList' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Owner) == 0x0002B0, "Member 'UUmg_propInvSlor_C::Owner' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Prop) == 0x0002B8, "Member 'UUmg_propInvSlor_C::Prop' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, Tag) == 0x0002C8, "Member 'UUmg_propInvSlor_C::Tag' has a wrong offset!");
static_assert(offsetof(UUmg_propInvSlor_C, IdLast) == 0x0002D8, "Member 'UUmg_propInvSlor_C::IdLast' has a wrong offset!");

}

