#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_achievements

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_achievement_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function umg_achievements.umg_achievements_C.ExecuteUbergraph_umg_achievements
// 0x0018 (0x0018 - 0x0000)
struct Umg_achievements_C_ExecuteUbergraph_umg_achievements final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_achievements_C_ExecuteUbergraph_umg_achievements) == 0x000008, "Wrong alignment on Umg_achievements_C_ExecuteUbergraph_umg_achievements");
static_assert(sizeof(Umg_achievements_C_ExecuteUbergraph_umg_achievements) == 0x000018, "Wrong size on Umg_achievements_C_ExecuteUbergraph_umg_achievements");
static_assert(offsetof(Umg_achievements_C_ExecuteUbergraph_umg_achievements, EntryPoint) == 0x000000, "Member 'Umg_achievements_C_ExecuteUbergraph_umg_achievements::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_ExecuteUbergraph_umg_achievements, K2Node_Event_index) == 0x000004, "Member 'Umg_achievements_C_ExecuteUbergraph_umg_achievements::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_ExecuteUbergraph_umg_achievements, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Umg_achievements_C_ExecuteUbergraph_umg_achievements::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_ExecuteUbergraph_umg_achievements, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000010, "Member 'Umg_achievements_C_ExecuteUbergraph_umg_achievements::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

// Function umg_achievements.umg_achievements_C.setIndex
// 0x0004 (0x0004 - 0x0000)
struct Umg_achievements_C_SetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_achievements_C_SetIndex) == 0x000004, "Wrong alignment on Umg_achievements_C_SetIndex");
static_assert(sizeof(Umg_achievements_C_SetIndex) == 0x000004, "Wrong size on Umg_achievements_C_SetIndex");
static_assert(offsetof(Umg_achievements_C_SetIndex, Param_Index) == 0x000000, "Member 'Umg_achievements_C_SetIndex::Param_Index' has a wrong offset!");

// Function umg_achievements.umg_achievements_C.upd
// 0x00A0 (0x00A0 - 0x0000)
struct Umg_achievements_C_Upd final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2173[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_achievementSlot_C*                 CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_InsertChildAt_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2174[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_achievementSlot_C*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_achievement                    CallFunc_Array_Get_Item_1;                         // 0x0040(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_achievements_C_Upd) == 0x000008, "Wrong alignment on Umg_achievements_C_Upd");
static_assert(sizeof(Umg_achievements_C_Upd) == 0x0000A0, "Wrong size on Umg_achievements_C_Upd");
static_assert(offsetof(Umg_achievements_C_Upd, Temp_int_Variable) == 0x000000, "Member 'Umg_achievements_C_Upd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Umg_achievements_C_Upd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Umg_achievements_C_Upd::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'Umg_achievements_C_Upd::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'Umg_achievements_C_Upd::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Umg_achievements_C_Upd::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_InsertChildAt_ReturnValue) == 0x000020, "Member 'Umg_achievements_C_Upd::CallFunc_InsertChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'Umg_achievements_C_Upd::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000030, "Member 'Umg_achievements_C_Upd::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Array_Get_Item) == 0x000038, "Member 'Umg_achievements_C_Upd::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'Umg_achievements_C_Upd::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'Umg_achievements_C_Upd::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'Umg_achievements_C_Upd::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'Umg_achievements_C_Upd::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Upd, CallFunc_Less_IntInt_ReturnValue_1) == 0x000099, "Member 'Umg_achievements_C_Upd::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function umg_achievements.umg_achievements_C.select
// 0x00D8 (0x00D8 - 0x0000)
struct Umg_achievements_C_Select final
{
public:
	class UUmg_achievementSlot_C*                 Param_ActiveSlot;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_achievementSlot_C*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2175[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2176[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2177[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2178[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2179[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_217A[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_achievements_C_Select) == 0x000008, "Wrong alignment on Umg_achievements_C_Select");
static_assert(sizeof(Umg_achievements_C_Select) == 0x0000D8, "Wrong size on Umg_achievements_C_Select");
static_assert(offsetof(Umg_achievements_C_Select, Param_ActiveSlot) == 0x000000, "Member 'Umg_achievements_C_Select::Param_ActiveSlot' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, Temp_int_Variable) == 0x000008, "Member 'Umg_achievements_C_Select::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Umg_achievements_C_Select::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Array_Get_Item) == 0x000010, "Member 'Umg_achievements_C_Select::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'Umg_achievements_C_Select::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_SelectColor_ReturnValue) == 0x00001C, "Member 'Umg_achievements_C_Select::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'Umg_achievements_C_Select::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'Umg_achievements_C_Select::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'Umg_achievements_C_Select::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000078, "Member 'Umg_achievements_C_Select::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000080, "Member 'Umg_achievements_C_Select::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000090, "Member 'Umg_achievements_C_Select::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000098, "Member 'Umg_achievements_C_Select::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'Umg_achievements_C_Select::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'Umg_achievements_C_Select::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'Umg_achievements_C_Select::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_Less_IntInt_ReturnValue) == 0x0000CC, "Member 'Umg_achievements_C_Select::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_achievements_C_Select, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'Umg_achievements_C_Select::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

