#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_menu.umg_menu_C.ExecuteUbergraph_umg_menu
// 0x01C0 (0x01C0 - 0x0000)
struct Umg_menu_C_ExecuteUbergraph_umg_menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0040(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue_1;        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_3;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_4;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_5;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_6;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_7;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_gameVersion_version;                      // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0130(0x0018)()
	bool                                          CallFunc_isMature_mature;                          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0160(0x0028)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_8;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst_9;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_menu_C_ExecuteUbergraph_umg_menu) == 0x000008, "Wrong alignment on Umg_menu_C_ExecuteUbergraph_umg_menu");
static_assert(sizeof(Umg_menu_C_ExecuteUbergraph_umg_menu) == 0x0001C0, "Wrong size on Umg_menu_C_ExecuteUbergraph_umg_menu");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, EntryPoint) == 0x000000, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, K2Node_Event_MyGeometry) == 0x000004, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, K2Node_Event_InFocusEvent) == 0x000040, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000048, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, K2Node_SwitchString_CmpSuccess) == 0x000058, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_SpawnSound2D_ReturnValue) == 0x000060, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_SetGamePaused_ReturnValue) == 0x000070, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000078, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_2) == 0x000080, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_3) == 0x000088, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_4) == 0x000090, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_5) == 0x000098, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_6) == 0x0000A0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000A8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetCurrentLevelName_ReturnValue_1) == 0x0000B0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetCurrentLevelName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, K2Node_SwitchString_CmpSuccess_1) == 0x0000C0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_7) == 0x0000C8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_1) == 0x0000D0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_1' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_2) == 0x0000D8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_2' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_3) == 0x0000E0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_3' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_8) == 0x0000E8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_4) == 0x0000F0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_4' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_5) == 0x0000F8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_5' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_6) == 0x000100, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_6' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_7) == 0x000108, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_7' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_9) == 0x000110, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000118, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_gameVersion_version) == 0x000120, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_gameVersion_version' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_Conv_StringToText_ReturnValue) == 0x000130, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_isMature_mature) == 0x000148, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_isMature_mature' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_SelectColor_ReturnValue) == 0x00014C, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00015C, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, K2Node_MakeStruct_SlateColor) == 0x000160, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000188, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x00018C, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000190, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000194, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_8) == 0x000198, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_8' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_10) == 0x0001A0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_11) == 0x0001A8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_getMainGameInstance_AsGame_Inst_9) == 0x0001B0, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_getMainGameInstance_AsGame_Inst_9' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_ExecuteUbergraph_umg_menu, CallFunc_GetPlayerController_ReturnValue_12) == 0x0001B8, "Member 'Umg_menu_C_ExecuteUbergraph_umg_menu::CallFunc_GetPlayerController_ReturnValue_12' has a wrong offset!");

// Function umg_menu.umg_menu_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct Umg_menu_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(Umg_menu_C_OnFocusLost) == 0x000004, "Wrong alignment on Umg_menu_C_OnFocusLost");
static_assert(sizeof(Umg_menu_C_OnFocusLost) == 0x000008, "Wrong size on Umg_menu_C_OnFocusLost");
static_assert(offsetof(Umg_menu_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'Umg_menu_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function umg_menu.umg_menu_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_menu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_menu_C_Tick) == 0x000004, "Wrong alignment on Umg_menu_C_Tick");
static_assert(sizeof(Umg_menu_C_Tick) == 0x00003C, "Wrong size on Umg_menu_C_Tick");
static_assert(offsetof(Umg_menu_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_menu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_menu_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_menu.umg_menu_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct Umg_menu_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(Umg_menu_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on Umg_menu_C_OnMouseButtonDown");
static_assert(sizeof(Umg_menu_C_OnMouseButtonDown) == 0x000218, "Wrong size on Umg_menu_C_OnMouseButtonDown");
static_assert(offsetof(Umg_menu_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'Umg_menu_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'Umg_menu_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'Umg_menu_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'Umg_menu_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function umg_menu.umg_menu_C.Action
// 0x0018 (0x0018 - 0x0000)
struct Umg_menu_C_Action final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_saveSlot_C*                        Param_Slot;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_menu_C_Action) == 0x000008, "Wrong alignment on Umg_menu_C_Action");
static_assert(sizeof(Umg_menu_C_Action) == 0x000018, "Wrong size on Umg_menu_C_Action");
static_assert(offsetof(Umg_menu_C_Action, Type) == 0x000000, "Member 'Umg_menu_C_Action::Type' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Action, Param_Slot) == 0x000008, "Member 'Umg_menu_C_Action::Param_Slot' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Action, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Umg_menu_C_Action::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Action, K2Node_SwitchInteger_CmpSuccess) == 0x000011, "Member 'Umg_menu_C_Action::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function umg_menu.umg_menu_C.OnKeyDown
// 0x0218 (0x0218 - 0x0000)
struct Umg_menu_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_widgets_C>        K2Node_DynamicCast_AsInt_Widgets;                  // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(Umg_menu_C_OnKeyDown) == 0x000008, "Wrong alignment on Umg_menu_C_OnKeyDown");
static_assert(sizeof(Umg_menu_C_OnKeyDown) == 0x000218, "Wrong size on Umg_menu_C_OnKeyDown");
static_assert(offsetof(Umg_menu_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'Umg_menu_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'Umg_menu_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'Umg_menu_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'Umg_menu_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'Umg_menu_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000141, "Member 'Umg_menu_C_OnKeyDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, K2Node_DynamicCast_AsInt_Widgets) == 0x000148, "Member 'Umg_menu_C_OnKeyDown::K2Node_DynamicCast_AsInt_Widgets' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'Umg_menu_C_OnKeyDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, CallFunc_IsValid_ReturnValue) == 0x000159, "Member 'Umg_menu_C_OnKeyDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyDown, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'Umg_menu_C_OnKeyDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function umg_menu.umg_menu_C.OnKeyUp
// 0x0200 (0x0200 - 0x0000)
struct Umg_menu_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0128(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_menu_C_OnKeyUp) == 0x000008, "Wrong alignment on Umg_menu_C_OnKeyUp");
static_assert(sizeof(Umg_menu_C_OnKeyUp) == 0x000200, "Wrong size on Umg_menu_C_OnKeyUp");
static_assert(offsetof(Umg_menu_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'Umg_menu_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'Umg_menu_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'Umg_menu_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyUp, K2Node_MakeStruct_EventReply) == 0x000128, "Member 'Umg_menu_C_OnKeyUp::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x0001E0, "Member 'Umg_menu_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'Umg_menu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function umg_menu.umg_menu_C.gather
// 0x05D8 (0x05D8 - 0x0000)
struct Umg_menu_C_Gather final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x00C8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_3;                    // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0138(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_4;                    // 0x0178(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_5;                    // 0x0190(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01A8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x01E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_6;                    // 0x0228(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_7;                    // 0x0240(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0258(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0298(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_8;                    // 0x02D8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_9;                    // 0x02F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0308(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x0348(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_10;                   // 0x0388(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_11;                   // 0x03A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x03B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x03F8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_12;                   // 0x0438(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_13;                   // 0x0450(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_12;           // 0x0468(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_13;           // 0x04A8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_14;                   // 0x04E8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_15;                   // 0x0500(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_14;           // 0x0518(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_15;           // 0x0558(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0598(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetText_ReturnValue_16;                   // 0x05A8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x05C0(0x0018)()
};
static_assert(alignof(Umg_menu_C_Gather) == 0x000008, "Wrong alignment on Umg_menu_C_Gather");
static_assert(sizeof(Umg_menu_C_Gather) == 0x0005D8, "Wrong size on Umg_menu_C_Gather");
static_assert(offsetof(Umg_menu_C_Gather, Result) == 0x000000, "Member 'Umg_menu_C_Gather::Result' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Gather, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'Umg_menu_C_Gather::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Gather, CallFunc_GetText_ReturnValue_1) == 0x000030, "Member 'Umg_menu_C_Gather::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_menu_C_Gather, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'Umg_menu_C_Gather::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
