#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_tvOffline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_tv_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_playlist_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_tvOffline.umg_tvOffline_C
// 0x00D8 (0x0338 - 0x0260)
class UUmg_tvOffline_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_104;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_play;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_refresh;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_skip;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_stop;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_scr;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_list;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_playback;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_volume;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_playback;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_playType;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_station;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_status;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_volume;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         Stations;                                          // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UUmg_tvOfflineSlot_C*>           Slots;                                             // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AProp_tv2_C*                            Radio;                                             // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_tv                             Data;                                              // 0x0300(0x0028)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimespan                              Duration;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SliderGrab;                                        // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_umg_tvOffline(int32 EntryPoint);
	void BndEvt__umg_tvOffline_Button_skip_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_tvOffline_Slider_playback_K2Node_ComponentBoundEvent_7_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__umg_tvOffline_Slider_playback_K2Node_ComponentBoundEvent_6_OnMouseCaptureBeginEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__umg_tvOffline_Slider_playback_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__umg_tvOffline_Button_104_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_onlineRadio_Button_refresh_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_onlineRadio_Slider_volume_K2Node_ComponentBoundEvent_3_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__umg_onlineRadio_Button_stop_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_onlineRadio_Button_play_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Quit();
	void Open(class AProp_tv2_C* Param_Radio);
	void Gen();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Select(const struct FStruct_tv& Param_Data, bool PausePlayer);
	void SelectDeco();
	void SetDuration(const struct FTimespan& Param_Duration);
	void SetPlaybackTime(const struct FTimespan& InTimespan);
	void SetPB(float Scalar);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_tvOffline_C">();
	}
	static class UUmg_tvOffline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_tvOffline_C>();
	}
};
static_assert(alignof(UUmg_tvOffline_C) == 0x000008, "Wrong alignment on UUmg_tvOffline_C");
static_assert(sizeof(UUmg_tvOffline_C) == 0x000338, "Wrong size on UUmg_tvOffline_C");
static_assert(offsetof(UUmg_tvOffline_C, UberGraphFrame) == 0x000260, "Member 'UUmg_tvOffline_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Button_104) == 0x000268, "Member 'UUmg_tvOffline_C::Button_104' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, button_play) == 0x000270, "Member 'UUmg_tvOffline_C::button_play' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Button_refresh) == 0x000278, "Member 'UUmg_tvOffline_C::Button_refresh' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Button_skip) == 0x000280, "Member 'UUmg_tvOffline_C::Button_skip' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, button_stop) == 0x000288, "Member 'UUmg_tvOffline_C::button_stop' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Img_scr) == 0x000290, "Member 'UUmg_tvOffline_C::Img_scr' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, ScrollBox_list) == 0x000298, "Member 'UUmg_tvOffline_C::ScrollBox_list' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Slider_playback) == 0x0002A0, "Member 'UUmg_tvOffline_C::Slider_playback' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Slider_volume) == 0x0002A8, "Member 'UUmg_tvOffline_C::Slider_volume' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Txt_playback) == 0x0002B0, "Member 'UUmg_tvOffline_C::Txt_playback' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Txt_playType) == 0x0002B8, "Member 'UUmg_tvOffline_C::Txt_playType' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Txt_station) == 0x0002C0, "Member 'UUmg_tvOffline_C::Txt_station' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Txt_status) == 0x0002C8, "Member 'UUmg_tvOffline_C::Txt_status' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Txt_volume) == 0x0002D0, "Member 'UUmg_tvOffline_C::Txt_volume' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Stations) == 0x0002D8, "Member 'UUmg_tvOffline_C::Stations' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Slots) == 0x0002E8, "Member 'UUmg_tvOffline_C::Slots' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Radio) == 0x0002F8, "Member 'UUmg_tvOffline_C::Radio' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Data) == 0x000300, "Member 'UUmg_tvOffline_C::Data' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, Duration) == 0x000328, "Member 'UUmg_tvOffline_C::Duration' has a wrong offset!");
static_assert(offsetof(UUmg_tvOffline_C, SliderGrab) == 0x000330, "Member 'UUmg_tvOffline_C::SliderGrab' has a wrong offset!");

}

