#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_eventRun

#include "Basic.hpp"

#include "Struct_event_structs.hpp"


namespace SDK::Params
{

// Function umg_eventRun.umg_eventRun_C.ExecuteUbergraph_umg_eventRun
// 0x0048 (0x0048 - 0x0000)
struct Umg_eventRun_C_ExecuteUbergraph_umg_eventRun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_event                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x000C(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun) == 0x000008, "Wrong alignment on Umg_eventRun_C_ExecuteUbergraph_umg_eventRun");
static_assert(sizeof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun) == 0x000048, "Wrong size on Umg_eventRun_C_ExecuteUbergraph_umg_eventRun");
static_assert(offsetof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun, EntryPoint) == 0x000000, "Member 'Umg_eventRun_C_ExecuteUbergraph_umg_eventRun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun, CallFunc_Conv_StringToName_ReturnValue) == 0x000004, "Member 'Umg_eventRun_C_ExecuteUbergraph_umg_eventRun::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun, CallFunc_GetDataTableRowFromName_OutRow) == 0x00000C, "Member 'Umg_eventRun_C_ExecuteUbergraph_umg_eventRun::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'Umg_eventRun_C_ExecuteUbergraph_umg_eventRun::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'Umg_eventRun_C_ExecuteUbergraph_umg_eventRun::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_eventRun_C_ExecuteUbergraph_umg_eventRun, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000040, "Member 'Umg_eventRun_C_ExecuteUbergraph_umg_eventRun::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");

}

