#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_statsSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_statsSlot.umg_statsSlot_C
// 0x0060 (0x02C0 - 0x0260)
class UUmg_statsSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_40;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_stat;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_text;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_Umg_statsSlot_C;                              // 0x0280(0x0018)(Edit, BlueprintVisible)
	float                                         Stat;                                              // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Suffix;                                            // 0x02A0(0x0018)(Edit, BlueprintVisible)
	float                                         Divisor;                                           // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimeValue;                                         // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_umg_statsSlot(int32 EntryPoint);
	void Construct();
	void Upd(float Param_Stat);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_statsSlot_C">();
	}
	static class UUmg_statsSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_statsSlot_C>();
	}
};
static_assert(alignof(UUmg_statsSlot_C) == 0x000008, "Wrong alignment on UUmg_statsSlot_C");
static_assert(sizeof(UUmg_statsSlot_C) == 0x0002C0, "Wrong size on UUmg_statsSlot_C");
static_assert(offsetof(UUmg_statsSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_statsSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Image_40) == 0x000268, "Member 'UUmg_statsSlot_C::Image_40' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Txt_stat) == 0x000270, "Member 'UUmg_statsSlot_C::Txt_stat' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Txt_text) == 0x000278, "Member 'UUmg_statsSlot_C::Txt_text' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Name_Umg_statsSlot_C) == 0x000280, "Member 'UUmg_statsSlot_C::Name_Umg_statsSlot_C' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Stat) == 0x000298, "Member 'UUmg_statsSlot_C::Stat' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Suffix) == 0x0002A0, "Member 'UUmg_statsSlot_C::Suffix' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, Divisor) == 0x0002B8, "Member 'UUmg_statsSlot_C::Divisor' has a wrong offset!");
static_assert(offsetof(UUmg_statsSlot_C, TimeValue) == 0x0002BC, "Member 'UUmg_statsSlot_C::TimeValue' has a wrong offset!");

}

