#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_reactorRod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_reactorRod.umg_reactorRod_C
// 0x0048 (0x02A8 - 0x0260)
class UUmg_reactorRod_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_heigh_1;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_89;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_71;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_Umg_reactorRod_C;                            // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_reactor_C*                         Owner;                                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_reactorRod(int32 EntryPoint);
	void BndEvt__Slider_89_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void Construct();
	void Upd(float Alpha);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_reactorRod_C">();
	}
	static class UUmg_reactorRod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_reactorRod_C>();
	}
};
static_assert(alignof(UUmg_reactorRod_C) == 0x000008, "Wrong alignment on UUmg_reactorRod_C");
static_assert(sizeof(UUmg_reactorRod_C) == 0x0002A8, "Wrong size on UUmg_reactorRod_C");
static_assert(offsetof(UUmg_reactorRod_C, UberGraphFrame) == 0x000260, "Member 'UUmg_reactorRod_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Image) == 0x000268, "Member 'UUmg_reactorRod_C::Image' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Image_1) == 0x000270, "Member 'UUmg_reactorRod_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Image_2) == 0x000278, "Member 'UUmg_reactorRod_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Img_heigh_1) == 0x000280, "Member 'UUmg_reactorRod_C::Img_heigh_1' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Slider_89) == 0x000288, "Member 'UUmg_reactorRod_C::Slider_89' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, TextBlock_71) == 0x000290, "Member 'UUmg_reactorRod_C::TextBlock_71' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Index_Umg_reactorRod_C) == 0x000298, "Member 'UUmg_reactorRod_C::Index_Umg_reactorRod_C' has a wrong offset!");
static_assert(offsetof(UUmg_reactorRod_C, Owner) == 0x0002A0, "Member 'UUmg_reactorRod_C::Owner' has a wrong offset!");

}

