#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_clipboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_clipboard.umg_clipboard_C
// 0x0068 (0x02C8 - 0x0260)
class UUmg_clipboard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_cr;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_del;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_page_next;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_page_prev;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_t_compl;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_t_loan;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_t_report;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_tg;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_back;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 MultiLineEditableText_86;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_nums;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AProp_clipboard_C*                      Clipboard;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_clipboard(int32 EntryPoint);
	void BndEvt__umg_clipboard_Button_t_compl_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_clipboard_Button_tg_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void F();
	void Construct();
	void BndEvt__Button_t_loan_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_t_report_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Button_cr_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_255_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_page_prev_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_page_next_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Init(class AProp_clipboard_C* Param_Clipboard);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void ClampPages();
	void Quit();
	void ClampLines(const class FString& SourceString, class FString* NewParam);
	class FString ProcSats(const TArray<class FString>& SourceArray);
	void Proc2(TArray<class FString>& InputPin, class FString* A1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_clipboard_C">();
	}
	static class UUmg_clipboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_clipboard_C>();
	}
};
static_assert(alignof(UUmg_clipboard_C) == 0x000008, "Wrong alignment on UUmg_clipboard_C");
static_assert(sizeof(UUmg_clipboard_C) == 0x0002C8, "Wrong size on UUmg_clipboard_C");
static_assert(offsetof(UUmg_clipboard_C, UberGraphFrame) == 0x000260, "Member 'UUmg_clipboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_cr) == 0x000268, "Member 'UUmg_clipboard_C::Button_cr' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_del) == 0x000270, "Member 'UUmg_clipboard_C::Button_del' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_page_next) == 0x000278, "Member 'UUmg_clipboard_C::Button_page_next' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_page_prev) == 0x000280, "Member 'UUmg_clipboard_C::Button_page_prev' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_t_compl) == 0x000288, "Member 'UUmg_clipboard_C::Button_t_compl' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_t_loan) == 0x000290, "Member 'UUmg_clipboard_C::Button_t_loan' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_t_report) == 0x000298, "Member 'UUmg_clipboard_C::Button_t_report' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Button_tg) == 0x0002A0, "Member 'UUmg_clipboard_C::Button_tg' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Image_back) == 0x0002A8, "Member 'UUmg_clipboard_C::Image_back' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, MultiLineEditableText_86) == 0x0002B0, "Member 'UUmg_clipboard_C::MultiLineEditableText_86' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Txt_nums) == 0x0002B8, "Member 'UUmg_clipboard_C::Txt_nums' has a wrong offset!");
static_assert(offsetof(UUmg_clipboard_C, Clipboard) == 0x0002C0, "Member 'UUmg_clipboard_C::Clipboard' has a wrong offset!");

}

