#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_upgradeSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function umg_upgradeSlot.umg_upgradeSlot_C.ExecuteUbergraph_umg_upgradeSlot
// 0x0118 (0x0118 - 0x0000)
struct Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_5;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_6;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_getPrice_ReturnValue;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_getPrice_ReturnValue_1;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot) == 0x000008, "Wrong alignment on Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot");
static_assert(sizeof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot) == 0x000118, "Wrong size on Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, EntryPoint) == 0x000000, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable) == 0x000048, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_MakeArray_Array) == 0x000050, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000060, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Format_ReturnValue) == 0x000068, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000080, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000088, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default) == 0x000090, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000098, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_1) == 0x0000A0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default_1) == 0x0000A4, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_2) == 0x0000AC, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x0000B0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_3) == 0x0000C0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_5) == 0x0000D0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_5' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_4) == 0x0000D8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default_2) == 0x0000DC, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, K2Node_Select_Default_3) == 0x0000E0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000E4, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getMainGamemode_AsMain_Gamemode_6) == 0x0000F0, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getMainGamemode_AsMain_Gamemode_6' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, Temp_int_Variable_5) == 0x0000F8, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getPrice_ReturnValue) == 0x0000FC, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_getPrice_ReturnValue_1) == 0x000100, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_getPrice_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Multiply_IntInt_ReturnValue) == 0x000104, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000108, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00010C, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot, CallFunc_FFloor_ReturnValue) == 0x000110, "Member 'Umg_upgradeSlot_C_ExecuteUbergraph_umg_upgradeSlot::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function umg_upgradeSlot.umg_upgradeSlot_C.upd
// 0x0080 (0x0080 - 0x0000)
struct Umg_upgradeSlot_C_Upd final
{
public:
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(Umg_upgradeSlot_C_Upd) == 0x000008, "Wrong alignment on Umg_upgradeSlot_C_Upd");
static_assert(sizeof(Umg_upgradeSlot_C_Upd) == 0x000080, "Wrong size on Umg_upgradeSlot_C_Upd");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000000, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000008, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, Temp_int_Variable) == 0x000010, "Member 'Umg_upgradeSlot_C_Upd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, K2Node_Select_Default) == 0x000014, "Member 'Umg_upgradeSlot_C_Upd::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, Temp_int_Variable_1) == 0x00002C, "Member 'Umg_upgradeSlot_C_Upd::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, K2Node_Select_Default_1) == 0x000034, "Member 'Umg_upgradeSlot_C_Upd::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000038, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_Upd, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'Umg_upgradeSlot_C_Upd::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function umg_upgradeSlot.umg_upgradeSlot_C.getPrice
// 0x0028 (0x0028 - 0x0000)
struct Umg_upgradeSlot_C_GetPrice final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_upgradeSlot_C_GetPrice) == 0x000008, "Wrong alignment on Umg_upgradeSlot_C_GetPrice");
static_assert(sizeof(Umg_upgradeSlot_C_GetPrice) == 0x000028, "Wrong size on Umg_upgradeSlot_C_GetPrice");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, ReturnValue) == 0x000000, "Member 'Umg_upgradeSlot_C_GetPrice::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Umg_upgradeSlot_C_GetPrice::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, Temp_int_Variable) == 0x000010, "Member 'Umg_upgradeSlot_C_GetPrice::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, K2Node_Select_Default) == 0x000014, "Member 'Umg_upgradeSlot_C_GetPrice::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'Umg_upgradeSlot_C_GetPrice::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, CallFunc_Max_ReturnValue) == 0x00001C, "Member 'Umg_upgradeSlot_C_GetPrice::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, CallFunc_Multiply_IntInt_ReturnValue) == 0x000020, "Member 'Umg_upgradeSlot_C_GetPrice::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_GetPrice, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'Umg_upgradeSlot_C_GetPrice::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function umg_upgradeSlot.umg_upgradeSlot_C.updPrice
// 0x0020 (0x0020 - 0x0000)
struct Umg_upgradeSlot_C_UpdPrice final
{
public:
	int32                                         CallFunc_getPrice_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(Umg_upgradeSlot_C_UpdPrice) == 0x000008, "Wrong alignment on Umg_upgradeSlot_C_UpdPrice");
static_assert(sizeof(Umg_upgradeSlot_C_UpdPrice) == 0x000020, "Wrong size on Umg_upgradeSlot_C_UpdPrice");
static_assert(offsetof(Umg_upgradeSlot_C_UpdPrice, CallFunc_getPrice_ReturnValue) == 0x000000, "Member 'Umg_upgradeSlot_C_UpdPrice::CallFunc_getPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_upgradeSlot_C_UpdPrice, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'Umg_upgradeSlot_C_UpdPrice::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

