#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_patronList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_patronList.umg_patronList_C.ExecuteUbergraph_umg_patronList
// 0x03D0 (0x03D0 - 0x0000)
struct Umg_patronList_C_ExecuteUbergraph_umg_patronList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20AC[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0018)()
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20AD[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20AE[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0110(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20AF[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B0[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_1;             // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01A0(0x0018)()
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B1[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0240(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B2[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B3[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_16;             // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_17;             // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B4[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B5[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue_2;             // 0x02F8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20B6[0x3];                                     // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_18;             // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_19;             // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_20;             // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B7[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0358(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_21;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_22;             // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_23;             // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_24;             // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_25;             // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_patronList_C_ExecuteUbergraph_umg_patronList) == 0x000008, "Wrong alignment on Umg_patronList_C_ExecuteUbergraph_umg_patronList");
static_assert(sizeof(Umg_patronList_C_ExecuteUbergraph_umg_patronList) == 0x0003D0, "Wrong size on Umg_patronList_C_ExecuteUbergraph_umg_patronList");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, EntryPoint) == 0x000000, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Variable) == 0x00001C, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Variable_1) == 0x000020, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Array_Index_Variable_2) == 0x00002C, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, K2Node_Event_MyGeometry) == 0x000030, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, K2Node_Event_InDeltaTime) == 0x000068, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000098, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000A8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_GetDesiredSize_ReturnValue) == 0x0000D0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_BreakVector2D_X) == 0x0000D8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_BreakVector2D_Y) == 0x0000DC, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000E8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Lerp_ReturnValue) == 0x0000F0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_MakeVector2D_ReturnValue) == 0x0000F4, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_TextToString_ReturnValue) == 0x000100, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_ParseIntoArray_ReturnValue) == 0x000110, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000120, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Array_Get_Item) == 0x000130, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000148, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Less_IntInt_ReturnValue) == 0x000158, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000160, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000170, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000180, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_ParseIntoArray_ReturnValue_1) == 0x000190, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_ParseIntoArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_MakeLiteralText_ReturnValue) == 0x0001A0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Array_Get_Item_1) == 0x0001B8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001C8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0001D8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0001E8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0001F8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_10) == 0x000208, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Array_Length_ReturnValue_1) == 0x000218, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Less_IntInt_ReturnValue_1) == 0x00021C, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000220, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_12) == 0x000230, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000240, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000258, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_13) == 0x000268, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Add_IntInt_ReturnValue_3) == 0x000278, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_14) == 0x000280, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, Temp_int_Variable_2) == 0x000290, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_15) == 0x000298, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_16) == 0x0002A8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_17) == 0x0002B8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0002C8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Add_IntInt_ReturnValue_4) == 0x0002CC, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002D0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0002D4, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0002D8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_TextToString_ReturnValue_4) == 0x0002E0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0002F0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_ParseIntoArray_ReturnValue_2) == 0x0002F8, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_ParseIntoArray_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Array_Get_Item_2) == 0x000308, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Array_Length_ReturnValue_2) == 0x000318, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Less_IntInt_ReturnValue_2) == 0x00031C, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_18) == 0x000320, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_19) == 0x000330, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_20) == 0x000340, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Add_IntInt_ReturnValue_5) == 0x000350, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000358, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000370, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_21) == 0x000380, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_22) == 0x000390, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_23) == 0x0003A0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_24) == 0x0003B0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_ExecuteUbergraph_umg_patronList, CallFunc_Concat_StrStr_ReturnValue_25) == 0x0003C0, "Member 'Umg_patronList_C_ExecuteUbergraph_umg_patronList::CallFunc_Concat_StrStr_ReturnValue_25' has a wrong offset!");

// Function umg_patronList.umg_patronList_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_patronList_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_patronList_C_Tick) == 0x000004, "Wrong alignment on Umg_patronList_C_Tick");
static_assert(sizeof(Umg_patronList_C_Tick) == 0x00003C, "Wrong size on Umg_patronList_C_Tick");
static_assert(offsetof(Umg_patronList_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_patronList_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_patronList_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_patronList_C_Tick::InDeltaTime' has a wrong offset!");

}

