#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_credits

#include "Basic.hpp"


namespace SDK::Params
{

// Function umg_credits.umg_credits_C.ExecuteUbergraph_umg_credits
// 0x0018 (0x0018 - 0x0000)
struct Umg_credits_C_ExecuteUbergraph_umg_credits final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_credits_C_ExecuteUbergraph_umg_credits) == 0x000008, "Wrong alignment on Umg_credits_C_ExecuteUbergraph_umg_credits");
static_assert(sizeof(Umg_credits_C_ExecuteUbergraph_umg_credits) == 0x000018, "Wrong size on Umg_credits_C_ExecuteUbergraph_umg_credits");
static_assert(offsetof(Umg_credits_C_ExecuteUbergraph_umg_credits, EntryPoint) == 0x000000, "Member 'Umg_credits_C_ExecuteUbergraph_umg_credits::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_credits_C_ExecuteUbergraph_umg_credits, K2Node_Event_index) == 0x000004, "Member 'Umg_credits_C_ExecuteUbergraph_umg_credits::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Umg_credits_C_ExecuteUbergraph_umg_credits, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Umg_credits_C_ExecuteUbergraph_umg_credits::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_credits_C_ExecuteUbergraph_umg_credits, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'Umg_credits_C_ExecuteUbergraph_umg_credits::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function umg_credits.umg_credits_C.setIndex
// 0x0004 (0x0004 - 0x0000)
struct Umg_credits_C_SetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_credits_C_SetIndex) == 0x000004, "Wrong alignment on Umg_credits_C_SetIndex");
static_assert(sizeof(Umg_credits_C_SetIndex) == 0x000004, "Wrong size on Umg_credits_C_SetIndex");
static_assert(offsetof(Umg_credits_C_SetIndex, Param_Index) == 0x000000, "Member 'Umg_credits_C_SetIndex::Param_Index' has a wrong offset!");

}

