#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_shopCartSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function umg_shopCartSlot.umg_shopCartSlot_C.ExecuteUbergraph_umg_shopCartSlot
// 0x0008 (0x0008 - 0x0000)
struct Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot) == 0x000004, "Wrong alignment on Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot");
static_assert(sizeof(Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot) == 0x000008, "Wrong size on Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot");
static_assert(offsetof(Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot, EntryPoint) == 0x000000, "Member 'Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot, K2Node_Event_index) == 0x000004, "Member 'Umg_shopCartSlot_C_ExecuteUbergraph_umg_shopCartSlot::K2Node_Event_index' has a wrong offset!");

// Function umg_shopCartSlot.umg_shopCartSlot_C.setIndex
// 0x0004 (0x0004 - 0x0000)
struct Umg_shopCartSlot_C_SetIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_shopCartSlot_C_SetIndex) == 0x000004, "Wrong alignment on Umg_shopCartSlot_C_SetIndex");
static_assert(sizeof(Umg_shopCartSlot_C_SetIndex) == 0x000004, "Wrong size on Umg_shopCartSlot_C_SetIndex");
static_assert(offsetof(Umg_shopCartSlot_C_SetIndex, Param_Index) == 0x000000, "Member 'Umg_shopCartSlot_C_SetIndex::Param_Index' has a wrong offset!");

// Function umg_shopCartSlot.umg_shopCartSlot_C.upd
// 0x0038 (0x0038 - 0x0000)
struct Umg_shopCartSlot_C_Upd final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Price;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(Umg_shopCartSlot_C_Upd) == 0x000008, "Wrong alignment on Umg_shopCartSlot_C_Upd");
static_assert(sizeof(Umg_shopCartSlot_C_Upd) == 0x000038, "Wrong size on Umg_shopCartSlot_C_Upd");
static_assert(offsetof(Umg_shopCartSlot_C_Upd, Param_Name) == 0x000000, "Member 'Umg_shopCartSlot_C_Upd::Param_Name' has a wrong offset!");
static_assert(offsetof(Umg_shopCartSlot_C_Upd, Price) == 0x000018, "Member 'Umg_shopCartSlot_C_Upd::Price' has a wrong offset!");
static_assert(offsetof(Umg_shopCartSlot_C_Upd, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'Umg_shopCartSlot_C_Upd::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

