#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_shopCartSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_shopCartSlot.umg_shopCartSlot_C
// 0x0030 (0x0290 - 0x0260)
class UUmg_shopCartSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_del;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_item;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_price;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_laptop_C*                          Owner;                                             // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_Umg_shopCartSlot_C;                          // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_shopCartSlot(int32 EntryPoint);
	void Resume();
	void SetIndex(int32 Param_Index);
	void BndEvt__Button_del_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Upd(const class FText& Param_Name, int32 Price);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_shopCartSlot_C">();
	}
	static class UUmg_shopCartSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_shopCartSlot_C>();
	}
};
static_assert(alignof(UUmg_shopCartSlot_C) == 0x000008, "Wrong alignment on UUmg_shopCartSlot_C");
static_assert(sizeof(UUmg_shopCartSlot_C) == 0x000290, "Wrong size on UUmg_shopCartSlot_C");
static_assert(offsetof(UUmg_shopCartSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_shopCartSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_shopCartSlot_C, Button_del) == 0x000268, "Member 'UUmg_shopCartSlot_C::Button_del' has a wrong offset!");
static_assert(offsetof(UUmg_shopCartSlot_C, Txt_item) == 0x000270, "Member 'UUmg_shopCartSlot_C::Txt_item' has a wrong offset!");
static_assert(offsetof(UUmg_shopCartSlot_C, Txt_price) == 0x000278, "Member 'UUmg_shopCartSlot_C::Txt_price' has a wrong offset!");
static_assert(offsetof(UUmg_shopCartSlot_C, Owner) == 0x000280, "Member 'UUmg_shopCartSlot_C::Owner' has a wrong offset!");
static_assert(offsetof(UUmg_shopCartSlot_C, Index_Umg_shopCartSlot_C) == 0x000288, "Member 'UUmg_shopCartSlot_C::Index_Umg_shopCartSlot_C' has a wrong offset!");

}

