#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_langs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_langs.umg_langs_C
// 0x0088 (0x02E8 - 0x0260)
class UUmg_langs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_exit;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_302;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_slots;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUmg_langSlot_C*>                Slots;                                             // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUmg_settings_C*                        Settings;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FText>              Langs_0;                                           // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_umg_langs(int32 EntryPoint);
	void Resume();
	void Construct();
	void BndEvt__button_exit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetIndex(int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_langs_C">();
	}
	static class UUmg_langs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_langs_C>();
	}
};
static_assert(alignof(UUmg_langs_C) == 0x000008, "Wrong alignment on UUmg_langs_C");
static_assert(sizeof(UUmg_langs_C) == 0x0002E8, "Wrong size on UUmg_langs_C");
static_assert(offsetof(UUmg_langs_C, UberGraphFrame) == 0x000260, "Member 'UUmg_langs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_langs_C, button_exit) == 0x000268, "Member 'UUmg_langs_C::button_exit' has a wrong offset!");
static_assert(offsetof(UUmg_langs_C, Image_302) == 0x000270, "Member 'UUmg_langs_C::Image_302' has a wrong offset!");
static_assert(offsetof(UUmg_langs_C, VerticalBox_slots) == 0x000278, "Member 'UUmg_langs_C::VerticalBox_slots' has a wrong offset!");
static_assert(offsetof(UUmg_langs_C, Slots) == 0x000280, "Member 'UUmg_langs_C::Slots' has a wrong offset!");
static_assert(offsetof(UUmg_langs_C, Settings) == 0x000290, "Member 'UUmg_langs_C::Settings' has a wrong offset!");
static_assert(offsetof(UUmg_langs_C, Langs_0) == 0x000298, "Member 'UUmg_langs_C::Langs_0' has a wrong offset!");

}

