#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_resetSave

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_resetSave.umg_resetSave_C
// 0x00A8 (0x0308 - 0x0260)
class UUmg_resetSave_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_back;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_day_minus;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_day_plus;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_okay;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_cleanbase;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_days;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_garb;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_grime;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_lvls;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_objs;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_player;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_points;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_prints;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_veh;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_106;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_days;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_days_1;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_top;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_saveSlot_C*                        SaveSlot;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartDay_res;                                      // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDay;                                            // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_resetSave(int32 EntryPoint);
	void SetIndex(int32 Param_Index);
	void BndEvt__button_okay_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_back_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_day_minus_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__button_day_plus_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Resume();
	void Upd();
	void UpdTxt();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_resetSave_C">();
	}
	static class UUmg_resetSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_resetSave_C>();
	}
};
static_assert(alignof(UUmg_resetSave_C) == 0x000008, "Wrong alignment on UUmg_resetSave_C");
static_assert(sizeof(UUmg_resetSave_C) == 0x000308, "Wrong size on UUmg_resetSave_C");
static_assert(offsetof(UUmg_resetSave_C, UberGraphFrame) == 0x000260, "Member 'UUmg_resetSave_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, button_back) == 0x000268, "Member 'UUmg_resetSave_C::button_back' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, button_day_minus) == 0x000270, "Member 'UUmg_resetSave_C::button_day_minus' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, button_day_plus) == 0x000278, "Member 'UUmg_resetSave_C::button_day_plus' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, button_okay) == 0x000280, "Member 'UUmg_resetSave_C::button_okay' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_cleanbase) == 0x000288, "Member 'UUmg_resetSave_C::Checkbox_cleanbase' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_days) == 0x000290, "Member 'UUmg_resetSave_C::Checkbox_days' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_garb) == 0x000298, "Member 'UUmg_resetSave_C::Checkbox_garb' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_grime) == 0x0002A0, "Member 'UUmg_resetSave_C::Checkbox_grime' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_lvls) == 0x0002A8, "Member 'UUmg_resetSave_C::Checkbox_lvls' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_objs) == 0x0002B0, "Member 'UUmg_resetSave_C::Checkbox_objs' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_player) == 0x0002B8, "Member 'UUmg_resetSave_C::Checkbox_player' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_points) == 0x0002C0, "Member 'UUmg_resetSave_C::Checkbox_points' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_prints) == 0x0002C8, "Member 'UUmg_resetSave_C::Checkbox_prints' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Checkbox_veh) == 0x0002D0, "Member 'UUmg_resetSave_C::Checkbox_veh' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Image_106) == 0x0002D8, "Member 'UUmg_resetSave_C::Image_106' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Txt_days) == 0x0002E0, "Member 'UUmg_resetSave_C::Txt_days' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Txt_days_1) == 0x0002E8, "Member 'UUmg_resetSave_C::Txt_days_1' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, Txt_top) == 0x0002F0, "Member 'UUmg_resetSave_C::Txt_top' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, SaveSlot) == 0x0002F8, "Member 'UUmg_resetSave_C::SaveSlot' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, StartDay_res) == 0x000300, "Member 'UUmg_resetSave_C::StartDay_res' has a wrong offset!");
static_assert(offsetof(UUmg_resetSave_C, MaxDay) == 0x000304, "Member 'UUmg_resetSave_C::MaxDay' has a wrong offset!");

}

