#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_printer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_printer.umg_printer_C
// 0x00B8 (0x0318 - 0x0260)
class UUmg_printer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                button_config;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                button_config_1;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_print;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_printCheat;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_refresh;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_list;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_coll;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_name;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_norm;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_pbr;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_secs;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_tex;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_verts;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ActiveName;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UUmg_printerSlot_C*>             Slots;                                             // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AThreedPrinterAnim_C*                   Printer;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PathToActiveModel;                                 // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentName;                                       // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_printer(int32 EntryPoint);
	void BndEvt__umg_printer_button_config_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_printer_button_config_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_printer_Button_printCheat_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void Open();
	void BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_Button_refresh_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Quit();
	void BndEvt__umg_printer_Button_print_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void Gen();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Info(const TArray<struct FVector>& TotalVerts);
	void NameToFilter(const class FString& Param_Name, ETextureFilter* Filter);
	void NameToMaterial(const class FString& Param_Name, uint8* Mat);
	void PrepareCfg(class FString* Cfg);
	void GatherConfig(const struct FStruct_multisectionCustomMesh& Struct_multisectionCustomMesh);
	void CreateConfig(bool SkipCheck);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_printer_C">();
	}
	static class UUmg_printer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_printer_C>();
	}
};
static_assert(alignof(UUmg_printer_C) == 0x000008, "Wrong alignment on UUmg_printer_C");
static_assert(sizeof(UUmg_printer_C) == 0x000318, "Wrong size on UUmg_printer_C");
static_assert(offsetof(UUmg_printer_C, UberGraphFrame) == 0x000260, "Member 'UUmg_printer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, button_config) == 0x000268, "Member 'UUmg_printer_C::button_config' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, button_config_1) == 0x000270, "Member 'UUmg_printer_C::button_config_1' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Button_print) == 0x000278, "Member 'UUmg_printer_C::Button_print' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Button_printCheat) == 0x000280, "Member 'UUmg_printer_C::Button_printCheat' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Button_refresh) == 0x000288, "Member 'UUmg_printer_C::Button_refresh' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, ScrollBox_list) == 0x000290, "Member 'UUmg_printer_C::ScrollBox_list' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_coll) == 0x000298, "Member 'UUmg_printer_C::Txt_coll' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_name) == 0x0002A0, "Member 'UUmg_printer_C::Txt_name' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_norm) == 0x0002A8, "Member 'UUmg_printer_C::Txt_norm' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_pbr) == 0x0002B0, "Member 'UUmg_printer_C::Txt_pbr' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_secs) == 0x0002B8, "Member 'UUmg_printer_C::Txt_secs' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_tex) == 0x0002C0, "Member 'UUmg_printer_C::Txt_tex' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_verts) == 0x0002C8, "Member 'UUmg_printer_C::Txt_verts' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, ActiveName) == 0x0002D0, "Member 'UUmg_printer_C::ActiveName' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Slots) == 0x0002E0, "Member 'UUmg_printer_C::Slots' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Printer) == 0x0002F0, "Member 'UUmg_printer_C::Printer' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, PathToActiveModel) == 0x0002F8, "Member 'UUmg_printer_C::PathToActiveModel' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, CurrentName) == 0x000308, "Member 'UUmg_printer_C::CurrentName' has a wrong offset!");

}

