#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_invaders

#include "Basic.hpp"


namespace SDK::Params
{

// Function umg_invaders.umg_invaders_C.upd
// 0x0048 (0x0048 - 0x0000)
struct Umg_invaders_C_Upd final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0030(0x0018)()
};
static_assert(alignof(Umg_invaders_C_Upd) == 0x000008, "Wrong alignment on Umg_invaders_C_Upd");
static_assert(sizeof(Umg_invaders_C_Upd) == 0x000048, "Wrong size on Umg_invaders_C_Upd");
static_assert(offsetof(Umg_invaders_C_Upd, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'Umg_invaders_C_Upd::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_invaders_C_Upd, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000018, "Member 'Umg_invaders_C_Upd::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_invaders_C_Upd, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000030, "Member 'Umg_invaders_C_Upd::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");

}

