#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_clipboard

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function umg_clipboard.umg_clipboard_C.ExecuteUbergraph_umg_clipboard
// 0x02D0 (0x02D0 - 0x0000)
struct Umg_clipboard_C_ExecuteUbergraph_umg_clipboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC9[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ECA[0x8];                                     // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_clipboard_paper_C*                CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0150(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ECB[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0170(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0198(0x0018)()
	class FName                                   Temp_name_Variable_1;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01D0(0x0018)()
	class FString                                 CallFunc_proc2_a1;                                 // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_procSats_ReturnValue;                     // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0208(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0230(0x0018)()
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_setActiveInterface_return;                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_setActiveInterface_return_1;              // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ECC[0xE];                                     // 0x0252(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0260(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AProp_nametag_C*                        CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_3;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_setActiveInterface_return_2;              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isBuoyant__buoyant_;                      // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard) == 0x000010, "Wrong alignment on Umg_clipboard_C_ExecuteUbergraph_umg_clipboard");
static_assert(sizeof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard) == 0x0002D0, "Wrong size on Umg_clipboard_C_ExecuteUbergraph_umg_clipboard");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, EntryPoint) == 0x000000, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, Temp_name_Variable) == 0x000004, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, Temp_int_Variable) == 0x00000C, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, Temp_int_Variable_1) == 0x000010, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, Temp_int_Variable_2) == 0x000014, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000020, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetComponentBounds_Origin) == 0x000030, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetComponentBounds_BoxExtent) == 0x00003C, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetComponentBounds_SphereRadius) == 0x000048, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0000A0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetComponentBounds_Origin_1) == 0x0000A8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetComponentBounds_BoxExtent_1) == 0x0000B4, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetComponentBounds_SphereRadius_1) == 0x0000C0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C4, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_MakeTransform_ReturnValue_1) == 0x0000D0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000100, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000108, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, K2Node_CreateDelegate_OutputDelegate) == 0x000110, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Array_Get_Item) == 0x000120, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_getMainPlayer_AsMain_Player) == 0x000130, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, K2Node_MakeArray_Array) == 0x000138, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000148, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, K2Node_ComponentBoundEvent_Text) == 0x000150, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, K2Node_ComponentBoundEvent_CommitMethod) == 0x000168, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_MakeLiteralText_ReturnValue) == 0x000170, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Conv_TextToString_ReturnValue) == 0x000188, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetText_ReturnValue) == 0x000198, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, Temp_name_Variable_1) == 0x0001B0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001B8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0001C8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0001D0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_proc2_a1) == 0x0001E8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_proc2_a1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_procSats_ReturnValue) == 0x0001F8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_procSats_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Conv_StringToText_ReturnValue) == 0x000208, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Concat_StrStr_ReturnValue) == 0x000220, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000230, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_getMainPlayer_AsMain_Player_2) == 0x000248, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_setActiveInterface_return) == 0x000250, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_setActiveInterface_return' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_setActiveInterface_return_1) == 0x000251, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_setActiveInterface_return_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_GetTransform_ReturnValue) == 0x000260, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000290, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_Array_Get_Item_1) == 0x000298, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0002A8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, Temp_name_Variable_2) == 0x0002B0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, K2Node_Select_Default) == 0x0002B8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_getMainPlayer_AsMain_Player_3) == 0x0002C0, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_getMainPlayer_AsMain_Player_3' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_setActiveInterface_return_2) == 0x0002C8, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_setActiveInterface_return_2' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ExecuteUbergraph_umg_clipboard, CallFunc_isBuoyant__buoyant_) == 0x0002C9, "Member 'Umg_clipboard_C_ExecuteUbergraph_umg_clipboard::CallFunc_isBuoyant__buoyant_' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'Umg_clipboard_C_BndEvt__MultiLineEditableText_86_K2Node_ComponentBoundEvent_5_OnMultiLineEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.Init
// 0x0038 (0x0038 - 0x0000)
struct Umg_clipboard_C_Init final
{
public:
	class AProp_clipboard_C*                      Param_Clipboard;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ECD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ECE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ECF[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_clipboard_C_Init) == 0x000008, "Wrong alignment on Umg_clipboard_C_Init");
static_assert(sizeof(Umg_clipboard_C_Init) == 0x000038, "Wrong size on Umg_clipboard_C_Init");
static_assert(offsetof(Umg_clipboard_C_Init, Param_Clipboard) == 0x000000, "Member 'Umg_clipboard_C_Init::Param_Clipboard' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, Temp_bool_Variable) == 0x000008, "Member 'Umg_clipboard_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, Temp_object_Variable) == 0x000010, "Member 'Umg_clipboard_C_Init::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, Temp_object_Variable_1) == 0x000018, "Member 'Umg_clipboard_C_Init::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Umg_clipboard_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'Umg_clipboard_C_Init::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'Umg_clipboard_C_Init::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'Umg_clipboard_C_Init::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Init, K2Node_Select_Default) == 0x000030, "Member 'Umg_clipboard_C_Init::K2Node_Select_Default' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.OnKeyDown
// 0x0200 (0x0200 - 0x0000)
struct Umg_clipboard_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0140(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_clipboard_C_OnKeyDown) == 0x000008, "Wrong alignment on Umg_clipboard_C_OnKeyDown");
static_assert(sizeof(Umg_clipboard_C_OnKeyDown) == 0x000200, "Wrong size on Umg_clipboard_C_OnKeyDown");
static_assert(offsetof(Umg_clipboard_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'Umg_clipboard_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'Umg_clipboard_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'Umg_clipboard_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'Umg_clipboard_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_OnKeyDown, K2Node_MakeStruct_EventReply) == 0x000140, "Member 'Umg_clipboard_C_OnKeyDown::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0001F8, "Member 'Umg_clipboard_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.clampPages
// 0x00A8 (0x00A8 - 0x0000)
struct Umg_clipboard_C_ClampPages final
{
public:
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	bool                                          CallFunc_setActiveInterface_return;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED1[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED2[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
};
static_assert(alignof(Umg_clipboard_C_ClampPages) == 0x000008, "Wrong alignment on Umg_clipboard_C_ClampPages");
static_assert(sizeof(Umg_clipboard_C_ClampPages) == 0x0000A8, "Wrong size on Umg_clipboard_C_ClampPages");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_getMainPlayer_AsMain_Player) == 0x000000, "Member 'Umg_clipboard_C_ClampPages::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000008, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Array_LastIndex_ReturnValue) == 0x00000C, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000028, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_setActiveInterface_return) == 0x000070, "Member 'Umg_clipboard_C_ClampPages::CallFunc_setActiveInterface_return' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Array_LastIndex_ReturnValue_1) == 0x000074, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Clamp_ReturnValue) == 0x000078, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Array_Get_Item) == 0x000080, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampPages, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'Umg_clipboard_C_ClampPages::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.quit
// 0x0038 (0x0038 - 0x0000)
struct Umg_clipboard_C_Quit final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_clipboard_C_Quit) == 0x000008, "Wrong alignment on Umg_clipboard_C_Quit");
static_assert(sizeof(Umg_clipboard_C_Quit) == 0x000038, "Wrong size on Umg_clipboard_C_Quit");
static_assert(offsetof(Umg_clipboard_C_Quit, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'Umg_clipboard_C_Quit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Quit, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'Umg_clipboard_C_Quit::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Quit, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'Umg_clipboard_C_Quit::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Quit, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'Umg_clipboard_C_Quit::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.clampLines
// 0x0040 (0x0040 - 0x0000)
struct Umg_clipboard_C_ClampLines final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NewParam;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         B;                                                 // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         A;                                                 // 0x0030(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(Umg_clipboard_C_ClampLines) == 0x000008, "Wrong alignment on Umg_clipboard_C_ClampLines");
static_assert(sizeof(Umg_clipboard_C_ClampLines) == 0x000040, "Wrong size on Umg_clipboard_C_ClampLines");
static_assert(offsetof(Umg_clipboard_C_ClampLines, SourceString) == 0x000000, "Member 'Umg_clipboard_C_ClampLines::SourceString' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampLines, NewParam) == 0x000010, "Member 'Umg_clipboard_C_ClampLines::NewParam' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampLines, B) == 0x000020, "Member 'Umg_clipboard_C_ClampLines::B' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ClampLines, A) == 0x000030, "Member 'Umg_clipboard_C_ClampLines::A' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.procSats
// 0x0088 (0x0088 - 0x0000)
struct Umg_clipboard_C_ProcSats final
{
public:
	TArray<class FString>                         SourceArray;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 A;                                                 // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED4[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED5[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_clipboard_C_ProcSats) == 0x000008, "Wrong alignment on Umg_clipboard_C_ProcSats");
static_assert(sizeof(Umg_clipboard_C_ProcSats) == 0x000088, "Wrong size on Umg_clipboard_C_ProcSats");
static_assert(offsetof(Umg_clipboard_C_ProcSats, SourceArray) == 0x000000, "Member 'Umg_clipboard_C_ProcSats::SourceArray' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, ReturnValue) == 0x000010, "Member 'Umg_clipboard_C_ProcSats::ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, A) == 0x000020, "Member 'Umg_clipboard_C_ProcSats::A' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, Temp_int_Array_Index_Variable) == 0x000034, "Member 'Umg_clipboard_C_ProcSats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'Umg_clipboard_C_ProcSats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Array_Get_Item) == 0x000040, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000068, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_ProcSats, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000078, "Member 'Umg_clipboard_C_ProcSats::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

// Function umg_clipboard.umg_clipboard_C.proc2
// 0x00B0 (0x00B0 - 0x0000)
struct Umg_clipboard_C_Proc2 final
{
public:
	TArray<class FString>                         InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 A1;                                                // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 A;                                                 // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED6[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED7[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED8[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADish_C*                                CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_clipboard_C_Proc2) == 0x000008, "Wrong alignment on Umg_clipboard_C_Proc2");
static_assert(sizeof(Umg_clipboard_C_Proc2) == 0x0000B0, "Wrong size on Umg_clipboard_C_Proc2");
static_assert(offsetof(Umg_clipboard_C_Proc2, InputPin) == 0x000000, "Member 'Umg_clipboard_C_Proc2::InputPin' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Proc2, A1) == 0x000010, "Member 'Umg_clipboard_C_Proc2::A1' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Proc2, A) == 0x000020, "Member 'Umg_clipboard_C_Proc2::A' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Proc2, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Umg_clipboard_C_Proc2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_clipboard_C_Proc2, Temp_int_Array_Index_Variable) == 0x000034, "Member 'Umg_clipboard_C_Proc2::Temp_int_Array_Index_Variable' has a wrong offset!");
