#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_serverMinigameSlott

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function umg_serverMinigameSlott.umg_serverMinigameSlott_C.ExecuteUbergraph_umg_serverMinigameSlott
// 0x0030 (0x0030 - 0x0000)
struct Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_serverMinigameNumber_C*            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott) == 0x000008, "Wrong alignment on Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott");
static_assert(sizeof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott) == 0x000030, "Wrong size on Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, EntryPoint) == 0x000000, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, CallFunc_Create_ReturnValue) == 0x000008, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, Temp_int_Variable) == 0x000010, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000020, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00002C, "Member 'Umg_serverMinigameSlott_C_ExecuteUbergraph_umg_serverMinigameSlott::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function umg_serverMinigameSlott.umg_serverMinigameSlott_C.SetActive
// 0x0048 (0x0048 - 0x0000)
struct Umg_serverMinigameSlott_C_SetActive final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_serverMinigameSlott_C_SetActive) == 0x000008, "Wrong alignment on Umg_serverMinigameSlott_C_SetActive");
static_assert(sizeof(Umg_serverMinigameSlott_C_SetActive) == 0x000048, "Wrong size on Umg_serverMinigameSlott_C_SetActive");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, Param_Index) == 0x000000, "Member 'Umg_serverMinigameSlott_C_SetActive::Param_Index' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, Temp_bool_Variable) == 0x000004, "Member 'Umg_serverMinigameSlott_C_SetActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, Temp_byte_Variable) == 0x000005, "Member 'Umg_serverMinigameSlott_C_SetActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, Temp_byte_Variable_1) == 0x000006, "Member 'Umg_serverMinigameSlott_C_SetActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000007, "Member 'Umg_serverMinigameSlott_C_SetActive::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, CallFunc_SelectColor_ReturnValue) == 0x000008, "Member 'Umg_serverMinigameSlott_C_SetActive::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'Umg_serverMinigameSlott_C_SetActive::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_SetActive, K2Node_Select_Default) == 0x000040, "Member 'Umg_serverMinigameSlott_C_SetActive::K2Node_Select_Default' has a wrong offset!");

// Function umg_serverMinigameSlott.umg_serverMinigameSlott_C.makeProb
// 0x0150 (0x0150 - 0x0000)
struct Umg_serverMinigameSlott_C_MakeProb final
{
public:
	int32                                         Output_Get;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_3;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_4;                         // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_2;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_5;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_3;           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_2;       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
};
static_assert(alignof(Umg_serverMinigameSlott_C_MakeProb) == 0x000008, "Wrong alignment on Umg_serverMinigameSlott_C_MakeProb");
static_assert(sizeof(Umg_serverMinigameSlott_C_MakeProb) == 0x000150, "Wrong size on Umg_serverMinigameSlott_C_MakeProb");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, Output_Get) == 0x000000, "Member 'Umg_serverMinigameSlott_C_MakeProb::Output_Get' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Array_Get_Item) == 0x000020, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Array_Get_Item_2) == 0x000040, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_StringToInt_ReturnValue) == 0x000050, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_IntToBool_ReturnValue) == 0x000054, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Array_Get_Item_3) == 0x000058, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_SelectString_ReturnValue) == 0x000068, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000078, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000090, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000098, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Array_Get_Item_4) == 0x0000A8, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_StringToInt_ReturnValue_2) == 0x0000D0, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_StringToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Array_Get_Item_5) == 0x0000D8, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000E8, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_StringToInt_ReturnValue_3) == 0x0000EC, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_StringToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_IntToString_ReturnValue) == 0x0000F0, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Subtract_IntInt_ReturnValue) == 0x000100, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Add_IntInt_ReturnValue) == 0x000104, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000108, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_SelectInt_ReturnValue) == 0x00010C, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000110, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Abs_Int_ReturnValue) == 0x000120, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_RandomIntegerInRange_ReturnValue_2) == 0x000124, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_RandomIntegerInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Percent_IntInt_ReturnValue) == 0x000128, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000130, "Member 'Umg_serverMinigameSlott_C_MakeProb::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_serverMinigameSlott_C_MakeProb, K2Node_MakeArray_Array) == 0x000140, "Member 'Umg_serverMinigameSlott_C_MakeProb::K2Node_MakeArray_Array' has a wrong offset!");

}

