#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_badSun

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function umg_badSun.umg_badSun_C.ExecuteUbergraph_umg_badSun
// 0x06A0 (0x06A0 - 0x0000)
struct Umg_badSun_C_ExecuteUbergraph_umg_badSun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD8[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD9[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DDA[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DDB[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameover_C*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	class FName                                   Temp_name_Variable;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DDC[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DDD[0x6];                                     // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DDE[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x01B0(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DDF[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE0[0x1];                                     // 0x02D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE1[0x3];                                     // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue_1;   // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE2[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0328(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0338(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE3[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE4[0x2];                                     // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE5[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0460(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_bloodGib_C*                       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE6[0x3];                                     // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE7[0x2];                                     // 0x04DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x04E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE8[0x4];                                     // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0504(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0520(0x0018)(ConstParm)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE9[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DEA[0x7];                                     // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_5;        // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DEB[0x7];                                     // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_6;        // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DEC[0x2];                                     // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DED[0x3];                                     // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_2;       // 0x057C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_2;  // 0x0604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DEE[0x3];                                     // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_7;        // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DEF[0x2];                                     // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x061C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0640(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DF0[0x4];                                     // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0695(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0696(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_badSun_C_ExecuteUbergraph_umg_badSun) == 0x000010, "Wrong alignment on Umg_badSun_C_ExecuteUbergraph_umg_badSun");
static_assert(sizeof(Umg_badSun_C_ExecuteUbergraph_umg_badSun) == 0x0006A0, "Wrong size on Umg_badSun_C_ExecuteUbergraph_umg_badSun");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, EntryPoint) == 0x000000, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LinearColorLerp_ReturnValue) == 0x000004, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable) == 0x000018, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable) == 0x000028, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_bool_Variable) == 0x000060, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_1) == 0x000070, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable_1) == 0x000088, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable) == 0x000098, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_2) == 0x0000A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Event_MyGeometry) == 0x0000A4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Event_InDeltaTime) == 0x0000DC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0000F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000100, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000108, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_1) == 0x000114, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetActorForwardVector_ReturnValue) == 0x00011C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000128, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000134, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue) == 0x000140, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00014C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x000158, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000160, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue) == 0x000161, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainPlayer_AsMain_Player) == 0x000168, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000170, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000180, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000188, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000194, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_2) == 0x0001A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_obj_static_obj) == 0x0001B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x0001C0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0001C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000250, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BooleanOR_ReturnValue) == 0x000251, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit) == 0x000252, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap) == 0x000253, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time) == 0x000254, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance) == 0x000258, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location) == 0x00025C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint) == 0x000268, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal) == 0x000274, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactNormal) == 0x000280, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_PhysMat) == 0x000290, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitActor) == 0x000298, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitComponent) == 0x0002A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitBoneName) == 0x0002A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitItem) == 0x0002B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ElementIndex) == 0x0002B4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_FaceIndex) == 0x0002B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceStart) == 0x0002BC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceEnd) == 0x0002C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002D4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002D5, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BooleanOR_ReturnValue_1) == 0x0002D6, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getSaveSlot_saveSlot) == 0x0002D8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainPlayer_AsMain_Player_1) == 0x0002E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0002E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0002F4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomPointInBoundingBox_ReturnValue_1) == 0x0002F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomPointInBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000304, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000310, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000318, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomFloatInRange_ReturnValue) == 0x000320, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_object_Variable_2) == 0x000328, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_OutHit_1) == 0x000338, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_OutHit_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LineTraceSingleForObjects_ReturnValue_1) == 0x0003C0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LineTraceSingleForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003C4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0003C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0003C9, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Time_1) == 0x0003CC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Distance_1) == 0x0003D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Location_1) == 0x0003D4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0003E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_Normal_1) == 0x0003EC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0003F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_PhysMat_1) == 0x000408, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitActor_1) == 0x000410, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitComponent_1) == 0x000418, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitBoneName_1) == 0x000420, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_HitItem_1) == 0x000428, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_ElementIndex_1) == 0x00042C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_FaceIndex_1) == 0x000430, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceStart_1) == 0x000434, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BreakHitResult_TraceEnd_1) == 0x000440, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00044C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomRotator_ReturnValue) == 0x000450, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00045C, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_MakeTransform_ReturnValue_1) == 0x000460, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000490, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000498, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Lerp_ReturnValue) == 0x0004A0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0004A4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_name_Variable_3) == 0x0004A8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0004B0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0004B4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x0004B8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0004C0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, Temp_int_Variable_3) == 0x0004C4, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0004C8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_FClamp_ReturnValue) == 0x0004CC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, K2Node_Select_Default) == 0x0004D0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Array_Contains_ReturnValue) == 0x0004D8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_Not_PreBool_ReturnValue_2) == 0x0004D9, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0004DA, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BooleanAND_ReturnValue) == 0x0004DB, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_BooleanAND_ReturnValue_1) == 0x0004DC, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x0004DD, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerController_ReturnValue_1) == 0x0004E0, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetControlRotation_ReturnValue) == 0x0004E8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_badSun_C_ExecuteUbergraph_umg_badSun, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x0004F8, "Member 'Umg_badSun_C_ExecuteUbergraph_umg_badSun::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
