#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_propInv

#include "Basic.hpp"

#include "Struct_propDynamic_structs.hpp"
#include "Engine_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_equipmentWear_structs.hpp"
#include "UMG_structs.hpp"
#include "Struct_mString_structs.hpp"
#include "InputCore_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Struct_mObject_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_equipment_structs.hpp"


namespace SDK::Params
{

// Function umg_propInv.umg_propInv_C.ExecuteUbergraph_umg_propInv
// 0x0740 (0x0740 - 0x0000)
struct Umg_propInv_C_ExecuteUbergraph_umg_propInv final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31B3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_3;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_start;                                // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_arm_end;                                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B5[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_4;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_2;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_checkEquip_empty;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31B6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_equipment                      CallFunc_checkEquip_Output;                        // 0x0090(0x00F0)(HasGetValueTypeHash)
	class USaveSlot_C*                            CallFunc_getSaveSlot_saveSlot;                     // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B7[0x8];                                     // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_equipment                      CallFunc_Array_Get_Item;                           // 0x0190(0x00F0)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B8[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_5;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_6;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0298(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x02A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31B9[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31BA[0x4];                                     // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePositionScaledByDPI_LocationX;    // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePositionScaledByDPI_LocationY;    // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMousePositionScaledByDPI_ReturnValue;  // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31BB[0x7];                                     // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x03E8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0424(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31BC[0x3];                                     // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_7;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_8;        // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31BD[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_9;        // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31BE[0xC];                                     // 0x0464(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0470(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31BF[0x7];                                     // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_batts_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          CallFunc_getMainPlayer_AsMain_Player_3;            // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_putObjectInventory2_return;               // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C0[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_equipmentSlot_C*                   CallFunc_Create_ReturnValue;                       // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C1[0x3];                                     // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C2[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_10;       // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_3;                  // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C3[0x2];                                     // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObject_OutputPin;                      // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_4;                  // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C4[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1;                   // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C5[0x3];                                     // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C6[0x8];                                     // 0x0528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data;                             // 0x0530(0x00C0)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObject_OutputPin_1;                    // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IInt_save1_C>          K2Node_DynamicCast_AsInt_Save_1_1;                 // 0x05F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C7[0x7];                                     // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_save                           CallFunc_getData_data_1;                           // 0x0610(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_addEquip_return;                          // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C8[0x7];                                     // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_addEquip_rebug;                           // 0x06D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddEquipment_return;                      // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_5;                  // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31C9[0x1];                                     // 0x06EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObject_OutputPin_2;                    // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_6;                  // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CA[0x3];                                     // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_getObject_OutputPin_3;                    // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_7;                  // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CB[0x3];                                     // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_getInd_ReturnValue;                       // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_4;                  // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31CC[0x4];                                     // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_getObject_OutputPin_4;                    // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_addObject_return;                         // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CD[0x7];                                     // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_addObject_err;                            // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_propInv_C_ExecuteUbergraph_umg_propInv) == 0x000010, "Wrong alignment on Umg_propInv_C_ExecuteUbergraph_umg_propInv");
static_assert(sizeof(Umg_propInv_C_ExecuteUbergraph_umg_propInv) == 0x000740, "Wrong size on Umg_propInv_C_ExecuteUbergraph_umg_propInv");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, EntryPoint) == 0x000000, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000008, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000010, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000018, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, Temp_int_Array_Index_Variable) == 0x000020, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Divide_IntInt_ReturnValue) == 0x000024, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_3) == 0x000030, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_3' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000038, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainPlayer_AsMain_Player) == 0x000040, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainPlayer_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_arm_start) == 0x000054, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_arm_start' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_arm_end) == 0x000060, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_arm_end' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainPlayer_AsMain_Player_1) == 0x000070, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainPlayer_AsMain_Player_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_4) == 0x000078, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_4' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainPlayer_AsMain_Player_2) == 0x000080, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainPlayer_AsMain_Player_2' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_checkEquip_empty) == 0x000088, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_checkEquip_empty' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_checkEquip_Output) == 0x000090, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_checkEquip_Output' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getSaveSlot_saveSlot) == 0x000180, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getSaveSlot_saveSlot' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Array_Get_Item) == 0x000190, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Array_Length_ReturnValue) == 0x000280, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_5) == 0x000288, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_5' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_6) == 0x000290, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_6' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, Temp_object_Variable) == 0x000298, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0002A8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000330, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue) == 0x000331, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_bBlockingHit) == 0x000332, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_bInitialOverlap) == 0x000333, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_Time) == 0x000334, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_Distance) == 0x000338, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_Location) == 0x00033C, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_ImpactPoint) == 0x000348, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_Normal) == 0x000354, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_ImpactNormal) == 0x000360, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_PhysMat) == 0x000370, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_HitActor) == 0x000378, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_HitComponent) == 0x000380, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_HitBoneName) == 0x000388, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_HitItem) == 0x000390, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_ElementIndex) == 0x000394, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_FaceIndex) == 0x000398, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_TraceStart) == 0x00039C, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BreakHitResult_TraceEnd) == 0x0003A8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetPlayerController_ReturnValue) == 0x0003B8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetDesiredSize_ReturnValue) == 0x0003C0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetMousePositionScaledByDPI_LocationX) == 0x0003C8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetMousePositionScaledByDPI_LocationX' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetMousePositionScaledByDPI_LocationY) == 0x0003CC, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetMousePositionScaledByDPI_LocationY' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetMousePositionScaledByDPI_ReturnValue) == 0x0003D0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetMousePositionScaledByDPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0003D8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_MakeVector2D_ReturnValue) == 0x0003E0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, K2Node_Event_MyGeometry) == 0x0003E8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, K2Node_Event_InDeltaTime) == 0x000420, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000424, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_1) == 0x00042C, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_7) == 0x000430, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_7' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_8) == 0x000438, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_8' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_2) == 0x000440, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_9) == 0x000448, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_9' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000450, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000458, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_MakeTransform_ReturnValue) == 0x000470, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsValidClass_ReturnValue) == 0x0004A0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0004A8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_FinishSpawningActor_ReturnValue) == 0x0004B0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainPlayer_AsMain_Player_3) == 0x0004B8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainPlayer_AsMain_Player_3' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_putObjectInventory2_return) == 0x0004C0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_putObjectInventory2_return' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Create_ReturnValue) == 0x0004C8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, Temp_int_Loop_Counter_Variable) == 0x0004D0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Less_IntInt_ReturnValue) == 0x0004D4, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Add_IntInt_ReturnValue) == 0x0004D8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Array_Add_ReturnValue) == 0x0004DC, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_AddChildToGrid_ReturnValue) == 0x0004E0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_Not_PreBool_ReturnValue) == 0x0004E8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getMainGamemode_AsMain_Gamemode_10) == 0x0004F0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getMainGamemode_AsMain_Gamemode_10' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0004F8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_3) == 0x0004F9, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SelectInt_ReturnValue) == 0x0004FC, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getObject_OutputPin) == 0x000500, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getObject_OutputPin' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_4) == 0x000508, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, K2Node_DynamicCast_AsInt_Save_1) == 0x000510, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::K2Node_DynamicCast_AsInt_Save_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, K2Node_DynamicCast_bSuccess) == 0x000520, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SelectInt_ReturnValue_1) == 0x000524, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getData_data) == 0x000530, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getData_data' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getObject_OutputPin_1) == 0x0005F0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getObject_OutputPin_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, K2Node_DynamicCast_AsInt_Save_1_1) == 0x0005F8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::K2Node_DynamicCast_AsInt_Save_1_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, K2Node_DynamicCast_bSuccess_1) == 0x000608, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getData_data_1) == 0x000610, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getData_data_1' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_addEquip_return) == 0x0006D0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_addEquip_return' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_addEquip_rebug) == 0x0006D8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_addEquip_rebug' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_AddEquipment_return) == 0x0006E8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_AddEquipment_return' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsValid_ReturnValue) == 0x0006E9, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_5) == 0x0006EA, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SelectInt_ReturnValue_2) == 0x0006EC, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getObject_OutputPin_2) == 0x0006F0, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getObject_OutputPin_2' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_6) == 0x0006F8, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SelectInt_ReturnValue_3) == 0x0006FC, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getObject_OutputPin_3) == 0x000700, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getObject_OutputPin_3' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_IsVisible_ReturnValue_7) == 0x000708, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_IsVisible_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getInd_ReturnValue) == 0x00070C, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getInd_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_SelectInt_ReturnValue_4) == 0x000710, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_SelectInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_getObject_OutputPin_4) == 0x000718, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_getObject_OutputPin_4' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_addObject_return) == 0x000720, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_addObject_return' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_ExecuteUbergraph_umg_propInv, CallFunc_addObject_err) == 0x000728, "Member 'Umg_propInv_C_ExecuteUbergraph_umg_propInv::CallFunc_addObject_err' has a wrong offset!");

// Function umg_propInv.umg_propInv_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_propInv_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_propInv_C_Tick) == 0x000004, "Wrong alignment on Umg_propInv_C_Tick");
static_assert(sizeof(Umg_propInv_C_Tick) == 0x00003C, "Wrong size on Umg_propInv_C_Tick");
static_assert(offsetof(Umg_propInv_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_propInv_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_propInv_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_propInv_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_propInv.umg_propInv_C.gen_player
// 0x0418 (0x0418 - 0x0000)
struct Umg_propInv_C_Gen_player final
{
public:
	class AProp_container_C*                      Enter;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Double;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31CE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_save>                   Copy;                                              // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         I;                                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31CF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_propInvSlor_C*                     CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_container_player_C*               K2Node_DynamicCast_AsProp_Container_Player;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D0[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D1[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D2[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_getName_name;                             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_getName_tag;                              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_getName_oName;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_getName_name_1;                           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_getName_tag_1;                            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_getName_oName_1;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D3[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_2;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D4[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D5[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_propInvInvSlot_C*                  CallFunc_Create_ReturnValue_1;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_3;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D6[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_4;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_propInvSlor_C*                     CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D7[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D8[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_propInvSlor_C*                     CallFunc_Array_Get_Item_1;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
