#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_laptop

#include "Basic.hpp"

#include "Enum_shopCats_structs.hpp"
#include "Struct_save_structs.hpp"
#include "Struct_storeOrder_structs.hpp"
#include "Struct_store_structs.hpp"
#include "Struct_prop_structs.hpp"
#include "Struct_email_structs.hpp"
#include "UMG_structs.hpp"
#include "Struct_signalDataDynamic_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Struct_achievement_structs.hpp"
#include "Struct_signal_data2_structs.hpp"
#include "Struct_settings_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function umg_laptop.umg_laptop_C.ExecuteUbergraph_umg_laptop
// 0x04A8 (0x04A8 - 0x0000)
struct Umg_laptop_C_ExecuteUbergraph_umg_laptop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3135[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        K2Node_Event_gamemode;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_settings                       K2Node_Event_settings;                             // 0x0010(0x00CC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3136[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_key;                                  // 0x00E0(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3137[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_color;                                // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3138[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USoundWave*                       K2Node_CustomEvent_PlayingSoundWave;               // 0x0110(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PlaybackPercent;                // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3139[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313A[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0138(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313B[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313C[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_313D[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_storeOrder                     K2Node_MakeStruct_struct_storeOrder;               // 0x0168(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0180(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313E[0x2];                                     // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_313F[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_3;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_4;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3140[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01F0(0x0018)()
	class UUmg_shopSubcategoryButton_C*           CallFunc_Create_ReturnValue;                       // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3141[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3142[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3143[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3144[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_store                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0250(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3145[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_store                          K2Node_SetFieldsInStruct_StructOut;                // 0x02A0(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3146[0x2];                                     // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0308(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3147[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_shopSlot_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3148[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3149[0x6];                                     // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314A[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314B[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_2;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_314C[0x3];                                     // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_314D[0x2];                                     // 0x03A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x03A8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_314E[0x3];                                     // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_314F[0x3];                                     // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3150[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_5;                   // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_6;                   // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3151[0x2];                                     // 0x0436(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USoundWave* PlayingSoundWave, float PlaybackPercent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0438(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3152[0x2];                                     // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3153[0x3];                                     // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3154[0x3];                                     // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0468(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0474(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3155[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_shopSlot_C*                        CallFunc_Array_Get_Item_1;                         // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUmg_shopSubcategoryButton_C*           CallFunc_Array_Get_Item_2;                         // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3156[0x2];                                     // 0x04A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_ExecuteUbergraph_umg_laptop) == 0x000008, "Wrong alignment on Umg_laptop_C_ExecuteUbergraph_umg_laptop");
static_assert(sizeof(Umg_laptop_C_ExecuteUbergraph_umg_laptop) == 0x0004A8, "Wrong size on Umg_laptop_C_ExecuteUbergraph_umg_laptop");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, EntryPoint) == 0x000000, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_gamemode) == 0x000008, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_gamemode' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_settings) == 0x000010, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_settings' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_key) == 0x0000E0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_pressed) == 0x0000F8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_color) == 0x0000FC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_color' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_CustomEvent_PlayingSoundWave) == 0x000110, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_CustomEvent_PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_CustomEvent_PlaybackPercent) == 0x000118, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_CustomEvent_PlaybackPercent' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000120, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000128, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000138, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00014C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000150, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Multiply_IntInt_ReturnValue) == 0x000158, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00015C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_RandomFloatInRange_ReturnValue) == 0x000160, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_MakeStruct_struct_storeOrder) == 0x000168, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_MakeStruct_struct_storeOrder' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetText_ReturnValue) == 0x000180, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Add_IntInt_ReturnValue) == 0x000198, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, Temp_int_Loop_Counter_Variable) == 0x00019C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_1) == 0x0001A0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Less_IntInt_ReturnValue) == 0x0001A1, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0001A8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_ComponentBoundEvent_Value_2) == 0x0001B0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_ComponentBoundEvent_Value_1) == 0x0001B4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_2) == 0x0001B8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue) == 0x0001BC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue_1) == 0x0001C0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue_2) == 0x0001C4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue_3) == 0x0001C8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_ComponentBoundEvent_Value) == 0x0001CC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue_4) == 0x0001D0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Lerp_ReturnValue) == 0x0001D8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Round_ReturnValue) == 0x0001DC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_LeftChop_ReturnValue) == 0x0001E0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Conv_StringToText_ReturnValue) == 0x0001F0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Create_ReturnValue) == 0x000208, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000210, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_3) == 0x000218, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000220, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Not_PreBool_ReturnValue) == 0x000228, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_getMainGameInstance_AsGame_Inst) == 0x000230, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000238, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, Temp_int_Array_Index_Variable) == 0x00023C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Get_Item) == 0x000240, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_4) == 0x000248, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetDataTableRowFromName_OutRow) == 0x000250, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000298, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_SetFieldsInStruct_StructOut) == 0x0002A0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Conv_TextToString_ReturnValue) == 0x0002E8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Contains_ReturnValue) == 0x0002F8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_5) == 0x0002F9, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, Temp_int_Variable) == 0x0002FC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Len_ReturnValue) == 0x000300, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000304, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Select_Default) == 0x000308, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000320, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_6) == 0x000330, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Create_ReturnValue_1) == 0x000338, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_7) == 0x000340, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_AddChild_ReturnValue) == 0x000348, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Not_PreBool_ReturnValue_1) == 0x000350, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_8) == 0x000351, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000358, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Add_ReturnValue) == 0x000360, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000368, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000370, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00037C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Vector_Distance_ReturnValue) == 0x000388, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_getMainGamemode_AsMain_Gamemode_2) == 0x000390, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_getMainGamemode_AsMain_Gamemode_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Less_FloatFloat_ReturnValue) == 0x000398, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, Temp_int_Variable_1) == 0x00039C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Add_IntInt_ReturnValue_2) == 0x0003A0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Not_PreBool_ReturnValue_2) == 0x0003A4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_9) == 0x0003A5, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_MyGeometry) == 0x0003A8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_Event_InDeltaTime) == 0x0003E0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003E4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_10) == 0x0003E8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0003EC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Not_PreBool_ReturnValue_3) == 0x0003F0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, Temp_int_Variable_2) == 0x0003F4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_11) == 0x0003F8, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue_5) == 0x0003FC, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_GetValue_ReturnValue_6) == 0x000400, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_GetValue_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000404, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000408, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00040C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_MakeVector_ReturnValue) == 0x000410, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_RotateAngleAxis_ReturnValue) == 0x00041C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_SelectVector_ReturnValue) == 0x000428, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_BooleanOR_ReturnValue) == 0x000434, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_12) == 0x000435, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_CreateDelegate_OutputDelegate) == 0x000438, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_IsValid_ReturnValue_13) == 0x000448, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Not_PreBool_ReturnValue_4) == 0x000449, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, Temp_int_Variable_3) == 0x00044C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Add_IntInt_ReturnValue_3) == 0x000450, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Contains_ReturnValue_1) == 0x000454, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Add_ReturnValue_1) == 0x000458, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_BooleanAND_ReturnValue) == 0x00045C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_AddChild_ReturnValue_1) == 0x000460, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_MakeStruct_SlateChildSize) == 0x000468, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Add_ReturnValue_2) == 0x000470, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, K2Node_MakeStruct_Margin) == 0x000474, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Get_Item_1) == 0x000488, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Get_Item_2) == 0x000490, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Length_ReturnValue_1) == 0x000498, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Length_ReturnValue_2) == 0x00049C, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Less_IntInt_ReturnValue_1) == 0x0004A0, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Less_IntInt_ReturnValue_2) == 0x0004A1, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_ExecuteUbergraph_umg_laptop, CallFunc_Array_Add_ReturnValue_3) == 0x0004A4, "Member 'Umg_laptop_C_ExecuteUbergraph_umg_laptop::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.Tick
// 0x003C (0x003C - 0x0000)
struct Umg_laptop_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_Tick) == 0x000004, "Wrong alignment on Umg_laptop_C_Tick");
static_assert(sizeof(Umg_laptop_C_Tick) == 0x00003C, "Wrong size on Umg_laptop_C_Tick");
static_assert(offsetof(Umg_laptop_C_Tick, MyGeometry) == 0x000000, "Member 'Umg_laptop_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_Tick, InDeltaTime) == 0x000038, "Member 'Umg_laptop_C_Tick::InDeltaTime' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'Umg_laptop_C_BndEvt__Slider_camZ_K2Node_ComponentBoundEvent_15_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'Umg_laptop_C_BndEvt__Slider_camX_K2Node_ComponentBoundEvent_14_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'Umg_laptop_C_BndEvt__Slider_camY_K2Node_ComponentBoundEvent_13_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.perc
// 0x0010 (0x0010 - 0x0000)
struct Umg_laptop_C_Perc final
{
public:
	const class USoundWave*                       PlayingSoundWave;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackPercent;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_Perc) == 0x000008, "Wrong alignment on Umg_laptop_C_Perc");
static_assert(sizeof(Umg_laptop_C_Perc) == 0x000010, "Wrong size on Umg_laptop_C_Perc");
static_assert(offsetof(Umg_laptop_C_Perc, PlayingSoundWave) == 0x000000, "Member 'Umg_laptop_C_Perc::PlayingSoundWave' has a wrong offset!");
static_assert(offsetof(Umg_laptop_C_Perc, PlaybackPercent) == 0x000008, "Member 'Umg_laptop_C_Perc::PlaybackPercent' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.applyColor
// 0x0010 (0x0010 - 0x0000)
struct Umg_laptop_C_ApplyColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Umg_laptop_C_ApplyColor) == 0x000004, "Wrong alignment on Umg_laptop_C_ApplyColor");
static_assert(sizeof(Umg_laptop_C_ApplyColor) == 0x000010, "Wrong size on Umg_laptop_C_ApplyColor");
static_assert(offsetof(Umg_laptop_C_ApplyColor, Color) == 0x000000, "Member 'Umg_laptop_C_ApplyColor::Color' has a wrong offset!");

// Function umg_laptop.umg_laptop_C.AnyKey
// 0x0020 (0x0020 - 0x0000)
struct Umg_laptop_C_AnyKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Umg_laptop_C_AnyKey) == 0x000008, "Wrong alignment on Umg_laptop_C_AnyKey");
static_assert(sizeof(Umg_laptop_C_AnyKey) == 0x000020, "Wrong size on Umg_laptop_C_AnyKey");
static_assert(offsetof(Umg_laptop_C_AnyKey, Key) == 0x000000, "Member 'Umg_laptop_C_AnyKey::Key' has a wrong offset!");
