#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_printer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_printer.umg_printer_C
// 0x00F0 (0x0350 - 0x0260)
class UUmg_printer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_print;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_printCheat;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_refresh;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        Combobox_filterNorm;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        Combobox_filterPbr;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        Combobox_filterTex;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        Combobox_physmat;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_list;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_coll;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_name;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_norm;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_pbr;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_tex;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_verts;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ActiveName;                                        // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UUmg_printerSlot_C*>             Slots;                                             // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AThreedPrinterAnim_C*                   Printer;                                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_printer(int32 EntryPoint);
	void BndEvt__umg_printer_Button_printCheat_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__umg_printer_combobox_physmat_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_combobox_filterTex_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_combobox_filterPbr_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_combobox_filterNorm_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__umg_printer_Button_print_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void Quit();
	void BndEvt__umg_printer_Button_refresh_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Open();
	void Gen();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Info();
	void NameToFilter(const class FString& Param_Name, ETextureFilter* Filter);
	void NameToMaterial(const class FString& Param_Name, uint8* Mat);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_printer_C">();
	}
	static class UUmg_printer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_printer_C>();
	}
};
static_assert(alignof(UUmg_printer_C) == 0x000008, "Wrong alignment on UUmg_printer_C");
static_assert(sizeof(UUmg_printer_C) == 0x000350, "Wrong size on UUmg_printer_C");
static_assert(offsetof(UUmg_printer_C, UberGraphFrame) == 0x000260, "Member 'UUmg_printer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Button_print) == 0x000268, "Member 'UUmg_printer_C::Button_print' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Button_printCheat) == 0x000270, "Member 'UUmg_printer_C::Button_printCheat' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Button_refresh) == 0x000278, "Member 'UUmg_printer_C::Button_refresh' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Combobox_filterNorm) == 0x000280, "Member 'UUmg_printer_C::Combobox_filterNorm' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Combobox_filterPbr) == 0x000288, "Member 'UUmg_printer_C::Combobox_filterPbr' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Combobox_filterTex) == 0x000290, "Member 'UUmg_printer_C::Combobox_filterTex' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Combobox_physmat) == 0x000298, "Member 'UUmg_printer_C::Combobox_physmat' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image) == 0x0002A0, "Member 'UUmg_printer_C::Image' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_1) == 0x0002A8, "Member 'UUmg_printer_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_2) == 0x0002B0, "Member 'UUmg_printer_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_3) == 0x0002B8, "Member 'UUmg_printer_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_4) == 0x0002C0, "Member 'UUmg_printer_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_5) == 0x0002C8, "Member 'UUmg_printer_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_6) == 0x0002D0, "Member 'UUmg_printer_C::Image_6' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_7) == 0x0002D8, "Member 'UUmg_printer_C::Image_7' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_8) == 0x0002E0, "Member 'UUmg_printer_C::Image_8' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Image_93) == 0x0002E8, "Member 'UUmg_printer_C::Image_93' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, ScrollBox_list) == 0x0002F0, "Member 'UUmg_printer_C::ScrollBox_list' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_coll) == 0x0002F8, "Member 'UUmg_printer_C::Txt_coll' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_name) == 0x000300, "Member 'UUmg_printer_C::Txt_name' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_norm) == 0x000308, "Member 'UUmg_printer_C::Txt_norm' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_pbr) == 0x000310, "Member 'UUmg_printer_C::Txt_pbr' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_tex) == 0x000318, "Member 'UUmg_printer_C::Txt_tex' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Txt_verts) == 0x000320, "Member 'UUmg_printer_C::Txt_verts' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, ActiveName) == 0x000328, "Member 'UUmg_printer_C::ActiveName' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Slots) == 0x000338, "Member 'UUmg_printer_C::Slots' has a wrong offset!");
static_assert(offsetof(UUmg_printer_C, Printer) == 0x000348, "Member 'UUmg_printer_C::Printer' has a wrong offset!");

}

