#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_statsGlossSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_statsGlossSlot.umg_statsGlossSlot_C
// 0x0040 (0x02A0 - 0x0260)
class UUmg_statsGlossSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_139;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_40;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_num;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_text;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_Umg_statsGlossSlot_C;                         // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUmg_stats_C*                           Owner;                                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Lvl;                                               // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_Umg_statsGlossSlot_C;                        // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_umg_statsGlossSlot(int32 EntryPoint);
	void BndEvt__umg_statsGlossSlot_Button_139_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_statsGlossSlot_C">();
	}
	static class UUmg_statsGlossSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_statsGlossSlot_C>();
	}
};
static_assert(alignof(UUmg_statsGlossSlot_C) == 0x000008, "Wrong alignment on UUmg_statsGlossSlot_C");
static_assert(sizeof(UUmg_statsGlossSlot_C) == 0x0002A0, "Wrong size on UUmg_statsGlossSlot_C");
static_assert(offsetof(UUmg_statsGlossSlot_C, UberGraphFrame) == 0x000260, "Member 'UUmg_statsGlossSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Button_139) == 0x000268, "Member 'UUmg_statsGlossSlot_C::Button_139' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Image_40) == 0x000270, "Member 'UUmg_statsGlossSlot_C::Image_40' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Txt_num) == 0x000278, "Member 'UUmg_statsGlossSlot_C::Txt_num' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Txt_text) == 0x000280, "Member 'UUmg_statsGlossSlot_C::Txt_text' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Name_Umg_statsGlossSlot_C) == 0x000288, "Member 'UUmg_statsGlossSlot_C::Name_Umg_statsGlossSlot_C' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Owner) == 0x000290, "Member 'UUmg_statsGlossSlot_C::Owner' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Lvl) == 0x000298, "Member 'UUmg_statsGlossSlot_C::Lvl' has a wrong offset!");
static_assert(offsetof(UUmg_statsGlossSlot_C, Index_Umg_statsGlossSlot_C) == 0x00029C, "Member 'UUmg_statsGlossSlot_C::Index_Umg_statsGlossSlot_C' has a wrong offset!");

}

