#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_gameoverScreen

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass umg_gameoverScreen.umg_gameoverScreen_C
// 0x0030 (0x0290 - 0x0260)
class UUmg_gameoverScreen_C final : public UUserWidget
{
public:
	class UImage*                                 Cov;                                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_32;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_105;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_136;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_text;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_41;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"umg_gameoverScreen_C">();
	}
	static class UUmg_gameoverScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUmg_gameoverScreen_C>();
	}
};
static_assert(alignof(UUmg_gameoverScreen_C) == 0x000008, "Wrong alignment on UUmg_gameoverScreen_C");
static_assert(sizeof(UUmg_gameoverScreen_C) == 0x000290, "Wrong size on UUmg_gameoverScreen_C");
static_assert(offsetof(UUmg_gameoverScreen_C, Cov) == 0x000260, "Member 'UUmg_gameoverScreen_C::Cov' has a wrong offset!");
static_assert(offsetof(UUmg_gameoverScreen_C, Image_32) == 0x000268, "Member 'UUmg_gameoverScreen_C::Image_32' has a wrong offset!");
static_assert(offsetof(UUmg_gameoverScreen_C, Image_105) == 0x000270, "Member 'UUmg_gameoverScreen_C::Image_105' has a wrong offset!");
static_assert(offsetof(UUmg_gameoverScreen_C, RetainerBox_136) == 0x000278, "Member 'UUmg_gameoverScreen_C::RetainerBox_136' has a wrong offset!");
static_assert(offsetof(UUmg_gameoverScreen_C, Txt_text) == 0x000280, "Member 'UUmg_gameoverScreen_C::Txt_text' has a wrong offset!");
static_assert(offsetof(UUmg_gameoverScreen_C, WidgetSwitcher_41) == 0x000288, "Member 'UUmg_gameoverScreen_C::WidgetSwitcher_41' has a wrong offset!");

}

