#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Umg_statsGlossSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function umg_statsGlossSlot.umg_statsGlossSlot_C.ExecuteUbergraph_umg_statsGlossSlot
// 0x0138 (0x0138 - 0x0000)
struct Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0018)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0110(0x0028)()
};
static_assert(alignof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot) == 0x000008, "Wrong alignment on Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot");
static_assert(sizeof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot) == 0x000138, "Wrong size on Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, EntryPoint) == 0x000000, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, Temp_int_Variable) == 0x000004, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, Temp_struct_Variable) == 0x000020, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, Temp_struct_Variable_1) == 0x000050, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, Temp_struct_Variable_2) == 0x000078, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, Temp_struct_Variable_3) == 0x000088, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Conv_NameToString_ReturnValue) == 0x000098, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B8, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C8, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D8, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E8, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, K2Node_Select_Default) == 0x000100, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot, K2Node_MakeStruct_SlateColor) == 0x000110, "Member 'Umg_statsGlossSlot_C_ExecuteUbergraph_umg_statsGlossSlot::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

