#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UndergroundGarbageSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function undergroundGarbageSpawner.undergroundGarbageSpawner_C.ExecuteUbergraph_undergroundGarbageSpawner
// 0x0240 (0x0240 - 0x0000)
struct UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0008(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class ALandscape*                             CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_weightedRandomV2_index;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_LowEntry_LocalVariable_Value__Object;       // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x01E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirthole_item_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner) == 0x000010, "Wrong alignment on UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner");
static_assert(sizeof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner) == 0x000240, "Wrong size on UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, EntryPoint) == 0x000000, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_obj_static_obj) == 0x000008, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, Temp_object_Variable) == 0x000040, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_weightedRandomV2_index) == 0x000058, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_weightedRandomV2_index' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_Array_Get_Item) == 0x00005C, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakVector2D_X) == 0x000064, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakVector2D_Y) == 0x000068, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00006C, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_RotateAngleAxis_ReturnValue) == 0x000084, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x000090, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_Add_VectorVector_ReturnValue) == 0x00009C, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_SelectVector_ReturnValue) == 0x0000A8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, K2Node_LowEntry_LocalVariable_Value__Object) == 0x0000B4, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::K2Node_LowEntry_LocalVariable_Value__Object' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C0, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000CC, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000D8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000160, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_bBlockingHit) == 0x000161, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_bInitialOverlap) == 0x000162, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_Location) == 0x00016C, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_Normal) == 0x000184, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_PhysMat) == 0x0001A0, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_HitActor) == 0x0001A8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_HitComponent) == 0x0001B0, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_HitBoneName) == 0x0001B8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_HitItem) == 0x0001C0, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_ElementIndex) == 0x0001C4, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_FaceIndex) == 0x0001C8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_TraceStart) == 0x0001CC, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001E4, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001E5, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BooleanOR_ReturnValue) == 0x0001E6, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0001E7, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x0001E8, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x0001E9, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_MakeTransform_ReturnValue) == 0x0001F0, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BooleanOR_ReturnValue_1) == 0x000220, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000228, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BooleanOR_ReturnValue_2) == 0x000230, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BooleanOR_ReturnValue_3) == 0x000231, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_BooleanAND_ReturnValue) == 0x000232, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000238, "Member 'UndergroundGarbageSpawner_C_ExecuteUbergraph_undergroundGarbageSpawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function undergroundGarbageSpawner.undergroundGarbageSpawner_C.UserConstructionScript
// 0x0090 (0x0090 - 0x0000)
struct UndergroundGarbageSpawner_C_UserConstructionScript final
{
public:
	TArray<float>                                 Vs;                                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Ks;                                                // 0x0010(0x0010)(Edit, BlueprintVisible)
	float                                         Sum;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0070(0x0010)(ReferenceParm)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x0080(0x0010)(ReferenceParm)
};
static_assert(alignof(UndergroundGarbageSpawner_C_UserConstructionScript) == 0x000008, "Wrong alignment on UndergroundGarbageSpawner_C_UserConstructionScript");
static_assert(sizeof(UndergroundGarbageSpawner_C_UserConstructionScript) == 0x000090, "Wrong size on UndergroundGarbageSpawner_C_UserConstructionScript");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Vs) == 0x000000, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Vs' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Ks) == 0x000010, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Ks' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Sum) == 0x000020, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Sum' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000044, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x00004C, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000054, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000058, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Round_ReturnValue) == 0x000060, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00006C, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Map_Keys_Keys) == 0x000070, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_UserConstructionScript, CallFunc_Map_Values_Values) == 0x000080, "Member 'UndergroundGarbageSpawner_C_UserConstructionScript::CallFunc_Map_Values_Values' has a wrong offset!");

// Function undergroundGarbageSpawner.undergroundGarbageSpawner_C.prepareItems
// 0x00E8 (0x00E8 - 0x0000)
struct UndergroundGarbageSpawner_C_PrepareItems final
{
public:
	struct FVector                                Loc;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Ws;                                                // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Ns;                                                // 0x0020(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, float>                      buff;                                              // 0x0030(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00A0(0x0010)(ReferenceParm)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AburiedItemsArea_C*                     CallFunc_findBuriedArea_Array_Element;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_Map_Values_Values_1;                      // 0x00C8(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys_1;                          // 0x00D8(0x0010)(ReferenceParm)
};
static_assert(alignof(UndergroundGarbageSpawner_C_PrepareItems) == 0x000008, "Wrong alignment on UndergroundGarbageSpawner_C_PrepareItems");
static_assert(sizeof(UndergroundGarbageSpawner_C_PrepareItems) == 0x0000E8, "Wrong size on UndergroundGarbageSpawner_C_PrepareItems");
static_assert(offsetof(UndergroundGarbageSpawner_C_PrepareItems, Loc) == 0x000000, "Member 'UndergroundGarbageSpawner_C_PrepareItems::Loc' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_PrepareItems, Ws) == 0x000010, "Member 'UndergroundGarbageSpawner_C_PrepareItems::Ws' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_PrepareItems, Ns) == 0x000020, "Member 'UndergroundGarbageSpawner_C_PrepareItems::Ns' has a wrong offset!");
static_assert(offsetof(UndergroundGarbageSpawner_C_PrepareItems, buff) == 0x000030, "Member 'UndergroundGarbageSpawner_C_PrepareItems::buff' has a wrong offset!");
