#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Untitled_1

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function untitled_1.untitled_1_C.InpActEvt_demosnow_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0");
static_assert(sizeof(Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0");
static_assert(offsetof(Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'Untitled_1_C_InpActEvt_demosnow_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function untitled_1.untitled_1_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Untitled_1_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Untitled_1_C_ReceiveTick) == 0x000004, "Wrong alignment on Untitled_1_C_ReceiveTick");
static_assert(sizeof(Untitled_1_C_ReceiveTick) == 0x000004, "Wrong size on Untitled_1_C_ReceiveTick");
static_assert(offsetof(Untitled_1_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Untitled_1_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function untitled_1.untitled_1_C.ExecuteUbergraph_untitled_1
// 0x01A0 (0x01A0 - 0x0000)
struct Untitled_1_C_ExecuteUbergraph_untitled_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0018(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_main_C*                           CallFunc_getMainSave_save_main;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class NewBlueprint2_0::ANewBlueprint2_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANewBlueprint18_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALandscape*                             CallFunc_GetActorOfClass_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0120(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWaterVolume_C*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0150(0x0010)(ReferenceParm)
	class AWaterVolume_C*                         CallFunc_Array_Get_Item_1;                         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       K2Node_MakeStruct_BoxSphereBounds;                 // 0x0184(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Untitled_1_C_ExecuteUbergraph_untitled_1) == 0x000010, "Wrong alignment on Untitled_1_C_ExecuteUbergraph_untitled_1");
static_assert(sizeof(Untitled_1_C_ExecuteUbergraph_untitled_1) == 0x0001A0, "Wrong size on Untitled_1_C_ExecuteUbergraph_untitled_1");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, EntryPoint) == 0x000000, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, Temp_int_Variable) == 0x000004, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, Temp_int_Variable_1) == 0x000008, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, K2Node_InputActionEvent_Key) == 0x000018, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_getMainSave_save_main) == 0x000038, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_getMainSave_save_main' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000040, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000048, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_GetPlayerPawn_ReturnValue) == 0x000080, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000088, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_BreakVector_X) == 0x00009C, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_BreakVector_Z) == 0x0000A4, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_MakeTransform_ReturnValue_1) == 0x0000C0, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_getMainGameInstance_AsGame_Inst) == 0x0000F0, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_getMainGameInstance_AsGame_Inst' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000F8, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000108, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_GetActorOfClass_ReturnValue) == 0x000110, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000118, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000120, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Array_Get_Item) == 0x000130, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Not_PreBool_ReturnValue_1) == 0x000139, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00013C, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Not_PreBool_ReturnValue_2) == 0x000140, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_GetAllActorsOfClass_OutActors) == 0x000150, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Array_Length_ReturnValue_1) == 0x000168, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_Less_IntInt_ReturnValue_1) == 0x00016C, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000170, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000178, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Untitled_1_C_ExecuteUbergraph_untitled_1, K2Node_MakeStruct_BoxSphereBounds) == 0x000184, "Member 'Untitled_1_C_ExecuteUbergraph_untitled_1::K2Node_MakeStruct_BoxSphereBounds' has a wrong offset!");

}

