#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VentCrawler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ventCrawler.ventCrawler_C
// 0x0020 (0x04E0 - 0x04C0)
class AVentCrawler_C final : public ACharacter
{
public:
	uint8                                         Pad_1EF8[0x8];                                     // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ventCrawler(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__ventCrawler_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Step();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ventCrawler_C">();
	}
	static class AVentCrawler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVentCrawler_C>();
	}
};
static_assert(alignof(AVentCrawler_C) == 0x000010, "Wrong alignment on AVentCrawler_C");
static_assert(sizeof(AVentCrawler_C) == 0x0004E0, "Wrong size on AVentCrawler_C");
static_assert(offsetof(AVentCrawler_C, UberGraphFrame) == 0x0004C0, "Member 'AVentCrawler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVentCrawler_C, Box) == 0x0004C8, "Member 'AVentCrawler_C::Box' has a wrong offset!");
static_assert(offsetof(AVentCrawler_C, Arrow1) == 0x0004D0, "Member 'AVentCrawler_C::Arrow1' has a wrong offset!");

}

