#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryBPLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VictoryBPLibrary_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function VictoryBPLibrary.VictoryPC.OnVictorySubtitlesQueued
// 0x0018 (0x0018 - 0x0000)
struct VictoryPC_OnVictorySubtitlesQueued final
{
public:
	TArray<struct FVictorySubtitleCue>            VictorySubtitles;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         CueDuration;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D48[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryPC_OnVictorySubtitlesQueued) == 0x000008, "Wrong alignment on VictoryPC_OnVictorySubtitlesQueued");
static_assert(sizeof(VictoryPC_OnVictorySubtitlesQueued) == 0x000018, "Wrong size on VictoryPC_OnVictorySubtitlesQueued");
static_assert(offsetof(VictoryPC_OnVictorySubtitlesQueued, VictorySubtitles) == 0x000000, "Member 'VictoryPC_OnVictorySubtitlesQueued::VictorySubtitles' has a wrong offset!");
static_assert(offsetof(VictoryPC_OnVictorySubtitlesQueued, CueDuration) == 0x000010, "Member 'VictoryPC_OnVictorySubtitlesQueued::CueDuration' has a wrong offset!");

// Function VictoryBPLibrary.VictoryPC.Subtitles_CPPDelegate
// 0x0018 (0x0018 - 0x0000)
struct VictoryPC_Subtitles_CPPDelegate final
{
public:
	TArray<struct FSubtitleCue>                   VictorySubtitles;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         CueDuration;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D49[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VictoryPC_Subtitles_CPPDelegate) == 0x000008, "Wrong alignment on VictoryPC_Subtitles_CPPDelegate");
static_assert(sizeof(VictoryPC_Subtitles_CPPDelegate) == 0x000018, "Wrong size on VictoryPC_Subtitles_CPPDelegate");
static_assert(offsetof(VictoryPC_Subtitles_CPPDelegate, VictorySubtitles) == 0x000000, "Member 'VictoryPC_Subtitles_CPPDelegate::VictorySubtitles' has a wrong offset!");
static_assert(offsetof(VictoryPC_Subtitles_CPPDelegate, CueDuration) == 0x000010, "Member 'VictoryPC_Subtitles_CPPDelegate::CueDuration' has a wrong offset!");

// Function VictoryBPLibrary.VictoryPC.VictoryPC_GetMyIP_DataReceived
// 0x0010 (0x0010 - 0x0000)
struct VictoryPC_VictoryPC_GetMyIP_DataReceived final
{
public:
	class FString                                 YourIP;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryPC_VictoryPC_GetMyIP_DataReceived) == 0x000008, "Wrong alignment on VictoryPC_VictoryPC_GetMyIP_DataReceived");
static_assert(sizeof(VictoryPC_VictoryPC_GetMyIP_DataReceived) == 0x000010, "Wrong size on VictoryPC_VictoryPC_GetMyIP_DataReceived");
static_assert(offsetof(VictoryPC_VictoryPC_GetMyIP_DataReceived, YourIP) == 0x000000, "Member 'VictoryPC_VictoryPC_GetMyIP_DataReceived::YourIP' has a wrong offset!");

// Function VictoryBPLibrary.VictoryPC.VictoryPC_GetMyIP_SendRequest
// 0x0001 (0x0001 - 0x0000)
struct VictoryPC_VictoryPC_GetMyIP_SendRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryPC_VictoryPC_GetMyIP_SendRequest) == 0x000001, "Wrong alignment on VictoryPC_VictoryPC_GetMyIP_SendRequest");
static_assert(sizeof(VictoryPC_VictoryPC_GetMyIP_SendRequest) == 0x000001, "Wrong size on VictoryPC_VictoryPC_GetMyIP_SendRequest");
static_assert(offsetof(VictoryPC_VictoryPC_GetMyIP_SendRequest, ReturnValue) == 0x000000, "Member 'VictoryPC_VictoryPC_GetMyIP_SendRequest::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.VictoryPC.VictoryPlaySpeechSound
// 0x0020 (0x0020 - 0x0000)
struct VictoryPC_VictoryPlaySpeechSound final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4A[0x4];                                      // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VictoryPC_VictoryPlaySpeechSound) == 0x000008, "Wrong alignment on VictoryPC_VictoryPlaySpeechSound");
static_assert(sizeof(VictoryPC_VictoryPlaySpeechSound) == 0x000020, "Wrong size on VictoryPC_VictoryPlaySpeechSound");
static_assert(offsetof(VictoryPC_VictoryPlaySpeechSound, Sound) == 0x000000, "Member 'VictoryPC_VictoryPlaySpeechSound::Sound' has a wrong offset!");
static_assert(offsetof(VictoryPC_VictoryPlaySpeechSound, VolumeMultiplier) == 0x000008, "Member 'VictoryPC_VictoryPlaySpeechSound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(VictoryPC_VictoryPlaySpeechSound, PitchMultiplier) == 0x00000C, "Member 'VictoryPC_VictoryPlaySpeechSound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(VictoryPC_VictoryPlaySpeechSound, StartTime) == 0x000010, "Member 'VictoryPC_VictoryPlaySpeechSound::StartTime' has a wrong offset!");
static_assert(offsetof(VictoryPC_VictoryPlaySpeechSound, ReturnValue) == 0x000018, "Member 'VictoryPC_VictoryPlaySpeechSound::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.AreLineSegmentsCrossing
// 0x0034 (0x0034 - 0x0000)
struct TKMathFunctionLibrary_AreLineSegmentsCrossing final
{
public:
	struct FVector                                PointA1;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PointA2;                                           // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PointB1;                                           // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PointB2;                                           // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4B[0x3];                                      // 0x0031(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_AreLineSegmentsCrossing) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_AreLineSegmentsCrossing");
static_assert(sizeof(TKMathFunctionLibrary_AreLineSegmentsCrossing) == 0x000034, "Wrong size on TKMathFunctionLibrary_AreLineSegmentsCrossing");
static_assert(offsetof(TKMathFunctionLibrary_AreLineSegmentsCrossing, PointA1) == 0x000000, "Member 'TKMathFunctionLibrary_AreLineSegmentsCrossing::PointA1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_AreLineSegmentsCrossing, PointA2) == 0x00000C, "Member 'TKMathFunctionLibrary_AreLineSegmentsCrossing::PointA2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_AreLineSegmentsCrossing, PointB1) == 0x000018, "Member 'TKMathFunctionLibrary_AreLineSegmentsCrossing::PointB1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_AreLineSegmentsCrossing, PointB2) == 0x000024, "Member 'TKMathFunctionLibrary_AreLineSegmentsCrossing::PointB2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_AreLineSegmentsCrossing, ReturnValue) == 0x000030, "Member 'TKMathFunctionLibrary_AreLineSegmentsCrossing::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ClosestPointOnLineSeqment
// 0x0030 (0x0030 - 0x0000)
struct TKMathFunctionLibrary_ClosestPointOnLineSeqment final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineStart;                                         // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineEnd;                                           // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_ClosestPointOnLineSeqment) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_ClosestPointOnLineSeqment");
static_assert(sizeof(TKMathFunctionLibrary_ClosestPointOnLineSeqment) == 0x000030, "Wrong size on TKMathFunctionLibrary_ClosestPointOnLineSeqment");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnLineSeqment, Point) == 0x000000, "Member 'TKMathFunctionLibrary_ClosestPointOnLineSeqment::Point' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnLineSeqment, LineStart) == 0x00000C, "Member 'TKMathFunctionLibrary_ClosestPointOnLineSeqment::LineStart' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnLineSeqment, LineEnd) == 0x000018, "Member 'TKMathFunctionLibrary_ClosestPointOnLineSeqment::LineEnd' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnLineSeqment, ReturnValue) == 0x000024, "Member 'TKMathFunctionLibrary_ClosestPointOnLineSeqment::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ClosestPointOnSphereToLine
// 0x0034 (0x0034 - 0x0000)
struct TKMathFunctionLibrary_ClosestPointOnSphereToLine final
{
public:
	struct FVector                                SphereOrigin;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereRadius;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineOrigin;                                        // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineDir;                                           // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_ClosestPointOnSphereToLine) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_ClosestPointOnSphereToLine");
static_assert(sizeof(TKMathFunctionLibrary_ClosestPointOnSphereToLine) == 0x000034, "Wrong size on TKMathFunctionLibrary_ClosestPointOnSphereToLine");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnSphereToLine, SphereOrigin) == 0x000000, "Member 'TKMathFunctionLibrary_ClosestPointOnSphereToLine::SphereOrigin' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnSphereToLine, SphereRadius) == 0x00000C, "Member 'TKMathFunctionLibrary_ClosestPointOnSphereToLine::SphereRadius' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnSphereToLine, LineOrigin) == 0x000010, "Member 'TKMathFunctionLibrary_ClosestPointOnSphereToLine::LineOrigin' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnSphereToLine, LineDir) == 0x00001C, "Member 'TKMathFunctionLibrary_ClosestPointOnSphereToLine::LineDir' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointOnSphereToLine, ReturnValue) == 0x000028, "Member 'TKMathFunctionLibrary_ClosestPointOnSphereToLine::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ClosestPointsOfLineSegments
// 0x0048 (0x0048 - 0x0000)
struct TKMathFunctionLibrary_ClosestPointsOfLineSegments final
{
public:
	struct FVector                                Line1Start;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Line1End;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Line2Start;                                        // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Line2End;                                          // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint1;                                        // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint2;                                        // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_ClosestPointsOfLineSegments) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_ClosestPointsOfLineSegments");
static_assert(sizeof(TKMathFunctionLibrary_ClosestPointsOfLineSegments) == 0x000048, "Wrong size on TKMathFunctionLibrary_ClosestPointsOfLineSegments");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOfLineSegments, Line1Start) == 0x000000, "Member 'TKMathFunctionLibrary_ClosestPointsOfLineSegments::Line1Start' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOfLineSegments, Line1End) == 0x00000C, "Member 'TKMathFunctionLibrary_ClosestPointsOfLineSegments::Line1End' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOfLineSegments, Line2Start) == 0x000018, "Member 'TKMathFunctionLibrary_ClosestPointsOfLineSegments::Line2Start' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOfLineSegments, Line2End) == 0x000024, "Member 'TKMathFunctionLibrary_ClosestPointsOfLineSegments::Line2End' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOfLineSegments, LinePoint1) == 0x000030, "Member 'TKMathFunctionLibrary_ClosestPointsOfLineSegments::LinePoint1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOfLineSegments, LinePoint2) == 0x00003C, "Member 'TKMathFunctionLibrary_ClosestPointsOfLineSegments::LinePoint2' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ClosestPointsOnTwoLines
// 0x004C (0x004C - 0x0000)
struct TKMathFunctionLibrary_ClosestPointsOnTwoLines final
{
public:
	struct FVector                                ClosestPointLine1;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestPointLine2;                                 // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint1;                                        // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineVec1;                                          // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint2;                                        // 0x0030(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineVec2;                                          // 0x003C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4C[0x3];                                      // 0x0049(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_ClosestPointsOnTwoLines) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_ClosestPointsOnTwoLines");
static_assert(sizeof(TKMathFunctionLibrary_ClosestPointsOnTwoLines) == 0x00004C, "Wrong size on TKMathFunctionLibrary_ClosestPointsOnTwoLines");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, ClosestPointLine1) == 0x000000, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::ClosestPointLine1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, ClosestPointLine2) == 0x00000C, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::ClosestPointLine2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, LinePoint1) == 0x000018, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::LinePoint1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, LineVec1) == 0x000024, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::LineVec1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, LinePoint2) == 0x000030, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::LinePoint2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, LineVec2) == 0x00003C, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::LineVec2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ClosestPointsOnTwoLines, ReturnValue) == 0x000048, "Member 'TKMathFunctionLibrary_ClosestPointsOnTwoLines::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ConvertAnchorToAnchor
// 0x0048 (0x0048 - 0x0000)
struct TKMathFunctionLibrary_ConvertAnchorToAnchor final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnchors                               CurrentAnchor;                                     // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                Offsets;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnchors                               TargetAnchor;                                      // 0x0028(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConvertedOffsets;                                  // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_ConvertAnchorToAnchor) == 0x000008, "Wrong alignment on TKMathFunctionLibrary_ConvertAnchorToAnchor");
static_assert(sizeof(TKMathFunctionLibrary_ConvertAnchorToAnchor) == 0x000048, "Wrong size on TKMathFunctionLibrary_ConvertAnchorToAnchor");
static_assert(offsetof(TKMathFunctionLibrary_ConvertAnchorToAnchor, WorldContextObject) == 0x000000, "Member 'TKMathFunctionLibrary_ConvertAnchorToAnchor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ConvertAnchorToAnchor, CurrentAnchor) == 0x000008, "Member 'TKMathFunctionLibrary_ConvertAnchorToAnchor::CurrentAnchor' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ConvertAnchorToAnchor, Offsets) == 0x000018, "Member 'TKMathFunctionLibrary_ConvertAnchorToAnchor::Offsets' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ConvertAnchorToAnchor, TargetAnchor) == 0x000028, "Member 'TKMathFunctionLibrary_ConvertAnchorToAnchor::TargetAnchor' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ConvertAnchorToAnchor, ConvertedOffsets) == 0x000038, "Member 'TKMathFunctionLibrary_ConvertAnchorToAnchor::ConvertedOffsets' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ConvertPhysicsLinearVelocity
// 0x0014 (0x0014 - 0x0000)
struct TKMathFunctionLibrary_ConvertPhysicsLinearVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpeedUnit                                    SpeedUnit;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4D[0x3];                                      // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_ConvertPhysicsLinearVelocity) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_ConvertPhysicsLinearVelocity");
static_assert(sizeof(TKMathFunctionLibrary_ConvertPhysicsLinearVelocity) == 0x000014, "Wrong size on TKMathFunctionLibrary_ConvertPhysicsLinearVelocity");
static_assert(offsetof(TKMathFunctionLibrary_ConvertPhysicsLinearVelocity, Velocity) == 0x000000, "Member 'TKMathFunctionLibrary_ConvertPhysicsLinearVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ConvertPhysicsLinearVelocity, SpeedUnit) == 0x00000C, "Member 'TKMathFunctionLibrary_ConvertPhysicsLinearVelocity::SpeedUnit' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ConvertPhysicsLinearVelocity, ReturnValue) == 0x000010, "Member 'TKMathFunctionLibrary_ConvertPhysicsLinearVelocity::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.GetConsoleVariableFloat
// 0x0018 (0x0018 - 0x0000)
struct TKMathFunctionLibrary_GetConsoleVariableFloat final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4E[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_GetConsoleVariableFloat) == 0x000008, "Wrong alignment on TKMathFunctionLibrary_GetConsoleVariableFloat");
static_assert(sizeof(TKMathFunctionLibrary_GetConsoleVariableFloat) == 0x000018, "Wrong size on TKMathFunctionLibrary_GetConsoleVariableFloat");
static_assert(offsetof(TKMathFunctionLibrary_GetConsoleVariableFloat, VariableName) == 0x000000, "Member 'TKMathFunctionLibrary_GetConsoleVariableFloat::VariableName' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GetConsoleVariableFloat, ReturnValue) == 0x000010, "Member 'TKMathFunctionLibrary_GetConsoleVariableFloat::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.GetConsoleVariableInt
// 0x0018 (0x0018 - 0x0000)
struct TKMathFunctionLibrary_GetConsoleVariableInt final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4F[0x4];                                      // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_GetConsoleVariableInt) == 0x000008, "Wrong alignment on TKMathFunctionLibrary_GetConsoleVariableInt");
static_assert(sizeof(TKMathFunctionLibrary_GetConsoleVariableInt) == 0x000018, "Wrong size on TKMathFunctionLibrary_GetConsoleVariableInt");
static_assert(offsetof(TKMathFunctionLibrary_GetConsoleVariableInt, VariableName) == 0x000000, "Member 'TKMathFunctionLibrary_GetConsoleVariableInt::VariableName' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GetConsoleVariableInt, ReturnValue) == 0x000010, "Member 'TKMathFunctionLibrary_GetConsoleVariableInt::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.GetVelocityAtPoint
// 0x0030 (0x0030 - 0x0000)
struct TKMathFunctionLibrary_GetVelocityAtPoint final
{
public:
	class UPrimitiveComponent*                    Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDebugInfo;                                     // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D50[0x3];                                      // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D51[0x4];                                      // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_GetVelocityAtPoint) == 0x000008, "Wrong alignment on TKMathFunctionLibrary_GetVelocityAtPoint");
static_assert(sizeof(TKMathFunctionLibrary_GetVelocityAtPoint) == 0x000030, "Wrong size on TKMathFunctionLibrary_GetVelocityAtPoint");
static_assert(offsetof(TKMathFunctionLibrary_GetVelocityAtPoint, Target) == 0x000000, "Member 'TKMathFunctionLibrary_GetVelocityAtPoint::Target' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GetVelocityAtPoint, Point) == 0x000008, "Member 'TKMathFunctionLibrary_GetVelocityAtPoint::Point' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GetVelocityAtPoint, BoneName) == 0x000014, "Member 'TKMathFunctionLibrary_GetVelocityAtPoint::BoneName' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GetVelocityAtPoint, DrawDebugInfo) == 0x00001C, "Member 'TKMathFunctionLibrary_GetVelocityAtPoint::DrawDebugInfo' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GetVelocityAtPoint, ReturnValue) == 0x000020, "Member 'TKMathFunctionLibrary_GetVelocityAtPoint::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.GridSnap
// 0x001C (0x001C - 0x0000)
struct TKMathFunctionLibrary_GridSnap final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Grid;                                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_GridSnap) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_GridSnap");
static_assert(sizeof(TKMathFunctionLibrary_GridSnap) == 0x00001C, "Wrong size on TKMathFunctionLibrary_GridSnap");
static_assert(offsetof(TKMathFunctionLibrary_GridSnap, A) == 0x000000, "Member 'TKMathFunctionLibrary_GridSnap::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GridSnap, Grid) == 0x00000C, "Member 'TKMathFunctionLibrary_GridSnap::Grid' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_GridSnap, ReturnValue) == 0x000010, "Member 'TKMathFunctionLibrary_GridSnap::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.IsEvenNumber
// 0x0008 (0x0008 - 0x0000)
struct TKMathFunctionLibrary_IsEvenNumber final
{
public:
	float                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D52[0x3];                                      // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_IsEvenNumber) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_IsEvenNumber");
static_assert(sizeof(TKMathFunctionLibrary_IsEvenNumber) == 0x000008, "Wrong size on TKMathFunctionLibrary_IsEvenNumber");
static_assert(offsetof(TKMathFunctionLibrary_IsEvenNumber, A) == 0x000000, "Member 'TKMathFunctionLibrary_IsEvenNumber::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsEvenNumber, ReturnValue) == 0x000004, "Member 'TKMathFunctionLibrary_IsEvenNumber::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.IsLineInsideSphere
// 0x0030 (0x0030 - 0x0000)
struct TKMathFunctionLibrary_IsLineInsideSphere final
{
public:
	struct FVector                                LineStart;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineDir;                                           // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineLength;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SphereOrigin;                                      // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SphereRadius;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D53[0x3];                                      // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_IsLineInsideSphere) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_IsLineInsideSphere");
static_assert(sizeof(TKMathFunctionLibrary_IsLineInsideSphere) == 0x000030, "Wrong size on TKMathFunctionLibrary_IsLineInsideSphere");
static_assert(offsetof(TKMathFunctionLibrary_IsLineInsideSphere, LineStart) == 0x000000, "Member 'TKMathFunctionLibrary_IsLineInsideSphere::LineStart' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsLineInsideSphere, LineDir) == 0x00000C, "Member 'TKMathFunctionLibrary_IsLineInsideSphere::LineDir' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsLineInsideSphere, LineLength) == 0x000018, "Member 'TKMathFunctionLibrary_IsLineInsideSphere::LineLength' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsLineInsideSphere, SphereOrigin) == 0x00001C, "Member 'TKMathFunctionLibrary_IsLineInsideSphere::SphereOrigin' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsLineInsideSphere, SphereRadius) == 0x000028, "Member 'TKMathFunctionLibrary_IsLineInsideSphere::SphereRadius' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsLineInsideSphere, ReturnValue) == 0x00002C, "Member 'TKMathFunctionLibrary_IsLineInsideSphere::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.IsMultipleOf
// 0x000C (0x000C - 0x0000)
struct TKMathFunctionLibrary_IsMultipleOf final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Multiple;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D54[0x3];                                      // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_IsMultipleOf) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_IsMultipleOf");
static_assert(sizeof(TKMathFunctionLibrary_IsMultipleOf) == 0x00000C, "Wrong size on TKMathFunctionLibrary_IsMultipleOf");
static_assert(offsetof(TKMathFunctionLibrary_IsMultipleOf, A) == 0x000000, "Member 'TKMathFunctionLibrary_IsMultipleOf::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsMultipleOf, Multiple) == 0x000004, "Member 'TKMathFunctionLibrary_IsMultipleOf::Multiple' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsMultipleOf, ReturnValue) == 0x000008, "Member 'TKMathFunctionLibrary_IsMultipleOf::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.IsPointInsideBox
// 0x0028 (0x0028 - 0x0000)
struct TKMathFunctionLibrary_IsPointInsideBox final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxOrigin;                                         // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D55[0x3];                                      // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_IsPointInsideBox) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_IsPointInsideBox");
static_assert(sizeof(TKMathFunctionLibrary_IsPointInsideBox) == 0x000028, "Wrong size on TKMathFunctionLibrary_IsPointInsideBox");
static_assert(offsetof(TKMathFunctionLibrary_IsPointInsideBox, Point) == 0x000000, "Member 'TKMathFunctionLibrary_IsPointInsideBox::Point' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsPointInsideBox, BoxOrigin) == 0x00000C, "Member 'TKMathFunctionLibrary_IsPointInsideBox::BoxOrigin' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsPointInsideBox, BoxExtent) == 0x000018, "Member 'TKMathFunctionLibrary_IsPointInsideBox::BoxExtent' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsPointInsideBox, ReturnValue) == 0x000024, "Member 'TKMathFunctionLibrary_IsPointInsideBox::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.IsPowerOfTwo
// 0x0008 (0x0008 - 0x0000)
struct TKMathFunctionLibrary_IsPowerOfTwo final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D56[0x3];                                      // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_IsPowerOfTwo) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_IsPowerOfTwo");
static_assert(sizeof(TKMathFunctionLibrary_IsPowerOfTwo) == 0x000008, "Wrong size on TKMathFunctionLibrary_IsPowerOfTwo");
static_assert(offsetof(TKMathFunctionLibrary_IsPowerOfTwo, X) == 0x000000, "Member 'TKMathFunctionLibrary_IsPowerOfTwo::X' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_IsPowerOfTwo, ReturnValue) == 0x000004, "Member 'TKMathFunctionLibrary_IsPowerOfTwo::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.LineExtentBoxIntersection
// 0x0060 (0x0060 - 0x0000)
struct TKMathFunctionLibrary_LineExtentBoxIntersection final
{
public:
	struct FBox                                   InBox;                                             // 0x0000(0x001C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Start;                                             // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0034(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0040(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormal;                                         // 0x004C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitTime;                                           // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x005C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D57[0x3];                                      // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_LineExtentBoxIntersection) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_LineExtentBoxIntersection");
static_assert(sizeof(TKMathFunctionLibrary_LineExtentBoxIntersection) == 0x000060, "Wrong size on TKMathFunctionLibrary_LineExtentBoxIntersection");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, InBox) == 0x000000, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::InBox' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, Start) == 0x00001C, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::Start' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, End) == 0x000028, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::End' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, Extent) == 0x000034, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::Extent' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, HitLocation) == 0x000040, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::HitLocation' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, HitNormal) == 0x00004C, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::HitNormal' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, HitTime) == 0x000058, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::HitTime' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineExtentBoxIntersection, ReturnValue) == 0x00005C, "Member 'TKMathFunctionLibrary_LineExtentBoxIntersection::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.LineToLineIntersection
// 0x0040 (0x0040 - 0x0000)
struct TKMathFunctionLibrary_LineToLineIntersection final
{
public:
	struct FVector                                IntersectionPoint;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint1;                                        // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineDir1;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint2;                                        // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineDir2;                                          // 0x0030(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x003C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D58[0x3];                                      // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TKMathFunctionLibrary_LineToLineIntersection) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_LineToLineIntersection");
static_assert(sizeof(TKMathFunctionLibrary_LineToLineIntersection) == 0x000040, "Wrong size on TKMathFunctionLibrary_LineToLineIntersection");
static_assert(offsetof(TKMathFunctionLibrary_LineToLineIntersection, IntersectionPoint) == 0x000000, "Member 'TKMathFunctionLibrary_LineToLineIntersection::IntersectionPoint' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineToLineIntersection, LinePoint1) == 0x00000C, "Member 'TKMathFunctionLibrary_LineToLineIntersection::LinePoint1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineToLineIntersection, LineDir1) == 0x000018, "Member 'TKMathFunctionLibrary_LineToLineIntersection::LineDir1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineToLineIntersection, LinePoint2) == 0x000024, "Member 'TKMathFunctionLibrary_LineToLineIntersection::LinePoint2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineToLineIntersection, LineDir2) == 0x000030, "Member 'TKMathFunctionLibrary_LineToLineIntersection::LineDir2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_LineToLineIntersection, ReturnValue) == 0x00003C, "Member 'TKMathFunctionLibrary_LineToLineIntersection::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.NegateFloat
// 0x0008 (0x0008 - 0x0000)
struct TKMathFunctionLibrary_NegateFloat final
{
public:
	float                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_NegateFloat) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_NegateFloat");
static_assert(sizeof(TKMathFunctionLibrary_NegateFloat) == 0x000008, "Wrong size on TKMathFunctionLibrary_NegateFloat");
static_assert(offsetof(TKMathFunctionLibrary_NegateFloat, A) == 0x000000, "Member 'TKMathFunctionLibrary_NegateFloat::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_NegateFloat, ReturnValue) == 0x000004, "Member 'TKMathFunctionLibrary_NegateFloat::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.NegateInt
// 0x0008 (0x0008 - 0x0000)
struct TKMathFunctionLibrary_NegateInt final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_NegateInt) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_NegateInt");
static_assert(sizeof(TKMathFunctionLibrary_NegateInt) == 0x000008, "Wrong size on TKMathFunctionLibrary_NegateInt");
static_assert(offsetof(TKMathFunctionLibrary_NegateInt, A) == 0x000000, "Member 'TKMathFunctionLibrary_NegateInt::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_NegateInt, ReturnValue) == 0x000004, "Member 'TKMathFunctionLibrary_NegateInt::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.NegateVector2D
// 0x0010 (0x0010 - 0x0000)
struct TKMathFunctionLibrary_NegateVector2D final
{
public:
	struct FVector2D                              A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_NegateVector2D) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_NegateVector2D");
static_assert(sizeof(TKMathFunctionLibrary_NegateVector2D) == 0x000010, "Wrong size on TKMathFunctionLibrary_NegateVector2D");
static_assert(offsetof(TKMathFunctionLibrary_NegateVector2D, A) == 0x000000, "Member 'TKMathFunctionLibrary_NegateVector2D::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_NegateVector2D, ReturnValue) == 0x000008, "Member 'TKMathFunctionLibrary_NegateVector2D::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.PointOnWhichSideOfLineSegment
// 0x0028 (0x0028 - 0x0000)
struct TKMathFunctionLibrary_PointOnWhichSideOfLineSegment final
{
public:
	struct FVector                                LinePoint1;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinePoint2;                                        // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_PointOnWhichSideOfLineSegment) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_PointOnWhichSideOfLineSegment");
static_assert(sizeof(TKMathFunctionLibrary_PointOnWhichSideOfLineSegment) == 0x000028, "Wrong size on TKMathFunctionLibrary_PointOnWhichSideOfLineSegment");
static_assert(offsetof(TKMathFunctionLibrary_PointOnWhichSideOfLineSegment, LinePoint1) == 0x000000, "Member 'TKMathFunctionLibrary_PointOnWhichSideOfLineSegment::LinePoint1' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_PointOnWhichSideOfLineSegment, LinePoint2) == 0x00000C, "Member 'TKMathFunctionLibrary_PointOnWhichSideOfLineSegment::LinePoint2' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_PointOnWhichSideOfLineSegment, Point) == 0x000018, "Member 'TKMathFunctionLibrary_PointOnWhichSideOfLineSegment::Point' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_PointOnWhichSideOfLineSegment, ReturnValue) == 0x000024, "Member 'TKMathFunctionLibrary_PointOnWhichSideOfLineSegment::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.ProjectPointOnLine
// 0x0030 (0x0030 - 0x0000)
struct TKMathFunctionLibrary_ProjectPointOnLine final
{
public:
	struct FVector                                LineOrigin;                                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LineDirection;                                     // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_ProjectPointOnLine) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_ProjectPointOnLine");
static_assert(sizeof(TKMathFunctionLibrary_ProjectPointOnLine) == 0x000030, "Wrong size on TKMathFunctionLibrary_ProjectPointOnLine");
static_assert(offsetof(TKMathFunctionLibrary_ProjectPointOnLine, LineOrigin) == 0x000000, "Member 'TKMathFunctionLibrary_ProjectPointOnLine::LineOrigin' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ProjectPointOnLine, LineDirection) == 0x00000C, "Member 'TKMathFunctionLibrary_ProjectPointOnLine::LineDirection' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ProjectPointOnLine, Point) == 0x000018, "Member 'TKMathFunctionLibrary_ProjectPointOnLine::Point' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_ProjectPointOnLine, ReturnValue) == 0x000024, "Member 'TKMathFunctionLibrary_ProjectPointOnLine::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.RoundToLowerMultiple
// 0x0010 (0x0010 - 0x0000)
struct TKMathFunctionLibrary_RoundToLowerMultiple final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Multiple;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipSelf;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D59[0x3];                                      // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TKMathFunctionLibrary_RoundToLowerMultiple) == 0x000004, "Wrong alignment on TKMathFunctionLibrary_RoundToLowerMultiple");
static_assert(sizeof(TKMathFunctionLibrary_RoundToLowerMultiple) == 0x000010, "Wrong size on TKMathFunctionLibrary_RoundToLowerMultiple");
static_assert(offsetof(TKMathFunctionLibrary_RoundToLowerMultiple, A) == 0x000000, "Member 'TKMathFunctionLibrary_RoundToLowerMultiple::A' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_RoundToLowerMultiple, Multiple) == 0x000004, "Member 'TKMathFunctionLibrary_RoundToLowerMultiple::Multiple' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_RoundToLowerMultiple, SkipSelf) == 0x000008, "Member 'TKMathFunctionLibrary_RoundToLowerMultiple::SkipSelf' has a wrong offset!");
static_assert(offsetof(TKMathFunctionLibrary_RoundToLowerMultiple, ReturnValue) == 0x00000C, "Member 'TKMathFunctionLibrary_RoundToLowerMultiple::ReturnValue' has a wrong offset!");

// Function VictoryBPLibrary.TKMathFunctionLibrary.RoundToNearestMultiple
// 0x000C (0x000C - 0x0000)
struct TKMathFunctionLibrary_RoundToNearestMultiple final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Multiple;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
