#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WalkingTree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass walkingTree.walkingTree_C
// 0x0030 (0x04F0 - 0x04C0)
class AWalkingTree_C final : public ACharacter
{
public:
	uint8                                         Pad_1E2F[0x8];                                     // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URadarPointComponent_C*                 RadarPoint;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rend;                                              // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_walkingTree(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnLanded(const struct FHitResult& Hit);
	void OnSuccess_FF173AF7418E4709B590F7A441AAF80A(EPathFollowingResult MovementResult);
	void OnFail_FF173AF7418E4709B590F7A441AAF80A(EPathFollowingResult MovementResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"walkingTree_C">();
	}
	static class AWalkingTree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWalkingTree_C>();
	}
};
static_assert(alignof(AWalkingTree_C) == 0x000010, "Wrong alignment on AWalkingTree_C");
static_assert(sizeof(AWalkingTree_C) == 0x0004F0, "Wrong size on AWalkingTree_C");
static_assert(offsetof(AWalkingTree_C, UberGraphFrame) == 0x0004C0, "Member 'AWalkingTree_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWalkingTree_C, RadarPoint) == 0x0004C8, "Member 'AWalkingTree_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(AWalkingTree_C, Rend) == 0x0004D0, "Member 'AWalkingTree_C::Rend' has a wrong offset!");
static_assert(offsetof(AWalkingTree_C, StaticMesh) == 0x0004D8, "Member 'AWalkingTree_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AWalkingTree_C, SpringArm) == 0x0004E0, "Member 'AWalkingTree_C::SpringArm' has a wrong offset!");

}

