#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallclockArrows_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass wallclockArrows_Skeleton_AnimBlueprint.wallclockArrows_Skeleton_AnimBlueprint_C
// 0x03B0 (0x0670 - 0x02C0)
class UWallclockArrows_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0430(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0538(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0558(0x0108)()
	float                                         Hours;                                             // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Minutes;                                           // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_wallclockArrows_Skeleton_AnimBlueprint(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_wallclockArrows_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_E09660A24D08191C6058DD898708E21B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_wallclockArrows_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5B2D034949E4FF76A667708259E04218();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"wallclockArrows_Skeleton_AnimBlueprint_C">();
	}
	static class UWallclockArrows_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWallclockArrows_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UWallclockArrows_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UWallclockArrows_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UWallclockArrows_Skeleton_AnimBlueprint_C) == 0x000670, "Wrong size on UWallclockArrows_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x000430, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000538, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000558, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, Hours) == 0x000660, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::Hours' has a wrong offset!");
static_assert(offsetof(UWallclockArrows_Skeleton_AnimBlueprint_C, Minutes) == 0x000664, "Member 'UWallclockArrows_Skeleton_AnimBlueprint_C::Minutes' has a wrong offset!");

}

