#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaspSwarm

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function waspSwarm.waspSwarm_C.ExecuteUbergraph_waspSwarm
// 0x0340 (0x0340 - 0x0000)
struct WaspSwarm_C_ExecuteUbergraph_waspSwarm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_hasEquipment_return;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21E7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21E8[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_pawn_obj;                             // 0x0098(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00B4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21E9[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21EA[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0148(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21EB[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0168(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0178(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21EC[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21ED[0x2];                                     // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21EE[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue_1;           // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x02D0(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21EF[0x4];                                     // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x02F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F0[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21F1[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F2[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F3[0x3];                                     // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WaspSwarm_C_ExecuteUbergraph_waspSwarm) == 0x000008, "Wrong alignment on WaspSwarm_C_ExecuteUbergraph_waspSwarm");
static_assert(sizeof(WaspSwarm_C_ExecuteUbergraph_waspSwarm) == 0x000340, "Wrong size on WaspSwarm_C_ExecuteUbergraph_waspSwarm");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, EntryPoint) == 0x000000, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::EntryPoint' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_hasEquipment_return) == 0x000004, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_hasEquipment_return' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000024, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_RandomUnitVector_ReturnValue) == 0x000030, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_RandomFloatInRange_ReturnValue) == 0x000048, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_ClampVectorSize_ReturnValue) == 0x00004C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000058, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000064, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00007C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000088, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_obj_pawn_obj) == 0x000098, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_obj_pawn_obj' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000A8, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000B4, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00013C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000140, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_obj_static_obj) == 0x000148, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000158, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, Temp_object_Variable) == 0x000168, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000178, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x000200, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_GetVelocity_ReturnValue) == 0x000204, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_bBlockingHit) == 0x000210, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_bInitialOverlap) == 0x000211, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_Time) == 0x000214, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_Distance) == 0x000218, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_Location) == 0x00021C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_ImpactPoint) == 0x000228, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_Normal) == 0x000234, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_ImpactNormal) == 0x000240, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_PhysMat) == 0x000250, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_HitActor) == 0x000258, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_HitComponent) == 0x000260, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_HitBoneName) == 0x000268, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_HitItem) == 0x000270, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_ElementIndex) == 0x000274, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_FaceIndex) == 0x000278, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_TraceStart) == 0x00027C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BreakHitResult_TraceEnd) == 0x000288, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x000294, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x0002A0, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002AC, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0002B8, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_RandomUnitVector_ReturnValue_1) == 0x0002C4, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_RandomUnitVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, Temp_object_Variable_1) == 0x0002D0, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0002E0, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_SphereOverlapActors_OutActors) == 0x0002F0, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_SphereOverlapActors_ReturnValue) == 0x000300, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Array_Get_Item) == 0x000308, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_GetDistanceTo_ReturnValue) == 0x000310, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, K2Node_DynamicCast_AsMain_Player) == 0x000318, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, K2Node_DynamicCast_bSuccess) == 0x000320, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_FClamp_ReturnValue) == 0x000324, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000328, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00032C, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_BooleanOR_ReturnValue) == 0x000330, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000334, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WaspSwarm_C_ExecuteUbergraph_waspSwarm, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000338, "Member 'WaspSwarm_C_ExecuteUbergraph_waspSwarm::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");

// Function waspSwarm.waspSwarm_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WaspSwarm_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WaspSwarm_C_ReceiveTick) == 0x000004, "Wrong alignment on WaspSwarm_C_ReceiveTick");
static_assert(sizeof(WaspSwarm_C_ReceiveTick) == 0x000004, "Wrong size on WaspSwarm_C_ReceiveTick");
static_assert(offsetof(WaspSwarm_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WaspSwarm_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

