#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterVolume_basementFlooder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WaterVolume_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass waterVolume_basementFlooder.waterVolume_basementFlooder_C
// 0x0038 (0x02F0 - 0x02B8)
class AWaterVolume_basementFlooder_C final : public AWaterVolume_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WaterVolume_basementFlooder_C;      // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_A;                                             // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Loc_B;                                             // 0x02D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MoveTo;                                            // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Dist;                                              // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_waterVolume_basementFlooder(int32 EntryPoint);
	void LoadLevel(float Alpha);
	void StartMoving(bool Param_MoveTo);
	void AddWater(float DeltaTime, float Power);
	void GetLevel(float* Level);
	void SetLevel(float Alpha);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"waterVolume_basementFlooder_C">();
	}
	static class AWaterVolume_basementFlooder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterVolume_basementFlooder_C>();
	}
};
static_assert(alignof(AWaterVolume_basementFlooder_C) == 0x000008, "Wrong alignment on AWaterVolume_basementFlooder_C");
static_assert(sizeof(AWaterVolume_basementFlooder_C) == 0x0002F0, "Wrong size on AWaterVolume_basementFlooder_C");
static_assert(offsetof(AWaterVolume_basementFlooder_C, UberGraphFrame_WaterVolume_basementFlooder_C) == 0x0002B8, "Member 'AWaterVolume_basementFlooder_C::UberGraphFrame_WaterVolume_basementFlooder_C' has a wrong offset!");
static_assert(offsetof(AWaterVolume_basementFlooder_C, Box1) == 0x0002C0, "Member 'AWaterVolume_basementFlooder_C::Box1' has a wrong offset!");
static_assert(offsetof(AWaterVolume_basementFlooder_C, Loc_A) == 0x0002C8, "Member 'AWaterVolume_basementFlooder_C::Loc_A' has a wrong offset!");
static_assert(offsetof(AWaterVolume_basementFlooder_C, Loc_B) == 0x0002D4, "Member 'AWaterVolume_basementFlooder_C::Loc_B' has a wrong offset!");
static_assert(offsetof(AWaterVolume_basementFlooder_C, Height) == 0x0002E0, "Member 'AWaterVolume_basementFlooder_C::Height' has a wrong offset!");
static_assert(offsetof(AWaterVolume_basementFlooder_C, MoveTo) == 0x0002E4, "Member 'AWaterVolume_basementFlooder_C::MoveTo' has a wrong offset!");
static_assert(offsetof(AWaterVolume_basementFlooder_C, Dist) == 0x0002E8, "Member 'AWaterVolume_basementFlooder_C::Dist' has a wrong offset!");

}

