#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wendussy_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass wendussy_Skeleton_AnimBlueprint.wendussy_Skeleton_AnimBlueprint_C
// 0x0A60 (0x0D20 - 0x02C0)
class UWendussy_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2812[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02C8(0x0020)()
	uint8                                         Pad_2813[0x8];                                     // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x02F0(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04A0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x04C0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x0670(0x01B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0820(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x08A0(0x0030)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_1;                            // 0x08D0(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x0A60(0x0190)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0BF0(0x0108)()
	struct FVector                                LookAt;                                            // 0x0CF8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RootLoc;                                           // 0x0D04(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RootRot;                                           // 0x0D10(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         T;                                                 // 0x0D1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_wendussy_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_wendussy_Skeleton_AnimBlueprint_AnimGraphNode_Fabrik_81F3F75544D159F2E09B8D8DF631FC0A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_wendussy_Skeleton_AnimBlueprint_AnimGraphNode_Fabrik_7C180DCE4D6DC25D858BC7943EFF268A();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"wendussy_Skeleton_AnimBlueprint_C">();
	}
	static class UWendussy_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWendussy_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UWendussy_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UWendussy_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UWendussy_Skeleton_AnimBlueprint_C) == 0x000D20, "Wrong size on UWendussy_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0002C8, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_2) == 0x0002F0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004A0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x0004C0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x000670, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000820, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0008A0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_Fabrik_1) == 0x0008D0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_Fabrik_1' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_Fabrik) == 0x000A60, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_Fabrik' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x000BF0, "Member 'UWendussy_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, LookAt) == 0x000CF8, "Member 'UWendussy_Skeleton_AnimBlueprint_C::LookAt' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, RootLoc) == 0x000D04, "Member 'UWendussy_Skeleton_AnimBlueprint_C::RootLoc' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, RootRot) == 0x000D10, "Member 'UWendussy_Skeleton_AnimBlueprint_C::RootRot' has a wrong offset!");
static_assert(offsetof(UWendussy_Skeleton_AnimBlueprint_C, T) == 0x000D1C, "Member 'UWendussy_Skeleton_AnimBlueprint_C::T' has a wrong offset!");

}

