#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wendussy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function wendussy.wendussy_C.ExecuteUbergraph_wendussy
// 0x0730 (0x0730 - 0x0000)
struct Wendussy_C_ExecuteUbergraph_wendussy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBox_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2839[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_static_obj;                           // 0x0030(0x0010)(ReferenceParm)
	class UWendussy_Skeleton_AnimBlueprint_C*     K2Node_DynamicCast_AsWendussy_Skeleton_Anim_Blueprint; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283A[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283B[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_283C[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj;                          // 0x00A0(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283D[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      CallFunc_obj_statDyn_obj_1;                        // 0x00E8(0x0010)(ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0118(0x0010)(ConstParm, ReferenceParm)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_4;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0130(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283E[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283F[0x2];                                     // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2840[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2841[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_5;     // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2842[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_rifle_C*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2843[0x6];                                     // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2844[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2845[0x3];                                     // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2846[0x8];                                     // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0300(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2847[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_C*                                CallFunc_FinishSpawningActor_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2848[0x3];                                     // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x03AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2849[0x1];                                     // 0x03AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284A[0x3];                                     // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284B[0x3];                                     // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_1;        // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x03EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284C[0x1];                                     // 0x03EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInst_C*                            CallFunc_getMainGameInstance_AsGame_Inst;          // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284D[0x2];                                     // 0x03FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0400(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284E[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0418(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_1;       // 0x0428(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_1;  // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_284F[0x1];                                     // 0x04B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x04C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x04D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2850[0x4];                                     // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0500(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2851[0x3];                                     // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0538(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2852[0x2];                                     // 0x05C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x05C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit_2;       // 0x05D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue_2;  // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x065B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0664(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0670(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x067C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2853[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x06D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x06DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x06DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x06DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue_2;        // 0x06E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2854[0xD];                                     // 0x06E3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x06F0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWendigoDreamer_C*                      CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wendussy_C_ExecuteUbergraph_wendussy) == 0x000010, "Wrong alignment on Wendussy_C_ExecuteUbergraph_wendussy");
static_assert(sizeof(Wendussy_C_ExecuteUbergraph_wendussy) == 0x000730, "Wrong size on Wendussy_C_ExecuteUbergraph_wendussy");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, EntryPoint) == 0x000000, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_IsPointInBox_ReturnValue) == 0x000010, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_IsPointInBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, Temp_int_Variable) == 0x000014, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, Temp_name_Variable) == 0x000018, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, Temp_name_Variable_1) == 0x000020, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_obj_static_obj) == 0x000030, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_obj_static_obj' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, K2Node_DynamicCast_AsWendussy_Skeleton_Anim_Blueprint) == 0x000040, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::K2Node_DynamicCast_AsWendussy_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000050, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000068, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000070, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000078, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000084, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000090, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_obj_statDyn_obj) == 0x0000A0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_obj_statDyn_obj' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000B0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakRotator_Roll) == 0x0000BC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakRotator_Pitch) == 0x0000C0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakRotator_Yaw) == 0x0000C4, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MakeRotator_ReturnValue) == 0x0000CC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000D8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000E0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_obj_statDyn_obj_1) == 0x0000E8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_obj_statDyn_obj_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCameraManager_ReturnValue_3) == 0x0000F8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000100, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00010C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, Temp_object_Variable) == 0x000118, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCameraManager_ReturnValue_4) == 0x000128, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCameraManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000130, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001B8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x0001BC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C9, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_Time) == 0x0001CC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_Distance) == 0x0001D0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_Location) == 0x0001D4, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_Normal) == 0x0001EC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_PhysMat) == 0x000208, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_HitActor) == 0x000210, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_HitComponent) == 0x000218, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_HitBoneName) == 0x000220, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_TraceStart) == 0x000234, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakHitResult_TraceEnd) == 0x000240, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x00024C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000258, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Vector_Distance_ReturnValue) == 0x00025C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCameraManager_ReturnValue_5) == 0x000260, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCameraManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x000268, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_9) == 0x000274, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Vector_Distance_ReturnValue_1) == 0x000280, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, K2Node_SwitchEnum_CmpSuccess) == 0x000284, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000288, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00028C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000290, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GetActorOfClass_ReturnValue) == 0x000298, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x0002A0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Not_PreBool_ReturnValue) == 0x0002A9, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x0002B0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002B8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_RandomRotator_ReturnValue) == 0x0002BC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, Temp_int_Variable_1) == 0x0002C8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002CC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, K2Node_Select_Default) == 0x0002D0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BooleanOR_ReturnValue) == 0x0002D9, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0002DA, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BooleanOR_ReturnValue_1) == 0x0002DB, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Add_IntInt_ReturnValue) == 0x0002DC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_K2_GetActorLocation_ReturnValue_10) == 0x0002E0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_K2_GetActorLocation_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Add_VectorVector_ReturnValue) == 0x0002EC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MakeTransform_ReturnValue) == 0x000300, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000330, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000338, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_FinishSpawningActor_ReturnValue) == 0x000340, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MakeVector_ReturnValue) == 0x000348, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_X) == 0x000354, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_Y) == 0x000358, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_Z) == 0x00035C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MakeVector_ReturnValue_1) == 0x000360, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00036C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_RandomFloatInRange_ReturnValue) == 0x000370, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000374, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MakeVector_ReturnValue_2) == 0x000378, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_MakeVector_ReturnValue_3) == 0x000384, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000390, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_X_1) == 0x000394, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_Y_1) == 0x000398, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_Z_1) == 0x00039C, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_X_2) == 0x0003A0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_Y_2) == 0x0003A4, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BreakVector_Z_2) == 0x0003A8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003AC, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0003AD, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BooleanOR_ReturnValue_2) == 0x0003AE, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0003B0, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_BooleanAND_ReturnValue) == 0x0003B4, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_C_ExecuteUbergraph_wendussy, CallFunc_RotateAngleAxis_ReturnValue) == 0x0003B8, "Member 'Wendussy_C_ExecuteUbergraph_wendussy::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
