#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wendussy_dream_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function wendussy_dream_Skeleton_AnimBlueprint.wendussy_dream_Skeleton_AnimBlueprint_C.ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint
// 0x0180 (0x0180 - 0x0000)
struct Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DFF[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E00[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E01[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_1;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_2;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_3;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_4;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue_5;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint) == 0x000010, "Wrong alignment on Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint");
static_assert(sizeof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint) == 0x000180, "Wrong size on Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_MakeTransform_ReturnValue_1) == 0x000040, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000070, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000078, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00008C, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000A0, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_GetVelocity_ReturnValue) == 0x0000A8, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x0000B4, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D0, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_VInterpTo_ReturnValue) == 0x0000D4, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_DegSin_ReturnValue) == 0x0000E4, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000E8, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000EC, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000F0, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000F4, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_DegSin_ReturnValue_1) == 0x0000F8, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_DegSin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000FC, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000100, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000104, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_DegSin_ReturnValue_2) == 0x000108, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_DegSin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00010C, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000110, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000114, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_DegSin_ReturnValue_3) == 0x000124, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_DegSin_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x000128, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x00012C, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000130, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000134, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_9) == 0x000138, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_DegSin_ReturnValue_4) == 0x00013C, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_DegSin_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_DegSin_ReturnValue_5) == 0x000140, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_DegSin_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_10) == 0x000144, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_11) == 0x000148, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x00014C, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000158, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000160, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x00016C, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_ExecuteUbergraph_wendussy_dream_Skeleton_AnimBlueprint::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");

// Function wendussy_dream_Skeleton_AnimBlueprint.wendussy_dream_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function wendussy_dream_Skeleton_AnimBlueprint.wendussy_dream_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Wendussy_dream_Skeleton_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

