#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wisp_p

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_interactionActions_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function wisp_p.wisp_p_C.ExecuteUbergraph_wisp_p
// 0x0970 (0x0970 - 0x0000)
struct Wisp_p_C_ExecuteUbergraph_wisp_p final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUmg_flashbang_C*                       CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_activate;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_static;                               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_frozen;                               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_active;                               // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor_1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_5;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_5;                                // 0x0074(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Event_impact_1;                             // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_skipSetting;                          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_key_1;                                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_12;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_4;                                // 0x0128(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_damage_4;                             // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fuel;                                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_3;                             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hot;                                  // 0x01BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_11;                            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_3;                                // 0x0250(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_10;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_9;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_2;                             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location_1;                           // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_8;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_7;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_6;                             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_wheelDelta;                           // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_5;                             // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Event_mouse;                                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_4;                             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_Event_key;                                  // 0x0338(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_Event_pressed;                              // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_temperature_1;                        // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_temperature;                          // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_speed;                                // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player_3;                             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_2;                                // 0x0368(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 K2Node_Event_name;                                 // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_volume;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_2;                             // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_location;                             // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage_1;                             // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_clean_1;                              // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player_1;                             // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit_1;                                // 0x0430(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHook_C*                                K2Node_Event_hook_1;                               // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_clean;                                // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHook_C*                                K2Node_Event_hook;                                 // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x04F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_PerlinNoise1D_ReturnValue;                // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x05A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AWaterVolume_C*                         K2Node_Event_water_3;                              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_2;                              // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterVolume_C*                         K2Node_Event_water_1;                              // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_damage;                               // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0644(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_actor;                                // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impact;                               // 0x06D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x06F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode;          // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x070D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x070E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x070F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterVolume_C*                         K2Node_Event_water;                                // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_722[0x2];                                      // 0x0722(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0728(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0750(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x075C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0760(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0770(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77D[0x3];                                      // 0x077D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0780(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0808(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoor_C*                                K2Node_DynamicCast_AsDoor;                         // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821[0x3];                                      // 0x0821(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0830(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x083C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83D[0x3];                                      // 0x083D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0840(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0870(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x087C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0898(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A5[0x3];                                      // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x08A8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0930(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93C[0x4];                                      // 0x093C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainPlayer_C*                          K2Node_DynamicCast_AsMain_Player;                  // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainGamemode_C*                        CallFunc_getMainGamemode_AsMain_Gamemode_1;        // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0958(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0964(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wisp_p_C_ExecuteUbergraph_wisp_p) == 0x000008, "Wrong alignment on Wisp_p_C_ExecuteUbergraph_wisp_p");
static_assert(sizeof(Wisp_p_C_ExecuteUbergraph_wisp_p) == 0x000970, "Wrong size on Wisp_p_C_ExecuteUbergraph_wisp_p");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, EntryPoint) == 0x000000, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, Temp_struct_Variable) == 0x000004, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Ease_ReturnValue) == 0x000014, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000018, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Lerp_ReturnValue_1) == 0x000024, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_CustomEvent_MovementResult_1) == 0x000028, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_CustomEvent_MovementResult) == 0x00003C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, Temp_byte_Variable) == 0x000050, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Create_ReturnValue) == 0x000058, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_activate) == 0x000060, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_activate' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_static) == 0x000061, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_static' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_frozen) == 0x000062, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_frozen' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_active) == 0x000063, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_active' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_actor_1) == 0x000068, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_actor_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_damage_5) == 0x000070, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_damage_5' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hit_5) == 0x000074, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hit_5' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_impact_1) == 0x0000FC, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_impact_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_skipSetting) == 0x000108, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_skipSetting' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_key_1) == 0x000110, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_key_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_12) == 0x000120, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_12' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hit_4) == 0x000128, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hit_4' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_damage_4) == 0x0001B0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_damage_4' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_fuel) == 0x0001B4, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_fuel' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_damage_3) == 0x0001B8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_damage_3' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hot) == 0x0001BC, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hot' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_11) == 0x000248, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_11' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hit_3) == 0x000250, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hit_3' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_action) == 0x0002D8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_10) == 0x0002E0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_10' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_9) == 0x0002E8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_9' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_damage_2) == 0x0002F0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_damage_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_location_1) == 0x0002F4, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_location_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_8) == 0x000300, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_8' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_7) == 0x000308, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_7' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_6) == 0x000310, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_6' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_wheelDelta) == 0x000318, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_wheelDelta' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_5) == 0x000320, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_5' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_mouse) == 0x000328, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_mouse' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_4) == 0x000330, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_4' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_key) == 0x000338, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_key' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_pressed) == 0x000350, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_pressed' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_temperature_1) == 0x000354, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_temperature_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_temperature) == 0x000358, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_temperature' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_speed) == 0x00035C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_speed' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_3) == 0x000360, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_3' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hit_2) == 0x000368, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hit_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_name) == 0x0003F0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_name' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_volume) == 0x000400, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_volume' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_2) == 0x000408, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_location) == 0x000410, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_location' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_damage_1) == 0x00041C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_damage_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_clean_1) == 0x000420, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_clean_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player_1) == 0x000428, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hit_1) == 0x000430, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hit_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hook_1) == 0x0004B8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hook_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_clean) == 0x0004C0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_clean' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_player) == 0x0004C8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hook) == 0x0004D0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hook' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_CustomEvent_Condition) == 0x0004D8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_CustomEvent_Condition' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_DeltaSeconds) == 0x0004DC, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0004E0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_VInterpTo_ReturnValue) == 0x0004E4, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0004F0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_PerlinNoise1D_ReturnValue) == 0x000578, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_PerlinNoise1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x00057C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Lerp_ReturnValue_2) == 0x000580, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000584, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Add_FloatFloat_ReturnValue) == 0x000588, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x00058C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_MakeVector_ReturnValue) == 0x000590, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RandomFloatInRange_ReturnValue) == 0x00059C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0005A0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_water_3) == 0x000628, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_water_3' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_water_2) == 0x000630, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_water_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_water_1) == 0x000638, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_water_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_damage) == 0x000640, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_damage' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_hit) == 0x000644, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_actor) == 0x0006D0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_impact) == 0x0006D8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_impact' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_GetPlayerPawn_ReturnValue) == 0x0006E8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0006F0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_getMainGamemode_AsMain_Gamemode) == 0x000700, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_getMainGamemode_AsMain_Gamemode' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000708, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00070C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Not_PreBool_ReturnValue) == 0x00070D, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_BooleanOR_ReturnValue) == 0x00070E, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00070F, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000710, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_Event_water) == 0x000718, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_Event_water' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Not_PreBool_ReturnValue_1) == 0x000720, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_BooleanAND_ReturnValue) == 0x000721, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000724, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_MakeVector_ReturnValue_1) == 0x000728, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000734, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RotateAngleAxis_ReturnValue) == 0x000738, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_MakeVector_ReturnValue_2) == 0x000744, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000750, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x00075C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000760, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000768, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000770, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000778, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x00077C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000780, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Add_VectorVector_ReturnValue) == 0x000808, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_DynamicCast_AsDoor) == 0x000818, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_DynamicCast_AsDoor' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_DynamicCast_bSuccess) == 0x000820, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000824, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_Pawn) == 0x000828, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000830, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x00083C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_SelectVector_ReturnValue) == 0x000840, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000850, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_IsValid_ReturnValue) == 0x000858, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_GetPlayerController_ReturnValue) == 0x000860, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000868, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000870, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00087C, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000888, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OtherActor) == 0x000890, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OtherComp) == 0x000898, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0008A0, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_bFromSweep) == 0x0008A4, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_ComponentBoundEvent_SweepResult) == 0x0008A8, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_FindLookAtRotation_ReturnValue) == 0x000930, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_DynamicCast_AsMain_Player) == 0x000940, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_DynamicCast_AsMain_Player' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, K2Node_DynamicCast_bSuccess_1) == 0x000948, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_getMainGamemode_AsMain_Gamemode_1) == 0x000950, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_getMainGamemode_AsMain_Gamemode_1' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_GetActorForwardVector_ReturnValue) == 0x000958, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_ExecuteUbergraph_wisp_p, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000964, "Member 'Wisp_p_C_ExecuteUbergraph_wisp_p::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function wisp_p.wisp_p_C.BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Wisp_p_C_BndEvt__wisp_p_Sphere1_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
