#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wisp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass wisp.wisp_C
// 0x0060 (0x0520 - 0x04C0)
class AWisp_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComp_radarPoint_C*                     RadarPoint;                                        // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavigationInvokerComponent*            NavigationInvoker;                                 // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Arg;                                               // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Eff_wisp;                                          // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         A_a_0405F1684513B03B00D2F2A73082564A;              // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            A__Direction_0405F1684513B03B00D2F2A73082564A;     // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5[0x3];                                      // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     A;                                                 // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ime;                                               // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disappearing;                                      // 0x0504(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      Obj;                                               // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Landed;                                            // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_wisp(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Dir(bool Condition);
	void ReceiveBeginPlay();
	void OnSuccess_95C7E50A40390A94DFC4A1A7F17F1D14(EPathFollowingResult MovementResult);
	void OnFail_95C7E50A40390A94DFC4A1A7F17F1D14(EPathFollowingResult MovementResult);
	void A__UpdateFunc();
	void A__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"wisp_C">();
	}
	static class AWisp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWisp_C>();
	}
};
static_assert(alignof(AWisp_C) == 0x000010, "Wrong alignment on AWisp_C");
static_assert(sizeof(AWisp_C) == 0x000520, "Wrong size on AWisp_C");
static_assert(offsetof(AWisp_C, UberGraphFrame) == 0x0004C0, "Member 'AWisp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWisp_C, RadarPoint) == 0x0004C8, "Member 'AWisp_C::RadarPoint' has a wrong offset!");
static_assert(offsetof(AWisp_C, NavigationInvoker) == 0x0004D0, "Member 'AWisp_C::NavigationInvoker' has a wrong offset!");
static_assert(offsetof(AWisp_C, Arg) == 0x0004D8, "Member 'AWisp_C::Arg' has a wrong offset!");
static_assert(offsetof(AWisp_C, PointLight) == 0x0004E0, "Member 'AWisp_C::PointLight' has a wrong offset!");
static_assert(offsetof(AWisp_C, Eff_wisp) == 0x0004E8, "Member 'AWisp_C::Eff_wisp' has a wrong offset!");
static_assert(offsetof(AWisp_C, A_a_0405F1684513B03B00D2F2A73082564A) == 0x0004F0, "Member 'AWisp_C::A_a_0405F1684513B03B00D2F2A73082564A' has a wrong offset!");
static_assert(offsetof(AWisp_C, A__Direction_0405F1684513B03B00D2F2A73082564A) == 0x0004F4, "Member 'AWisp_C::A__Direction_0405F1684513B03B00D2F2A73082564A' has a wrong offset!");
static_assert(offsetof(AWisp_C, A) == 0x0004F8, "Member 'AWisp_C::A' has a wrong offset!");
static_assert(offsetof(AWisp_C, Ime) == 0x000500, "Member 'AWisp_C::Ime' has a wrong offset!");
static_assert(offsetof(AWisp_C, Disappearing) == 0x000504, "Member 'AWisp_C::Disappearing' has a wrong offset!");
static_assert(offsetof(AWisp_C, Obj) == 0x000508, "Member 'AWisp_C::Obj' has a wrong offset!");
static_assert(offsetof(AWisp_C, Landed) == 0x000518, "Member 'AWisp_C::Landed' has a wrong offset!");

}

