#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WMannequinSpawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function wMannequinSpawn.wMannequinSpawn_C.Spawn
// 0x0060 (0x0060 - 0x0000)
struct WMannequinSpawn_C_Spawn final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DCD[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasRecentlyRendered_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DCE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProp_wMannequin_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WMannequinSpawn_C_Spawn) == 0x000010, "Wrong alignment on WMannequinSpawn_C_Spawn");
static_assert(sizeof(WMannequinSpawn_C_Spawn) == 0x000060, "Wrong size on WMannequinSpawn_C_Spawn");
static_assert(offsetof(WMannequinSpawn_C_Spawn, Return) == 0x000000, "Member 'WMannequinSpawn_C_Spawn::Return' has a wrong offset!");
static_assert(offsetof(WMannequinSpawn_C_Spawn, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'WMannequinSpawn_C_Spawn::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WMannequinSpawn_C_Spawn, CallFunc_WasRecentlyRendered_ReturnValue) == 0x000040, "Member 'WMannequinSpawn_C_Spawn::CallFunc_WasRecentlyRendered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WMannequinSpawn_C_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'WMannequinSpawn_C_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WMannequinSpawn_C_Spawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'WMannequinSpawn_C_Spawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

