#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Woodchipper

#include "Basic.hpp"

#include "Enum_interactionActions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function woodchipper.woodchipper_C.ExecuteUbergraph_woodchipper
// 0x07D0 (0x07D0 - 0x0000)
struct Woodchipper_C_ExecuteUbergraph_woodchipper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C8[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26C9[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26CA[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26CB[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0078(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsChildActor_ReturnValue;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26CC[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Temp_struct_Variable;                              // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26CD[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26CE[0xC];                                     // 0x0124(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26CF[0xC];                                     // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               Temp_struct_Variable_1;                            // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D0[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D1[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue_1;                       // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable_2;                            // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_2;                              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D2[0x3];                                     // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D3[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_active_1;                       // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D4[0x1];                                     // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active;                         // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D5[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0388(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D6[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_1;        // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D7[0x6];                                     // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainPlayer_C*                          K2Node_Event_player;                               // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0450(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_index;                                // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_interactionActions                       K2Node_Event_action;                               // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x04DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x04DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x04E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x04F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0500(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x050C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D8[0x3];                                     // 0x055D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0570(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D9[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExplosion_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DA[0x3];                                     // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatMinusEquals_FloatOut;         // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26DB[0x4];                                     // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProp_arg2_C*                           K2Node_DynamicCast_AsProp_Arg_2;                   // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DC[0x7];                                     // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DD[0x7];                                     // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_GetPhysicalMaterial_ReturnValue;          // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_canChip_ReturnValue;                      // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DE[0x7];                                     // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0640(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0678(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26DF[0x3];                                     // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0708(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VictoryFloatPlusEquals_FloatOut_2;        // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E0[0x3];                                     // 0x0739(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E1[0x3];                                     // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Select_Default_1;                           // 0x0760(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E2[0x3];                                     // 0x076D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default_2;                           // 0x0770(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0794(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x07A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Woodchipper_C_ExecuteUbergraph_woodchipper) == 0x000010, "Wrong alignment on Woodchipper_C_ExecuteUbergraph_woodchipper");
static_assert(sizeof(Woodchipper_C_ExecuteUbergraph_woodchipper) == 0x0007D0, "Wrong size on Woodchipper_C_ExecuteUbergraph_woodchipper");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, EntryPoint) == 0x000000, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::EntryPoint' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_bool_Variable) == 0x000004, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_object_Variable) == 0x000008, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_object_Variable_1) == 0x000010, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_Select_Default) == 0x000018, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000024, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1) == 0x000028, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Lerp_ReturnValue) == 0x00002C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Lerp_ReturnValue_1) == 0x000030, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_SwitchEnum_CmpSuccess_1) == 0x000034, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2) == 0x000038, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3) == 0x00003C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Lerp_ReturnValue_2) == 0x000040, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Lerp_ReturnValue_3) == 0x000044, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_int_Variable) == 0x000048, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_bool_IsClosed_Variable) == 0x000050, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000058, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_ComponentBoundEvent_OtherActor) == 0x000060, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_ComponentBoundEvent_OtherComp) == 0x000068, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000070, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_ComponentBoundEvent_bFromSweep) == 0x000074, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_ComponentBoundEvent_SweepResult) == 0x000078, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_IsChildActor_ReturnValue) == 0x000100, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_IsChildActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_struct_Variable) == 0x000104, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000110, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000114, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_VictoryFloatPlusEquals_FloatOut) == 0x000118, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_VictoryFloatPlusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Less_FloatFloat_ReturnValue) == 0x00011C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Ease_ReturnValue) == 0x000120, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_TLerp_ReturnValue) == 0x000130, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakTransform_Location) == 0x000160, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakTransform_Rotation) == 0x00016C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakTransform_Scale) == 0x000178, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MakeTransform_ReturnValue) == 0x000190, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetRelativeTransform_ReturnValue) == 0x0001C0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0001F0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_struct_Variable_1) == 0x000278, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000284, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_SetStaticMesh_ReturnValue) == 0x000288, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00028C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_bool_Variable_1) == 0x000290, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Ease_ReturnValue_1) == 0x000294, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Ease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_struct_Variable_2) == 0x000298, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MakeVector_ReturnValue) == 0x0002A4, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002B0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_bool_Variable_2) == 0x000338, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MakeVector_ReturnValue_1) == 0x00033C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000348, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000350, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4) == 0x000354, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000358, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00035C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000360, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000364, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000368, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_SelectFloat_ReturnValue) == 0x00036C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Not_PreBool_ReturnValue) == 0x000370, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BooleanAND_ReturnValue) == 0x000371, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_CustomEvent_active_1) == 0x000372, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_CustomEvent_active_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x000374, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_CustomEvent_active) == 0x000378, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_CustomEvent_active' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MakeVector_ReturnValue_2) == 0x00037C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000388, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BooleanAND_ReturnValue_1) == 0x000410, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_6) == 0x000414, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_VictoryFloatPlusEquals_FloatOut_1) == 0x000418, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_VictoryFloatPlusEquals_FloatOut_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_7) == 0x00041C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000420, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000421, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000428, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000430, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetForwardVector_ReturnValue) == 0x00043C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_Event_player) == 0x000448, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_Event_hit) == 0x000450, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_Event_index) == 0x0004D8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_Event_action) == 0x0004DC, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_Event_action' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_SwitchEnum_CmpSuccess_2) == 0x0004DD, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_bBlockingHit) == 0x0004DE, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_bInitialOverlap) == 0x0004DF, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_Time) == 0x0004E0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_Distance) == 0x0004E4, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_Location) == 0x0004E8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_ImpactPoint) == 0x0004F4, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_Normal) == 0x000500, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_ImpactNormal) == 0x00050C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_PhysMat) == 0x000518, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_HitActor) == 0x000520, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_HitComponent) == 0x000528, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_HitBoneName) == 0x000530, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_HitItem) == 0x000538, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_ElementIndex) == 0x00053C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_FaceIndex) == 0x000540, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_TraceStart) == 0x000544, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BreakHitResult_TraceEnd) == 0x000550, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, Temp_bool_Has_Been_Initd_Variable) == 0x00055C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000560, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MakeLiteralInt_ReturnValue) == 0x00056C, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_MakeTransform_ReturnValue_1) == 0x000570, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Less_IntInt_ReturnValue) == 0x0005A0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0005A8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_FinishSpawningActor_ReturnValue) == 0x0005B0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0005B8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_RandomUnitVector_ReturnValue) == 0x0005BC, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0005C8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x0005D4, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_VictoryFloatMinusEquals_FloatOut) == 0x0005D8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_VictoryFloatMinusEquals_FloatOut' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_DynamicCast_AsProp_Arg_2) == 0x0005E0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_DynamicCast_AsProp_Arg_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_DynamicCast_bSuccess) == 0x0005E8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0005F0, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, K2Node_DynamicCast_bSuccess_1) == 0x0005F8, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetMaterial_ReturnValue) == 0x000600, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000608, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000610, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetMaterial_ReturnValue_1) == 0x000618, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetPhysicalMaterial_ReturnValue) == 0x000620, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetPhysicalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000628, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000630, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_canChip_ReturnValue) == 0x000638, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_canChip_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000640, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_GetOwner_ReturnValue) == 0x000670, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000678, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000700, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Woodchipper_C_ExecuteUbergraph_woodchipper, CallFunc_Multiply_FloatFloat_ReturnValue_8) == 0x000704, "Member 'Woodchipper_C_ExecuteUbergraph_woodchipper::CallFunc_Multiply_FloatFloat_ReturnValue_8' has a wrong offset!");
